{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سَاَلَ سَآئِلٌۢ بِعَذَابٍ وَّاقِعٍ ۙ﴿۲﴾", "english": " An inquirer inquires concerning the punishment about to fall", "french": " Un interrogateur a interrogé sur un châtiment, qui ne manquera pas de tomber", "german": " Ein Fragender fragt nach der Strafe, die da treffen wird", "spanish": " Uno que pregunta interroga sobre el castigo que está a punto de caer", "urdu": " پوچھنے والا پوچھتا ہے (منکروں پر) اٹل عذاب کب آئے گا؟"}, {"arabic": " لِّلۡکٰفِرِیۡنَ لَیۡسَ لَہٗ دَافِعٌ ۙ﴿۳﴾", "english": " Upon the disbelievers, which none can repel.", "french": " Sur les mécréants, châtiment que personne ne peut repousser.", "german": " die Ungläubigen – es kann sie keiner abwehren –", "spanish": " Sobre los incrédulos, y que ninguno puede rechazar.", "urdu": " (یاد رکھو کہ) کافروں کو اس سے بچانے والا کوئی نہیں (پس وقت کے متعلق سوال غیر متعلق اور بے فائدہ ہے)"}, {"arabic": " مِّنَ اللّٰہِ ذِی الۡمَعَارِجِ ؕ﴿۴﴾", "english": " It is from Allah, Lord of great ascents.", "french": " C’est de la part d’Allāh, le Seigneur de toutes les ascensions.", "german": " von Allah, dem Hohen.", "spanish": " Viene de Al-lah, Señor de grados siempre ascendentes.", "urdu": " یہ (عذاب) ذوالمعارج خدا کی طرف سے آئے گا۔"}, {"arabic": " تَعۡرُجُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ اِلَیۡہِ فِیۡ یَوۡمٍ کَانَ مِقۡدَارُہٗ خَمۡسِیۡنَ اَلۡفَ سَنَۃٍ ۚ﴿۵﴾", "english": " The angels and the Spirit ascend to Him in a day the measure of which is fifty thousand years.", "french": " Les anges et l’Esprit montent vers Lui en un jour dont la durée est de cinquante mille ans.", "german": " Die Engel und der Geist steigen zu Ihm in einem Tage, dessen Maß fünfzigtausend Jahre sind.", "spanish": " Los ángeles y el Espíritu ascienden a Él en un día cuya duración es de cincuenta mil años.", "urdu": " فرشتے اور جبرائیل اس (خدا) کی طرف اتنے وقت میں چڑھتے ہیں جس کی مقدار پچاس ہزار سال کے برابر ہوتی ہے۔"}, {"arabic": " فَاصۡبِرۡ صَبۡرًا جَمِیۡلًا ﴿۶﴾", "english": " So be patient with admirable patience.", "french": " Aussi, exerce une patience sereine.", "german": " Gedulde dich drum in geziemender Geduld.", "spanish": " Ejercita, pues, tranquilamente la paciencia.", "urdu": " پس تو اچھی طرح صبر کر۔"}, {"arabic": " اِنَّہُمۡ یَرَوۡنَہٗ بَعِیۡدًا ۙ﴿۷﴾", "english": " They see it to be far off,", "french": " Ils le voient comme étant éloigné,", "german": " Sie wähnen, er sei ferne;", "spanish": " Ellos lo ven muy lejano.", "urdu": " یہ لوگ اس (دن) کو بہت دور سمجھتے ہیں۔"}, {"arabic": " وَّ نَرٰٮہُ قَرِیۡبًا ؕ﴿۸﴾", "english": " But We see it to be nigh.", "french": " Mais Nous le voyons comme étant proche.", "german": " aber Wir sehen, er ist nahe.", "spanish": " Pero Nosotros lo vemos próximo.", "urdu": " مگر ہم اس کو بہت قریب دیکھتے ہیں۔"}, {"arabic": " یَوۡمَ تَکُوۡنُ السَّمَآءُ کَالۡمُہۡلِ ۙ﴿۹﴾", "english": " The day when the heaven will become like molten copper,", "french": " Le jour où le ciel deviendra comme du cuivre fondu,", "german": " Am Tage, da der Himmel wie geschmolzenes Erz sein wird", "spanish": " El día en que el cielo se vuelva como cobre fundido,", "urdu": " اس دن (شدت حرارت کی وجہ سے) آسمان پگھلائے ہوئے تانبے کی طرح ہو جائے گا۔"}, {"arabic": " وَ تَکُوۡنُ الۡجِبَالُ کَالۡعِہۡنِ ۙ﴿۱۰﴾", "english": " And the mountains will become like flakes of wool,", "french": " Et les montagnes deviendront comme de la laine cardée,", "german": " und die Berge wie farbige Wollflocken,", "spanish": " Y las montañas se vuelvan como copos de lana,", "urdu": " اور پہاڑ دھنی ہوئی اون کی طرح ہو جائیں گے۔"}, {"arabic": " وَ لَا یَسۡـَٔلُ حَمِیۡمٌ حَمِیۡمًا ﴿ۚۖ۱۱﴾", "english": " And a friend will not inquire after a friend.", "french": " Et aucun ami dévoué ne s’enquerra de quelque ami dévoué.", "german": " Und ein Freund nicht nach einem Freunde fragen wird.", "spanish": " Y el amigo no preguntará por su amigo.", "urdu": " اور اس دن کوئی دوست کسی دوست کے متعلق کوئی سوال نہیں کرے گا۔"}, {"arabic": " یُّبَصَّرُوۡنَہُمۡ ؕ یَوَدُّ الۡمُجۡرِمُ لَوۡ یَفۡتَدِیۡ مِنۡ عَذَابِ یَوۡمِئِذٍۭ بِبَنِیۡہِ ﴿ۙ۱۲﴾", "english": " They will be placed in sight of one another, and the guilty one would fain ransom himself from the punishment of that day by offering his children,", "french": " Ils seront placés en vue les uns des autres et le coupable aimerait pouvoir se racheter du châtiment de ce jour-là en offrant ses enfants,", "german": " Sie werden in Sehweite zueinander gebracht werden, und der Schuldige würde sich wohl loskaufen von der Strafe jenes Tages mit seinen Kindern", "spanish": " Serán colocados uno a la vista del otro y el culpable querrá librarse del castigo de ese día ofreciendo como rescate a sus hijos.", "urdu": " کیونکہ اس دن ہر شخص کی حالت اس کے دوست کو دکھادی جائے گی۔ اس دن مجرم خواہش کرے گا کہ کاش وہ آج کے دن اپنے بیٹوں‘"}, {"arabic": " وَ صَاحِبَتِہٖ وَ اَخِیۡہِ ﴿ۙ۱۳﴾", "english": " And his wife and his brother,", "french": " Et sa femme et son frère,", "german": " und seiner Gattin und seinem Bruder", "spanish": " A su mujer y a su hermano,", "urdu": " اور اپنی بیوی اور اپنے بھائی‘"}, {"arabic": " وَ فَصِیۡلَتِہِ الَّتِیۡ تُــٔۡوِیۡہِ ﴿ۙ۱۴﴾", "english": " And his kinsfolk who sheltered him,", "french": " Et ses proches parents qui lui avaient donné asile,", "german": " und seiner Verwandtschaft, die ihn beherbergt hat,", "spanish": " Y a sus parientes que lo acogieron,", "urdu": " اور اپنے اس قبیلہ کے ذریعہ سے جس کی طرف وہ پناہ لیا کرتا تھا۔"}, {"arabic": " وَ مَنۡ فِی الۡاَرۡضِ جَمِیۡعًا ۙ ثُمَّ یُنۡجِیۡہِ ﴿ۙ۱۵﴾", "english": " And by offering all those who are on the earth, if only thus he might save himself.", "french": " Et en offrant tous ceux qui sont sur la terre, si seulement cela pouvait le sauver ainsi.", "german": " und allen, die auf Erden sind insgesamt, ob es ihn nur retten wollte.", "spanish": " Y ofreciendo a todos los que están en la tierra, por si pudiera así salvarse.", "urdu": " اور دنیا میں جو کچھ بھی ہے اس کی قربانی سے اپنے آپ کو عذاب سے بچالے۔"}, {"arabic": " کَلَّا ؕ اِنَّہَا لَظٰی ﴿ۙ۱۶﴾", "english": " But no! surely it is a flame of Fire,", "french": " Mais non ! sûrement, c’est une langue de flamme sans fumée,", "german": " Doch nein! wahrlich, es ist eine Feuerflamme –", "spanish": " ¡Mas no! En verdad es una llama de Fuego,", "urdu": " سنو! یہ عذاب جس کی خبر دی گئی ہے شعلہ والا عذاب ہے۔"}, {"arabic": " نَزَّاعَۃً لِّلشَّوٰی ﴿ۚۖ۱۷﴾", "english": " Stripping off the skin even to the extremities of the body .", "french": " Arrachant la peau.", "german": " die Kopfhaut gänzlich abziehend.", "spanish": " Que arranca la piel, incluso de las extremidades del cuerpo .", "urdu": " سر تک کے چمڑے کو ادھیڑ دینے والا عذاب ہے۔"}, {"arabic": " تَدۡعُوۡا مَنۡ اَدۡبَرَ وَ تَوَلّٰی ﴿ۙ۱۸﴾", "english": " It will call him who turned his back and retreated", "french": " Il appellera celui qui tournait le dos, et se retirait,", "german": " Den wird sie rufen, der den Rücken kehrt und sich abwendet", "spanish": " Que llamará a quien dio la espalda y se retiró,", "urdu": " جو اسے بھی جو پیٹھ پھیر کر بھاگ جائے بلا لائے گا۔"}, {"arabic": " وَ جَمَعَ فَاَوۡعٰی ﴿۱۹﴾", "english": " And hoarded wealth , and withheld it .", "french": " Et amassait des richesses , et les retenait.", "german": " und (Reichtum) aufhäuft und (damit) geizt.", "spanish": " Y atesoró y retuvo.", "urdu": " اور (اس کو بھی) جو جمع کرتا رہا اور ذخیرہ کرتا رہا۔"}, {"arabic": " اِنَّ الۡاِنۡسَانَ خُلِقَ ہَلُوۡعًا ﴿ۙ۲۰﴾", "english": " Verily, man is born impatient and miserly.", "french": " En vérité, l’homme est né avare.", "german": " Wahrlich, der Mensch ist aus Ungeduld geschaffen;", "spanish": " En verdad, el hombre nace impaciente.", "urdu": " انسان کی فطرت میں تلون ہے۔"}, {"arabic": " اِذَا مَسَّہُ الشَّرُّ جَزُوۡعًا ﴿ۙ۲۱﴾", "english": " When evil touches him, he is full of lamentation,", "french": " Lorsque le malheur le touche, il est plein de lamentations,", "german": " wenn ihn Schlimmes trifft, ist er voller Klage,", "spanish": " Cuando la desgracia cae sobre él, se lamenta,", "urdu": " جب اس کو کوئی تکلیف پہنچے تو گھبرا جاتا ہے۔"}, {"arabic": " وَّ اِذَا مَسَّہُ الۡخَیۡرُ مَنُوۡعًا ﴿ۙ۲۲﴾", "english": " But when good falls to his lot , he is niggardly.", "french": " Mais lorsque le bien lui arrive, il est pingre.", "german": " doch wenn ihm Gutes widerfährt, ist er knausrig.", "spanish": " Pero cuando su suerte es el bien, se vuelve tacaño.", "urdu": " اور جب اس کو کوئی فائدہ پہنچے تو بخل کرنے لگ جاتا ہے (اور نہیں چاہتا کہ کوئی اس کا شریک ہو)"}, {"arabic": " اِلَّا الۡمُصَلِّیۡنَ ﴿ۙ۲۳﴾", "english": " But not those who pray.", "french": " Excepté ceux qui prient,", "german": " Nicht so sind die, die beten", "spanish": " Excepto los que rezan.", "urdu": " سوائے نماز پڑھنے والوں کے۔"}, {"arabic": " الَّذِیۡنَ ہُمۡ عَلٰی صَلَاتِہِمۡ دَآئِمُوۡنَ ﴿۪ۙ۲۴﴾", "english": " Those who are constant in their Prayer,", "french": " Ceux qui sont constants dans leur Prière,", "german": " und bei ihrem Gebet verharren,", "spanish": " Los que son constantes en su Oración,", "urdu": " جو اپنی نمازوں پر ہمیشہ قائم رہتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ فِیۡۤ اَمۡوَالِہِمۡ حَقٌّ مَّعۡلُوۡمٌ ﴿۪ۙ۲۵﴾", "english": " And those in whose wealth there is a recognized right", "french": " Et ceux dans les richesses de qui il y a une part déterminée", "german": " und die, in deren Reichtum ein bestimmter Anteil ist", "spanish": " Y aquellos en cuyos bienes hay una parte determinada,", "urdu": " اور جن کے مالوں میں ایک مقررہ حصہ غریب سوالیوں کا بھی ہوتا ہے۔"}, {"arabic": " لِّلسَّآئِلِ وَ الۡمَحۡرُوۡمِ ﴿۪ۙ۲۶﴾", "english": " For one who asks for help and for one who does not.", "french": " Pour le mendiant et pour le destitué qui ne mendie pas ,", "german": " für den Bittenden sowohl wie für den, der es nicht kann.", "spanish": " Para el mendigo y para el pobre que no pide .", "urdu": " اور ان کا بھی ہوتا ہے جو سوال کرنے سے محروم ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ یُصَدِّقُوۡنَ بِیَوۡمِ الدِّیۡنِ ﴿۪ۙ۲۷﴾", "english": " And those who believe the Day of Judgment to be a reality,", "french": " Et ceux qui attestent que le Jour du Jugement est une réalité,", "german": " Und die, die den Tag des Gerichts für wahr und wirklich erklären,", "spanish": " Y quienes creen que el Día del Juicio será una realidad,", "urdu": " اور جو لوگ جزا سزا کے دن کی تصدیق کرتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ مِّنۡ عَذَابِ رَبِّہِمۡ مُّشۡفِقُوۡنَ ﴿ۚ۲۸﴾", "english": " And those who are fearful of the punishment of their Lord —", "french": " Et ceux qui redoutent le châtiment de leur Seigneur –", "german": " und die, die vor der Strafe ihres Herrn zagen –", "spanish": " Y quienes temen el castigo de su Señor.", "urdu": " اور جو لوگ اپنے رب کے عذاب سے ڈرتے ہیں۔"}, {"arabic": " اِنَّ عَذَابَ رَبِّہِمۡ غَیۡرُ مَاۡمُوۡنٍ ﴿۲۹﴾", "english": " Verily the punishment of their Lord is not a thing to feel secure from —", "french": " En vérité, le châtiment de leur Seigneur n’épargne pas.", "german": " wahrlich, die Strafe ihres Herrn ist nicht, wovor man sicher sein könnte –,", "spanish": " En verdad, el castigo de su Señor es duro.", "urdu": " (اور واقعہ یہی ہے) کہ ان کے رب کے عذاب سے کوئی اپنے زور سے بچ نہیں سکتا۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ لِفُرُوۡجِہِمۡ حٰفِظُوۡنَ ﴿ۙ۳۰﴾", "english": " And those who guard their private parts —", "french": " Et ceux qui préservent leurs parties intimes,", "german": " und die, die ihre Sinnlichkeit im Zaum halten,", "spanish": " Y quienes guardan sus partes secretas,", "urdu": " اور وہ لوگ بھی جو اپنے سوراخوں کی حفاظت کرتے ہیں۔"}, {"arabic": " اِلَّا عَلٰۤی اَزۡوَاجِہِمۡ اَوۡ مَا مَلَکَتۡ اَیۡمَانُہُمۡ فَاِنَّہُمۡ غَیۡرُ مَلُوۡمِیۡنَ ﴿ۚ۳۱﴾", "english": " Except from their wives and from those whom their right hands possess; such indeed are not to blame;", "french": " Sauf de leurs femmes et de celles que possède leur main droite, car assurément ils ne sont pas à blâmer ;", "german": " es sei denn mit ihren Gattinnen oder denen, die ihre Rechte besitzt, denn da sind sie nicht zu tadeln,", "spanish": " Excepto de sus esposas y de aquellas que poseen sus diestras; para ellos en verdad no hay culpa;", "urdu": " سوائے اپنی بیویوں یا لونڈیوں کے۔ ان پر کوئی ملامت نہیں۔"}, {"arabic": " فَمَنِ ابۡتَغٰی وَرَآءَ ذٰلِکَ فَاُولٰٓئِکَ ہُمُ الۡعٰدُوۡنَ ﴿ۚ۳۲﴾", "english": " But those who seek to go beyond that, it is these who are transgressors —", "french": " Mais ceux qui recherchent quoi que ce soit au-delà de cela, ceux-là sont les transgresseurs –", "german": " die aber mehr als das suchen, sind Übertreter.", "spanish": " Mas quienes intenten ir más allá de eso, serán los transgresores,", "urdu": " مگر جو لوگ اس سے آگے بڑھنے کی خواہش کرتے ہیں وہ حد سے بڑھنے والے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ لِاَمٰنٰتِہِمۡ وَ عَہۡدِہِمۡ رٰعُوۡنَ ﴿۪ۙ۳۳﴾", "english": " And those who are watchful of their trusts and their covenants,", "french": " Et ceux qui veillent sur les dépôts qui leur sont confiés et sur leurs engagements,", "german": " Und die, die das ihnen Anvertraute und ihren Vertrag halten,", "spanish": " Y quienes respetan sus depósitos y sus pactos,", "urdu": " (اور اسی طرح وہ لوگ بھی عذاب سے محفوظ ہیں) جو اپنے پاس رکھی ہوئی امانتوں اور اپنے عہدوں کی حفاظت کرتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ بِشَہٰدٰتِہِمۡ قَآئِمُوۡنَ ﴿۪ۙ۳۴﴾", "english": " And those who are upright in their testimonies,", "french": " Et ceux qui sont intègres dans leurs témoignages,", "german": " und die, die aufrichtig sind in ihrem Zeugnis,", "spanish": " Quienes se mantienen firmes en sus testimonios,", "urdu": " اور جو اپنی گواہیوں پر قائم رہتے ہیں (کسی سے ڈر کر جھوٹی گواہیاں نہیں دیتے) ۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ عَلٰی صَلَاتِہِمۡ یُحَافِظُوۡنَ ﴿ؕ۳۵﴾", "english": " And those who are strict in the observance of their Prayer.", "french": " Et ceux qui surveillent leur Prière.", "german": " und die, die ihr Gebet getreulich verrichten.", "spanish": " Y quienes están atentos al cumplimiento de su Oración.", "urdu": " اور وہ لوگ بھی جو اپنی نمازوں کی حفاظت کرتے ہیں۔"}, {"arabic": " اُولٰٓئِکَ فِیۡ جَنّٰتٍ مُّکۡرَمُوۡنَ ﴿ؕ٪۳۶﴾", "english": " These will be in the Gardens, duly honoured.", "french": " Ceux-là seront dans des Jardins, honorés comme il se doit .", "german": " Diese sind es, die in den Gärten sein werden, hochgeehrt.", "spanish": " Éstos estarán en los Jardines, debidamente honrados.", "urdu": " وہ جنتوں میں اعزاز کے ساتھ رکھے جائیں گے۔"}, {"arabic": " فَمَالِ الَّذِیۡنَ کَفَرُوۡا قِبَلَکَ مُہۡطِعِیۡنَ ﴿ۙ۳۷﴾", "english": " But what is the matter with those who disbelieve, that they come hastening towards thee,", "french": " Mais qu’arrive-t-il aux mécréants, pour qu’ils accourent vers toi,", "german": " Was aber ist denen, die ungläubig sind, dass sie auf dich zugelaufen kommen", "spanish": " Mas ¿qué ocurre con los incrédulos, que acuden apresurados hacia ti,", "urdu": " پس کافروں کو کیا ہو گیا ہے کہ تیری طرف غصہ سے سر اٹھا کر دوڑے آرہے ہیں۔"}, {"arabic": " عَنِ الۡیَمِیۡنِ وَ عَنِ الشِّمَالِ عِزِیۡنَ ﴿۳۸﴾", "english": " From the right hand and from the left, in different parties?", "french": " De droite et de gauche, en diverses bandes ?", "german": " von rechts und links, gruppenweise gesondert?", "spanish": " Desde la derecha y la izquierda, en grupos diferentes?", "urdu": " دائیں طرف سے بھی اور بائیں طرف سے بھی‘ گروہ در گروہ کی صورت میں۔"}, {"arabic": " اَیَطۡمَعُ کُلُّ امۡرِیًٴ مِّنۡہُمۡ اَنۡ یُّدۡخَلَ جَنَّۃَ نَعِیۡمٍ ﴿ۙ۳۹﴾", "english": " Does every man among them hope to enter the Garden of Bliss?", "french": " Chacun d’entre eux espère-t-il entrer au Jardin de la Félicité ?", "german": " Hofft jeder einzelne von ihnen wohl, den Garten der Wonne zu betreten?", "spanish": " ¿Esperan cada uno de ellos entrar en el Jardín de las Bendiciones?", "urdu": " کیا ان میں سے ہر شخص چاہتا ہے کہ اس کو نعمت والی جنت میں داخل کر دیا جائے (خواہ دنیوی ہو یا اخروی)"}, {"arabic": " کَلَّا ؕ اِنَّا خَلَقۡنٰہُمۡ مِّمَّا یَعۡلَمُوۡنَ ﴿۴۰﴾", "english": " Never! We have created them of that which they know.", "french": " Jamais ! Nous les avons créés de ce qu’ils savent.", "german": " Nimmermehr! Wir erschufen sie aus dem, was sie wissen.", "spanish": " ¡Nunca! Los hemos creado de lo que saben.", "urdu": " ایسا ہرگز نہیں ہوگا‘ ہم نے ان کو اس چیز سے پیدا کیا ہے‘ جس کو وہ جانتے ہیں۔"}, {"arabic": " فَلَاۤ اُقۡسِمُ بِرَبِّ الۡمَشٰرِقِ وَ الۡمَغٰرِبِ اِنَّا لَقٰدِرُوۡنَ ﴿ۙ۴۱﴾", "english": " But nay! I swear by the Lord of the easts and of the wests, that We have the power", "french": " Mais non ! Je jure par le Seigneur des orients et des occidents, que certainement Nous avons le pouvoir", "german": " Aber nein! Ich schwöre beim Herrn des Ostens und des Westens, dass Wir imstande sind,", "spanish": " ¡Mas no! Juro por el Señor de los orientes y los ocasos, que Nosotros tenemos el poder", "urdu": " پس میں (اس قرآن کو نازل کرنے والے) مشرق و مغرب کے رب کو شہادت کے طور پر پیش کرتا ہوں‘ کہ ہم اس بات پر قادر ہیں۔"}, {"arabic": " عَلٰۤی اَنۡ نُّبَدِّلَ خَیۡرًا مِّنۡہُمۡ ۙ وَ مَا نَحۡنُ بِمَسۡبُوۡقِیۡنَ ﴿۴۲﴾", "english": " To bring in their place others better than they, and We cannot be frustrated in Our plans .", "french": " D’amener à leur place d’autres meilleurs qu’eux, et Nous ne pouvons être entravé dans Nos desseins,", "german": " bessere als sie an ihre Stelle zu setzen, und keiner kann Uns hindern.", "spanish": " De poner en su lugar a otros mejores que ellos, y Nuestros planes no pueden ser frustrados .", "urdu": " کہ اس قوم کو تباہ کرکے ایک اور اچھی قوم پیدا کر دیں اور کوئی ہم کو اس ارادہ سے باز نہیں رکھ سکتا۔"}, {"arabic": " فَذَرۡہُمۡ یَخُوۡضُوۡا وَ یَلۡعَبُوۡا حَتّٰی یُلٰقُوۡا یَوۡمَہُمُ الَّذِیۡ یُوۡعَدُوۡنَ ﴿ۙ۴۳﴾", "english": " So leave them alone to indulge in idle talk and play until they meet that day of theirs which they are promised,", "french": " Laisse-les donc à leurs vains discours, s’amuser jusqu’à ce qu’ils rencontrent ce jour des leurs qui leur est promis,", "german": " So lass sie nur in eitler Rede sich ergehen und sich vergnügen, bis sie ihrem Tag begegnen, der ihnen angedroht ward,", "spanish": " Dejadles, pues, solos, dedicados a sus juegos y charlas vanas, hasta que se encuentren con ese día que se les ha prometido.", "urdu": " پس تو ان کو چھوڑ دے کہ یہ سچائی کو گدلا کرتے رہیں اور ہنسی کھیل میں مبتلا رہیں اس وقت تک کہ وہ اس دن کو دیکھ لیں جس کا ان سے وعدہ کیا جاتا ہے۔"}, {"arabic": " یَوۡمَ یَخۡرُجُوۡنَ مِنَ الۡاَجۡدَاثِ سِرَاعًا کَاَنَّہُمۡ اِلٰی نُصُبٍ یُّوۡفِضُوۡنَ ﴿ۙ۴۴﴾", "english": " The day when they will come forth from their graves hastening, as though they were racing to a target,", "french": " Le jour où ils sortiront précipitamment de leur tombe, comme s’ils couraient vers l’endroit de leur propre sacrifice,", "german": " dem Tag, da sie aus ihren Gräbern hervorkommen werden in Hast, als eilten sie zu einem Ziel.", "spanish": " El día en que salgan de sus tumbas apresuradamente, como si corrieran a sus destinos.", "urdu": " جس دن وہ قبروں سے زندہ ہو کر نکلیں گے اور جلدی جلدی بھاگ رہے ہوں گے گویا کہ وہ خاص ستونوں کی طرف دوڑتے جا رہے ہیں۔"}, {"arabic": " خَاشِعَۃً اَبۡصَارُہُمۡ تَرۡہَقُہُمۡ ذِلَّۃٌ ؕ ذٰلِکَ الۡیَوۡمُ الَّذِیۡ کَانُوۡا یُوۡعَدُوۡنَ ﴿٪۴۵﴾", "english": " With their eyes cast down; and disgrace will cover them. Such is the day which they are promised.", "french": " Les yeux abaissés ; et l’humiliation les couvrira. Tel est le jour qui leur est promis.", "german": " Ihre Augen werden niedergeschlagen sein; Schmach wird sie bedecken. Das ist der Tag, der ihnen angedroht ward.", "spanish": " Con sus ojos bajados. Y la ignominia les cubrirá. Ése es el día que se les ha prometido.", "urdu": " ان کی آنکھیں شرم سے جھکی ہوئی ہوں گی اور ان کے چہروں پر ذلت چھائی ہوئی ہوگی‘ یہ وہ دن ہے جس کا ان سے وعدہ کیا جاتا ہے۔"}], "Surah": 70}