{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِذَا زُلۡزِلَتِ الۡاَرۡضُ زِلۡزَالَہَا ۙ﴿۲﴾", "english": " When the earth is shaken with her violent shaking,", "french": " Lorsque la terre sera secouée de sa violente secousse,", "german": " Wenn die Erde erschüttert wird,", "spanish": " Cuando la tierra tiemble con su temblor poderoso .", "urdu": " جب زمین کو پوری طرح ہلا دیا جائے گا۔"}, {"arabic": " وَ اَخۡرَجَتِ الۡاَرۡضُ اَثۡقَالَہَا ۙ﴿۳﴾", "english": " And the earth brings forth her burdens,", "french": " Et que la terre rejettera ses fardeaux,", "german": " und die Erde ihre Lasten herausgibt,", "spanish": " Cuando la tierra se libere de su carga,", "urdu": " اور زمین اپنے بوجھ کو نکال (کر پھینک) دے گی۔"}, {"arabic": " وَ قَالَ الۡاِنۡسَانُ مَا لَہَا ۚ﴿۴﴾", "english": " And man says, ‘What is the matter with her?’", "french": " Et que l’homme dira : « Qu’est-ce qu’elle a ? »", "german": " und der Mensch spricht: \"Was ist ihr?\"", "spanish": " Y el hombre diga: “¿Qué le ocurre?”", "urdu": " اور انسان کہہ اٹھے گا کہ اسے کیا ہو گیا ہے۔"}, {"arabic": " یَوۡمَئِذٍ تُحَدِّثُ اَخۡبَارَہَا ۙ﴿۵﴾", "english": " That day will she tell her news,", "french": " Ce jour-là elle narrera ses nouvelles ;", "german": " An jenem Tage wird sie ihre Geschichten erzählen;", "spanish": " En ese día, ella referirá sus noticias ,", "urdu": " اس دن وہ اپنی (ساری ہی پوشیدہ) خبریں بیان کر دے گی۔"}, {"arabic": " بِاَنَّ رَبَّکَ اَوۡحٰی لَہَا ؕ﴿۶﴾", "english": " For thy Lord will have revealed about her.", "french": " Car ton Seigneur lui aura révélé ainsi.", "german": " weil Sich dein Herr in Bezug auf sie offenbart hat.", "spanish": " Ocurrirá porque tu Señor así se lo habrá revelado.", "urdu": " اس لئے کہ تیرے رب نے اس (زمین) کے حق میں وحی کر چھوڑی ہے۔"}, {"arabic": " یَوۡمَئِذٍ یَّصۡدُرُ النَّاسُ اَشۡتَاتًا ۬ۙ لِّیُرَوۡا اَعۡمَالَہُمۡ ؕ﴿۷﴾", "english": " On that day will men come forth in scattered groups that they may be shown the results of their works.", "french": " Ce jour-là, les hommes s’avanceront en groupes épars pour qu’on leur montre les résultats de leurs œuvres.", "german": " An jenem Tage werden die Menschen in zerstreuten Gruppen hervorkommen, damit ihnen ihre Werke gezeigt werden.", "spanish": " En ese día, los hombres com­parecerán dispersos para que pueda mostrárseles los resultados de sus acciones.", "urdu": " اس دن لوگ مختلف گروہوں کی صورت میں جمع ہونگے۔ تا کہ انہیں ان کے اعمال کی حقیقت دکھائی جائے۔"}, {"arabic": " فَمَنۡ یَّعۡمَلۡ مِثۡقَالَ ذَرَّۃٍ خَیۡرًا یَّرَہٗ ؕ﴿۸﴾", "english": " Then whoso does an atom’s weight of good will see it,", "french": " Alors quiconque fait un bien même du poids d’un atome le verra,", "german": " Wer auch nur eines Stäubchens Gewicht Gutes tut, der wird es dann schauen,", "spanish": " Entonces, quien haya hecho el peso de un átomo de bien, lo verá,", "urdu": " پھر جس نے ایک ذرہ کے برابر (بھی) نیکی کی ہوگی وہ اس (کے نتیجہ) کو دیکھ لے گا۔"}, {"arabic": " وَ مَنۡ یَّعۡمَلۡ مِثۡقَالَ ذَرَّۃٍ شَرًّا یَّرَہٗ ٪﴿۹﴾", "english": " And whoso does an atom’s weight of evil will also see it.", "french": " Et quiconque fait un mal même du poids d’un atome le verra aussi .", "german": " und wer auch nur eines Stäubchens Gewicht Böses tut, der wird es dann schauen.", "spanish": " Y quien haya hecho el peso de un átomo de mal, lo verá también.", "urdu": " اور جس نے ایک ذرہ کے برابر بھی بدی کی ہوگی وہ اس (کے نتیجہ) کو دیکھ لے گا۔"}], "Surah": 99}