{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِذَا جَآءَ نَصۡرُ اللّٰہِ وَ الۡفَتۡحُ ۙ﴿۲﴾", "english": " When the help of Allah comes, and the victory,", "french": " Lorsque vient l’aide d’Allāh ainsi que la victoire,", "german": " Wenn Allahs Hilfe kommt und der Sieg", "spanish": " Cuando llega la ayuda de Al-lah y la victoria,", "urdu": " جب اللہ کی مدد اور کامل غلبہ آجائے گا۔"}, {"arabic": " وَ رَاَیۡتَ النَّاسَ یَدۡخُلُوۡنَ فِیۡ دِیۡنِ اللّٰہِ اَفۡوَاجًا ۙ﴿۳﴾", "english": " And thou seest men entering the religion of Allah in troops,", "french": " Et que tu vois les hommes entrer en troupes dans la religion d’Allāh,", "german": " und du die Menschen scharenweise in die Religion Allahs eintreten siehst,", "spanish": " Y ves a los hombres entrar en la religión de Al‑lah en masa,", "urdu": " اور تو اس بات کے آثار دیکھ لے گا کہ اللہ کے دین میں لوگ فوج در فوج داخل ہوں گے۔"}, {"arabic": " فَسَبِّحۡ بِحَمۡدِ رَبِّکَ وَ اسۡتَغۡفِرۡہُ ؕؔ اِنَّہٗ کَانَ تَوَّابًا ٪﴿۴﴾", "english": " Glorify thy Lord, with His praise, and seek forgiveness of Him. Surely He is Oft-Returning with compassion .", "french": " Alors glorifie ton Seigneur avec Sa louange, et implore Son pardon. Assurément, Il revient sans cesse avec compassion .", "german": " dann lobpreise du deinen Herrn und bitte Ihn um Vergebung. Wahrlich, Er wendet Sich oft mit Gnade.", "spanish": " Glorifica a tu Señor con Su alabanza y pide Su perdón. En verdad, El es Remisorio con com­pasión.", "urdu": " اس وقت تو اپنے رب کی تعریف کے ساتھ (ساتھ) اس کی پاکیزگی بیان کرنے میں بھی مشغول ہو جائیو اور (مسلمانوں کی تربیت میں جو کوتاہیاں ہوئی ہوں ان پر) اس (خدا) سے پردہ ڈالنے کی دعا کیجیئو۔ وہ یقیناً اپنے بندے کی طرف رحمت کے ساتھ لوٹ لوٹ کر آنے والا ہے۔"}], "Surah": 110}