{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَتٰۤی اَمۡرُ اللّٰہِ فَلَا تَسۡتَعۡجِلُوۡہُ ؕ سُبۡحٰنَہٗ وَ تَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿۲﴾", "english": " The decree of Allah is coming, so seek ye not to hasten it. Holy is He, and exalted above all that which they associate with Him .", "french": " Le décret d’Allāh arrive ; ne soyez pas impatients à son sujet. Il est Saint, et Elevé bien au-dessus de tout ce qu’ils Lui associent.", "german": " Der Befehl Allahs kommt, so sucht ihn nicht zu beschleunigen. Heilig ist Er und erhaben über all das, was sie anbeten.", "spanish": " El decreto de Al-lah está cerca; no seáis impacientes acerca de él. Santo es Él, y exaltado por encima de todo lo que Le asocian.", "urdu": " (اے منکرو)! اللہ کا حکم آیا ہی چاہتا ہے‘ اس لئے (اب) تم اس کے جلد آنے کا مطالبہ نہ کرو۔ وہ پاک (ذات) ہے اور جو (باتیں) وہ (کافر) شرک کے متعلق کہتے ہیں وہ ان سے بہت بالا ہے۔"}, {"arabic": " یُنَزِّلُ الۡمَلٰٓئِکَۃَ بِالرُّوۡحِ مِنۡ اَمۡرِہٖ عَلٰی مَنۡ یَّشَآءُ مِنۡ عِبَادِہٖۤ اَنۡ اَنۡذِرُوۡۤا اَنَّہٗ لَاۤ اِلٰہَ اِلَّاۤ اَنَا فَاتَّقُوۡنِ ﴿۳﴾", "english": " He sends down the angels with revelation by His command on whomsoever of His servants He pleases saying , ‘Warn people that there is no God but I, so take Me alone for your Protector.’", "french": " Selon Son commandement, Il fait descendre les anges avec la révélation sur qui Il veut de parmi Ses serviteurs, en disant : « Avertissez les hommes qu’il n’y a de dieu que Moi, aussi craignez-Moi Seul. »", "german": " Er sendet die Engel hernieder mit der Offenbarung nach Seinem Gebot zu wem Er will von Seinen Dienern: \"Ermahnet (die Menschen), dass es keinen Gott gibt außer Mir; darum nehmt Mich zum Beschützer.\"", "spanish": " Él envía a los ángeles con la revelación por Su mandato, a quien le place de Sus siervos, diciendo: “Advertid a la gente ue no hay más dios que Yo, por lo que debéis temerme sólo a Mí” .", "urdu": " وہ فرشتوں کو اپنے بندوں پر جنہیں وہ پسند کرتا ہے اپنے امر سے کلام دے کر اتارتا ہے (اور رسولوں کو کہتا ہے) کہ (لوگوں کو) آگاہ کر دو کہ بات یہی درست ہے کہ میرے سوا کوئی بھی (سچا) معبود نہیں۔ اس لئے تم (مصائب سے) اپنے بچاٶ کا ذریعہ مجھے ہی بناٶ۔"}, {"arabic": " خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ ؕ تَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿۴﴾", "english": " He has created the heavens and the earth in accordance with the requirements of wisdom. Exalted is He above all that they associate with Him .", "french": " Il a créé les cieux et la terre avec la vérité. Il est élevé bien au-dessus de tout ce qu’ils Lui associent.", "german": " Er hat die Himmel und die Erde erschaffen in Weisheit. Erhaben ist Er über all das, was sie anbeten.", "spanish": " Él creó los cielos y la tierra de acuerdo con los requisitos de la verdad. Exaltado sea Él por encima de todo lo que Le asocian.", "urdu": " اس نے آسمانوں اور زمین کو حق (اور حکمت) کے ساتھ پیدا کیا ہے (اور) ان کے مشرکانہ خیالات سے وہ بہت بالا ہے۔"}, {"arabic": " خَلَقَ الۡاِنۡسَانَ مِنۡ نُّطۡفَۃٍ فَاِذَا ہُوَ خَصِیۡمٌ مُّبِیۡنٌ ﴿۵﴾", "english": " He has created man from a drop of fluid, but lo! he is an open disputer.", "french": " Il a créé l’homme d’une goutte de sperme, et voilà ! Il est un querelleur manifeste.", "german": " Er hat den Menschen aus einem Tropfen erschaffen, doch siehe, nun ist er ein offener Krittler.", "spanish": " Él ha creado al hombre de una gota de líquido, pero he ahí que se convierte en un opositor declarado.", "urdu": " اس نے انسان کو ایک (حقیر) نطفہ سے پیدا کیا ہے پھر وہ (اپنے آپ کو اتنا بڑا سمجھنے لگتا ہے کہ ہمارے بارے میں) کھلم کھلا جھگڑنے والا بن جاتا ہے۔"}, {"arabic": " وَ الۡاَنۡعَامَ خَلَقَہَا ۚ لَکُمۡ فِیۡہَا دِفۡءٌ وَّ مَنَافِعُ وَ مِنۡہَا تَاۡکُلُوۡنَ ﴿۪۶﴾", "english": " And the cattle too He has created; you find in them warmth and other uses; and some of them you eat.", "french": " Et les bestiaux aussi, Il les a créés ; vous trouvez en eux de la chaleur et beaucoup d’autres avantages ; et vous en mangez certains.", "german": " Und das Vieh hat Er erschaffen, ihr habt an ihm Wärme und (andere) Nutzen; und einiges davon esset ihr.", "spanish": " Él ha creado también el ganado; en ellos encontráis calor y muchos otros beneficios; y de algunos de ellos coméis.", "urdu": " نیز چارپایوں کو (اللہ نے پیدا کیا ہے اور انہیں) ایسا بنایا ہے کہ ان میں تمہارے لئے گرمی کا سامان ہے اور (اور بھی) کئی نفعے ہیں اور تم ان (کے گوشت) کا کچھ حصہ کھاتے ہو۔"}, {"arabic": " وَ لَکُمۡ فِیۡہَا جَمَالٌ حِیۡنَ تُرِیۡحُوۡنَ وَ حِیۡنَ تَسۡرَحُوۡنَ ﴿۪۷﴾", "english": " And in them there is beauty for you when you bring them home in the evening, and when you drive them forth to pasture in the morning.", "french": " Et en eux il y a de la beauté pour vous, lorsque vous les ramenez le soir au bercail, et quand vous les menez paître le matin.", "german": " Und es ist Schönheit darin für euch, wenn ihr es abends eintreibt und morgens austreibt auf die Weide.", "spanish": " Y en ellos encontráis belleza para vosotros cuando los lleváis a casa al atardecer, y cuando los sacáis a pastar por la mañana.", "urdu": " اور (اس کے علاوہ) جب تم انہیں چرا کر شام کو (ان کے تھانوں کی طرف) واپس لاتے ہو تو اس میں ایک قسم کا زینت کا سامان ہوتا ہے اسی طرح اس وقت جب تم انہیں (صبح کو) چرنے کے لئے (آزاد) چھوڑتے ہو (تو اس میں بھی تمہارے لئے زینت اور بڑائی کا سامان ہوتا ہے)"}, {"arabic": " وَ تَحۡمِلُ اَثۡقَالَکُمۡ اِلٰی بَلَدٍ لَّمۡ تَکُوۡنُوۡا بٰلِغِیۡہِ اِلَّا بِشِقِّ الۡاَنۡفُسِ ؕ اِنَّ رَبَّکُمۡ لَرَءُوۡفٌ رَّحِیۡمٌ ۙ﴿۸﴾", "english": " And they carry your loads to a land which you could not reach except with great hardship to yourselves. Surely, your Lord is Compassionate, Merciful.", "french": " Et ils transportent vos fardeaux vers un pays où vous n’auriez autrement pu parvenir qu’avec de grandes fatigues pour vous-mêmes. Assurément, votre Seigneur est Compatissant, Miséricordieux.", "german": " Sie (die Tiere) tragen eure Lasten in ein Land, das ihr nicht erreichen könntet, es sei denn mit großer Mühsal für euch selbst. Wahrlich, euer Herr ist gütig, barmherzig.", "spanish": " Y ellos transportan vuestras cargas hasta una tierra a la que no podríais llegar a no ser a costa de gran esfuerzo por vuestra parte. En verdad, vuestro Señor es Compasivo, Misericordioso.", "urdu": " اور وہ تمہارے بوجھ اٹھا کر اس (دور کے) شہر تک بھی لے جاتے ہیں۔ جہاں تک تم اپنی جانوں کو مشقت میں ڈالے بغیر نہیں لے جا سکتے۔ تمہارا رب یقیناً (تم پر) نہایت شفقت کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَّ الۡخَیۡلَ وَ الۡبِغَالَ وَ الۡحَمِیۡرَ لِتَرۡکَبُوۡہَا وَ زِیۡنَۃً ؕ وَ یَخۡلُقُ مَا لَا تَعۡلَمُوۡنَ ﴿۹﴾", "english": " And He has created horses and mules and asses that you may ride them, and as a source of beauty. And He will create what you do not yet know.", "french": " Et Il a créé les chevaux et les mulets et les ânes pour que vous les montiez et comme une source de beauté. Et il créera ce que vous ne savez pas encore .", "german": " Und (erschaffen hat Er) Pferde und Maultiere und Esel, dass ihr auf ihnen reiten möchtet und als Schmuck. Und Er wird erschaffen, was ihr (noch) nicht kennt.", "spanish": " Él ha creado caballos, mulas y asnos para que podáis montarlos, y como fuente de belleza. Y Él creará lo que aún desconocéis.", "urdu": " اور اس نے گھوڑوں‘ خچروں اور گدھوں کو (بھی) تمہاری سواری کے لئے اور (نیز) زینت (وشان) کے لئے (پیدا کیا ہے) اور (آئندہ بھی) وہ (تمہارے لئے سواری کا مزید سامان) جسے تم (ابھی) نہیں جانتے پیدا کرے گا۔"}, {"arabic": " وَ عَلَی اللّٰہِ قَصۡدُ السَّبِیۡلِ وَ مِنۡہَا جَآئِرٌ ؕ وَ لَوۡ شَآءَ لَہَدٰٮکُمۡ اَجۡمَعِیۡنَ ﴿٪۱۰﴾", "english": " And upon Allah rests the showing of the right way, and there are ways which deviate from the right course . And if He had enforced His will, He would have guided you all.", "french": " Et c’est à Allāh de montrer la bonne voie, et il en est qui dévient de la bonne voie . Et s’Il avait imposé Sa volonté, Il vous aurait tous guidés.", "german": " Bei Allah steht die Weisung des Weges. Es gibt solche, die abweichen (von der rechten Bahn). Und hätte Er Seinen Willen erzwungen, Er hätte euch allen den Weg gewiesen.", "spanish": " A Al-lah corresponde mostrar el camino recto, pues hay aminos que se desvían­ del recto. Mas si Él hubiese ejecutado Su Voluntad, os habría guiado a todos.", "urdu": " اور (تمہیں) دین کی سیدھی راہ (کا بتانا بھی) اللہ ہی کے ذمے ہے اور (اس کی ضرورت اس لئے ہے کہ) ان (یعنی دین کے راستوں) میں سے بعض ٹیڑھے (ہوتے) ہیں۔ لیکن اگر وہ (اللہ) اپنی مشیت نافذ کرتا تو تم سب کو ہدایت (ہی) دیتا۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً لَّکُمۡ مِّنۡہُ شَرَابٌ وَّ مِنۡہُ شَجَرٌ فِیۡہِ تُسِیۡمُوۡنَ ﴿۱۱﴾", "english": " He it is Who sends down water for you from the clouds; out of it you have your drink, and there grow from it trees on which you pasture your cattle.", "french": " C’est Lui Qui fait descendre de l’eau pour vous, des nuages ; on en sert comme boisson ; et grâce à laquelle poussent des plantes dont vous faites paître votre bétail .", "german": " Er ist es, Der Wasser aus den Wolken herniedersendet; davon habt ihr Trank, und davon (wachsen) die Bäume, von denen ihr (euer Vieh) fressen lasst.", "spanish": " Él es quien os envía el agua de las nubes; de ella tenéis vuestra bebida y a partir de ella crecen las plantas en las que hacéis pastar a vuestro ganado.", "urdu": " (اللہ) وہی تو ہے جس نے بادلوں سے پانی اتارا ہے۔ اسی میں سے تمہارے پینے کا (پانی مہیا ہوتا) ہے اور اسی سے وہ درخت (بھی تیار) ہوتے ہیں جن میں تم (مویشیوں کو) چراتے ہو۔"}, {"arabic": " یُنۡۢبِتُ لَکُمۡ بِہِ الزَّرۡعَ وَ الزَّیۡتُوۡنَ وَ النَّخِیۡلَ وَ الۡاَعۡنَابَ وَ مِنۡ کُلِّ الثَّمَرٰتِ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّقَوۡمٍ یَّتَفَکَّرُوۡنَ ﴿۱۲﴾", "english": " Therewith He grows corn for you, and the olive and the datepalm, and the grapes, and all kinds of fruits. Surely, in that is a Sign for a people who reflect.", "french": " C’est avec cela qu’Il fait pousser pour vous des cultures de toutes sortes , et l’olive et le dattier, et les raisins, et toutes sortes de fruits. Assurément, en cela se trouve un Signe pour un peuple qui réfléchit.", "german": " Damit lässt Er Korn sprießen für euch und den Ölbaum und die Dattelpalme und die Trauben und Früchte aller Art. Fürwahr, darin ist ein Zeichen für nachdenkende Leute.", "spanish": " En ella hace germinar para vosotros toda clase de cultivos, el olivo y la palmera, la vid y toda clase de frutos. En verdad, aquí hay un Signo para las gentes que reflexionan.", "urdu": " وہ اس کے ذریعہ سے تمہارے لئے کھیتی‘ زیتون اور کھجور کے درخت اور انگور اور (دوسرے) ہر قسم کے پھل پیدا کرتا ہے ان لوگوں کے لئے جو غوروفکر سے کام لیتے ہیں۔ اس میں یقیناً ایک (واضح) نشان (پایا جاتا) ہے۔"}, {"arabic": " وَ سَخَّرَ لَکُمُ الَّیۡلَ وَ النَّہَارَ ۙ وَ الشَّمۡسَ وَ الۡقَمَرَ ؕ وَ النُّجُوۡمُ مُسَخَّرٰتٌۢ بِاَمۡرِہٖ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّعۡقِلُوۡنَ ﴿ۙ۱۳﴾", "english": " And He has pressed into service for you the night and the day, and the sun and the moon; and the stars too have been pressed into service by His command. Surely, in that are Signs for a people who make use of their reason.", "french": " Et Il a assujetti pour vous la nuit et le jour, et le soleil et la lune ; et les astres aussi ont été assujettis par Son commandement. Assurément, il y a là des Signes pour un peuple qui se sert de sa raison.", "german": " Und Er hat für euch die Nacht und den Tag dienstbar gemacht und die Sonne und den Mond; und die Sterne sind dienstbar auf Sein Geheiß. Fürwahr, darin sind Zeichen für Leute, die von der Vernunft Gebrauch machen.", "spanish": " Y sometió a vuestro servicio la noche y el día, el sol y la luna; las estrellas también fueron puestas a vuestro servicio por orden Suya. En verdad, aquí hay Signos para las gentes que utilizan la razón.", "urdu": " اور اس نے رات اور دن کو اور سورج اور چاند کو تمہارے لئے خدمت پر لگا رکھا ہے اور (دوسرے) تمام (سیارے اور) ستارے (بھی) اس کے حکم سے (تمہاری) خدمت پر متعین ہیں جو لوگ عقل سے کام لیتے ہیں ان کے لئے اس میں یقیناً کئی نشان (پائے جاتے) ہیں۔"}, {"arabic": " وَ مَا ذَرَاَ لَکُمۡ فِی الۡاَرۡضِ مُخۡتَلِفًا اَلۡوَانُہٗ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّقَوۡمٍ یَّذَّکَّرُوۡنَ ﴿۱۴﴾", "english": " And He has pressed into service the things He has created for you in the earth, varying in colours. Surely, in that is a Sign for a people who take heed.", "french": " Et les choses qu’Il a fait pousser pour vous de la terre sont de couleurs variées. Assurément, il y a là un Signe pour un peuple qui fait attention.", "german": " Und was Er auf der Erde für euch erschaffen hat, ist mannigfach an Farben. Fürwahr, darin ist ein Zeichen für Leute, die es beherzigen.", "spanish": " Y él sometió a vuestro servicio las cosas que creó para vosotros en la tierra, de colores variados. En verdad, aquí hay un Signo para las gentes que prestan atención.", "urdu": " اور جو مختلف اقسام کی چیزیں اس نے تمہارے لئے زمین میں پیدا کی ہیں (وہ سب تمہارے کام آرہی ہیں) ان (چیزوں کی پیدائش) میں (بھی) ان لوگوں کے لئے جو نصیحت حاصل کرتے ہیں یقیناً ایک نشان پایا جاتا) ہے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ سَخَّرَ الۡبَحۡرَ لِتَاۡکُلُوۡا مِنۡہُ لَحۡمًا طَرِیًّا وَّ تَسۡتَخۡرِجُوۡا مِنۡہُ حِلۡیَۃً تَلۡبَسُوۡنَہَا ۚ وَ تَرَی الۡفُلۡکَ مَوَاخِرَ فِیۡہِ وَ لِتَبۡتَغُوۡا مِنۡ فَضۡلِہٖ وَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۱۵﴾", "english": " And He it is Who has subjected to you the sea that you may eat therefrom fresh flesh, and may take forth therefrom ornaments which you wear. And thou seest the ships ploughing through it, that you may thereby journey and that you may seek of His bounty and that you may be grateful.", "french": " Et c’est Lui Qui vous a soumis la mer, afin que vous en mangiez de la chair fraîche, et que vous en tiriez des ornements que vous portez. Et où tu vois les navires fendre les vagues, pour que vous vous mettiez en quête de Sa munificence et pour que vous soyez reconnaissants.", "german": " Und Er ist es, Der (euch) das Meer dienstbar gemacht hat, dass ihr frisches Fleisch daraus essen und Schmuck aus ihm hervorholen möget, den ihr anlegt. Und du siehst die Schiffe es durchpflügen, dass (ihr damit reisen möget) und suchet Seine Huld und dass ihr dankbar seiet.", "spanish": " Él es quien os sometió el mar para que comierais de él carne fresca, y sacarais de él ciertos ornamentos con los que os ngalanáis. Veis a los buques surcándolo, para que de ese modo podáis viajar y para que procuréis Su Magnanimidad y seáis agradecidos.", "urdu": " اسی نے سمندر کو (بھی تمہاری) خدمت پر لگا رکھا ہے تا کہ تم اس میں سے (مچھلی کا) تازہ گوشت کھاٶ۔ اور اس میں سے زیور (کا سامان بھی) نکالو جسے تم (لوگ) پہننے کے کام لاتے ہو اور (اے مخاطب) تو اس میں کشتیوں کو پانی پھاڑتے (اور زور سے چلتے) ہوئے دیکھتا ہے (جو اس لئے چلتی ہیں کہ تم سمندری سفر طے کرو) اور تا کہ تم اس کے بعض اور فضل (بھی) تلاش کرو۔ اور تا کہ تم (اس کا) شکر ادا کرو۔"}, {"arabic": " وَ اَلۡقٰی فِی الۡاَرۡضِ رَوَاسِیَ اَنۡ تَمِیۡدَ بِکُمۡ وَ اَنۡہٰرًا وَّ سُبُلًا لَّعَلَّکُمۡ تَہۡتَدُوۡنَ ﴿ۙ۱۶﴾", "english": " And He has placed in the earth firm mountains lest it quake with you, and rivers and routes that you may take the right way.", "french": " Et Il a placé sur la terre des montagnes solidement ancrées pour vous fournir votre subsistance, et des fleuves et des chemins afin que vous puissiez emprunter la bonne voie.", "german": " Und Er hat feste Berge in der Erde gegründet, dass sie nicht mit euch wanke, und Flüsse und Wege, dass ihr recht gehen möget.", "spanish": " Él ha puesto en la tierra montañas firmes para sosteneros, y ríos y rutas para que podáis seguir el camino adecuado.", "urdu": " اور اس نے زمین میں (محکم) پہاڑ بنائے ہیں اس وجہ سے کہ وہ (متحرک ہوتے ہوئے) تمہیں چکر میں نہ ڈالے اور (اس نے تمہارے لئے) کئی دریا (چلائے ہیں) اور کئی (خشکی کے) راستے (بھی بنائے) ہیں تا کہ تم (آسانی سے اپنی منزل مقصود تک) راہ پا سکو۔"}, {"arabic": " وَ عَلٰمٰتٍ ؕ وَ بِالنَّجۡمِ ہُمۡ یَہۡتَدُوۡنَ ﴿۱۷﴾", "english": " And, other marks too ; by them and by the stars they follow the right direction.", "french": " Et d ’autres repères aussi ; par ceux-là et par les étoiles, ils suivent la bonne direction.", "german": " Und (andere) Wegzeichen; (durch sie) und durch die Gestirne folgen sie der rechten Richtung.", "spanish": " Y también puso otras señales; con ellas y con las estrellas siguen la dirección correcta.", "urdu": " اور (ان کے علاوہ اس نے) کئی (اور) علامات بھی (قائم کی ہیں) اور ستاروں کے ذریعہ سے (بھی) وہ (لوگ) راہ پاتے ہیں۔"}, {"arabic": " اَفَمَنۡ یَّخۡلُقُ کَمَنۡ لَّا یَخۡلُقُ ؕ اَفَلَا تَذَکَّرُوۡنَ ﴿۱۸﴾", "english": " Is He, then, Who creates like one who creates not? Will you not then take heed?", "french": " Ainsi, Celui Qui crée est-Il pareil à quelqu’un qui ne crée pas ? Ne voulez-vous donc pas prendre garde ?", "german": " Ist nun wohl der, Der erschafft, dem gleich, der nicht erschafft? Wollt ihr es also nicht beherzigen?", "spanish": " ¿Acaso Quien crea es como quien no crea? ¿No prestaréis atención?", "urdu": " پھر (بتاٶ تو سہی کہ) کیا جو پیدا کرتا ہے وہ اس جیسا ہو سکتا ہے جو (کچھ بھی) پیدا نہیں کرتا‘ کیا تم پھر (بھی) نہیں سمجھتے۔"}, {"arabic": " وَ اِنۡ تَعُدُّوۡا نِعۡمَۃَ اللّٰہِ لَا تُحۡصُوۡہَا ؕ اِنَّ اللّٰہَ لَغَفُوۡرٌ رَّحِیۡمٌ ﴿۱۹﴾", "english": " And if you try to count the favours of Allah, you will not be able to number them. Surely, Allah is Most Forgiving, Merciful.", "french": " Et si vous essayez de compter les faveurs d’Allāh, vous ne pourrez pas les dénombrer. Assurément, Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und wenn ihr Allahs Wohltaten aufzählen wolltet, ihr würdet sie nicht berechnen können. Fürwahr, Allah ist allverzeihend, barmherzig.", "spanish": " Pero si intentáis contar los favores de Al-lah, no podréis enumerarlos. En verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور اگر تم اللہ کے احسان شمار کرنے لگو تو (کبھی) تم ان کا احاطہ نہ کر سکو گے۔ اللہ یقیناً بہت (ہی) بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ اللّٰہُ یَعۡلَمُ مَا تُسِرُّوۡنَ وَ مَا تُعۡلِنُوۡنَ ﴿۲۰﴾", "english": " And Allah knows what you conceal and what you disclose.", "french": " Et Allāh sait ce que vous cachez et ce que vous divulguez.", "german": " Und Allah weiß, was ihr verhehlt und was ihr kundtut.", "spanish": " Al-lah sabe lo que ocultáis y lo que manifestáis.", "urdu": " اور جو کچھ تم چھپاتے ہو اور جو کچھ تم ظاہر کرتے ہو اللہ اس (سب) کو جانتا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ لَا یَخۡلُقُوۡنَ شَیۡئًا وَّ ہُمۡ یُخۡلَقُوۡنَ ﴿ؕ۲۱﴾", "english": " And those on whom they call beside Allah create not anything, but they are themselves created.", "french": " Et ceux qu’ils invoquent en dehors d’Allāh ne créent rien, mais ils sont eux-mêmes créés.", "german": " Und jene, die sie statt Allah anrufen, sie schaffen nichts, sind sie doch selbst geschaffen.", "spanish": " Mas aquellos a quienes invocan en vez de Al-lah no crean nada, sino que ellos mismos son creados.", "urdu": " اور اللہ کے سوا جن (معبودان باطلہ) کو وہ پکارتے ہیں وہ کچھ بھی) پیدا نہیں کرسکتے اور (اس سے بھی بڑھ کر یہ ہے کہ) وہ خود پیدا کیے جاتے ہیں۔"}, {"arabic": " اَمۡوَاتٌ غَیۡرُ اَحۡیَآءٍ ۚ وَ مَا یَشۡعُرُوۡنَ ۙ اَیَّانَ یُبۡعَثُوۡنَ ﴿٪۲۲﴾", "english": " They are dead, not living; and they know not when they will be raised.", "french": " Ils sont morts, et non vivants ; et ils ne savent pas quand ils seront ressuscités.", "german": " Tot sind sie, nicht lebendig; und sie wissen nicht, wann sie erweckt werden.", "spanish": " Son muertos, no vivos; e ignoran cuándo serán resucitados.", "urdu": " وہ (سب) مردے ہیں نہ کہ زندہ۔ اور وہ (یہ بھی) نہیںجانتے کہ کب (دوبارہ) اٹھائے جائیں گے۔"}, {"arabic": " اِلٰـہُکُمۡ اِلٰہٌ وَّاحِدٌ ۚ فَالَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ قُلُوۡبُہُمۡ مُّنۡکِرَۃٌ وَّ ہُمۡ مُّسۡتَکۡبِرُوۡنَ ﴿۲۳﴾", "english": " Your God is One God. And as to those who believe not in the Hereafter, their hearts are strangers to truth , and they are full of pride.", "french": " Votre Dieu est un Dieu Unique. Et quant à ceux qui ne croient pas à l’au-delà, leurs cœurs sont opposés à la vérité , et ils sont pleins d’orgueil.", "german": " Euer Gott ist ein Einiger Gott. Und die nicht ans Jenseits glauben, ihre Herzen sind (der Wahrheit) fremd, und sie sind voller Hoffart.", "spanish": " Vuestro Dios es el Dios Único. Y en cuanto a quienes no creen en el Más Allá, sus corazones son contrarios a la verdad, y están llenos de orgullo.", "urdu": " (پس اچھی طرح یاد رکھو کہ) تمہارا معبود ایک ہی معبود ہے اور جو لوگ آخرت پر ایمان نہیں لاتے ان کے دل (حق سے) نا آشنا ہیں اور وہ تکبر سے کام لے رہے ہیں۔"}, {"arabic": " لَاجَرَمَ اَنَّ اللّٰہَ یَعۡلَمُ مَا یُسِرُّوۡنَ وَ مَا یُعۡلِنُوۡنَ ؕ اِنَّہٗ لَا یُحِبُّ الۡمُسۡتَکۡبِرِیۡنَ ﴿۲۴﴾", "english": " Undoubtedly, Allah knows what they conceal and what they disclose. Surely, He loves not the proud.", "french": " Sans aucun doute, Allāh sait ce qu’ils cachent et ce qu’ils divulguent. Assurément, Il n’aime pas les orgueilleux.", "german": " Unzweifelhaft kennt Allah, was sie verbergen und was sie kundtun. Wahrlich, Er liebt nicht die Hoffärtigen.", "spanish": " Indudablemente Al-lah sabe lo que ocultan y lo que manifiestan. El, en verdad, no ama a los orgullosos.", "urdu": " یہ یقینی بات ہے کہ جو کچھ وہ پوشیدہ (طور پر) کرتے ہیں (اسے بھی) اور جو کچھ وہ ظاہر (طور پر) کرتے ہیں (اسے بھی) اللہ جانتا ہے۔ وہ تکبر کرنے والوں کو ہرگز پسند نہیں کرتا۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ مَّا ذَاۤ اَنۡزَلَ رَبُّکُمۡ ۙ قَالُوۡۤا اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿ۙ۲۵﴾", "english": " And when it is said to them, ‘What think ye of that which your Lord has sent down?’, they say, ‘Stories of the ancients,’", "french": " Et lorsqu’on leur dit : « C’est quoi ce que votre Seigneur a révélé ? » Ils disent : « Des fables des anciens ! »", "german": " Und wenn sie gefragt werden: \"Was (denkt ihr) von dem, was euer Herr niedergesandt hat?\", sagen sie: \"Fabeln der Alten.\"", "spanish": " Mas cuando se les dice: “¿Qué pensáis vosotros de lo que vuestro Señor ha revelado?”. Responden: “Historias de los antiguos”.", "urdu": " اور جب ان سے کہا جاتا ہے (کہ) وہ (کلام) جو تمہارے رب نے اتارا ہے کیا (ہی شاندار) ہے تو وہ کہتے ہیں کہ یہ (خدا کا کلام نہیں بلکہ) پہلے لوگوں کی کہانیاں ہیں۔"}, {"arabic": " لِیَحۡمِلُوۡۤا اَوۡزَارَہُمۡ کَامِلَۃً یَّوۡمَ الۡقِیٰمَۃِ ۙ وَ مِنۡ اَوۡزَارِ الَّذِیۡنَ یُضِلُّوۡنَہُمۡ بِغَیۡرِ عِلۡمٍ ؕ اَلَا سَآءَ مَا یَزِرُوۡنَ ﴿٪۲۶﴾", "english": " That they may bear their burdens in full on the Day of Resurrection, and also a portion of the burdens of those whom they lead astray without knowledge. Behold! evil is that which they bear.", "french": " De sorte qu’ils porteront intégralement leurs fardeaux au Jour de la Résurrection, et une partie des fardeaux des ignorants qu’ils égarent. Prenez note ! Ce qu’ils portent est très mauvais.", "german": " Dass sie am Tage der Auferstehung ihre Lasten vollständig tragen mögen und einen Teil der Lasten derer, die sie ohne Wissen irreführen. Siehe, schlimm ist, was sie tragen.", "spanish": " Para que lleven sus cargas completas el Día de la Resurrección, y también una parte de las cargas de aquellos a quienes extraviaron sin conocimiento. ¡Qué mala es la carga que soportan!", "urdu": " (اس دھوکہ دہی کا) نتیجہ یہ نکلے گا کہ وہ قیامت کے دن اپنے بوجھ (بھی) پورے (پورے) اٹھائیں گے اور ان جاہلوں کے بوجھ بھی جن کو وہ گمراہ کر رہے ہیں۔ سنو! جو بوجھ وہ اٹھا رہے ہیں وہ بہت ہی برا ہے۔"}, {"arabic": " قَدۡ مَکَرَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ فَاَتَی اللّٰہُ بُنۡیَانَہُمۡ مِّنَ الۡقَوَاعِدِ فَخَرَّ عَلَیۡہِمُ السَّقۡفُ مِنۡ فَوۡقِہِمۡ وَ اَتٰٮہُمُ الۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُوۡنَ ﴿۲۷﴾", "english": " Those who were before them did also plan, but Allah came upon their structure at the very foundations, so that the roof fell down upon them from above them; and the punishment came upon them from where they knew not.", "french": " Leurs devanciers aussi avaient comploté, mais Allāh démolit leur édifice jusqu’aux fondements mêmes, de sorte que le toit s’écroula sur eux ; et le châtiment les surprit d’où ils ne pouvaient imaginer.", "german": " Die vor ihnen waren, planten auch Ränke, doch Allah fasste ihren Bau an den Grundmauern, so dass das Dach von oben her auf sie stürzte; und die Strafe kam über sie, von wannen sie nicht wussten.", "spanish": " Quienes los precedieron se confabularon también , mas Al-lah derribó sus edificaciones hasta sus mismos cimientos, de manera que el techo se desplomó sobre ellos; y el castigo les vino de donde menos pensaban.", "urdu": " جو لوگ ان سے پہلے تھے انہوں نے (بھی اپنے اپنے زمانہ کے انبیاء کے خلاف) تدبیریں کی تھیں جس کے نتیجہ میں اللہ ان کی (تدبیروں کی) عمارتوں کی بنیادوں کے پاس (انہیں تباہ کرنے کے لئے) آیا۔ جس کی وجہ سے چھتیں ان کے اوپر کی طرف سے ان پر آگریں اور (اس کا یہ) عذاب ان پر اس راستہ سے آیا جس کو وہ جانتے بھی نہ تھے۔"}, {"arabic": " ثُمَّ یَوۡمَ الۡقِیٰمَۃِ یُخۡزِیۡہِمۡ وَ یَقُوۡلُ اَیۡنَ شُرَکَآءِیَ الَّذِیۡنَ کُنۡتُمۡ تُشَآقُّوۡنَ فِیۡہِمۡ ؕ قَالَ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ اِنَّ الۡخِزۡیَ الۡیَوۡمَ وَ السُّوۡٓءَ عَلَی الۡکٰفِرِیۡنَ ﴿ۙ۲۸﴾", "english": " Then on the Day of Resurrection He will disgrace them and will say, “Where are My ‘partners’ for whose sake you used to oppose the Prophets ?” Those endowed with knowledge will say, ‘This day disgrace and affliction will surely fall on the disbelievers,’", "french": " Alors, au Jour de la Résurrection, Il les déshonorera et dira : « Où sont Mes 'associés' pour lesquels vous vous opposiez aux Prophètes ? » Ceux qui seront doués de savoir diront : « Aujourd’hui la honte et l’affliction tomberont assurément sur les mécréants. »", "german": " Dann wird Er sie am Tage der Auferstehung zuschanden machen und sprechen: «Wo sind nun Meine \"Teilhaber\", um deretwillen ihr (die Propheten) bestrittet?» Die mit Erkenntnis Begabten werden sprechen: \"An diesem Tage wird Schande und Unheil den Ungläubigen.\"", "spanish": " Luego, en el Día de la Resurrección, los afrentará diciendo: “¿Dónde están Mis “partícipes” en cuyo nombre acostumbrabais a oponeros a los Profetas?” . Los dotados de conocimiento dirán: “Este día, la desgracia y la aflicción caerán ciertamente sobre los incrédulos”.", "urdu": " پھر وہ قیامت کے دن انہیں رسوا کرے گا اور کہے گا (کہ اب) کہاں ہیں وہ میرے شریک جن کی وجہ سے تم (میرے انبیاء سے) دشمنی (اور مخالفت) رکھتے تھے۔ (اور) جنہیں علم دیا گیا ہوگا وہ (اس وقت) کہیں گے کہ آج کافروں پر یقیناً رسوائی اور مصیبت (آنے والی) ہے۔"}, {"arabic": " الَّذِیۡنَ تَتَوَفّٰٮہُمُ الۡمَلٰٓئِکَۃُ ظَالِمِیۡۤ اَنۡفُسِہِمۡ ۪ فَاَلۡقَوُا السَّلَمَ مَا کُنَّا نَعۡمَلُ مِنۡ سُوۡٓءٍ ؕ بَلٰۤی اِنَّ اللّٰہَ عَلِیۡمٌۢ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۲۹﴾", "english": " Those whom the angels cause to die while they are wronging their souls. Then will they offer submission, saying , ‘We used not to do any evil.’ Nay, surely, Allah knows well what you used to do.", "french": " Ceux que les anges font mourir pendant qu’ils nuisent à leur âme offriront de se soumettre, en disant : « Nous n’avions pas l’habitude d’agir mal. » Il leur sera dit : « Non, en vérité, Allāh sait très bien ce que vous faisiez,", "german": " Denen, die die Engel sterben lassen, indes sie wider sich selbst sündigen und dann also die Unterwerfung anbieten: \"Wir pflegten ja nichts Böses zu tun.\" Nein, fürwahr, Allah weiß wohl, was ihr zu tun pflegtet.", "spanish": " Aquellos a quienes los ángeles causarán la muerte mientras estén aciendo daño a sus propias almas. Entonces ofrecerán su sumisión diciendo: “No solíamos hacer ningún mal”. No; en verdad Al-lah sabe muy bien lo que solíais hacer.", "urdu": " (ان کافروں پر) جن کی روحوں کو فرشتے (عین) اس وقت کہ وہ اپنی جانوں پر ظلم کر رہے ہوتے ہیں نکالتے ہیں۔ اس پر وہ (یہ کہہ کر) صلح کی طرح ڈالتے ہیں (کہ) ہم (تو) کوئی (بھی) برائی (کاکام) نہیں کیا کرتے تھے (تب انہیں کہا جائے گا کہ واقعہ) یوں نہیں۔ بلکہ (اس کے برعکس ہے یاد رکھو) جو کچھ تم کرتے تھے اسے اللہ خوب جانتا ہے۔"}, {"arabic": " فَادۡخُلُوۡۤا اَبۡوَابَ جَہَنَّمَ خٰلِدِیۡنَ فِیۡہَا ؕ فَلَبِئۡسَ مَثۡوَی الۡمُتَکَبِّرِیۡنَ ﴿۳۰﴾", "english": " So enter the gates of Hell, to abide therein. Evil indeed is the abode of the proud.", "french": " Entrez donc par les portes de l’Enfer, pour y demeurer longtemps. L’habitation des orgueilleux est vraiment mauvaise. »", "german": " So tretet ein in die Tore der Hölle, darin zu wohnen. Schlimm ist fürwahr die Wohnstatt der Hoffärtigen.", "spanish": " Así pues, franquead las puertas del Infierno, para morar en él. ¡Mala es en verdad la morada del orgulloso!", "urdu": " اس لئے (اب) تم جہنم کے دروازوں میں سے اس میں ہمیشہ کے لئے ٹھکانا بناتے ہوئے داخل ہو جاٶ۔ کیونکہ تکبر کرنے والوں کا ٹھکانا بہت ہی برا (ہوتا) ہے۔"}, {"arabic": " وَ قِیۡلَ لِلَّذِیۡنَ اتَّقَوۡا مَاذَاۤ اَنۡزَلَ رَبُّکُمۡ ؕ قَالُوۡا خَیۡرًا ؕ لِلَّذِیۡنَ اَحۡسَنُوۡا فِیۡ ہٰذِہِ الدُّنۡیَا حَسَنَۃٌ ؕ وَ لَدَارُ الۡاٰخِرَۃِ خَیۡرٌ ؕ وَ لَنِعۡمَ دَارُ الۡمُتَّقِیۡنَ ﴿ۙ۳۱﴾", "english": " And when it is said to the righteous, ‘What think ye of that which your Lord has revealed?’ they say, ‘The best.’ For those who do good there is good in this world. And the home of the Hereafter is even better. Excellent indeed is the abode of the righteous —", "french": " Et lorsqu ’il est dit aux vertueux, « C’est quoi ce que votre Seigneur a révélé ? » Ils disent : « Le meilleur. » Pour ceux qui font le bien il y a le bien dans ce monde, et la Demeure de l’au-delà est certainement meilleure. Et sans doute la demeure des vertueux est excellente –", "german": " Und (wenn) zu den Rechtschaffenen gesprochen wird \"Was (denkt ihr) von dem, was euer Herr herabgesandt hat?\", sagen sie: \"Das Beste!\" Für die, welche Gutes tun, ist Gutes in dieser Welt, und die Wohnstatt des Jenseits ist noch besser. Herrlich fürwahr ist die Wohnstatt der Rechtschaffenen:", "spanish": " Y de cuando se dice a los justos: “¿Qué pensáis vosotros de lo que ha revelado vuestro Señor?”, ellos responden: “Lo mejor”. Para quienes hacen el bien hay un beneficio en este mundo, pero el hogar del Más Allá es aún mejor. ¡Qué buena es, en verdad, la morada de los justos!", "urdu": " اور (جب) ان لوگوں سے جنہوں نے تقویٰ (کا طریق) اختیار کیا ہے کہا گیا (کہ) تمہارے رب نے کیا (شاندار کلام) اتارا ہے (تو) انہوں نے کہا (ہاں ہاں کیا ہی) بہترین (کلام ہے) جنہوں نے نیکو کاری (کی راہ) اختیار کی ان کے لئے اس دنیا (کی زندگی) میں (بھی) بھلائی (مقدر) ہے اور آخرت کا گھر (تو ان کے لئے) اور بھی بہتر ہوگا اور تقویٰ اختیار کرنے والوں کا گھر یقیناً بہت (ہی) اچھا (ہوتا) ہے۔"}, {"arabic": " جَنّٰتُ عَدۡنٍ یَّدۡخُلُوۡنَہَا تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ لَہُمۡ فِیۡہَا مَا یَشَآءُوۡنَ ؕ کَذٰلِکَ یَجۡزِی اللّٰہُ الۡمُتَّقِیۡنَ ﴿ۙ۳۲﴾", "english": " Gardens of Eternity, which they will enter; through them flow streams. They will have therein what they wish for. Thus does Allah reward the righteous,", "french": " Des Jardins d’Eternité dans lesquels ils entreront ; sous lesquels coulent des ruisseaux. Là ils auront ce qu’ils désireront. C’est ainsi qu’Allāh récompense les vertueux.", "german": " Gärten der Ewigkeit, die sie betreten werden; Ströme durchfließen sie. Darin werden sie haben, was sie begehren. Also belohnt Allah die Rechtschaffenen,", "spanish": " Jardines de Eternidad, en los que entrarán, por los que corren ríos. Tendrán en ellos lo que deseen. Así Al-lah recompensa a los justos,", "urdu": " (وہ گھر) دائمی رہائش کے باغات (ہیں) جن میں وہ داخل ہوں گے ان (باغات) کے نیچے نہریں بہتی ہوں گی۔ ان (باغوں) میں جو کچھ وہ چاہیں گے انہیں ملے گا (یاد رکھو) تقویٰ اختیار کرنے والوں کو اللہ اسی طرح جزا دیا کرتا ہے۔"}, {"arabic": " الَّذِیۡنَ تَتَوَفّٰٮہُمُ الۡمَلٰٓئِکَۃُ طَیِّبِیۡنَ ۙ یَقُوۡلُوۡنَ سَلٰمٌ عَلَیۡکُمُ ۙ ادۡخُلُوا الۡجَنَّۃَ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۳۳﴾", "english": " Those whom the angels cause to die while they are pure. They say: ‘Peace be unto you! Enter Heaven because of what you used to do.’", "french": " Ceux que les anges font mourir pendant qu’ils sont purs, ils leur disent : « Paix sur vous ! Entrez au Paradis pour ce que vous aviez l’habitude de faire. »", "german": " sie, die die Engel in Reinheit sterben lassen. Sie sprechen: \"Friede sei mit euch! Tretet ein in den Himmel für das, was ihr zu tun pflegtet.\"", "spanish": " Aquellos a quienes los ángeles causarán la muerte mientras son puros. Dirán: “¡La paz sea con vosotros! Entrad en el Cielo por lo que solíais hacer”.", "urdu": " (وہ متقی) جن کی روحوں کو فرشتے اس حالت میں کہ وہ پاک نفس ہوں (یہ) کہتے ہوئے قبض کرتے ہیں کہ (اب) تمہارے لئے سلامتی (ہی سلامتی) ہے ( لو اب اپنے نیک) اعمال کے بدلے میں تم جنت میں داخل ہو جاٶ۔"}, {"arabic": " ہَلۡ یَنۡظُرُوۡنَ اِلَّاۤ اَنۡ تَاۡتِیَہُمُ الۡمَلٰٓئِکَۃُ اَوۡ یَاۡتِیَ اَمۡرُ رَبِّکَ ؕ کَذٰلِکَ فَعَلَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ وَ مَا ظَلَمَہُمُ اللّٰہُ وَ لٰکِنۡ کَانُوۡۤا اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ﴿۳۴﴾", "english": " What do they wait for except that the angels should come upon them or that the decree of thy Lord should come to pass? So did those who were before them. Allah did not wrong them, but they used to wrong themselves.", "french": " Qu’attendent-ils si ce n’est que les anges descendent sur eux, ou que survienne le décret de ton Seigneur ? Ainsi firent leurs devanciers. Allāh ne leur a pas fait de tort, mais ils faisaient du tort à eux-mêmes.", "german": " Worauf warten sie denn, wenn nicht, dass die Engel zu ihnen kommen oder dass der Befehl deines Herrn eintrifft? So taten schon jene, die vor ihnen waren. Allah war nicht ungerecht gegen sie, jedoch sie waren ungerecht gegen sich selber.", "spanish": " ¿Esperan acaso otra cosa salvo que los ángeles vengan sobre ellos o que se alcance el designio de tu Señor? Lo mismo hicieron los que les precedieron. Al-lah no les ha perjudicado, sino que se perjudicaron a sí mismos.", "urdu": " یہ (کافر لوگ) اس بات کے سوا کس کا انتظار کر رہے ہیں کہ فرشتے ان کے پاس (آسمانی عذاب لے کر) آئیں۔ یا تیرے رب کا (فیصلہ کن) حکم آجائے۔ اسی طرح ان لوگوں نے کیا تھا جو ان سے پہلے (زمانوں کے) تھے اور اللہ نے ان پر کوئی ظلم نہیں کیا تھا بلکہ وہ (خود ہی) اپنی جانوں پر ظلم کرتے تھے۔"}, {"arabic": " فَاَصَابَہُمۡ سَیِّاٰتُ مَا عَمِلُوۡا وَ حَاقَ بِہِمۡ مَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿٪۳۵﴾", "english": " So the evil result of what they did befell them, and that which they used to mock at encompassed them.", "french": " Ainsi les mauvaises conséquences de ce qu’ils avaient fait leur sont survenues ; et ce dont ils se moquaient les a cernés.", "german": " So ereilte sie die böse Folge ihres Tuns, und das, was sie zu verhöhnen pflegten, umschloss sie von allen Seiten.", "spanish": " De ese modo, la perversa consecuencia de lo que hicieron, recayó sobre ellos y aquello de lo que solían mofarse les acorraló.", "urdu": " پس ان کے عملوں کی سزا نے ان کو آپکڑا اور جس (عذاب کی خبر) پر وہ ہنسی کیا کرتے تھے اس نے انہیں گھیر لیا (اور تباہ کر دیا)"}, {"arabic": " وَ قَالَ الَّذِیۡنَ اَشۡرَکُوۡا لَوۡ شَآءَ اللّٰہُ مَا عَبَدۡنَا مِنۡ دُوۡنِہٖ مِنۡ شَیۡءٍ نَّحۡنُ وَ لَاۤ اٰبَآؤُنَا وَ لَا حَرَّمۡنَا مِنۡ دُوۡنِہٖ مِنۡ شَیۡءٍ ؕ کَذٰلِکَ فَعَلَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ۚ فَہَلۡ عَلَی الرُّسُلِ اِلَّا الۡبَلٰغُ الۡمُبِیۡنُ ﴿۳۶﴾", "english": " Those who set up equals to God say: ‘If Allah had so willed, we should not have worshipped anything beside Him, neither we nor our fathers, nor should we have forbidden anything without command from Him.’ So did those who were before them. But are the Messengers responsible for anything except the plain delivery of the Message?", "french": " Et les associateurs disent : « Si Allāh l ’ avait voulu, nous n’aurions rien adoré d’autre que Lui, ni nous ni nos ancêtres, et nous n’aurions rien interdit sans un ordre de Lui. » Ainsi firent leurs devanciers. Mais incombe-t-il aux Messagers autre chose que la transmission claire du Message ?", "german": " Die Götzendiener sprechen: \"Hätte Allah es so gewollt, wir würden nichts außer Ihm angebetet haben, weder wir noch unsere Väter, noch würden wir etwas verboten haben ohne (Befehl von) Ihm.\" So taten schon jene, die vor ihnen waren. Jedoch, sind die Gesandten für irgendetwas verantwortlich, außer für die deutliche Verkündigung?", "spanish": " Quienes elevan partícipes iguales a Dios dicen: “Si Al-lah lo hubiese querido, no habríamos adorado a nada en vez de a Él, ni nosotros ni nuestros padres, ni habríamos prohibido nada sin una orden Suya”. Lo mismo dijeron quienes los precedieron. Pero ¿son responsables los Mensajeros de algo salvo de la simple entrega del Mensaje?", "urdu": " اور جن لوگوں نے شرک (کا طریق اختیار) کیا۔ انہوں نے (یہ بھی) کہا ہے کہ اگر اللہ (یہی) چاہتا (کہ اس کے سوا کسی کی عبادت نہ کی جائے) تو نہ ہم اس کے سوا کسی چیز کی عبادت کرتے اور نہ ہمارے باپ دادا ایسا کرتے اور نہ (ہی) ہم اس کے (فرمانے کے) بغیر کسی چیز کو (خود بخود) حرام ٹھہراتے جو (لوگ) ان سے پہلے (سچائی کے دشمن) تھے انہوں نے (بھی) ایسا ہی کیا تھا بھلا (یہ اتنا بھی نہیں سوچتے کہ) رسولوں پر (خدا کا پیغام) پہنچا دینے کے سوا اور کیا ذمہ داری ہے۔"}, {"arabic": " وَ لَقَدۡ بَعَثۡنَا فِیۡ کُلِّ اُمَّۃٍ رَّسُوۡلًا اَنِ اعۡبُدُوا اللّٰہَ وَ اجۡتَنِبُوا الطَّاغُوۡتَ ۚ فَمِنۡہُمۡ مَّنۡ ہَدَی اللّٰہُ وَ مِنۡہُمۡ مَّنۡ حَقَّتۡ عَلَیۡہِ الضَّلٰلَۃُ ؕ فَسِیۡرُوۡا فِی الۡاَرۡضِ فَانۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الۡمُکَذِّبِیۡنَ ﴿۳۷﴾", "english": " And We did raise among every people a Messenger, preaching : ‘Worship Allah and shun the Evil One.’ Then among them were some whom Allah guided and among them were some who became deserving of ruin. So travel through the earth, and see what was the end of those who treated the Prophets as liars!", "french": " Et Nous avons certainement envoyé à chaque peuple un Messager, qui prêchait ainsi : « Adorez Allāh et évitez tous les transgresseurs. » Alors il y eut parmi eux certains qu’Allāh guida et certains qui méritèrent la ruine. Aussi, parcourez la terre, et voyez quelle a été la fin de ceux qui ont traité les Prophètes de menteurs !", "german": " Und in jedem Volke erweckten Wir einen Gesandten (der da predigte): \"Dienet Allah und meidet den Bösen.\" Dann waren unter ihnen einige, die Allah leitete, und es waren unter ihnen einige, die sich Verderben zuzogen. So reiset umher auf der Erde und seht, wie das Ende der Leugner war!", "spanish": " Y suscitamos de entre cada pueblo un Mensajero, que predicó : “Adorad a Al-lah y rechazad al Maligno”. Pero ntre ellos hubo algunos a quienes Al-lah guió y otros que merecieron la perdición. ¡Recorred pues la tierra, y omprobad cuál fue el fin de los que trataron de mentirosos a los Profetas!", "urdu": " اور ہم نے یقیناً ہر قوم میں (کوئی نہ کوئی) رسول (یہ حکم دے کر) بھیجا ہے‘ کہ (اے لوگو)! تم اللہ کی عبادت کرو۔ اور ہر حد سے بڑھنے والے سے کنارہ کش رہو اس پر ان میں سے بعض (تو) ایسے (اچھے ثابت) ہوئے کہ انہیں اللہ نے ہدایت دی اور بعض ایسے کہ ان پر ہلاکت واجب ہو گئی۔ پس تم (تمام) ملک میں پھرو اور دیکھو کہ (انبیاء کو) جھٹلانے والوں کا انجام کیسا ہوا تھا۔"}, {"arabic": " اِنۡ تَحۡرِصۡ عَلٰی ہُدٰٮہُمۡ فَاِنَّ اللّٰہَ لَا یَہۡدِیۡ مَنۡ یُّضِلُّ وَ مَا لَہُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿۳۸﴾", "english": " If thou art solicitous of their guidance, then know that Allah surely guides not those who lead others astray. And for such there are no helpers.", "french": " Si tu es soucieux de leur direction, alors sache qu ’Allāh ne guide assurément pas ceux qui égarent les autres. Et pour ceux-là il n’y a pas d’aides.", "german": " Wenn du für sie den rechten Weg begehrst, dann (wisse, dass) Allah nicht jenen den Weg weist, die (andere) irreführen; noch gibt es für sie Helfer.", "spanish": " Si deseas ardientemente guiarlos, sabe entonces que Al-lah no guía ciertamente a quienes extravían a otros. Para ellos no habrá socorredores.", "urdu": " (اے رسول) اگر تو ان (لوگوں) کی ہدایت کی بہت خواہش رکھتا ہے تو (سمجھ لے کہ) جو لوگ (دوسروں کو دانستہ) گمراہ کر رہے ہوں انہیں اللہ ہرگز ہدایت نہیں دیا کرتا اور نہ ان کا کوئی مددگار ہوتا ہے۔"}, {"arabic": " وَ اَقۡسَمُوۡا بِاللّٰہِ جَہۡدَ اَیۡمَانِہِمۡ ۙ لَا یَبۡعَثُ اللّٰہُ مَنۡ یَّمُوۡتُ ؕ بَلٰی وَعۡدًا عَلَیۡہِ حَقًّا وَّ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یَعۡلَمُوۡنَ ﴿ۙ۳۹﴾", "english": " And they swear by Allah their strongest oaths, that Allah will not raise up those who die. Nay, He will certainly raise them up — a promise He has made binding on Himself, but most people know not.", "french": " Et ils jurent par Allāh, de leurs serments les plus solennels, qu’Allāh ne ressuscitera pas ceux qui meurent. Non, Il les ressuscitera assurément – une promesse qui L’engage, mais la plupart des gens ne savent pas.", "german": " Sie schwören bei Allah ihre feierlichsten Eide, Allah werde jene nicht auferwecken, die sterben. Nicht doch, Ihn bindet ein Versprechen, jedoch die meisten Menschen wissen es nicht.", "spanish": " Mas juran por Al-lah con sus juramentos más solemnes, que Al-lah no resucitará a quienes mueren. No, Él ciertamente los resucitará , una promesa que Él ha hecho obligándose a Sí Mismo, pero la mayoría de los hombres lo ignoran.", "urdu": " اور انہوں نے اللہ کی بڑی زوردار قسمیں کھائی ہیں (کہ) جو مر جائے اللہ اسے (پھر کبھی) زندہ نہیں کرے گا (مگر حقیقت) یوں نہیں۔ یہ (تو ایک ایسا) وعدہ ہے جس (کے پورا کرنے) کا وہ (اللہ) ذمہ وار ہے لیکن اکثر لوگ (اس حقیقت کو) نہیں جانتے۔"}, {"arabic": " لِیُبَیِّنَ لَہُمُ الَّذِیۡ یَخۡتَلِفُوۡنَ فِیۡہِ وَ لِیَعۡلَمَ الَّذِیۡنَ کَفَرُوۡۤا اَنَّہُمۡ کَانُوۡا کٰذِبِیۡنَ ﴿۴۰﴾", "english": " He will raise them up that He may make clear to them that wherein they differed, and that those who disbelieved may know that they were liars.", "french": " Il les ressuscitera afin de rendre clair pour eux ce sur quoi ils étaient en désaccord, et afin que ceux qui ne crurent pas sachent qu’ils étaient des menteurs.", "german": " (Er wird sie auferwecken) damit Er ihnen das klar mache, worüber sie uneins waren, und damit jene, die ungläubig sind, wissen, dass sie Lügner waren.", "spanish": " Él los resucitará para explicarles aquello en lo que discreparon, y para que los incrédulos sepan que fueron mentirosos.", "urdu": " (یہ دوبارہ زندگی اس لئے ہوگی کہ) تا وہ ان پر اس (حقیقت) کو ظاہر کرے جس میں وہ (آج) اختلاف کر رہے ہیں اور تا جن لوگوں نے کفر (کا طریق) اختیار کیا ہے انہیں معلوم ہو جائے کہ وہ جھوٹے تھے۔"}, {"arabic": " اِنَّمَا قَوۡلُنَا لِشَیۡءٍ اِذَاۤ اَرَدۡنٰہُ اَنۡ نَّقُوۡلَ لَہٗ کُنۡ فَیَکُوۡنُ ﴿٪۴۱﴾", "english": " Our word to a thing, when We will it, is only that We say to it, ‘Be!’, and it is.", "french": " Notre parole concernant une chose, lorsque Nous la voulons, est uniquement que Nous lui disons : ‘Sois, » et elle commence à être.", "german": " Unser Wort zu einem Ding, wenn Wir es wollen, ist nur, dass Wir zu ihm sprechen: \"Sei!\", und es ist.", "spanish": " Cuando queremos que algo exista, Nuestra palabra es solamente decirle: “¡Sé!”, y es.", "urdu": " ہمارا کام کسی (ایسی) چیز کے متعلق جس (کے کرنے) کا ہم ارادہ کریں صرف یہ ہوتا ہے کہ ہم اس کے متعلق کہہ دیتے ہیں کہ ہو جا اور وہ ہو جاتی ہے۔"}, {"arabic": " وَ الَّذِیۡنَ ہَاجَرُوۡا فِی اللّٰہِ مِنۡۢ بَعۡدِ مَا ظُلِمُوۡا لَـنُبَوِّئَنَّہُمۡ فِی الدُّنۡیَا حَسَنَۃً ؕ وَ لَاَجۡرُ الۡاٰخِرَۃِ اَکۡبَرُ ۘ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿ۙ۴۲﴾", "english": " And as to those who have left their homes for the sake of Allah after they had been wronged, We will surely give them a goodly abode in this world: and truly the reward of the Hereafter is greater, if they but knew —", "french": " Et quant à ceux qui auront quitté leurs habitations pour la cause d’Allāh après avoir été traités injustement, Nous leur accorderons assurément une belle habitation dans ce monde ; et en vérité la récompense de l’au-delà est plus grande, si seulement ils savaient –", "german": " Und die ausgewandert sind um Allahs willen, nachdem sie Unbill erfuhren, ihnen werden Wir sicherlich eine schöne Wohnstatt in der Welt geben; und wahrlich, der Lohn des Jenseits ist größer; wüssten sie es nur,", "spanish": " En cuanto a los que abandonaron sus hogares por la causa de Al-lah después de haber sido vejados, ciertamente les daremos una digna morada en este mundo; mas, en verdad, la recompensa del Más Allá es mayor, si lo supieran,", "urdu": " اور جن لوگوں نے اس کے بعد کہ ان پر ظلم کیا گیا اللہ کے لئے ہجرت اختیار کی (ہمیں اپنی ذات کی قسم ہے کہ) ہم انہیں ضرور دنیا میں اچھی جگہ دیں گے اور آخرت کا اجر تو اور بھی بڑا ہوگا کاش یہ (منکر اس حقیقت کو) جانتے۔"}, {"arabic": " الَّذِیۡنَ صَبَرُوۡا وَ عَلٰی رَبِّہِمۡ یَتَوَکَّلُوۡنَ ﴿۴۳﴾", "english": " Those who are steadfast and put their trust in their Lord.", "french": " Ceux qui endurent et mettent leur confiance en leur Seigneur.", "german": " die standhaft sind und auf ihren Herrn vertrauen.", "spanish": " Quienes son perseverantes y ponen su confianza en su Señor.", "urdu": " جو (ظلموں کا نشانہ بن کر بھی) ثابت قدم رہے اور (جو ہمیشہ ہی) اپنے رب پر بھروسہ کرتے ہیں۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنَا مِنۡ قَبۡلِکَ اِلَّا رِجَالًا نُّوۡحِیۡۤ اِلَیۡہِمۡ فَسۡـَٔلُوۡۤا اَہۡلَ الذِّکۡرِ اِنۡ کُنۡتُمۡ لَا تَعۡلَمُوۡنَ ﴿ۙ۴۴﴾", "english": " And We sent not as Messengers before thee but men to whom We sent revelation, so ask those who possess the Reminder, if you know not.", "french": " Et Nous n’avons envoyé en tant que Messagers avant toi que des hommes à qui Nous avons donné de la révélation ; demandez donc à ceux à qui les Rappels venant de Dieu ont été confiés, si vous ne savez pas.", "german": " Und vor dir entsandten Wir nur Männer, denen Wir Offenbarung gegeben – so fraget die, welche die Ermahnung besitzen, wenn ihr nicht wisst –", "spanish": " No enviamos como Mensajeros antes de ti sino a hombres a quienes enviamos la revelación; preguntad, pues, a quienes poseen la custodia de las escrituras divinas, si no lo sabéis.", "urdu": " اور ہم تجھ سے پہلے (بھی ہمیشہ) مردوں ہی کو رسول بنا کر بھیجا کرتے تھے (اور) ہم ان کی طرف وحی کرتے تھے اور (اے منکرو)! اگر تم (اس حقیقت کو) نہیں جانتے تو اس (اللہ کے بھیجے ہوئے) ذکر (کو ماننے) والوں سے (ہی) پوچھ لو (تا حقیقت تمہیں معلوم ہوسکے)"}, {"arabic": " بِالۡبَیِّنٰتِ وَ الزُّبُرِ ؕ وَ اَنۡزَلۡنَاۤ اِلَیۡکَ الذِّکۡرَ لِتُبَیِّنَ لِلنَّاسِ مَا نُزِّلَ اِلَیۡہِمۡ وَ لَعَلَّہُمۡ یَتَفَکَّرُوۡنَ ﴿۴۵﴾", "english": " We sent Our Messengers with clear Signs and Scriptures. And We have sent down to thee the Reminder that thou mayest explain to mankind that which has been sent down to them, and that they may reflect.", "french": " Et Nous les avons envoyés avec des Signes clairs et des Ecritures. Et Nous t’avons transmis le Rappel afin que tu puisses expliquer à l’humanité ce qui leur a été envoyé, et afin qu’ils puissent réfléchir.", "german": " mit deutlichen Zeichen und Schriften. Und Wir haben dir die Ermahnung hinabgesandt, auf dass du den Menschen erklären mögest, was ihnen hinabgesandt ward, und dass sie nachdenken.", "spanish": " Los enviamos con Signos evidentes y Escrituras. Y te revelamos el Recordatorio, para que explicaras a la humanidad lo que se les había revelado, y para que reflexionaran.", "urdu": " (ہم نے انہیں) روشن نشانات اور (الہامی) نوشتے دے کر (بھیجا تھا) اور تجھ پر ہم نے یہ (کامل) ذکر نازل کیا ہے تا کہ تو سب لوگوں کو وہ (فرمان الٰہی) جو (تیرے ذریعہ سے) ان کی طرف نازل کیا گیا ہے کھول کر بتائے اور تا کہ وہ (اس پر) تدبر کریں۔"}, {"arabic": " اَفَاَمِنَ الَّذِیۡنَ مَکَرُوا السَّیِّاٰتِ اَنۡ یَّخۡسِفَ اللّٰہُ بِہِمُ الۡاَرۡضَ اَوۡ یَاۡتِیَہُمُ الۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُوۡنَ ﴿ۙ۴۶﴾", "english": " Do, then, those who devise evil plans feel secure that Allah will not make them sink into the land, or that the punishment will not come upon them from whence they do not know?", "french": " Aussi, ceux qui ourdissent de mauvais desseins se sentent-ils en sécurité à l’idée qu’Allāh ne les engloutira pas en terre, ou que le châtiment ne tombera pas sur eux d’où ils ne pouvaient même pas imaginer ?", "german": " Sind denn jene, die Böses planen, sicher davor, dass Allah sie nicht in die Erde versinken lässt oder dass die Strafe nicht über sie kommen wird, von wannen sie nicht wissen?", "spanish": " ¿Se sentirán pues seguros quienes inventaron planes malvados, de que Al-lah no hará que se los trague la tierra, o de que el castigo no vendrá sobre ellos de donde no lo esperan?", "urdu": " پھر کیا جو لوگ (تیرے خلاف) بری تدبیریں کرتے چلے آئے ہیں وہ اس بات سے امن میں ہیں کہ اللہ انہیں اس ملک میں (ہی) ذلیل (اور رسوا) کر دے یا وہ عذاب (جس کی خبر دی جا چکی ہے) ان پر (اس راستہ سے) آجائے جس کو وہ جانتے ہی نہ ہوں۔"}, {"arabic": " اَوۡ یَاۡخُذَہُمۡ فِیۡ تَقَلُّبِہِمۡ فَمَا ہُمۡ بِمُعۡجِزِیۡنَ ﴿ۙ۴۷﴾", "english": " Or that He will not seize them in their going to and fro so that they shall not be able to frustrate God’s plans ?", "french": " Ou qu’Il ne les saisira pas dans leurs allées et venues de sorte qu’ils ne puissent contrecarrer les projets d’Allāh ?", "german": " Oder dass Er sie nicht ergreift in ihrem Hin und Her, so dass sie nicht imstande sein werden, zu obzusiegen?", "spanish": " ¿O de que Él no los sorprenderá en sus desplazamientos de modo que no puedan frustrar los planes de Dios?", "urdu": " یا وہ انہیں ان کے سفروں میں تباہ کرے پس (وہ یاد رکھیں کہ) وہ (ہرگز اللہ کو ان باتوں کے پورا کرنے سے) عاجز نہ پائیں گے۔"}, {"arabic": " اَوۡ یَاۡخُذَہُمۡ عَلٰی تَخَوُّفٍ ؕ فَاِنَّ رَبَّکُمۡ لَرَءُوۡفٌ رَّحِیۡمٌ ﴿۴۸﴾", "english": " Or that He will not seize them by a process of gradual destruction? Your Lord is indeed Compassionate, Merciful.", "french": " Ou, qu’Il ne les détruira pas à travers un processus graduel d’usure ? Votre Seigneur est, en vérité, Compatissant, Miséricordieux.", "german": " Oder dass Er sie nicht durch allmähliche Vernichtung erfasst? Euer Herr ist fürwahr gütig, barmherzig.", "spanish": " ¿O de que Él no los alcanzará con un proceso de aniquilación gradual? Vuestro Señor es en verdad Compasivo, Misericordioso.", "urdu": " یا وہ انہیں آہستہ آہستہ گھٹا کر ہلاک کر دے کیونکہ تمہارا رب یقیناً (مومنوں پر) بہت (ہی) شفقت کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اِلٰی مَا خَلَقَ اللّٰہُ مِنۡ شَیۡءٍ یَّتَفَیَّؤُا ظِلٰلُہٗ عَنِ الۡیَمِیۡنِ وَ الشَّمَآئِلِ سُجَّدًا لِّلّٰہِ وَ ہُمۡ دٰخِرُوۡنَ ﴿۴۹﴾", "english": " Have they not seen that the shadows of everything which Allah has created shift from the right and from the left, prostrating themselves to Allah, while they are being humbled?", "french": " N’ont-ils pas vu que les ombres de toutes les choses qu’Allāh a créées se déplacent à droite et à gauche, et se prosternent humblement devant Allāh ?", "german": " Haben sie denn nicht gesehen, wie die Schatten eines jeden Dings, das Allah schuf, von rechts und von links sich wenden, sich niederwerfend vor Allah, dieweil sie gedemütigt werden?", "spanish": " ¿Acaso no han comprobado que las sombras de todo lo que Al-lah ha creado se mueven desde la derecha y desde la izquierda, postrándose ante Al-lah al tiempo que se humillan?", "urdu": " اور کیا باوجود اس کے کہ وہ ذلیل ہو رہے ہیں انہوں نے (کبھی) اللہ کے حضور (تذلل کے ساتھ) جھکتے ہوئے جو کچھ بھی اللہ نے (ان کے لئے) پیدا کیا ہے اسے غور سے نہیں دیکھا کہ اس کے سائے دائیں جانب سے اور شمالی جانبوں سے ادھر ادھر ہو رہے ہیں (پس اسی طرح محمد رسول اللہ صلی اللہ علیہ وسلم کا سایہ بڑھے گا اور وہ کفار ذلیل ہو کر رہیں گے) ۔"}, {"arabic": " وَ لِلّٰہِ یَسۡجُدُ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ مِنۡ دَآبَّۃٍ وَّ الۡمَلٰٓئِکَۃُ وَ ہُمۡ لَا یَسۡتَکۡبِرُوۡنَ ﴿۵۰﴾", "english": " And whatever is in the heavens and whatever creature is in the earth submits humbly to Allah, and the angels too , and they do not behave proudly.", "french": " Et tout ce qui est dans les cieux, et toute créature qui est sur la terre, tout se soumet humblement à Allāh, et les anges aussi , et ils ne se conduisent pas orgueilleusement.", "german": " Und was in den Himmeln ist und was auf Erden ist an Geschöpfen, unterwirft sich Allah, also die Engel, und sie betragen sich nicht hoffärtig.", "spanish": " Pues todo lo que hay en los cielos y cada criatura que hay en la tierra se somete humildemente a Al-lah, y también los ángeles, que no se comportan orgullosamente.", "urdu": " اور جو (کچھ بھی) آسمانوں میں ہے‘ اور (نیز) زمین پر جو بھی جاندار (موجود) ہیں اور (تمام) فرشتے بھی اللہ کے حضور میں ہی جھکے رہتے ہیں اور وہ بڑائی نہیں کرتے۔"}, {"arabic": " یَخَافُوۡنَ رَبَّہُمۡ مِّنۡ فَوۡقِہِمۡ وَ یَفۡعَلُوۡنَ مَا یُؤۡمَرُوۡنَ ﴿٪ٛ۵۱﴾", "english": " They fear their Lord above them, and do what they are commanded.", "french": " Ils craignent leur Seigneur au-dessus d’eux, et font ce qu’il leur est commandé.", "german": " Sie fürchten ihren Herrn über ihnen und tun, was ihnen geheißen ist.", "spanish": " Temen a su Señor que está encima de ellos, y hacen lo que se les ordena.", "urdu": " وہ اپنے رب سے جو ان پر غالب ہے ڈرتے رہتے ہیں اور جس بات کا انہیں حکم دیا جاتا ہے (وہی) کرتے ہیں۔"}, {"arabic": " وَ قَالَ اللّٰہُ لَا تَتَّخِذُوۡۤا اِلٰـہَیۡنِ اثۡنَیۡنِ ۚ اِنَّمَا ہُوَ اِلٰہٌ وَّاحِدٌ ۚ فَاِیَّایَ فَارۡہَبُوۡنِ ﴿۵۲﴾", "english": " Allah has said, ‘Take not for worship two gods. There is only One God. So fear Me alone.’", "french": " Allāh a dit : « Ne prenez pas deux dieux pour objet d’adoration . Il n’y a qu’Un Dieu Unique. Aussi, craignez-Moi Seul. »", "german": " Allah hat gesprochen: \"Habt nicht zwei Götter. Er ist der Einige Gott. So fürchtet Mich allein.\"", "spanish": " Al-lah ha dicho: “No toméis a dos dioses para adorarlos. No hay más que un Dios Único. Así pues, Temedme solamente a Mí”.", "urdu": " اور اللہ نے (ہمیشہ ہر قوم کو یہی) فرمایا ہے (کہ) تم دو معبود مت بناٶ۔ وہ (یعنی معبود برحق تو) ایک ہی ہے پس تم مجھ سے ہی (ڈرو) پھر (میں تم سے کہتا ہوں کہ) مجھ سے ہی ڈرو۔"}, {"arabic": " وَ لَہٗ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ وَ لَہُ الدِّیۡنُ وَاصِبًا ؕ اَفَغَیۡرَ اللّٰہِ تَتَّقُوۡنَ ﴿۵۳﴾", "english": " And to Him belongs whatsoever is in the heavens and the earth and to Him is due obedience for ever. Will you then fear any other than Allah?", "french": " Et c’est à Lui qu’appartient, tout ce qui est aux cieux et sur la terre ; et à c’est à Lui qu’appartient, pour toujours, le droit de choisir la Voie. Craindrez-vous donc quelqu’autre qu’Allāh ?", "german": " Und Sein ist, was in den Himmeln und was auf Erden ist, und Ihm gehört Gehorsam auf immer. Wollt ihr also einen anderen zum Beschützer nehmen als Allah?", "spanish": " A Él pertenece todo lo que hay en los cielos y en la tierra y a Él pertenece eternamente el derecho a determinar el camino. ¿Temeréis pues a alguien que no sea Al-lah?", "urdu": " اور جو کچھ (بھی) آسمانوں اور زمین میں (پایا جاتا) ہے سب اسی کی ملکیت ہے اور اطاعت ہمیشہ اسی کا حق ہے تو کیا تم اللہ کے سوا اور ہستیوں کو اپنے بچاٶ کا ذریعہ بناتے ہو۔"}, {"arabic": " وَ مَا بِکُمۡ مِّنۡ نِّعۡمَۃٍ فَمِنَ اللّٰہِ ثُمَّ اِذَا مَسَّکُمُ الضُّرُّ فَاِلَیۡہِ تَجۡـَٔرُوۡنَ ﴿ۚ۵۴﴾", "english": " And whatever blessing you have, it is from Allah. And when affliction befalls you, it is unto Him that you cry for help .", "french": " Et tout bienfait à votre disposition provient d’Allāh. Et lorsque le malheur vous surprend, c’est Lui que vous suppliez pour l’enlever.", "german": " Was ihr Gutes habt, es ist von Allah; und wenn euch ein Unheil befällt, dann fleht ihr Ihn um Hilfe an.", "spanish": " Pues todas las bendiciones que tenéis proceden de Al-lah. Y cuando s aflige la desgracia, es a Él a quien clamáis pidiendo ayuda.", "urdu": " اور جو نعمت بھی تمہارے شامل حال ہے وہ اللہ ہی کی طرف سے ہے پھر جب تمہیں (کوئی تنگی اور) تکلیف پہنچتی ہے تو (اس وقت بھی) تم اسی کے حضور فریاد کرتے ہو۔"}, {"arabic": " ثُمَّ اِذَا کَشَفَ الضُّرَّ عَنۡکُمۡ اِذَا فَرِیۡقٌ مِّنۡکُمۡ بِرَبِّہِمۡ یُشۡرِکُوۡنَ ﴿ۙ۵۵﴾", "english": " Then, when He removes the affliction from you, behold! a party among you begins to attribute equals to their Lord,", "french": " Ensuite, quand Il vous enlève le malheur, voyez une partie d’entre vous se mettent à attribuer des associés à leur Seigneur,", "german": " Doch wenn Er dann das Unheil von euch hinwegnimmt, siehe, da (beginnt) ein Teil von euch, ihrem Herrn Götter zur Seite zu stellen,", "spanish": " Luego, cuando os retira la desgracia, he ahí que un grupo de entre vosotros empieza a atribuir iguales a su Señor,", "urdu": " پھر جب وہ تم سے اس تکلیف کو دور کر دیتا ہے تو تم میں سے بعض لوگ جھٹ (اوروں کو) اپنے رب کا شریک ٹھہرانے لگتے ہیں۔"}, {"arabic": " لِیَکۡفُرُوۡا بِمَاۤ اٰتَیۡنٰہُمۡ ؕ فَتَمَتَّعُوۡا ۟ فَسَوۡفَ تَعۡلَمُوۡنَ ﴿۵۶﴾", "english": " So that they deny that which We have bestowed upon them. Well, enjoy yourselves a little; but soon will you know.", "french": " Ce qui fait qu’ils désavouent ce que Nous leur avons donné. Eh bien, jouissez des bénéfices pour un temps ; mais bientôt vous saurez.", "german": " (mit dem Ergebnis) dass sie verleugnen, was Wir ihnen beschert haben. Wohlan, vergnügt euch nur eine Weile; bald aber werdet ihr es erfahren", "spanish": " Hasta el punto de que niegan cuanto les hemos concedido. Pues bien, gozad un poco; pues pronto sabréis.", "urdu": " نتیجہ یہ ہوتا ہے کہ جو کچھ ہم نے انہیں دیا ہے وہ اس کا انکار کر دیتے ہیں۔ اچھا! تم عارضی (اور وقتی سامانوں سے) نفع اٹھالو اور (اس کا انجام بھی) تم جلد معلوم کرلوگے۔"}, {"arabic": " وَ یَجۡعَلُوۡنَ لِمَا لَا یَعۡلَمُوۡنَ نَصِیۡبًا مِّمَّا رَزَقۡنٰہُمۡ ؕ تَاللّٰہِ لَتُسۡـَٔلُنَّ عَمَّا کُنۡتُمۡ تَفۡتَرُوۡنَ ﴿۵۷﴾", "english": " And they set apart for the false deities of which they know nothing a portion of that which We have bestowed on them. By Allah, you shall certainly be called to account for all that you have forged.", "french": " Et de la provision que Nous leur avons accordée, ils mettent de côté une partie pour ces faux dieux à propos desquels ils ne savent rien. Par Allāh, il vous sera certainement demandé compte de tout ce que vous avez inventé.", "german": " und (für die falschen Gottheiten) von denen sie nichts wissen, setzen sie einen Teil beiseite von dem, was Wir ihnen beschert haben. Bei Allah, ihr werdet sicherlich zur Rechenschaft gezogen werden für all das, was ihr erdichtet.", "spanish": " Y apartan para los falsos dioses de los que no saben nada, una parte de lo que les hemos concedido. Por Al-lah, ciertamente se os pedirá cuenta de todo lo que habéis fraguado.", "urdu": " اور جو کچھ ہم نے انہیں دیا ہے اس میں سے ایک حصہ وہ (اپنے) ان (جھوٹے معبودوں) کے لئے مخصوص کر دیتے ہیں جن (کی حقیقت) کے متعلق وہ (کچھ) علم نہیں رکھتے۔ اللہ کی قسم‘ جو کچھ تم (جھوٹ سے کام لیکر) اپنے پاس سے بناتے رہے ہو (ایک دن) اس کی نسبت تم سے یقیناً باز پرس ہوگی۔"}, {"arabic": " وَ یَجۡعَلُوۡنَ لِلّٰہِ الۡبَنٰتِ سُبۡحٰنَہٗ ۙ وَ لَہُمۡ مَّا یَشۡتَہُوۡنَ ﴿۵۸﴾", "english": " And they ascribe daughters to Allah — Holy is He! — while they themselves have what they desire.", "french": " Et ils attribuent des filles à Allāh – Gloire à Lui ! – tandis qu’ils ont eux ce qu’ils désirent.", "german": " Und sie dichten Allah – Heilig ist Er! – Töchter an, während sie (selbst) haben, was sie begehren.", "spanish": " Y atribuyen hijas a Al-lah - ¡Santo es Él! – mientras ellos mismos tienen lo que desean.", "urdu": " اور وہ اللہ کی طرف لڑکیاں منسوب کرتے ہیں (یاد رکھو) وہ (ایسی باتوں سے) پاک ہے اور (لطف یہ ہے کہ) انہیں وہ کچھ حاصل ہے جو وہ چاہتے ہیں (یعنی لڑکے)"}, {"arabic": " وَ اِذَا بُشِّرَ اَحَدُہُمۡ بِالۡاُنۡثٰی ظَلَّ وَجۡہُہٗ مُسۡوَدًّا وَّ ہُوَ کَظِیۡمٌ ﴿ۚ۵۹﴾", "english": " And when to one of them is conveyed the tidings of the birth of a female, his face darkens, while he suppresses his inward grief.", "french": " Et lorsqu’on apporte à l’un d’entre eux la nouvelle de la naissance d’une fille, son visage s’assombrit, en raison de ce chagrin intérieur qu’il refoule.", "german": " Und wenn einem von ihnen die Nachricht von (der Geburt) einer Tochter gebracht wird, so verfinstert sich sein Gesicht, indes er den inneren Schmerz unterdrückt.", "spanish": " Mas cuando se anuncia a uno de ellos la buena nueva del nacimiento de una hembra, su semblante se ensombrece, y sofoca la angustia en su interior.", "urdu": " اور (اس کے مقابل پر ان کا یہ حال ہے کہ) جب ان میں سے کسی کو لڑکی (کی پیدائش) کی خبر مل جائے تو اس کا منہ سیاہ ہو جاتا ہے اور وہ نہایت رنجیدہ ہوتا ہے۔"}, {"arabic": " یَتَوَارٰی مِنَ الۡقَوۡمِ مِنۡ سُوۡٓءِ مَا بُشِّرَ بِہٖ ؕ اَیُمۡسِکُہٗ عَلٰی ہُوۡنٍ اَمۡ یَدُسُّہٗ فِی التُّرَابِ ؕ اَلَا سَآءَ مَا یَحۡکُمُوۡنَ ﴿۶۰﴾", "english": " He hides himself from the people because of the bad news he has had: ‘Shall he keep it in spite of disgrace or bury it in the dust?’ Verily, evil is that which they judge.", "french": " Il se cache des gens à cause de la mauvaise nouvelle qu’il a reçue : Doit-il la garder malgré la honte, ou l’enterrer dans la poussière ? En vérité, mauvais est ce qu’ils jugent.", "german": " Er verbirgt sich vor den Leuten ob der schlimmen Nachricht, die er erhalten hat: Soll er sie trotz der Schande behalten oder im Staub verscharren? Wahrlich, übel ist, wie sie urteilen!", "spanish": " Se oculta de las gentes por la mala noticia que ha recibido: “¿La conservará a pesar de la deshonra o la enterrará en el polvo?”. En verdad, ¡cuán malo es lo que juzgan!", "urdu": " (اور) جس بات کی اسے خبر دی گئی ہے اس کی (مزعومہ) شناعت کے باعث وہ لوگوں سے چھپتا (پھرتا) ہے (اور سوچتا ہے کہ) آیا وہ اسے (پیش آنے والی) ذلت کے باوجود (زندہ) رہنے دے یا اسے (کہیں) مٹی میں گاڑ دے۔ سنو! جو رائے وہ قائم کرتے ہیں بہت بری ہے۔"}, {"arabic": " لِلَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ مَثَلُ السَّوۡءِ ۚ وَ لِلّٰہِ الۡمَثَلُ الۡاَعۡلٰی ؕ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿٪۶۱﴾", "english": " The state of those who do not believe in the Hereafter is evil, while Allah’s attribute is sublime and He is the Mighty, the Wise.", "french": " Ceux qui ne croient pas à l’au-delà, c’est à eux que s’appliquent les pires analogies ; alors qu’à Allāh appartient ce qu’il y a de plus sublime. Et Il est le Puissant, le Sage.", "german": " Der Zustand derer, die nicht an das Jenseits glauben, ist übel, Allahs Sein aber ist hoch erhaben und Er ist der Allmächtige, der Allweise.", "spanish": " A quienes no creen en el Más Allá se ajusta la peor semblanza; mientras que a Al-lah pertenece lo más sublime y Él es el Poderoso, el Sabio.", "urdu": " جو لوگ آخرت پرایمان نہیں لاتے ان کی حالت بری ہے۔ اور ہر اعلیٰ صفت (اور شان) اللہ ہی کی ہے اور وہی غالب (اور) حکمت والا ہے۔"}, {"arabic": " وَ لَوۡ یُؤَاخِذُ اللّٰہُ النَّاسَ بِظُلۡمِہِمۡ مَّا تَرَکَ عَلَیۡہَا مِنۡ دَآبَّۃٍ وَّ لٰکِنۡ یُّؤَخِّرُہُمۡ اِلٰۤی اَجَلٍ مُّسَمًّی ۚ فَاِذَا جَآءَ اَجَلُہُمۡ لَا یَسۡتَاۡخِرُوۡنَ سَاعَۃً وَّ لَا یَسۡتَقۡدِمُوۡنَ ﴿۶۲﴾", "english": " And if Allah were to punish men for their wrongdoing, He would not leave thereon a living creature, but He gives them respite till an appointed term; and when their term is come, they cannot remain behind a single hour, nor can they go ahead of it .", "french": " Et si Allāh devait châtier les hommes pour leurs iniquités, Il ne laisserait pas sur terre une seule créature vivante, mais Il leur accorde un délai jusqu’à un terme fixé ; et quand leur terme arrive, ils ne peuvent rester en arrière un seul instant, ni le devancer.", "german": " Und wenn Allah die Menschen für ihr Freveln bestrafen wollte, Er würde nicht ein einziges Lebewesen darauf (auf der Erde) lassen, doch Er gewährt ihnen Aufschub bis zu einer bestimmten Zeit; und wenn ihre Frist um ist, dann können sie auch nicht eine Stunde dahinter zurückbleiben, noch können sie (ihr) vorauseilen.", "spanish": " Y si Al-lah tuviera que castigar a los hombres por sus malas acciones, no dejaría una criatura viva, pero Él les concede un respiro hasta un plazo fijado; y cuando les llega el plazo, no pueden retrasarse una sola hora, ni adelantar lo .", "urdu": " اور اگر اللہ (کی یہ سنت ہوتی کہ وہ) لوگوں کو ان کے (ارتکاب) ظلم پر (فوراً) پکڑ لیتا (اور توبہ کے لئے مہلت نہ دیتا) تو وہ اس (زمین) پر کسی جاندار کو (زندہ) نہ چھوڑتا مگر (اس کی یہ سنت ہے کہ) وہ (اصلاح کے لئے) انہیں ایک معین وقت تک مہلت دیتا (چلا جاتا) ہے۔ پھر جب ان (کی سزا) کا وقت آجاتا ہے تو وہ نہ تو ایک گھڑی پیچھے رہ کر (بچ) سکتے ہیں اور نہ (اس سے) آگے نکل (کر بچ) سکتے ہیں۔"}, {"arabic": " وَ یَجۡعَلُوۡنَ لِلّٰہِ مَا یَکۡرَہُوۡنَ وَ تَصِفُ اَلۡسِنَتُہُمُ الۡکَذِبَ اَنَّ لَہُمُ الۡحُسۡنٰی ؕ لَا جَرَمَ اَنَّ لَہُمُ النَّارَ وَ اَنَّہُمۡ مُّفۡرَطُوۡنَ ﴿۶۳﴾", "english": " And they attribute to Allah what they dislike for themselves and their tongues utter the lie that they will have the best of everything . Undoubtedly, theirs shall be the Fire, and therein shall they be abandoned.", "french": " Et ils attribuent à Allāh ce qu’ils détestent pour eux-mêmes , et leur langue prononce ce mensonge qu’ils auront la meilleure en toute chose. Ce qui sera pour eux, sans nul doute, c’est le Feu, et ils y seront abandonnés.", "german": " Und sie schreiben Allah zu, was ihnen (selbst) missliebig ist, und ihre Zungen äußern die Lüge, dass sie das Beste erhalten werden. Zweifellos wird ihnen das Feuer zuteil werden, und (darin) sollen sie verlassen bleiben.", "spanish": " Y atribuyen a Al-lah lo que no les gusta para ellos mismos sus lenguas profieren la mentira de que tendrán lo mejor de todo. Indudablemente, suyo será el Fuego, y en él serán abandonados.", "urdu": " اور وہ اللہ کے لئے وہ چیز تجویز کرتے ہیں جسے وہ (خود اپنے لئے) ناپسند کرتے ہیں اور ان کی زبانیں (بڑی جرات سے کام لیکر یہ) جھوٹ بولتی ہیں کہ انہیں ضرور بھلائی مل کر رہے گی (مگر یہ) اٹل بات ہے کہ ان کے لئے (دوزخ کی) آگ (کا عذاب مقدر) ہے اور یہ کہ انہیں (اس میں) چھوڑ دیا جائے گا۔"}, {"arabic": " تَاللّٰہِ لَقَدۡ اَرۡسَلۡنَاۤ اِلٰۤی اُمَمٍ مِّنۡ قَبۡلِکَ فَزَیَّنَ لَہُمُ الشَّیۡطٰنُ اَعۡمَالَہُمۡ فَہُوَ وَلِیُّہُمُ الۡیَوۡمَ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۶۴﴾", "english": " By Allah, We did send Messengers to the peoples before thee; but Satan made their works appear beautiful to them. So he is their patron this day, and they shall have a grievous punishment.", "french": " Par Allāh, Nous avons sûrement envoyé desMessagers aux peuples avant toi ; mais Satan leur fit paraître belles leurs œuvres. Ainsi, il sera leur patron ce jour-là, et ils auront un châtiment douloureux.", "german": " Bei Allah, Wir schickten fürwahr schon Gesandte zu den Völkern vor dir, doch Satan ließ ihnen ihre Werke wohlgefällig erscheinen. So ist er heute ihr Schutzherr, und ihnen wird schmerzliche Strafe.", "spanish": " Por Al-lah, enviamos Mensajeros a los pueblos antes de ti; pero Satanás hizo que sus obras les aparecieran bellas a sus ojos. Así pues, él es su patrón en este día, y sufrirán un doloroso castigo.", "urdu": " اللہ کی قسم ہم نے تجھ سے پہلے کی تمام امتوں کی طرف رسول بھیجے تھے۔ پھر انہیں شیطان نے ان کے (بد) اعمال خوبصورت کرکے دکھائے‘ سو آج وہی ان کا آقا (بنا ہوا) ہے اور (وہ اس کے پیچھے جا رہے ہیں) ان کے لئے دردناک عذاب (مقدر) ہے۔"}, {"arabic": " وَ مَاۤ اَنۡزَلۡنَا عَلَیۡکَ الۡکِتٰبَ اِلَّا لِتُبَیِّنَ لَہُمُ الَّذِی اخۡتَلَفُوۡا فِیۡہِ ۙ وَ ہُدًی وَّ رَحۡمَۃً لِّقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۶۵﴾", "english": " And We have not sent down to thee the Book except that thou mayest explain to them that concerning which they differ, and as a guidance, and a mercy for a people who believe.", "french": " Et Nous ne t’avons révélé le Livre que pour que tu leur expliques clairement ce sur quoi ils sont en désaccord, et pour les guider, et comme une miséricorde pour des gens qui croient.", "german": " Und Wir haben dir das Buch nur darum hinabgesandt, auf dass du ihnen das erklären mögest, worüber sie uneinig sind, und als Führung und Barmherzigkeit für Leute, die glauben.", "spanish": " Pues solamente te hemos revelado el Libro para que les expliques lo relativo a sus discordias, y como misericordia para un pueblo que cree.", "urdu": " اور ہم نے اس کتاب کو تجھ پر اسی لئے اتارا ہے کہ جس بات کے متعلق انہوں نے (باہم) اختلاف (پیدا) کر لیا ہے اس (کی اصل حقیقت) کو تو ان پر روشن کرے۔ اور (نیز) جو (اس پر) ایمان لائیں ان کے لئے یہ (کتاب) ہدایت اور رحمت (کا موجب) ہو۔"}, {"arabic": " وَ اللّٰہُ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَحۡیَا بِہِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّقَوۡمٍ یَّسۡمَعُوۡنَ ﴿٪۶۶﴾", "english": " And Allah has sent down water from the sky, and has quickened therewith the earth after its death. Surely, in that is a Sign for a people who would hear.", "french": " Et Allāh a fait descendre de l’eau du ciel, et en a vivifié la terre après sa mort. Assurément, il y a là un Signe pour des gens qui veulent entendre.", "german": " Allah hat Wasser vom Himmel hernieder gesandt und damit die Erde belebt nach ihrem Tod. Wahrlich, darin ist ein Zeichen für Leute, die hören mögen.", "spanish": " Y Al-lah ha enviado agua desde el cielo y ha resucitado con ella la tierra después de su muerte. En verdad, aquí hay un Signo para las gentes que quieren oír.", "urdu": " اور اللہ نے (ہی) آسمان سے پانی اتارا ہے اور اس کے ذریعہ سے اس نے زمین کو اس کے مردہ ہو چکنے کے بعد (ازسرنو) زندہ کیا ہے جو لوگ (حق بات کو) سنتے (اور اسے قبول کرنے کے لئے تیار ہوتے) ہیں ان کے لئے اس میں یقیناً ایک (بہت بڑا) نشان (پایا جاتا) ہے۔"}, {"arabic": " وَ اِنَّ لَکُمۡ فِی الۡاَنۡعَامِ لَعِبۡرَۃً ؕ نُسۡقِیۡکُمۡ مِّمَّا فِیۡ بُطُوۡنِہٖ مِنۡۢ بَیۡنِ فَرۡثٍ وَّ دَمٍ لَّبَنًا خَالِصًا سَآئِغًا لِّلشّٰرِبِیۡنَ ﴿۶۷﴾", "english": " And surely in the cattle too there is a lesson for you. We give you to drink of what is in their bellies, from betwixt the faeces and the blood, milk pure and pleasant for those who drink it .", "french": " Et assurément dans les bestiaux aussi il y a une leçon pour vous. Nous vous fournissons une boisson extraite de ce qu’ils ont dans le ventre – d’entre les excréments et le sang – du lait pur et agréable pour ceux qui en boivent.", "german": " Wahrlich, auch am Vieh habt ihr eine Lehre. Wir geben euch zu trinken von dem, was in ihren Leibern ist, zwischen Kot und Blut in der Mitte, Milch, lauter (und) angenehm denen, die trinken.", "spanish": " Y ciertamente en el ganado hay también una lección para vosotros. Os damos a beber lo que hay en sus entrañas, de entre las heces y la sangre, leche pura y agradable para quienes la beben.", "urdu": " اور تمہارے لئے چارپایوں میں (بھی) یقیناً نصیحت حاصل کرنے کا ذریعہ (موجود) ہے (کیا تم دیکھتے نہیں کہ) جو کچھ ان کے پیٹوں میں (گند وغیرہ بھرا) ہوتا ہے اس میں سے یعنی گوبر اور خون کے درمیان سے ہم تمہیں پینے کے لئے (پاک اور) صاف دودھ (مہیا کر) دیتے ہیں‘ جو پینے والوں کے لئے خوشگوار (اور) گلے سے آسانی سے اُترنے والا (ہوتا) ہے۔"}, {"arabic": " وَ مِنۡ ثَمَرٰتِ النَّخِیۡلِ وَ الۡاَعۡنَابِ تَتَّخِذُوۡنَ مِنۡہُ سَکَرًا وَّ رِزۡقًا حَسَنًا ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّقَوۡمٍ یَّعۡقِلُوۡنَ ﴿۶۸﴾", "english": " And of the fruits of the datepalms and the grapes, whence you obtain intoxicating drink and wholesome food. Verily, in that is a Sign for a people who make use of their reason.", "french": " Et des fruits des dattiers et des raisins, dont vous tirez des boissons intoxicantes et des aliments sains. En vérité, il y a là un Signe pour des gens qui se servent de leur raison.", "german": " Und von den Früchten der Dattelpalmen und den Trauben, von denen ihr berauschenden Trank und (auch) bekömmliche Nahrung zieht. Wahrlich, darin ist ein Zeichen für Leute, die vom Verstand Gebrauch machen.", "spanish": " Y de los frutos de las palmeras y la vid, de donde obtenéis una bebida embriagadora y alimentos nutritivos. En verdad, en ello hay un Signo para las gentes que hacen uso de su razón.", "urdu": " اور کھجوروں کے پھلوں اور انگوروں سے تم شراب (بھی) بناتے ہو اور اچھا رزق (بھی)۔ جو لوگ عقل سے کام لیتے ہیں ان کے لئے اس میں یقیناً ایک (بڑا) نشان پایا جاتا ہے۔"}, {"arabic": " وَ اَوۡحٰی رَبُّکَ اِلَی النَّحۡلِ اَنِ اتَّخِذِیۡ مِنَ الۡجِبَالِ بُیُوۡتًا وَّ مِنَ الشَّجَرِ وَ مِمَّا یَعۡرِشُوۡنَ ﴿ۙ۶۹﴾", "english": " And thy Lord has inspired the bee, saying , ‘Make thou houses in the hills and in the trees and in the trellises which they build.", "french": " Et ton Seigneur inspira l’abeille, en lui disant : « Fais des maisons dans les collines et dans les arbres et dans les treillis qu’ils construisent.", "german": " Und dein Herr hat der Biene eingegeben: \"Baue dir Häuser in den Bergen und in den Bäumen und in den Spalieren, die sie errichten.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=16:69&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=16:69&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic70\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic70\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/16:70' style='text-decoration:underline'>16:70</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(70)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control70\"></i></button> <audio id=\"player70\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ثُمَّ کُلِیۡ مِنۡ کُلِّ الثَّمَرٰتِ فَاسۡلُکِیۡ سُبُلَ رَبِّکِ ذُلُلًا ؕ یَخۡرُجُ مِنۡۢ بُطُوۡنِہَا شَرَابٌ مُّخۡتَلِفٌ اَلۡوَانُہٗ فِیۡہِ شِفَآءٌ لِّلنَّاسِ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّقَوۡمٍ یَّتَفَکَّرُوۡنَ ﴿۷۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Then eat of every <em>kind of </em>fruit, and follow the ways of thy Lord <I>that have been </I>made easy <em>for thee</em>.’ There comes forth from their bellies a drink of varying hues. Therein is cure for men. Surely, in that is a Sign for a people who reflect.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Then eat of all <i>manner of </i>fruits, and follow the ways <i>taught thee by </i>thy Lord and <i>which </i>have been made easy <i>for thee</i>.’ There comes forth from their bellies a drink of varying hues. Therein is healing for mankind. Surely, in that is a Sign for a people who reflect.<sup class='ref'>[<a class='ref' data-id='ref_16_70_1557' href='#'>1557</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_16_70_1557'>1557</span></div> <div><a name='1557'></a><div class='reference' data-id='ref_16_70_1557' style='display:none'> <p><b>1557.</b> The subject of the bee has been further elaborated in this verse. God inspires the bee to collect its food from different fruits and flowers and then by means of the mechanism provided in its body and by the methods revealed to it by God it converts the collected food into honey. Honey possesses different colours and flavours, but all its different varieties are highly useful for men. This suggests that revelation has continued to descend on Prophets at different times and that the teachings of one Prophet differed in some details from the teachings of others, nevertheless all were the means of moral and spiritual regeneration for the people for whom they were designed. (<a href='javascript:void(0)' data-id='ref_16_70_1557' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پھر ہر قسم کے پھلوں میں سے کھا اور اپنے ربّ کے رستوں پر عاجزی کرتے ہوئے چل۔ ان کے پیٹوں میں سے ایسا مشروب نکلتا ہے جس کے رنگ مختلف ہیں اور اس میں انسانوں کے لئے ایک بڑی شفا ہے۔ یقیناً اس میں غور و فکر کرنے والوں کے لئے بہت بڑا نشان ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پھر ہر قسم کے پھلوں میں سے (تھوڑا تھوڑا لے کر) کھا اور اپنے رب کے (بتائے ہوئے) طریقوں پر جو (تیرے لئے) آسان (کئے گئے) ہیں چل۔ ان (مکھیوں) کے پیٹوں سے (تمہارے) پینے کی ایک چیز نکلتی ہے جو مختلف رنگوں کی ہوتی ہے (اور) اس میں لوگوں کے لئے شفا (کی خاصیت رکھی گئی) ہے۔ جو لوگ سوچ (اور فکر) سے کام لیتے ہیں۔ ان کے لئے اس میں یقیناً کئی نشان (پائے جاتے) ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Puis mange de toute espèce de fruits, et ensuite suis docilement les voies prescrites par ton Seigneur. » Il sort de leur ventre une boisson de nuances variées. Il s’y trouve de la guérison pour les hommes. Assurément, il y a là un Signe pour des gens qui réfléchissent.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Come luego de <em>todo tipo de</em> fruta, y sigue humildemente los caminos prescritos por tu Señor”. De sus vientres sale una bebida de diversas tonalidades. En ella hay una cura para el hombre. En verdad, en ello hay un Signo para las gentes que reflexionan.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dann iss von allen Arten an Früchten und folge den Wegen deines Herrn, (die dir) leicht gemacht.\" Aus ihren Leibern kommt ein Trank, mannigfach an Farbe. Darin ist Heilung für die Menschen. Wahrlich, hierin ist ein Zeichen für Leute, die nachdenken.", "spanish": " Y tu Señor inspiró a la abeja, diciéndole: “Hazte casas en las colinas, en los árboles y en los enrejados que ellos construyen”.", "urdu": " اور تیرے رب نے شہد کی مکھی کی طرف وحی کی کہ تو پہاڑوں میں اور درختوں میں اور جو (انگوروں وغیرہ کے لئے لوگ) ٹٹیاں بنا لیتے ہیں ان میں (اپنے) گھر بنا۔"}], "Surah": 16}