{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَلۡحَمۡدُ لِلّٰہِ الَّذِیۡۤ اَنۡزَلَ عَلٰی عَبۡدِہِ الۡکِتٰبَ وَ لَمۡ یَجۡعَلۡ لَّہٗ عِوَجًا ؕ﴿ٜ۲﴾", "english": " All praise belongs to Allah Who has sent down the Book to His servant and has not put therein any crookedness.", "french": " Toutes les louanges appartiennent à Allāh Qui a envoyé le Livre à Son serviteur, et Il n’a fait rien de travers dans sa création – la création du Prophète ou du Livre .", "german": " Aller Preis gehört Allah, Der zu Seinem Diener das Buch herabsandte und nichts Krummes darein legte –", "spanish": " Toda alabanza corresponde a Al-lah, Quien ha revelado el Libro a Su siervo, y no ha utilizado tergiversación alguna en su creación.", "urdu": " ہر تعریف کا اللہ ہی مستحق ہے جس نے (یہ) کتاب اپنے بندہ پر اتاری ہے‘ اور اس میں کوئی کجی نہیں رکھی۔"}, {"arabic": " قَیِّمًا لِّیُنۡذِرَ بَاۡسًا شَدِیۡدًا مِّنۡ لَّدُنۡہُ وَ یُبَشِّرَ الۡمُؤۡمِنِیۡنَ الَّذِیۡنَ یَعۡمَلُوۡنَ الصّٰلِحٰتِ اَنَّ لَہُمۡ اَجۡرًا حَسَنًا ۙ﴿۳﴾", "english": " He has made it a guardian, that it may give warning of a grievous chastisement from Him, and that it may give the believers who do good deeds the glad tidings that they shall have a good reward,", "french": " Il en a fait un gardien, afin qu’il donne l’avertissement d’un châtiment sévère de Sa part, et qu’il annonce aux croyants qui font de bonnes œuvres la bonne nouvelle qu’ils auront une belle récompense,", "german": " als Wegweiser, damit es strenge Strafe von Ihm androhe und den Gläubigen, die gute Werke tun, die frohe Botschaft bringe, dass ihnen ein schöner Lohn wird,", "spanish": " Él lo ha convertido en guardián, para advertir de un doloroso castigo Suyo, y para dar a los creyentes que hacen buenas obras, la buena noticia de que tendrán una maravillosa recompensa,", "urdu": " (اور اس نے اسے) سچ سے معمور اور صحیح راہنمائی کرنے والی بنا کر اتارا ہے تا کہ وہ (لوگوں کو) اس کی (یعنی اللہ کی) طرف سے (آنے والے) ایک سخت عذاب سے آ گاہ کرے اور ایمان لانے والوں کو جو نیک (اور ایمان کے مناسب حال) کام کرتے ہیں بشارت دے کہ ان کے لئے (خدا کی طرف سے) اچھا اجر (مقدر) ہے۔"}, {"arabic": " مَّاکِثِیۡنَ فِیۡہِ اَبَدًا ۙ﴿۴﴾", "english": " Wherein they shall abide for ever;", "french": " Où ils demeureront à tout jamais ;", "german": " worin sie weilen werden immerdar;", "spanish": " En la que morarán para siempre;", "urdu": " وہ اس (اجر کے مقام) میں ہمیشہ رہیں گے۔"}, {"arabic": " وَّ یُنۡذِرَ الَّذِیۡنَ قَالُوا اتَّخَذَ اللّٰہُ وَلَدًا ٭﴿۵﴾", "english": " And that it may warn those who say, ‘ Allah has taken unto Himself a son.’", "french": " Et qu’il avertisse ceux qui disent : « Allāh S’est pris un fils. »", "german": " und damit es jene warne, die da sagen: \"Allah hat Sich einen Sohn beigesellt.\"", "spanish": " Y para advertir a quienes dicen: “Al-lah ha tomado para Sí un hijo”.", "urdu": " اور (نیز اُس نے اس لئے اسے اُتارا ہے کہ) تا وہ ان لوگوں کو (آنے والے عذاب سے) آ گاہ کرے جو یہ کہتے ہیں (کہ) اللہ نے (فلاں شخص کو) بیٹا بنا لیا ہے۔"}, {"arabic": " مَا لَہُمۡ بِہٖ مِنۡ عِلۡمٍ وَّ لَا لِاٰبَآئِہِمۡ ؕ کَبُرَتۡ کَلِمَۃً تَخۡرُجُ مِنۡ اَفۡوَاہِہِمۡ ؕ اِنۡ یَّقُوۡلُوۡنَ اِلَّا کَذِبًا ﴿۶﴾", "english": " No knowledge have they thereof, nor had their fathers. Grievous is the word that comes from their mouths. They speak naught but a lie.", "french": " Ils n’en ont aucune connaissance, et leurs pères non plus. C’est une parole monstrueuse qui sort de leurs bouches. Ils ne disent rien d’autre qu’un mensonge.", "german": " Sie haben keinerlei Kenntnis davon, noch hatten es ihre Väter. Groß ist das Wort, das aus ihrem Munde kommt. Sie sprechen nichts als Lüge.", "spanish": " No tienen el menor conocimiento de ello, ni lo tuvieron sus padres. Es una maldad la palabra que sale de sus bocas. No dicen más que mentiras.", "urdu": " اُنہیں اس بارہ میں کچھ بھی تو علم (حاصل) نہیں اور نہ ان کے بڑوں کو (اس بارہ میں کوئی علم تھا) یہ بہت بڑی (خطرناک) بات ہے جو ان کے مونہوں سے نکل رہی ہے (بلکہ) وہ محض جھوٹ بول رہے ہیں۔"}, {"arabic": " فَلَعَلَّکَ بَاخِعٌ نَّفۡسَکَ عَلٰۤی اٰثَارِہِمۡ اِنۡ لَّمۡ یُؤۡمِنُوۡا بِہٰذَا الۡحَدِیۡثِ اَسَفًا ﴿۷﴾", "english": " So haply thou wilt grieve thyself to death for sorrow after them if they believe not in this discourse.", "french": " Ainsi, il se peut que tu te désoles à en mourir pour eux s’ils ne croient pas à cette narration.", "german": " So wirst du dich vielleicht noch zu Tode grämen aus Kummer über sie, wenn sie dieser Rede nicht glauben.", "spanish": " Es posible que te aflijas hasta la muerte por la pena que sientes por ellos si no creen en este mensaje.", "urdu": " (کیا) اگر وہ اس عظیم الشان کلام پر ایمان نہ لائیں تو تو ان کے غم میں شدت افسوس کی وجہ سے اپنی جان کو ہلاکت میں ڈال دے گا۔"}, {"arabic": " اِنَّا جَعَلۡنَا مَا عَلَی الۡاَرۡضِ زِیۡنَۃً لَّہَا لِنَبۡلُوَہُمۡ اَیُّہُمۡ اَحۡسَنُ عَمَلًا ﴿۸﴾", "english": " Verily, We have made all that is on the earth as an ornament for it, that We may try them as to which of them is best in conduct.", "french": " En vérité, Nous avons fait tout ce qu’il y a sur la terre comme un ornement pour elle, afin de les éprouver pour voir lequel d’entre eux excelle en conduite.", "german": " Siehe, Wir schufen alles, was auf Erden ist, zu einem Schmuck für sie, auf dass Wir sie prüfen, wer unter ihnen der Beste im Wirken ist.", "spanish": " En verdad, hemos hecho todo lo que hay en la tierra como adorno suyo, para probarlos y comprobar cuáles de ellos se comportan mejor.", "urdu": " جو کچھ (روئے) زمین پر (موجود) ہے اسے یقیناً ہم نے اس کی زینت (کا موجب) بنایا ہے تا کہ ہم ان کا امتحان لیں (کہ) ان میں سے سب سے اچھا کام کرنے والا کون ہے۔"}, {"arabic": " وَ اِنَّا لَجٰعِلُوۡنَ مَا عَلَیۡہَا صَعِیۡدًا جُرُزًا ؕ﴿۹﴾", "english": " And We shall make all that is thereon a barren soil.", "french": " Et, en vérité, Nous allons rendre tout ce qui se trouve sur sa surface en un sol aride.", "german": " Und siehe, Wir werden alles, was auf ihr ist, in dürren Wüstenstaub verwandeln.", "spanish": " Mas convertiremos todo cuanto existe en ella en terreno árido.", "urdu": " اور جو کچھ اس (زمین) پر (موجود) ہے اسے ہم یقیناً (ایک دن) مٹا کر ویران سطح بنا دیں گے۔"}, {"arabic": " اَمۡ حَسِبۡتَ اَنَّ اَصۡحٰبَ الۡکَہۡفِ وَ الرَّقِیۡمِ ۙ کَانُوۡا مِنۡ اٰیٰتِنَا عَجَبًا ﴿۱۰﴾", "english": " Dost thou think that the People of the Cave and the Inscription were a wonder among Our Signs?", "french": " Penses-tu que les Gens de la Caverne et de l’Inscription étaient une merveille parmi Nos Signes ?", "german": " Meinst du wohl, die Gefährten in der Höhle und der Inschrift seien ein Wunder unter Unseren Zeichen?", "spanish": " ¿Crees que el Pueblo de la Caverna y la Inscripción eran una maravilla entre Nuestros Signos?", "urdu": " کیا تو سمجھتا ہے کہ کہف اور رقیم والے (لوگ) ہمارے نشانوں میں سے کوئی اچنبھا (نشان) تھے (جن کی نظیر پھر کبھی نہ پائی جا سکتی ہو)"}, {"arabic": " اِذۡ اَوَی الۡفِتۡیَۃُ اِلَی الۡکَہۡفِ فَقَالُوۡا رَبَّنَاۤ اٰتِنَا مِنۡ لَّدُنۡکَ رَحۡمَۃً وَّ ہَیِّیٴۡ لَنَا مِنۡ اَمۡرِنَا رَشَدًا ﴿۱۱﴾", "english": " When the young men betook themselves for refuge to the Cave and said, ‘Our Lord, bestow on us mercy from Thyself, and provide for us right guidance in our affair.’", "french": " Lorsque les jeunes gens se réfugièrent dans la Caverne, ils dirent : « Notre Seigneur, accorde-nous de Ta part de la miséricorde, et guide-nous dans notre affaire. »", "german": " Als die Jünglinge in der Höhle Zuflucht nahmen und sprachen: \"Unser Herr, gewähre uns Barmherzigkeit von Dir aus und bereite uns einen Weg in unserer Sache.\"", "spanish": " Cuando los jóvenes buscaron refugio en la Caverna diciendo: “Señor Nuestro, concédenos Tu misericordia, y guíanos rectamente en nuestro asunto”.", "urdu": " جب وہ (چند) نوجوان وسیع غار میں پناہ گزیں ہوئے اور (دعا کرتے ہوئے) انہوں نے کہا (کہ) اے ہمارے رب ہمیں اپنے حضور سے (خاص) رحمت عطا کر اور ہمارے لئے ہمارے (اس) معاملہ میں رشد و ہدایت کا سامان مہیا کر۔"}, {"arabic": " فَضَرَبۡنَا عَلٰۤی اٰذَانِہِمۡ فِی الۡکَہۡفِ سِنِیۡنَ عَدَدًا ﴿ۙ۱۲﴾", "english": " So We sealed up their ears in the Cave for a number of years.", "french": " Aussi, les avons-Nous empêchés d’entendre dans la Caverne les nouvelles du monde extérieur pendant quelques années.", "german": " Also versiegelten Wir ihre Ohren in der Höhle auf eine Anzahl von Jahren.", "spanish": " De ese modo les privamos de escuchar las noticias del mundo exterior durante una serie de años.", "urdu": " جس پر ہم نے اس وسیع غار میں چند گنتی کے سالوں کے لئے انہیں (بیرونی حالات کے) سننے سے محروم کر دیا۔"}, {"arabic": " ثُمَّ بَعَثۡنٰہُمۡ لِنَعۡلَمَ اَیُّ الۡحِزۡبَیۡنِ اَحۡصٰی لِمَا لَبِثُوۡۤا اَمَدًا ﴿٪۱۳﴾", "english": " Then We raised them up that We might know which of the two parties would better reckon the time that they had tarried.", "french": " Ensuite Nous les avons fait sortir de cet état afin de savoir lequel des deux partis saurait le mieux compter le temps qu’ils y étaient restés.", "german": " Dann erweckten Wir sie, auf dass Wir erführen welche von den beiden Scharen die Zeit ihres Verweilens am besten berechnet hatte.", "spanish": " Más tarde les despertamos para saber cuál de los dos grupos conservaba un cálculo mejor del tiempo durante el cual habían permanecido.", "urdu": " پھر ہم نے انہیں اٹھایا‘ تا کہ ہم جان لیں کہ جتنی مدت وہ (وہاں) ٹھہرے رہے تھے اسے (مسیح کے متبع) دونوں گروہوں میں سے زیادہ محفوظ رکھنے والا کونسا گروہ ہے۔"}, {"arabic": " نَحۡنُ نَقُصُّ عَلَیۡکَ نَبَاَہُمۡ بِالۡحَقِّ ؕ اِنَّہُمۡ فِتۡیَۃٌ اٰمَنُوۡا بِرَبِّہِمۡ وَ زِدۡنٰہُمۡ ہُدًی ﴿٭ۖ۱۴﴾", "english": " We will relate to thee their story with truth: They were young men who believed in their Lord, and We increased them in guidance.", "french": " Nous allons te raconter leur véritable histoire : c’étaient des jeunes gens qui croyaient en leur Seigneur, et Nous les avons fait progresser sur la bonne voie.", "german": " Wir wollen dir ihre Geschichte der Wahrheit gemäß berichten: Sie waren Jünglinge, die an ihren Herrn glaubten, und Wir ließen sie zunehmen an Führung.", "spanish": " Te relataremos su historia con veracidad: Eran jóvenes que creían en su Señor por lo que les aumentamos su guía.", "urdu": " (اب) ہم ان کی اہم خبر بالکل صحیح طور پر تیرے پاس بیان کرتے ہیں وہ چند نوجوان تھے جو اپنے رب پر (حقیقی) ایمان لائے تھے اور انہیں ہم نے ہدایت میں (اور بھی) بڑھایا تھا۔"}, {"arabic": " وَّ رَبَطۡنَا عَلٰی قُلُوۡبِہِمۡ اِذۡ قَامُوۡا فَقَالُوۡا رَبُّنَا رَبُّ السَّمٰوٰتِ وَ الۡاَرۡضِ لَنۡ نَّدۡعُوَا۠ مِنۡ دُوۡنِہٖۤ اِلٰـہًا لَّقَدۡ قُلۡنَاۤ اِذًا شَطَطًا ﴿۱۵﴾", "english": " And We strengthened their hearts, when they stood up and said, ‘Our Lord is the Lord of the heavens and the earth. Never shall we call upon any god beside Him; if we did , we should indeed have uttered an enormity.", "french": " Et Nous avons fortifié leur cœur lorsqu’ils se mirent debout pour dire : « Notre Seigneur est le Seigneur des cieux et de la terre. Jamais n’invoquerons-nous quelque autre dieu en dehors de Lui ; car si nous le faisions , nous prononcerions ainsi une énormité.", "german": " Und Wir stärkten ihre Herzen, als sie aufstanden und sprachen: \"Unser Herr ist der Herr der Himmel und der Erde. Nie werden wir einen Gott anrufen außer Ihm: sonst würden wir ja eine Ungeheuerlichkeit aussprechen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=18:15&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=18:15&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic16\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic16\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/18:16' style='text-decoration:underline'>18:16</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(16)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control16\"></i></button> <audio id=\"player16\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ہٰۤؤُلَآءِ قَوۡمُنَا اتَّخَذُوۡا مِنۡ دُوۡنِہٖۤ اٰلِہَۃً ؕ لَوۡ لَا یَاۡتُوۡنَ عَلَیۡہِمۡ بِسُلۡطٰنٍۭ بَیِّنٍ ؕ فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا ﴿ؕ۱۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘These, our people, have taken<I> for worship other </I>gods beside Him. Wherefore do they not bring a clear authority for them? And who is more unjust than he who invents a lie concerning Allah?</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_18_16_b' href='#'>b</a>]</sup>‘These, our people, have taken <i>for worship </i>other gods beside Him.<sup class='ref'>[<a class='ref' data-id='ref_18_16_1672' href='#'>1672</a>]</sup> Wherefore do they not bring a clear authority regarding them? And <sup class='ref'>[<a class='ref' data-id='ref_18_16_a' href='#'>a</a>]</sup>who is more unjust than he who invents a lie concerning Allah? <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_18_16_b'>b</span><span class='collapsible plus' data-id='ref_18_16_1672'>1672</span><span class='collapsible plus' data-id='ref_18_16_a'>a</span></div> <div><div class='reference' data-id='ref_18_16_b' style='display:none'> <p><b>b.</b> <a href='/quran/21:25' target=_blank>21:25</a>; <a href='/quran/25:4' target=_blank>25:4</a>. (<a href='javascript:void(0)' data-id='ref_18_16_b' class='ref'>close</a>)</p> </div> </div><div><a name='1672'></a><div class='reference' data-id='ref_18_16_1672' style='display:none'> <p><b>1672.</b> The people to whom the Dwellers of the Cave belonged were idol-worshippers. Such were the Romans. (<a href='javascript:void(0)' data-id='ref_18_16_1672' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_18_16_a' style='display:none'> <p><b>a.</b> <a href='/quran/6:145' target=_blank>6:145</a>; <a href='/quran/7:38' target=_blank>7:38</a>; <a href='/quran/10:18' target=_blank>10:18</a>; <a href='/quran/11:19' target=_blank>11:19</a>. (<a href='javascript:void(0)' data-id='ref_18_16_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہ ہیں ہماری قوم، جنہوں نے اس کے سوا معبود بنا رکھے ہیں۔ وہ کیوں ان کے حق میں کوئی غالب روشن دلیل نہیں لاتے؟ پس اس سے زیادہ ظالم کون ہو سکتا ہے جو اللہ پر جھوٹ گھڑے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ان لوگوں یعنی ہماری قوم نے اس (معبود برحق) کو چھوڑ کر (اپنے لئے) اور معبود بنا لیے ہیں۔ وہ ان کے ثبوت میں کیوں کوئی روشن دلیل نہیں لاتے۔ پھر (وہ کیوں نہیں سمجھتے) کہ جو شخص اللہ پر جھوٹ باندھے اس سے بڑھ کر ظالم (اور) کون (ہوسکتا) ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Nos gens que voici ont pris<em> en adoration</em> des dieux en dehors de Lui. Pourquoi n’apportent-ils pas une autorité manifeste en ce qui les concerne ? Et qui commet une plus grande injustice que celui qui invente un mensonge à propos d’Allāh ?</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Éstos, nuestras gentes, han tomado <em>para adorar a otros</em> dioses en lugar de Él. ¿Por qué no presentan entonces una prueba evidente de ellos? Pues ¿quién es más injusto que quien inventa una mentira sobre Al-lah?</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dieses unser Volk hat Götter statt Ihn angenommen. Warum bringen sie dann nicht einen klaren Beweis dafür? Und wer verübt größeren Frevel, als wer eine Lüge gegen Allah erdichtet?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=18:16&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=18:16&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic17\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic17\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/18:17' style='text-decoration:underline'>18:17</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(17)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control17\"></i></button> <audio id=\"player17\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِذِ اعۡتَزَلۡتُمُوۡہُمۡ وَمَا یَعۡبُدُوۡنَ اِلَّا اللّٰہَ فَاۡ وٗۤا اِلَی الۡکَہۡفِ یَنۡشُرۡ لَکُمۡ رَبُّکُمۡ مِّنۡ رَّحۡمَتِہٖ وَیُہَیِّیٴۡ لَکُمۡ مِّنۡ اَمۡرِکُمۡ مِّرۡفَقًا ﴿۱۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And <em>now </em>when you have withdrawn from them and from that which they worship beside Allah, then seek refuge in the Cave; your Lord will unfold for you His mercy and will provide for you comfort in<I> this </I>affair of yours.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And <i>now </i>when you havewithdrawn from them and from that which they worship beside Allah, then seek refuge in the Cave;<sup class='ref'>[<a class='ref' data-id='ref_18_17_1673' href='#'>1673</a>]</sup> your Lord will unfold to you His mercy and will provide for you some easy and comfortable course in <i>this </i>affair of yours.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_18_17_1673'>1673</span></div> <div><a name='1673'></a><div class='reference' data-id='ref_18_17_1673' style='display:none'> <p><b>1673.</b> The verse brings to light the fact that those monotheistic young men were no scattered individuals but formed part of an organized and disciplined religious community whose members met frequently in private. The verse shows that when these young men talked of taking shelter in the Cave they had some specific Cave in mind. This Cave seems to have already been used as a place of refuge by Roman slaves when they fled from their cruel masters. The words, <i>And now when you have withdrawn from them</i>, signify that they had already been the victims of a severe social boycott and had lived apart from their people in a separate group of their own. (<a href='javascript:void(0)' data-id='ref_18_17_1673' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس جبکہ تم نے اُنہیں اور ان کو جن کی وہ اللہ کے سوا عبادت کرتے ہیں ترک کردیا ہے تو غار کی طرف پناہ لینے کے لئے چلے جاؤ۔ تمہارا ربّ تمہارے لئے اپنی رحمت پھیلائے گا اور تمہارا کام تمہارے لئے آسان کر دے گا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور (اس وقت) جب (کہ) تم نے ان سے اور (نیز) اللہ کے سوا جس چیز کی (بھی) وہ پرستش کرتے ہیں (اس سے) کنارہ کشی کرلی ہے تو (اب) تم اس وسیع پہاڑی پناہ گاہ میں بیٹھے رہو (ایسا کرو گے تو) تمہارا رب اپنی رحمت (کی کوئی راہ) تمہارے لئے کھول دے گا اور تمہارے لئے تمہارے اس معاملہ میں کوئی سہولت کا سامان مہیا کر دے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et <em>maintenant</em> que vous vous êtes retirés de leur compagnie et de ce qu’ils adorent en dehors d’Allāh, alors cherchez refuge dans la Caverne ; votre Seigneur répandra pour vous Sa miséricorde et vous rendra votre affaire facile. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y <em>ahora,</em> cuando os habéis retirado de ellos y de aquello a lo que adoran en lugar de Al-lah, buscad refugio en la Caverna; vuestro Señor extenderá sobre vosotros Su misericordia y os proporcionará consuelo en <em>este</em> asunto vuestro”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und wenn ihr euch nun von ihnen und dem, was sie statt Allah anbeten, zurückzieht, so suchet Zuflucht in der Höhle; euer Herr wird Seine Barmherzigkeit über euch breiten und euch einen tröstlichen Ausweg aus eurer Lage weisen.\"", "spanish": " Y fortalecimos sus corazones cuando se levantaron y dijeron: “Nuestro Señor es el Señor de los cielos y la tierra. Nunca invocaremos a dios alguno en lugar de Él; si lo hiciéramos , habríamos proferido en verdad una atrocidad”;", "urdu": " اور جب وہ (اپنے وطن سے نکلنے کے لئے) اٹھے تو ہم نے ان کے دلوں کو مضبوط کر دیا۔ تب انہوں نے (ایک دوسرے سے) کہا (کہ) ہمارا رب (وہ ہے جو) آسمانوں اور زمین کا (بھی) رب ہے ہم اس کے سوا کسی اور معبود کو ہرگز (کبھی) نہیں پکاریں گے ورنہ ہم ایک حق سے دور بات کہنے والے ہوں گے۔"}, {"arabic": " وَ تَرَی الشَّمۡسَ اِذَا طَلَعَتۡ تَّزٰوَرُ عَنۡ کَہۡفِہِمۡ ذَاتَ الۡیَمِیۡنِ وَ اِذَا غَرَبَتۡ تَّقۡرِضُہُمۡ ذَاتَ الشِّمَالِ وَ ہُمۡ فِیۡ فَجۡوَۃٍ مِّنۡہُ ؕ ذٰلِکَ مِنۡ اٰیٰتِ اللّٰہِ ؕ مَنۡ یَّہۡدِ اللّٰہُ فَہُوَ الۡمُہۡتَدِ ۚ وَ مَنۡ یُّضۡلِلۡ فَلَنۡ تَجِدَ لَہٗ وَلِیًّا مُّرۡشِدًا ﴿٪۱۸﴾", "english": " And thou couldst see the sun, as it rose, move away from their Cave on the right, and when it set, turn away from them on the left; and they were in the spacious hollow thereof. This is among the Signs of Allah. He whom Allah guides is rightly guided; but he whom He adjudges astray, for him thou wilt find no helper or guide.", "french": " Et tu aurais pu voir le soleil, à son lever s’éloigner de leur Caverne sur la droite, et à son coucher se déplacer en travers devant eux vers la gauche, et ils se trouvaient dans le creux spacieux de la Caverne . Ceci est parmi les Signes d’Allāh. Celui qu’Allāh guide est bien guidé ; mais celui qu’Il juge égaré, pour celui-là tu ne trouveras aucun ami pour le guider.", "german": " Und du hättest sehen können, wie die Sonne, da sie aufging, sich von ihrer Höhle rechtshin wegneigte, und da sie unterging, sich von ihnen linkshin abwandte; und sie waren in einem Hohlraum inmitten. Das gehört zu den Zeichen Allahs. Wen Allah leitet, der ist rechtgeleitet; doch wen Er irregehen lässt, für den wirst du auf keine Weise einen Helfer (und) Führer finden.", "spanish": " Pudisteis ver el sol, cuando subió, retirarse de su Caverna a la derecha, y cuando se puso, pasar sobre ellos a su izquierda; y ellos se encontraban en el amplio espacio intermedio. Éste es uno de los Signos de Al-lah. A quien Al-lah guía, está encaminado correctamente; pero a quien Él declara extraviado, no encontrarás quien le socorra ni le guíe.", "urdu": " اور (اے مخاطب) تو سورج کو دیکھتا ہے کہ جب وہ چڑھتا ہے تو ان کی وسیع جائے پناہ سے دائیں طرف کو ہٹ کر گزرتا ہے اور جب وہ ڈوبتا ہے تو ان سے بائیں طرف کو ہٹ کر گذرتا ہے اور وہ اس غار کے اندر ایک فراخ جگہ میں (رہتے) تھے یہ بات اللہ (کی نصرت) کے نشانوں میں سے (ایک نشان) ہے جسے اللہ (ہدایت کا) راستہ دکھائے وہی ہدایت پر ہوتا ہے اور جسے وہ گمراہ کرے اس کا تو (کبھی) کوئی دوست (اور) راہنما نہیں پائے گا۔"}, {"arabic": " وَ تَحۡسَبُہُمۡ اَیۡقَاظًا وَّ ہُمۡ رُقُوۡدٌ ٭ۖ وَّ نُقَلِّبُہُمۡ ذَاتَ الۡیَمِیۡنِ وَ ذَاتَ الشِّمَالِ ٭ۖ وَ کَلۡبُہُمۡ بَاسِطٌ ذِرَاعَیۡہِ بِالۡوَصِیۡدِ ؕ لَوِ اطَّلَعۡتَ عَلَیۡہِمۡ لَوَلَّیۡتَ مِنۡہُمۡ فِرَارًا وَّ لَمُلِئۡتَ مِنۡہُمۡ رُعۡبًا ﴿۱۹﴾", "english": " Thou mightest deem them awake, whilst they are asleep; and We shall cause them to turn over to the right and to the left, their dog stretching out his forelegs on the threshold. If thou hadst had a look at them, thou wouldst surely have turned away from them in fright, and wouldst surely have been filled with awe of them.", "french": " Tu pourrais les croire éveillés, alors qu’ils dorment ; et Nous les ferons se retourner à droite et à gauche, leur chien allongeant ses pattes de devant sur le seuil. Si tu avais jeté un regard sur eux, tu te serais assurément détourné d’eux en fuyant, et tu aurais été rempli d’émerveillement et de frayeur à cause d’eux.", "german": " Du könntest sie für wach halten, indes sie schlafen; und Wir werden sie auf die rechte Seite und auf die linke sich umdrehen lassen, während ihr Hund seine Vorderpfoten auf der Schwelle ausstreckt. Hättest du sie so erblickt, du würdest dich gewiss vor ihnen zur Flucht gewandt haben und wärest mit Grausen vor ihnen erfüllt gewesen.", "spanish": " Podrías considerarlos despiertos, cuando están dormidos; pero Nosotros haremos que se muevan a la derecha y a la izquierda; con su perro estirando sus patas delanteras en el umbral. Si los hubieras contemplado, ciertamente te habrías alejado de ellos atemorizado, y en verdad te hubieras sentido aterrado ante ellos.", "urdu": " اور (اے مخاطب) تو انہیں بیدار سمجھتا ہے حالانکہ وہ سوتے ہیں اور ہم انہیں دائیں طرف (بھی) پھرائیں گے اور بائیں طرف (بھی) اور ان کا کتا (بھی ان کے ساتھ ساتھ) صحن میں ہاتھ پھیلائے (موجود) رہے گا۔ اگر تو ان کے حالات سے آگاہ ہو جائے تو تو ان سے بھاگنے کے لئے پیٹھ پھیر لے اور ان کی وجہ سے رعب سے بھر جائے۔"}, {"arabic": " وَ کَذٰلِکَ بَعَثۡنٰہُمۡ لِیَتَسَآءَلُوۡا بَیۡنَہُمۡ ؕ قَالَ قَآئِلٌ مِّنۡہُمۡ کَمۡ لَبِثۡتُمۡ ؕ قَالُوۡا لَبِثۡنَا یَوۡمًا اَوۡ بَعۡضَ یَوۡمٍ ؕ قَالُوۡا رَبُّکُمۡ اَعۡلَمُ بِمَا لَبِثۡتُمۡ ؕ فَابۡعَثُوۡۤا اَحَدَکُمۡ بِوَرِقِکُمۡ ہٰذِہٖۤ اِلَی الۡمَدِیۡنَۃِ فَلۡیَنۡظُرۡ اَیُّہَاۤ اَزۡکٰی طَعَامًا فَلۡیَاۡتِکُمۡ بِرِزۡقٍ مِّنۡہُ وَ لۡـیَؔ‍‍‍تَلَطَّفۡ وَ لَا یُشۡعِرَنَّ بِکُمۡ اَحَدًا ﴿۲۰﴾", "english": " And so We raised them up that they might question one another. One of them said, ‘How long have you tarried?’ They said, ‘We have tarried a day or part of a day.’ Others said, ‘Your Lord knows best the time you have tarried. Now send one of you with these silver coins of yours to the city; and let him see which of its inhabitants has the purest food, and let him bring you provisions thereof. And let him be courteous and let him not inform anyone about you.’", "french": " Et ainsi Nous les fîmes sortir de leur état afin qu’ils s’interrogent les uns les autres. L’un d’eux dit : « Combien de temps êtes-vous restés dans cet état ? » Ils répondirent : « Nous sommes restés dans cet état pendant une journée ou une partie d’une journée. » D’autres dirent : « Votre Seigneur sait le mieux le temps que vous êtes restés ainsi . Maintenant envoyez l’un d’entre vous à la ville avec vos pièces d’argent que voici ; et qu’il voie quel aliment est le plus pur, et qu’il vous en apporte des provisions. Et qu’il se montre courtois, mais qu’il ne renseigne personne sur vous.", "german": "", "spanish": " Y así los despertamos para que pudieran interrogarse unos a otros. Uno de ellos dijo: “¿Cuánto tiempo habéis permanecido?”. Contestaron: “Estuvimos un día o parte de un día”. Otros dijeron. “Vuestro Señor sabe muy bien el tiempo que habéis permanecido. Enviad ahora a uno de vosotros a la ciudad con estas vuestras monedas de plata; y que vea cuál de sus moradores tiene la comida más pura, y que os traiga provisiones de ella. Y que sea amable y que no informe a nadie sobre vosotros”.", "urdu": " اور اسی طرح ہم نے انہیں (بیکسی کی حالت سے) اٹھایا۔ اس پر وہ آپس میں (حیرت سے) ایک دوسرے سے سوال کرنے لگے (اور) ان میں سے ایک کہنے لگا (کہ) تم یہاں کتنی دیر ٹھہرے رہے ہو (جو اس کے مخاطب تھے) انہوں نے کہا (کہ) ہم ایک دن یا دن کا کچھ حصہ ٹھہرے ہیں (تب) انہوں نے (یعنی دوسروں نے) کہا (کہ) جو (عرصہ) تم (یہاں) ٹھہرے رہے ہو اسے تمہارا رب (ہی) بہتر جانتا ہے۔ پس (اس بحث کو چھوڑو اور) اپنے یہ پرانے سکے دے کر اپنے میں سے کسی ایک کو اس شہر کی طرف بھیجو وہ (جاکر) دیکھے کہ اس (شہر) میں سے کس کا غلہ سب سے اچھا ہے پھر (جس کا غلہ سب سے اچھا ہو) اس سے کچھ کھانے کا سامان لے آئے اور وہ ہوشیاری سے (لوگوں کی) راز کی باتیں معلوم کرنے کی کوشش کرے اور تمہارے متعلق کسی کو ہرگز (کوئی) علم نہ ہونے دے۔"}], "Surah": 18}