{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ السَّمَآءِ ذَاتِ الۡبُرُوۡجِ ۙ﴿۲﴾", "english": " By the heaven having mansions of stars ,", "french": " Par le ciel ayant des constellations d’étoiles ,", "german": " Beim Himmel mit den Burgen,", "spanish": " Por el cielo, que contiene constelaciones,", "urdu": " میں برجوں والے آسمان کو شہادت کے طور پر پیش کرتا ہوں۔"}, {"arabic": " وَ الۡیَوۡمِ الۡمَوۡعُوۡدِ ۙ﴿۳﴾", "english": " And by the Promised Day,", "french": " Et par le Jour Promis,", "german": " und beim verheißenen Tag,", "spanish": " Y por el Día Prometido,", "urdu": " اور اس دن کو بھی جس کا وعدہ ہے۔"}, {"arabic": " وَ شَاہِدٍ وَّ مَشۡہُوۡدٍ ؕ﴿۴﴾", "english": " And by the Witness and that about whom witness has been borne,", "french": " Et par le témoin et celui pour qui le témoignage a été porté,", "german": " und beim Zeugen und beim Bezeugten,", "spanish": " Y por el que da testimonio y por aquél de quien se presta testi­monio.", "urdu": " اور (موعود) گواہ کو اور اس شخص کو جس کی پیشگوئی پہلی کتب میں موجود ہے۔"}, {"arabic": " قُتِلَ اَصۡحٰبُ الۡاُخۡدُوۡدِ ۙ﴿۵﴾", "english": " Cursed be the Fellows of the Trench —", "french": " Maudits soient les Gens des Fossés !", "german": " vernichtet sind die Leute des Grabens –", "spanish": " Maldito sea el pueblo de las trincheras.", "urdu": " خندقوں والے ہلاک ہو گئے۔"}, {"arabic": " النَّارِ ذَاتِ الۡوَقُوۡدِ ۙ﴿۶﴾", "english": " The fire fed with fuel —", "french": " Allumeurs du feu plein de combustible !", "german": " des Feuers voll von Brennstoff –,", "spanish": " –El fuego alimentado con combustible‑", "urdu": " یعنی (خندقوں میں) آگ (بھڑکانے والے) جس میں (خوب) ایندھن (جھونکا گیا) تھا۔"}, {"arabic": " اِذۡ ہُمۡ عَلَیۡہَا قُعُوۡدٌ ۙ﴿۷﴾", "english": " As they sat by it,", "french": " Lorsqu’ils étaient assis tout autour,", "german": " wie sie daran saßen", "spanish": " Cuando se sentaron junto a él,", "urdu": " جب وہ اس آگ پر (دھرنا مار کر) بیٹھے ہوئے تھے۔"}, {"arabic": " وَّ ہُمۡ عَلٰی مَا یَفۡعَلُوۡنَ بِالۡمُؤۡمِنِیۡنَ شُہُوۡدٌ ؕ﴿۸﴾", "english": " And they witnessed what they did to the believers.", "french": " Et ils ont été témoins de ce qu’ils firent aux croyants.", "german": " und bezeugten, was sie den Gläubigen antaten.", "spanish": " Y fueron testigos de lo que hicieron a los creyentes.", "urdu": " اور وہ مومنوں سے جو کچھ (معاملہ) کر رہے تھے‘ ان کا دل اس کی حقیقت کو سمجھتا تھا۔"}, {"arabic": " وَ مَا نَقَمُوۡا مِنۡہُمۡ اِلَّاۤ اَنۡ یُّؤۡمِنُوۡا بِاللّٰہِ الۡعَزِیۡزِ الۡحَمِیۡدِ ۙ﴿۹﴾", "english": " And they hated them not but because they believed in Allah, the Almighty, the Praiseworthy,", "french": " Et ils ne les haïssaient que parce qu’ils croyaient en Allāh, le Puissant, le Très-Louable,", "german": " Und sie hassten sie aus keinem anderen Grund, als weil sie an Allah glaubten, den Allmächtigen, den Preiswürdigen,", "spanish": " Y sólo se vengaron de ellos porque creían en Al-lah, el Todo­poderoso, el Merecedor de Alabanza,", "urdu": " اور وہ ان سے صرف اس لئے دشمنی کرتے تھے کہ وہ غالب (اور) سب تعریفوں کے مالک اللہ پر ایمان کیوں لائے۔"}, {"arabic": " الَّذِیۡ لَہٗ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ شَہِیۡدٌ ؕ﴿۱۰﴾", "english": " To Whom belongs the kingdom of the heavens and the earth; and Allah is Witness over all things.", "french": " A Qui appartient le royaume des cieux et de la terre ; et Allāh est Témoin de toutes choses.", "german": " des das Königreich der Himmel und der Erde ist; und Allah ist Zeuge aller Dinge.", "spanish": " A Quien pertenece el reino de los cielos y la tierra; pues Al‑lah es Testigo de todas las cosas.", "urdu": " وہ اللہ جس کے قبضہ میں آسمانوں اور زمین کی بادشاہت ہے اور (یہ نہیں سوچتے کہ) اللہ ہر چیز (کے حالات) سے واقف ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ فَتَنُوا الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ ثُمَّ لَمۡ یَتُوۡبُوۡا فَلَہُمۡ عَذَابُ جَہَنَّمَ وَ لَہُمۡ عَذَابُ الۡحَرِیۡقِ ﴿ؕ۱۱﴾", "english": " Those who persecute the believing men and the believing women and then repent not, for them is surely the punishment of Hell, and for them is the punishment of burning.", "french": " En vérité, ceux qui persécutent les croyants et les croyantes, et ensuite ne s’ en repentent pas, il y a sûrement pour eux le châtiment de l’Enfer, et pour eux est le châtiment du feu.", "german": " Jene nun, welche die gläubigen Männer und die gläubigen Frauen verfolgen und dann nicht bereuen – für sie ist die Strafe der Hölle, und für sie ist die Strafe des Brennens.", "spanish": " Quienes persiguen a los hom­bres y mujeres creyentes y luego no se arrepienten, para ellos acaecerá, en verdad, el castigo del fuego.", "urdu": " وہ لوگ جنہوں نے مومن مردوں اور مومن عورتوں کو عذاب میں مبتلا کیا پھر (اپنے فعل سے) توبہ بھی نہ کی‘ انہیں یقیناً جہنم کا عذاب ملے گا۔ اور (اس دنیا میں بھی) انہیں (دل کو) جلا دینے والا عذاب ملے گا۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَہُمۡ جَنّٰتٌ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ۬ؕؑ ذٰلِکَ الۡفَوۡزُ الۡکَبِیۡرُ ﴿ؕ۱۲﴾", "english": " But those who believe and do good works, for them are Gardens through which streams flow. That is the great triumph.", "french": " En vérité, pour ceux qui croient et font de bonnes œuvres, il y a des Jardins sous lesquels coulent des ruisseaux. C’est là le grand triomphe.", "german": " Doch jene, die glauben und gute Werke tun – für sie sind Gärten, durch die Ströme fließen. Das ist die höchste Glückseligkeit.", "spanish": " Mas para quienes crean y hagan buenas obras, para ellos hay Jar­dines por los que corren ríos. Ese es el gran triunfo.", "urdu": " (اور) جو لوگ ایمان لائے اور ساتھ ہی اس (ایمان) کے مناسب حال عمل بھی انہوں نے کیے انہیں باغات ملیں گے جن کے نیچے نہریں بہتی ہوں گی (اور) یہی بڑی کامیابی ہے۔"}, {"arabic": " اِنَّ بَطۡشَ رَبِّکَ لَشَدِیۡدٌ ﴿ؕ۱۳﴾", "english": " Surely the seizing of thy Lord is severe.", "french": " Assurément, l’empoignement de ton Seigneur est terrible.", "german": " In Wahrheit, deines Herrn Erfassung ist furchtbar.", "spanish": " En verdad, el rigor de tu Señor es severo.", "urdu": " یقیناً تیرے رب کی گرفت سخت ہوا کرتی ہے۔"}, {"arabic": " اِنَّہٗ ہُوَ یُبۡدِئُ وَ یُعِیۡدُ ﴿ۚ۱۴﴾", "english": " He it is Who originates and reproduces;", "french": " En vérité, c’est Lui Qui commence et Qui reproduit ;", "german": " Er ist es, Der erschafft und wiederkehren lässt;", "spanish": " El es Quien origina y re pite ,", "urdu": " (کیونکہ وہی دنیا کے عذاب کو شروع کرتا ہے اور (اگر کوئی قوم باز نہ آئے تو) باربار عذاب لاتا ہے۔"}, {"arabic": " وَ ہُوَ الۡغَفُوۡرُ الۡوَدُوۡدُ ﴿ۙ۱۵﴾", "english": " And He is the Most Forgiving, the Loving;", "french": " Et Il est le Très-Pardonnant, le Très-Affectueux ;", "german": " und Er ist der Allverzeihende, der Liebreiche;", "spanish": " Pues El es el Sumo Indul­gente, el Amante;", "urdu": " اور (اس کے ساتھ ہی) وہ بے انتہا بخشنے والا (اور) بے انتہا محبت کرنے والا بھی ہے۔"}, {"arabic": " ذُو الۡعَرۡشِ الۡمَجِیۡدُ ﴿ۙ۱۶﴾", "english": " The Lord of the Throne, the Lord of honour;", "french": " Le Seigneur du Trône, le Seigneur de l’Honneur ;", "german": " der Herr des Throns, der Hocherhabene;", "spanish": " El Señor del Trono, el Señor del Honor;", "urdu": " (وہ) عرش کا مالک (اور) بزرگ شان والا ہے۔"}, {"arabic": " فَعَّالٌ لِّمَا یُرِیۡدُ ﴿ؕ۱۷﴾", "english": " Doer of whatever He wills.", "french": " Il réalise pleinement ce qu’Il veut.", "german": " Bewirker alles dessen, was Er will.", "spanish": " El que ejecuta plenamente Su Vo­luntad.", "urdu": " جس بات کا ارادہ کرے اسے کرکے رہنے والا ہے۔"}, {"arabic": " ہَلۡ اَتٰٮکَ حَدِیۡثُ الۡجُنُوۡدِ ﴿ۙ۱۸﴾", "english": " Has not the story of the hosts come to thee?", "french": " N ’as-tu pas entendu parler de l’histoire des armées ?", "german": " Ist nicht die Geschichte von den Heerscharen zu dir gedrungen,", "spanish": " ¿No te llegó acaso la historia de los ejércitos?", "urdu": " کیا تمہیں (دشمنان صداقت کے) لشکروں کی خبر نہیں ملی۔"}, {"arabic": " فِرۡعَوۡنَ وَ ثَمُوۡدَ ﴿ؕ۱۹﴾", "english": " Of Pharaoh and Thamud?", "french": " Des armées de Pharaon et de Thamūd ?", "german": " von Pharao und den Thamûd?", "spanish": " ¿De Faraón y de Zamud?", "urdu": " یعنی فرعون اور ثمود کے لشکروں کی۔"}, {"arabic": " بَلِ الَّذِیۡنَ کَفَرُوۡا فِیۡ تَکۡذِیۡبٍ ﴿ۙ۲۰﴾", "english": " Nay, but those who disbelieve persist in rejecting the truth .", "french": " Non , mais ceux qui ne croient pas persistent à rejeter la vérité .", "german": " Nein, aber die Ungläubigen verharren im Leugnen.", "spanish": " ¡No!, mas quienes no creen per­sisten en rechazar la verdad .", "urdu": " حقیقت تو یہ ہے کہ کافر (شدید) انکار (کی مرض) میں (مبتلا) ہیں۔"}, {"arabic": " وَّ اللّٰہُ مِنۡ وَّرَآئِہِمۡ مُّحِیۡطٌ ﴿ۚ۲۱﴾", "english": " And Allah encompasses them from before them and from behind them.", "french": " Et Allāh les cerne sans qu’ils ne s’en aperçoivent.", "german": " Und Allah umfasst sie von allen Seiten.", "spanish": " Pero Al-lah los rodea de una manera que no lo perciben.", "urdu": " حالانکہ اللہ (انہیں) ان کے پیچھے سے (آکر) گھیرنے والا ہے۔"}, {"arabic": " بَلۡ ہُوَ قُرۡاٰنٌ مَّجِیۡدٌ ﴿ۙ۲۲﴾", "english": " Nay, but it is a glorious Qur’an,", "french": " Non , mais c’est un Coran glorieux,", "german": " Nein, es ist der hocherhabene Qur-ân,", "spanish": " ¡No!, mas se trata de un glo­rioso Corán,", "urdu": " (اس کے علاوہ) یہ بھی ایک حقیقت ہے کہ وہ (کلام جو ان امور کی خبر دے رہا ہے) ایک بزرگ کلام ہے اور ہر جگہ اور ہر زمانہ میں پڑھا جانے والا کلام ہے۔"}, {"arabic": " فِیۡ لَوۡحٍ مَّحۡفُوۡظٍ ﴿٪۲۳﴾", "english": " In a well guarded tablet.", "french": " Sur une tablette bien protégée.", "german": " auf einer wohlverwahrten Tafel.", "spanish": " En una tabla bien guar­ dada.", "urdu": " (اور مزید کمال یہ ہے کہ) وہ لوح محفوظ میں ہے۔"}], "Surah": 85}