{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سَبَّحَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ۚ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۲﴾", "english": " All that is in the heavens and all that is in the earth glorifies Allah; and He is the Mighty, the Wise.", "french": " Tout ce qui est dans les cieux et tout ce qui est sur la terre glorifient Allāh ; et Il est le Puissant, le Sage.", "german": " Alles, was in den Himmeln, und alles, was auf Erden ist, preist Allah; und Er ist der Allmächtige, der Allweise.", "spanish": " Todo lo que hay en los cielos y todo lo que hay en la tierra glorifica a Al-lah; pues Él es el Poderoso, el Sabio.", "urdu": " آسمانوں اور زمین میں جو کچھ ہے اللہ کی تسبیح کر رہا ہے اور وہ (اللہ) غالب (اور) حکمت والا ہے۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَخۡرَجَ الَّذِیۡنَ کَفَرُوۡا مِنۡ اَہۡلِ الۡکِتٰبِ مِنۡ دِیَارِہِمۡ لِاَوَّلِ الۡحَشۡرِ ؕؔ مَا ظَنَنۡتُمۡ اَنۡ یَّخۡرُجُوۡا وَ ظَنُّوۡۤا اَنَّہُمۡ مَّانِعَتُہُمۡ حُصُوۡنُہُمۡ مِّنَ اللّٰہِ فَاَتٰٮہُمُ اللّٰہُ مِنۡ حَیۡثُ لَمۡ یَحۡتَسِبُوۡا ٭ وَ قَذَفَ فِیۡ قُلُوۡبِہِمُ الرُّعۡبَ یُخۡرِبُوۡنَ بُیُوۡتَہُمۡ بِاَیۡدِیۡہِمۡ وَ اَیۡدِی الۡمُؤۡمِنِیۡنَ ٭ فَاعۡتَبِرُوۡا یٰۤاُولِی الۡاَبۡصَارِ ﴿۳﴾", "english": " He it is Who turned out the disbelievers among the People of the Book from their homes at the time of the first banishment. You did not think that they would go forth, and they thought that their fortresses would defend them against Allah. But Allah came upon them whence they did not expect, and cast terror into their hearts, so that they destroyed their houses with their own hands and the hands of the believers. So take a lesson, O ye who have eyes!", "french": " C’est Lui Qui, lors du premier bannissement, fit partir de leurs habitations ceux d’entre les Gens du Livre qui étaient mécréants. Vous ne croyiez pas qu’ils partiraient et ils croyaient que leurs forteresses les défendraient contre Allāh. Mais Allāh les frappa d’où ils ne s’y attendaient pas, et jeta de la terreur dans leurs cœurs, de sorte qu’ils détruisirent leurs maisons de leurs propres mains et des mains des croyants. Tirez en donc une leçon ; ô vous qui avez des yeux !", "german": " Er ist es, Der diejenigen von dem Volk der Schrift, die ungläubig waren, austrieb aus ihren Heimstätten bei dem ersten Heerbann. Ihr glaubtet nicht, dass sie hinausziehen würden, und sie dachten, dass ihre Burgen sie beschützen würden gegen Allah. Doch Allah kam über sie, von wo sie es nicht erwarteten, und warf Schrecken in ihre Herzen, so dass sie ihre Häuser zerstörten mit ihren eigenen Händen und den Händen der Gläubigen. So zieht eine Lehre daraus, o die ihr Augen habt.", "spanish": " Él es Quien expulsó a los incrédulos de entre el Pueblo del Libro, de sus casas, en el momento del primer exilio. No creísteis que partirían, y ellos pensaron que sus fortalezas les defenderían contra Al-lah. Mas Al-lah cayó sobre ellos cuando menos lo esperaban, e infundió el terror en sus corazones, por lo que destruyeron sus casas con sus propias manos y las manos de los creyentes. ¡Aprended la lección, vosotros, los que tenéis ojos!", "urdu": " وہ (خدا) ہی ہے جس نے اہل کتاب کافروں کو پہلی جنگ کے موقعہ پر ان کے گھروں سے نکالا اور تم خیال نہیں کرتے تھے کہ وہ نکلیں گے اور وہ خیال کرتے تھے کہ ان کے قلعے اللہ کے مقابلہ میں ان کو بچالیں گے اور اللہ ان کے پاس ادھر سے آیا جدھر سے ان کو گمان تک نہ تھا۔ اور ان کے دلوں میں اس نے رعب ڈالا دیا۔ وہ اپنے گھروں کو (کچھ تو) اپنے ہاتھوں اور (کچھ) مومنوں کے ہاتھوں سے خراب کر رہے تھے۔ پس اے سمجھ بوجھ رکھنے والے لوگو! عبرت حاصل کرو۔"}, {"arabic": " وَ لَوۡ لَاۤ اَنۡ کَتَبَ اللّٰہُ عَلَیۡہِمُ الۡجَلَآءَ لَعَذَّبَہُمۡ فِی الدُّنۡیَا ؕ وَ لَہُمۡ فِی الۡاٰخِرَۃِ عَذَابُ النَّارِ ﴿۴﴾", "english": " And had it not been that Allah had decreed exile for them, He would have surely punished them otherwise in this world. And in the Hereafter they will certainly have the punishment of the Fire.", "french": " Et n’eût été le fait qu’Allāh avait décrété le bannissement pour eux, Il les aurait assurément punis d’une autre façon dans ce monde. Et dans l’au-delà, ils auront le châtiment du Feu.", "german": " Und wäre es nicht so gewesen, dass Allah für sie Verbannung angeordnet hatte, Er hätte sie sicherlich hienieden bestraft, und im Jenseits wird ihnen die Strafe des Feuers.", "spanish": " Mas si Dios no hubiese decretado el exilio para ellos, les habría castigado ciertamente de otro modo en este mundo. Y en el Más Allá tendrán ciertamente el castigo del Fuego.", "urdu": " اور اگر اللہ نے ان پر جلا وطنی فرض نہ کر رکھی ہوتی تو ان کو اس دنیا میں بھی عذاب دیتا اور آخرت میں ان کے لئے دوزخ کا عذاب مقرر ہے۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمۡ شَآقُّوا اللّٰہَ وَ رَسُوۡلَہٗ ۚ وَ مَنۡ یُّشَآقِّ اللّٰہَ فَاِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ﴿۵﴾", "english": " That is because they opposed Allah and His Messenger; and whoso opposes Allah — then surely Allah is Severe in retribution.", "french": " C’est parce qu’ils se sont opposés à Allāh et à Son Messager ; et quiconque s’oppose à Allāh – alors sûrement Allāh est sévère en châtiment.", "german": " Dies, weil sie sich Allah widersetzten und Seinem Gesandten; und wer sich Allah widersetzt – wahrlich, dann ist Allah streng im Strafen.", "spanish": " Eso por haberse opuesto a Al-lah y a Su Mensajero; pues quien se opone a Al-lah sepa que Al-lah es Severo en la retribución.", "urdu": " یہ سب کچھ اس لئے ہوا کہ انہوں نے اللہ اور اس کے رسول سے اختلاف کیا اور جو اللہ سے اختلاف کرتا ہے وہ یاد رکھے کہ اللہ کا عذاب یقیناً سخت ہے۔"}, {"arabic": " مَا قَطَعۡتُمۡ مِّنۡ لِّیۡنَۃٍ اَوۡ تَرَکۡتُمُوۡہَا قَآئِمَۃً عَلٰۤی اُصُوۡلِہَا فَبِاِذۡنِ اللّٰہِ وَ لِیُخۡزِیَ الۡفٰسِقِیۡنَ ﴿۶﴾", "english": " Whatever palm-trees you cut down or left standing on their roots, it was by Allah’s leave, and that He might disgrace the transgressors.", "french": " Quelque dattier que vous ayez abattu ou laissé debout sur ses racines, c’était avec la permission d’Allāh, et pour qu’Il couvre les rebelles d’ignominie.", "german": " Was ihr umgehauen habt an Palmen oder auf ihren Wurzeln stehen ließet, es geschah mit Allahs Erlaubnis und damit Er die Übertreter in Schmach stürze.", "spanish": " Cuantas palmeras hayáis cortado o dejado en pie, todo ello sucedió con el permiso de Al-lah y para que Él humillara a los transgresores.", "urdu": " تم نے کوئی جڑ کھجور کے درخت کی نہیں کاٹی یا اس کو اپنی جڑوں پر کھڑا نہیں چھوڑا۔ مگر یہ اللہ کے حکم سے تھا اور اس لئے تھا کہ نافرمانوں کو رسوا کیا جائے۔"}, {"arabic": " وَ مَاۤ اَفَآءَ اللّٰہُ عَلٰی رَسُوۡلِہٖ مِنۡہُمۡ فَمَاۤ اَوۡجَفۡتُمۡ عَلَیۡہِ مِنۡ خَیۡلٍ وَّ لَا رِکَابٍ وَّ لٰکِنَّ اللّٰہَ یُسَلِّطُ رُسُلَہٗ عَلٰی مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۷﴾", "english": " And whatever Allah has given to His Messenger as spoils from them, you urged neither horse nor camel for that; but Allah grants power to His Messenger over whomsoever He pleases; and Allah has power over all things.", "french": " Et tout ce qu’Allāh a accordé d’eux comme butin à Son Messager, pour cela vous n’avez poussé ni chevaux ni chameaux, mais Allāh accorde à Son Messager le pouvoir sur qui Il veut ; et Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Und was Allah Seinem Gesandten als Beute von ihnen gegeben hat, ihr habt weder Ross noch Kamel dazu angespornt; aber Allah gibt Seinen Gesandten Gewalt über wen Er will: und Allah vermag alle Dinge zu tun.", "spanish": " Y en todo lo que Al-lah ha entregado a Su Mensajero como botín suyo, no tuvisteis que emplear en ello ni caballos ni camellos; mas Al-lah concede poder a Sus Mensajeros sobre quien le place; pues Al-lah tiene poder sobre todas las cosas.", "urdu": " اور جو کچھ اللہ نے ان (برگشتہ لوگوں) کا مال اپنے رسول کو دیا (تم کو معلوم ہی ہے کہ) تم نے اپنے گھوڑے اور اونٹ اس مال کے حصول کے لئے نہیں دوڑائے تھے۔ لیکن اللہ اپنے رسولوں کو جس کا چاہتا ہے مالک بنا دیتا ہے اور اللہ ہر چیز پر قادر ہے۔"}, {"arabic": " مَاۤ اَفَآءَ اللّٰہُ عَلٰی رَسُوۡلِہٖ مِنۡ اَہۡلِ الۡقُرٰی فَلِلّٰہِ وَ لِلرَّسُوۡلِ وَ لِذِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ ابۡنِ السَّبِیۡلِ ۙ کَیۡ لَا یَکُوۡنَ دُوۡلَۃًۢ بَیۡنَ الۡاَغۡنِیَآءِ مِنۡکُمۡ ؕ وَ مَاۤ اٰتٰٮکُمُ الرَّسُوۡلُ فَخُذُوۡہُ ٭ وَ مَا نَہٰٮکُمۡ عَنۡہُ فَانۡتَہُوۡا ۚ وَ اتَّقُوا اللّٰہَ ؕ اِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ۘ﴿۸﴾", "english": " Whatever Allah has given to His Messenger as spoils from the people of the towns is for Allah and for the Messenger and for the near of kin and the orphans and the needy and the wayfarer, that it may not circulate only among those of you who are rich. And whatsoever the Messenger gives you, take it; and whatsoever he forbids you, abstain from that . And fear Allah; surely, Allah is Severe in retribution.", "french": " Tout ce qu'Allāh a accordé à Son Messager comme butin des habitants des villes, est pour Allāh et pour le Messager, et pour les proches parents et les orphelins, et les nécessiteux et le voyageur, afin que cela ne circule pas uniquement parmi ceux qui sont riches d’entre vous. Et quoi que ce soit que le Messager vous accorde, prenez-le ; et quoi que ce soit qu’il vous interdise, abstenez-vous en . Et craignez Allāh ; assurément Allāh est sévère en châtiment.", "german": " Was Allah Seinem Gesandten als Beute von den Bewohnern der Städte gegeben hat, das ist für Allah und für den Gesandten und für die nahen Verwandten und die Waisen und die Armen und den Wanderer, damit es nicht bloß bei den Reichen unter euch die Runde mache. Und was euch der Gesandte gibt, nehmt es; und was er euch untersagt, enthaltet euch dessen. Und fürchtet Allah; wahrlich, Allah ist streng im Strafen.", "spanish": " Cuanto Al-lah ha entregado a Su Mensajero como botín de la gente de las ciudades es para Al-lah y para el Mensajero y para los parientes cercanos y los huérfanos, los necesitados y viajeros, para que no circule únicamente entre aquellos de vosotros que sois ricos. cuanto os da el Mensajero, tomadlo, y cuanto os prohíba, absteneos de ello . Temed a Al-lah; pues en verdad Al-lah es Severo en la retribución.", "urdu": " بستیوں کے لوگوں کا جو مال اللہ نے اپنے رسول کو عطا فرمایا وہ اللہ کا (ہے) اور رسول کا (ہے) اور قرابت داروں کا (ہے) اور یتیموں کا (ہے) اور مسکینوں کا (ہے) اور مسافروں کا ہے۔ تا وہ مال تم میں سے مالداروں کے اندر چکر نہ کھاتا پھرے اور رسول جو کچھ تم کو دے اس کو لے لو اور جس سے منع کرے اس سے رک جاٶ اور اللہ کا تقویٰ اختیار کرو۔ اللہ کا عذاب یقیناً بہت سخت ہوتا ہے۔"}, {"arabic": " لِلۡفُقَرَآءِ الۡمُہٰجِرِیۡنَ الَّذِیۡنَ اُخۡرِجُوۡا مِنۡ دِیَارِہِمۡ وَ اَمۡوَالِہِمۡ یَبۡتَغُوۡنَ فَضۡلًا مِّنَ اللّٰہِ وَ رِضۡوَانًا وَّ یَنۡصُرُوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ ؕ اُولٰٓئِکَ ہُمُ الصّٰدِقُوۡنَ ۚ﴿۹﴾", "english": " These spoils are for the poor Refugees who have been driven out from their homes and their possessions while seeking grace from Allah and His pleasure, and helping Allah and His Messenger. These it is who are true in their faith .", "french": " Le butin est pour les Réfugiés pauvres qui ont été chassés de leurs habitations et de leurs biens, alors qu’ils recherchaient quelque grâce et plaisir de la part d'Allāh et qu'ils aidaient Allāh et Son Messager. Ceux-là sont les véridiques dans leur foi ;", "german": " (Es ist) für die armen Flüchtlinge, die von ihren Heimstätten und ihren Besitztümern vertrieben wurden, indes sie nach Allahs Huld und Wohlgefallen trachteten und Allah und Seinem Gesandten beistanden. Diese sind die wahrhaft Treuen.", "spanish": " Ese botín es para los refugiados pobres que han sido expulsados de sus casas y sus posesiones, mientras buscaban la gracia de Al-lah y Su agrado, ayudando a Al-lah y a Su Mensajero. Ésos son los auténticos en su fe.", "urdu": " یہ (مال علاوہ اوپر کے لوگوں کے) مہاجر غریبوں کا حق ہے جن کو ان کے گھروں اور مالوں سے (بے دخل کرکے) نکال دیا گیا تھا۔ وہ اللہ کا فضل اور اس کی رضا چاہتے ہیں اور (ہمیشہ) اللہ (کے دین) کی اور اس کے رسول کی مدد کرتے رہتے ہیں۔ وہی لوگ (ایمان میں) سچے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ تَبَوَّؤُ الدَّارَ وَ الۡاِیۡمَانَ مِنۡ قَبۡلِہِمۡ یُحِبُّوۡنَ مَنۡ ہَاجَرَ اِلَیۡہِمۡ وَ لَا یَجِدُوۡنَ فِیۡ صُدُوۡرِہِمۡ حَاجَۃً مِّمَّاۤ اُوۡتُوۡا وَ یُؤۡثِرُوۡنَ عَلٰۤی اَنۡفُسِہِمۡ وَ لَوۡ کَانَ بِہِمۡ خَصَاصَۃٌ ؕ۟ وَ مَنۡ یُّوۡقَ شُحَّ نَفۡسِہٖ فَاُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ۚ﴿۱۰﴾", "english": " And those who had established their home in this city before them and had accepted faith, love those who came to them for refuge, and find not in their breasts any desire for that which is given them (Refugees), but prefer the Refugees to themselves, even though poverty be their own lot . And whoso is rid of the covetousness of his own soul — it is these who will be successful.", "french": " Et pour ceux qui avaient établi domicile dans cette ville avant eux et avaient accepté la Foi, qui aiment ceux qui sont venus à eux pour chercher refuge, et ils ne trouvent dans leurs poitrines aucune envie pour ce qui est accordé aux Réfugiés , mais ils donnent préférence aux autres sur eux-mêmes, bien qu’ils soient eux-mêmes dans l’indigence. Et quiconque est débarrassé de la convoitise de sa propre âme – ce sont ceux-là qui prospéreront.", "german": " Und jene, die vor ihnen in der Stadt wohnten und im Glauben (beharrten), lieben jene, die bei ihnen Zuflucht suchten, und finden in ihrer Brust keinen Wunsch nach dem, was ihnen gegeben ward, sondern sehen (die Flüchtlinge gern) vor sich selber bevorzugt, auch wenn sie selbst in Dürftigkeit sind. Und wer vor seiner eigenen Habsucht bewahrt ist – das sind die Erfolgreichen.", "spanish": " Y quienes habían establecido su casa en esta ciudad y habían aceptado la fe antes que ellos, aman a quienes acudieron a ellos pidiendo refugio, y no encuentran en sus corazones deseo alguno de lo que se les da a ellos (los refugiados), sino que prefieren a los demás a ellos mismos, aún cuando la privación sea su propia suerte. Pues quienes se libran de la avaricia de su propia alma sepan que son ellos los que serán bienaventurados.", "urdu": " اور (اسی طرح وہ مال ان لوگوں کے لئے بھی ہے) جو مدینہ میں پہلے سے رہتے تھے اور (مہاجرین کے آنے سے پہلے) ایمان قبول کر چکے تھے اور ان سے محبت کرتے تھے جو ان کی طرف ہجرت کرکے آئے اور اپنے دلوں میں اس (مال) کی کوئی خواہش نہیں رکھتے تھے جو ان کو دیا گیا تھا اور وہ باوجود اس کے کہ خود غریب تھے مہاجرین کو اپنے نفسوں پر ترجیح دیتے تھے‘ اور جن لوگوں کو اپنے نفس کے بخل سے محفوظ رکھا جائے ایسے تمام لوگ بامراد ہونے والے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ جَآءُوۡ مِنۡۢ بَعۡدِہِمۡ یَقُوۡلُوۡنَ رَبَّنَا اغۡفِرۡ لَنَا وَ لِاِخۡوَانِنَا الَّذِیۡنَ سَبَقُوۡنَا بِالۡاِیۡمَانِ وَ لَا تَجۡعَلۡ فِیۡ قُلُوۡبِنَا غِلًّا لِّلَّذِیۡنَ اٰمَنُوۡا رَبَّنَاۤ اِنَّکَ رَءُوۡفٌ رَّحِیۡمٌ ﴿٪۱۱﴾", "english": " And the spoils are also for those who came after them. They say, ‘Our Lord, forgive us and our brothers who preceded us in the faith, and leave not in our hearts any rancour against those who believe. Our Lord! Thou art indeed Compassionate, Merciful.’", "french": " Et le butin est aussi pour ceux qui sont venus après eux. Ils disent : « Notre Seigneur, pardonne-nous, et à nos frères qui nous ont devancés dans la foi, et ne laisse dans notre cœur aucune rancune contre ceux qui croient. Notre Seigneur ! En vérité, Tu es Compatissant, Miséricordieux. »", "german": " Und die nach ihnen kamen, sprechen: \"Unser Herr, vergib uns und unseren Brüdern, die uns im Glauben vorangingen, und lasse in unseren Herzen keinen Groll gegen die Gläubigen. Unser Herr! Du bist fürwahr gütig, barmherzig.\"", "spanish": " Y el botín es también para quienes vinieron tras ellos. Dicen: “Señor Nuestro, perdónanos a nosotros y a nuestros hermanos que nos precedieron en la fe, y no dejes en nuestros corazones rencor alguno contra los creyentes. ¡Señor Nuestro! Tú eres en verdad, Compasivo, Misericordioso”.", "urdu": " اور جو لوگ ان کے زمانہ کے بعد آئے وہ کہتے ہیں۔ کہ اے ہمارے رب! ہم کو اور ہمارے ان بھائیوں کو بخش دے جو ہم سے پہلے ایمان لاچکے ہیں اور ہمارے دلوں میں مومنوں کا کینہ نہ پیدا ہونے دے۔ اے ہمارے رب تو بہت مہربان (اور) بے انتہا کرم کرنے والا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ نَافَقُوۡا یَقُوۡلُوۡنَ لِاِخۡوَانِہِمُ الَّذِیۡنَ کَفَرُوۡا مِنۡ اَہۡلِ الۡکِتٰبِ لَئِنۡ اُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَکُمۡ وَ لَا نُطِیۡعُ فِیۡکُمۡ اَحَدًا اَبَدًا ۙ وَّ اِنۡ قُوۡتِلۡتُمۡ لَنَنۡصُرَنَّکُمۡ ؕ وَ اللّٰہُ یَشۡہَدُ اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿۱۲﴾", "english": " Hast thou not seen those who are hypocrites? They say to their brethren who disbelieve among the People of the Book, ‘If you are turned out, we will surely go out with you, and we will never obey anyone against you: and if you are fought against, we will certainly help you.’ But Allah bears witness that surely they are liars.", "french": " N’as-tu pas vu ceux qui sont hypocrites ? Ils disent à leurs frères qui refusent de croire parmi les Gens du Livre : « Si vous êtes chassés, nous sortirons assurément avec vous, et nous n’obéirons jamais à qui que ce soit contre vous ; et si on se bat contre vous, nous vous aiderons assurément. » Mais Allāh témoigne que ce sont certainement des menteurs.", "german": " Hast du nicht die beobachtet, die Heuchler sind? Sie sprechen zu ihren Brüdern, die ungläubig sind unter dem Volk der Schrift: \"Wenn ihr vertrieben werdet, so werden wir sicherlich mit euch ziehen, und wir werden nie jemandem gegen euch gehorchen; und wenn ihr angegriffen werdet, so werden wir euch sicherlich helfen.\" Doch Allah ist Zeuge, dass sie gewisslich Lügner sind.", "spanish": " ¿No has visto a los hipócritas? Dicen a sus hermanos incrédulos de entre el Pueblo del Libro: “Si se os expulsa, ciertamente marcharemos con vosotros y nunca obedeceremos a nadie en contra vuestra; y si se os ataca, en verdad os ayudaremos”. Pero Al-lah es testigo de que ciertamente son embusteros.", "urdu": " کیا تو نے ان منافقوں کو نہیں دیکھا‘ جو اہل کتاب میں سے اپنے کافر بھائیوں کو کہتے ہیں کہ اگر تم کو (مدینہ سے) نکالا گیا۔ تو ہم تمہارے ساتھ ہی نکل جائیں گے۔ اور تمہارے خلاف کبھی کسی کی بات نہیں مانیں گے‘ اور اگر تم سے جنگ کی گئی تو ہم تمہاری مدد کریں گے اور اللہ گواہی دیتا ہے کہ وہ جھوٹے ہیں۔"}, {"arabic": " لَئِنۡ اُخۡرِجُوۡا لَا یَخۡرُجُوۡنَ مَعَہُمۡ ۚ وَ لَئِنۡ قُوۡتِلُوۡا لَا یَنۡصُرُوۡنَہُمۡ ۚ وَ لَئِنۡ نَّصَرُوۡہُمۡ لَیُوَلُّنَّ الۡاَدۡبَارَ ۟ ثُمَّ لَا یُنۡصَرُوۡنَ ﴿۱۳﴾", "english": " If they are turned out, they will never go out with them; and if they are fought against they will never help them. And even if they help them, they will assuredly turn their backs; and then they shall not be helped.", "french": " S’ils étaient chassés, ils ne sortiraient jamais avec eux ; et si on se battait contre eux, ils ne les aideraient jamais. Et même s’ils les aidaient, ils s’enfuiraient assurément ; et alors ils ne seraient pas aidés.", "german": " Wenn sie vertrieben werden, sie würden nie mit ihnen ausziehen; und wenn sie angegriffen werden, sie würden ihnen niemals helfen. Und helfen sie ihnen schon, so werden sie sicherlich den Rücken wenden; und dann sollen sie (selbst) keine Hilfe finden.", "spanish": " Si se les expulsa, nunca partirán con ellos; y si se lucha contra llos, nunca les ayudarán. Y aunque les ayudaran, ciertamente volverían sus espaldas; y entonces no serían auxiliados.", "urdu": " اگر ان (اہل کتاب) کو نکال دیا گیا۔ تو یہ (منافق) ان کے ساتھ کبھی نہیں نکلیں گے اور اگر ان (اہل کتاب) سے جنگ کی گئی تو یہ (منافق) ان کی کبھی مدد نہیں کریں گے۔ اور اگر مدد کی بھی تو (ایسے جھوٹے دل سے کریں گے کہ) جنگ ہوتے ہی پیٹھ پھیر کر بھاگ جائیں گے۔ اور (انہوں نے ان کی مدد تو کیا کرنی ہے خطرہ کے موقعہ پر) ان کی اپنی مدد کرنے والا کوئی نہیں ہوگا۔"}, {"arabic": " لَاَنۡتُمۡ اَشَدُّ رَہۡبَۃً فِیۡ صُدُوۡرِہِمۡ مِّنَ اللّٰہِ ؕ ذٰلِکَ بِاَنَّہُمۡ قَوۡمٌ لَّا یَفۡقَہُوۡنَ ﴿۱۴﴾", "english": " Of a truth, they have greater fear of you in their hearts than of Allah. That is because they are a people who are devoid of all reason.", "french": " En vérité, ils ont dans le cœur une crainte plus grande de vous que d’Allāh. C’est parce qu’ils sont un peuple qui ne comprend pas.", "german": " Wahrlich, sie hegen größere Furcht vor euch in ihren Herzen als vor Allah. Dies, weil sie ein Volk sind, das nicht begreift.", "spanish": " Seguramente sienten en sus corazones un mayor temor a vosotros que a Al-lah. Esto es porque son un pueblo desprovisto de toda razón.", "urdu": " (۔اے مومنو)! تمہارا ڈر ان (منافقوں) کے دل میں اللہ سے بھی زیادہ ہے یہ بات اس لئے ہے کہ وہ ایک ایسا گروہ ہے جو سمجھ سے عاری ہے۔"}, {"arabic": " لَا یُقَاتِلُوۡنَکُمۡ جَمِیۡعًا اِلَّا فِیۡ قُرًی مُّحَصَّنَۃٍ اَوۡ مِنۡ وَّرَآءِ جُدُرٍ ؕ بَاۡسُہُمۡ بَیۡنَہُمۡ شَدِیۡدٌ ؕ تَحۡسَبُہُمۡ جَمِیۡعًا وَّ قُلُوۡبُہُمۡ شَتّٰی ؕ ذٰلِکَ بِاَنَّہُمۡ قَوۡمٌ لَّا یَعۡقِلُوۡنَ ﴿ۚ۱۵﴾", "english": " They will not fight you in a body except in fortified towns or from behind walls. Their fighting among themselves is severe. Thou thinkest them to be united, but their hearts are divided. That is because they are a people who have no sense.", "french": " Ils ne se battront pas ensemble contre vous, sauf dans des villes fortifiées ou de derrière des murailles. Leur guerre entre eux-mêmes est violente ! Tu les crois unis mais leurs cœurs sont divisés. C’est parce qu’ils sont un peuple qui ne raisonne pas.", "german": " Sie würden euch nicht bekämpfen – nicht einmal alle zusammen –, außer in befestigten Städten oder hinter Mauern, (obgleich) ihre Heldentaten untereinander groß sind. Du würdest denken, sie seien eine Einheit, aber ihre Herzen sind geteilt. Dies, weil sie ein Volk sind, das keine Einsicht hat,", "spanish": " No os combatirán en masa, sino en ciudades fortificadas o detrás de muros. Su lucha mutua es implacable. Piensas que están unidos, pero sus corazones están divididos. Esto es porque son un pueblo que carece de sentido.", "urdu": " وہ کبھی تم سے جنگ نہیں کریں گے سوائے اس کے کہ مضبوط فصیلوں والے گاٶں میں دیواروں کے پیچھے بیٹھے ہوں‘ ان کی لڑائی آپس میں بڑی سخت ہوتی ہے تو ان کو ایک قوم خیال کرتا ہے لیکن ان کے دل پھٹے ہوئے ہوتے ہیں۔ یہ اس لئے ہے کہ وہ ایسی قوم ہیں جو عقل نہیں رکھتی۔"}, {"arabic": " کَمَثَلِ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ قَرِیۡبًا ذَاقُوۡا وَبَالَ اَمۡرِہِمۡ ۚ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿ۚ۱۶﴾", "english": " Their case is like the case of those who have, a short time before them, tasted the evil consequences of their doings. And for them is a painful punishment.", "french": " Leur cas est pareil à celui de ceux qui, peu de temps avant eux, ont goûté les mauvaises conséquences de leur conduite. Et pour eux il y a un châtiment douloureux.", "german": " gleich jenen, die kurz vor ihnen die bösen Folgen ihrer Handlungsweise kosteten. Und für sie ist qualvolle Strafe.", "spanish": " Son semejantes a quienes, poco tiempo antes que ellos, probaron las consecuencias malvadas de sus acciones. Mas para ellos hay un doloroso castigo.", "urdu": " ان کا حال ان (قوموں) کی طرح ہے جو ان سے پہلے قریب زمانہ میںگذر چکی ہیں انہوں نے اپنے کاموں کا انجام دیکھ لیا اور ان کو دردناک عذاب پہنچا۔"}, {"arabic": " کَمَثَلِ الشَّیۡطٰنِ اِذۡ قَالَ لِلۡاِنۡسَانِ اکۡفُرۡ ۚ فَلَمَّا کَفَرَ قَالَ اِنِّیۡ بَرِیۡٓءٌ مِّنۡکَ اِنِّیۡۤ اَخَافُ اللّٰہَ رَبَّ الۡعٰلَمِیۡنَ ﴿۱۷﴾", "english": " It is like that of Satan, when he says to man, ‘Disbelieve;’ but when he disbelieves, he says, ‘I have nothing to do with thee; I fear Allah, the Lord of the worlds.’", "french": " Ou c’est comme le cas de Satan, lorsqu’il dit à l’homme : « Ne crois pas. » Mais quand il est devenu mécréant, il dit : « Je n’ai rien à faire avec toi ; certainement je crains Allāh, le Seigneur des mondes. »", "german": " Gleich Satan, wenn er zu dem Menschen spricht: \"Sei ungläubig!\"; ist er aber ungläubig, so spricht er: \"Ich habe nichts mit dir zu schaffen, denn ich fürchte Allah, den Herrn der Welten.\"", "spanish": " Es como ocurre con Satanás, cuando dice al hombre: “No creas”, pero cuando deja de creer, dice: “No tengo nada que ver contigo; yo temo a Al-lah, el Señor de los mundos”.", "urdu": " (۔نیز) ان (منافقوں) کی حالت شیطان کے ساتھ ملتی ہے جبکہ وہ انسان سے تو یہ کہہ دیتا ہے کہ کفر کر۔ لیکن جب وہ کفر کر بیٹھتا ہے تو (شیطان) اس سے کہتا ہے میں تجھ سے بری ہوں میں اللہ سے ڈرتا ہوں جو سب جہانوں کا رب ہے۔"}, {"arabic": " فَکَانَ عَاقِبَتَہُمَاۤ اَنَّہُمَا فِی النَّارِ خَالِدَیۡنِ فِیۡہَا ؕ وَ ذٰلِکَ جَزٰٓؤُا الظّٰلِمِیۡنَ ﴿٪۱۸﴾", "english": " And the end of both will be that they will both be in the Fire, abiding therein. Such is the reward of the wrongdoers.", "french": " Et la fin des deux sera qu’ils seront tous deux dans le Feu, y demeurant longtemps. Telle est la rétribution de ceux qui font le mal.", "german": " Und das Ende beider wird sein, dass sie im Feuer sein werden und darin bleiben. Das ist der Lohn der Frevler.", "spanish": " Y el final de ambos será que uno y otro caerán al Fuego, morando en él. Ésa es la recompensa de los inicuos.", "urdu": " سو ان دونوں کا انجام یہ ہوتا ہے کہ وہ دونوں ہی جہنم میں جا پڑتے ہیں اور اسی میں رہتے چلے جائیں گے اور ظالموں کا بدلہ ایسا ہی ہوتا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ وَ لۡتَنۡظُرۡ نَفۡسٌ مَّا قَدَّمَتۡ لِغَدٍ ۚ وَ اتَّقُوا اللّٰہَ ؕ اِنَّ اللّٰہَ خَبِیۡرٌۢ بِمَا تَعۡمَلُوۡنَ ﴿۱۹﴾", "english": " O ye who believe! fear Allah; and let every soul look to what it sends forth for the morrow. And fear Allah; verily Allah is Well-Aware of what you do.", "french": " Ô vous qui croyez ! craignez Allāh ; et que chaque âme s’occupe de ce qu’elle envoie en avant pour le lendemain. Et craignez Allāh ; en vérité, Allāh est Très-Conscient de ce que vous faites.", "german": " O die ihr glaubt, fürchtet Allah; und eine jede Seele schaue nach dem, was sie für morgen vorausschickt. Und fürchtet Allah; Allah ist wohl kundig dessen, was ihr tut.", "spanish": " ¡Oh vosotros, los creyentes! Temed a Al-lah; y que cada alma considere lo que prepara para el mañana. Temed a Al-lah; pues en verdad Al-lah conoce muy bien lo que hacéis.", "urdu": " اے مومنو! اللہ کا تقویٰ اختیار کرو‘ اور چاہیے کہ ہر جان اس بات پر نظر رکھے کہ اس نے کل کے لئے آگے کیا بھیجا ہے اور تم سب اللہ کا تقویٰ اختیار کرو۔ اللہ تمہارے اعمال سے خوب باخبر ہے۔"}, {"arabic": " وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ نَسُوا اللّٰہَ فَاَنۡسٰہُمۡ اَنۡفُسَہُمۡ ؕ اُولٰٓئِکَ ہُمُ الۡفٰسِقُوۡنَ ﴿۲۰﴾", "english": " And be not like those who forgot Allah, and whom He has consequently caused to forget their own souls. It is they that are the rebellious.", "french": " Et ne soyez pas comme ceux qui ont oublié Allāh et par conséquent, Il leur a fait oublier leur propre âme. Ce sont eux qui sont les rebelles.", "german": " Und seid nicht gleich jenen, die Allah vergaßen und die Er darum ihre eigenen Seelen vergessen ließ. Das sind die Übertreter.", "spanish": " No seáis como quienes olvidaron a Al-lah, por lo que Él hizo que se olvidaran de sí mismos. Ellos son los rebeldes.", "urdu": " اور ان لوگوں کی طرح نہ بنو‘ جنہوں نے اللہ کو بھلا دیا سو اللہ نے بھی ان کو اپنی جانوں کا فائدہ بھلا دیا یہ لوگ اطاعت سے باہر نکلنے والے ہیں۔"}, {"arabic": " لَا یَسۡتَوِیۡۤ اَصۡحٰبُ النَّارِ وَ اَصۡحٰبُ الۡجَنَّۃِ ؕ اَصۡحٰبُ الۡجَنَّۃِ ہُمُ الۡفَآئِزُوۡنَ ﴿۲۱﴾", "english": " The inmates of the Fire and the inmates of the Garden are not equal. It is the inmates of the Garden that will triumph.", "french": " Les habitants du Feu, et les habitants du Jardin ne sont pas égaux. Ce sont les habitants du Jardin qui triompheront.", "german": " Nicht gleich sind die Bewohner des Feuers und die Bewohner des Gartens. Es sind die Bewohner des Gartens, die erfolgreich sind.", "spanish": " Los moradores del Fuego y los moradores del Jardín no son iguales. Son los moradores del Jardín los que triunfarán.", "urdu": " دوزخی اور جنتی برابر نہیں ہو سکتے۔ جنتی لوگ ہی کامیاب ہیں۔"}, {"arabic": " لَوۡ اَنۡزَلۡنَا ہٰذَا الۡقُرۡاٰنَ عَلٰی جَبَلٍ لَّرَاَیۡتَہٗ خَاشِعًا مُّتَصَدِّعًا مِّنۡ خَشۡیَۃِ اللّٰہِ ؕ وَ تِلۡکَ الۡاَمۡثَالُ نَضۡرِبُہَا لِلنَّاسِ لَعَلَّہُمۡ یَتَفَکَّرُوۡنَ ﴿۲۲﴾", "english": " If We had sent down this Qur’an on a mountain, thou wouldst certainly have seen it humbled and rent asunder for fear of Allah. And these are similitudes that We set forth for mankind that they may reflect.", "french": " Si Nous avions envoyé ce Coran sur une montagne, tu l’aurais certainement vu s’humilier et se fendre en morceaux par crainte d’Allāh. Et ce sont des similitudes que Nous proposons aux hommes afin qu’ils réfléchissent.", "german": " Hätten Wir diesen Qur-ân auf einen Berg herabgesandt, du hättest gesehen, wie er sich demütigte und sich spaltete aus Furcht vor Allah. Solche Gleichnisse stellen Wir für die Menschen, auf dass sie sich besinnen.", "spanish": " Si hubiésemos revelado este Corán en un monte, ciertamente lo hubieras visto humillado y hecho pedazos por temor a Al-lah. Éstos son ejemplos que proponemos a los humanos para que reflexionen.", "urdu": " اگر یہ قرآن ہم کسی پہاڑ پر نازل کرتے تو تو اسے دیکھتا کہ وہ (ادب سے) جھک جاتا اور اللہ کے ڈر سے ٹکڑے ٹکڑے ہو جاتا۔ اور یہ باتیں جو ہم (تجھ سے) کہتے ہیں یہ سب انسانوں کے لئے ہیں تا کہ وہ سوچیں۔"}, {"arabic": " ہُوَ اللّٰہُ الَّذِیۡ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ ۚ ہُوَ الرَّحۡمٰنُ الرَّحِیۡمُ ﴿۲۳﴾", "english": " He is Allah, and there is no God beside Him, the Knower of the unseen and the seen. He is the Gracious, the Merciful.", "french": " Il est Allāh ; nul n’est digne d’adoration excepté Lui, Celui Qui connaît l’invisible et le visible. Il est le Gracieux, le Miséricordieux.", "german": " Er ist Allah, außer Dem es keinen Gott gibt, der Wisser des Ungesehenen und des Sichtbaren. Er ist der Gnädige, der Barmherzige.", "spanish": " Él es Al-lah, y no hay nadie digno de ser adorado más que Él, el Conocedor de lo invisible y de lo visible. Él es el Clemente, el Misericordioso.", "urdu": " اللہ ہی ہے جس کے سوا کوئی معبود نہیں۔ وہ غائب اور حاضر کو جانتا ہے وہی بے انتہا کرم کرنے والا (خدا) ہے (اور وہی) باربار رحم کرنے والا (خدا) ہے۔"}, {"arabic": " ہُوَ اللّٰہُ الَّذِیۡ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ اَلۡمَلِکُ الۡقُدُّوۡسُ السَّلٰمُ الۡمُؤۡمِنُ الۡمُہَیۡمِنُ الۡعَزِیۡزُ الۡجَبَّارُ الۡمُتَکَبِّرُ ؕ سُبۡحٰنَ اللّٰہِ عَمَّا یُشۡرِکُوۡنَ ﴿۲۴﴾", "english": " He is Allah, and there is no God beside Him, the Sovereign, the Holy One, the Source of Peace, the Bestower of Security, the Protector, the Mighty, the Subduer, the Exalted. Holy is Allah far above that which they associate with Him .", "french": " Il est Allāh ; et nul n’est digne d’adoration excepté Lui, le Souverain, le Très-Saint, la Source de Paix, Celui Qui accorde la Sécurité, le Protecteur, le Puissant, Celui Qui remet en bon état, le Possesseur de la Majesté. Saint est Allāh, bien au-dessus de ce qu’ils Lui associent.", "german": " Er ist Allah, außer Dem es keinen Gott gibt, der König, der Heilige, der Eigner des Friedens, der Gewährer von Sicherheit, der Beschützer, der Allmächtige, der Verbesserer, der Majestätische. Hoch erhaben ist Allah über all das, was sie anbeten!", "spanish": " Él es Al-lah, y no hay nadie digno de ser adorado sino Él, el Soberano, el Santo, la Fuente de Paz, el que concede Seguridad, el rotector, el Poderoso, el que Somete, el Altísimo. Santo es Al-lah, mucho más allá de lo que Le asocian.", "urdu": " (۔حق یہ ہے کہ) اللہ وہ ہے جس کے سوا کوئی معبود نہیں‘ وہ بادشاہ ہے‘ (خود) پاک ہے (اور دوسروں کو پاک کرتا ہے‘ خود) ہر عیب سے سلامت ہے (اور دوسروں کو سلامت رکھتا ہے) سب کو امن دینے والا ہے‘ اور سب کا نگران ہے غالب ہے اور سب ٹوٹے ہوئے دلوں کو جوڑتا ہے۔ بڑی شان والا ہے۔ جن چیزوں کو یہ لوگ اس کا شریک قرار دیتے ہیں ان سے اللہ پاک ہے۔"}, {"arabic": " ہُوَ اللّٰہُ الۡخَالِقُ الۡبَارِئُ الۡمُصَوِّرُ لَہُ الۡاَسۡمَآءُ الۡحُسۡنٰی ؕ یُسَبِّحُ لَہٗ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ۚ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿٪۲۵﴾", "english": " He is Allah, the Creator, the Maker, the Fashioner. His are the most beautiful names. All that is in the heavens and the earth glorifies Him, and He is the Mighty, the Wise.", "french": " Il est Allāh, le Créateur, Celui Qui forme, Celui Qui façonne. A Lui appartiennent les plus beaux noms. Tout ce qui est dans les cieux et sur la terre Le glorifie, et Il est le Puissant, le Sage.", "german": " Er ist Allah, der Schöpfer, der Bildner, der Gestalter. Sein sind die schönsten Namen. Alles, was in den Himmeln und auf Erden ist, preist Ihn, und Er ist der Allmächtige, der Allweise.", "spanish": " Él es Al-lah, el Creador, el Hacedor, el Modelador. Suyos son los nombres más bellos. Todo lo que hay en los cielos y en la tierra Le glorifica, pues Él es el Poderoso, el Sabio.", "urdu": " (۔حق یہی ہے کہ) اللہ ہر چیز کا پیدا کرنے والا اور ہر چیز کا موجد بھی ہے۔ اور ہر چیز کو اس کی مناسب حال صورت دینے والا ہے اس کی بہت سی اچھی صفات ہیں۔ آسمانوں اور زمین میں جو کچھ ہے اس کی تسبیح کر رہا ہے اور وہ غالب (اور) حکمت والا ہے۔"}], "Surah": 59}