{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ الۡعٰدِیٰتِ ضَبۡحًا ۙ﴿۲﴾", "english": " By the snorting chargers of the warriors ,", "french": " Par les coursiers renâclants.", "german": " Bei den schnaubenden Rennern,", "spanish": " Por los corceles jadeantes,", "urdu": " میں شہادت کے طور پر ان جماعتوں کو پیش کرتا ہوں جو گھوڑوں پر چڑھ کر اس طرح بے تحاشا دوڑتی ہیں کہ ان کے گھوڑوں کے منہ سے آوازیں نکلنے لگ جاتی ہیں۔"}, {"arabic": " فَالۡمُوۡرِیٰتِ قَدۡحًا ۙ﴿۳﴾", "english": " Striking sparks of fire,", "french": " Qui font jaillir des étincelles de feu,", "german": " Feuerfunken schlagenden,", "spanish": " Que lanzan chispas de fuego,", "urdu": " نیز ان گھوڑ سواروں کو جن کے مرکب چوٹ مار کر چنگاریاں نکالتے ہیں۔"}, {"arabic": " فَالۡمُغِیۡرٰتِ صُبۡحًا ۙ﴿۴﴾", "english": " And making raids at dawn,", "french": " Et font des incursions à l’aube,", "german": " frühmorgens anstürmenden,", "spanish": " Y hacen sus incursiones al amanecer,", "urdu": " پھر صبح ہی صبح حملہ کرنے والوں کو۔"}, {"arabic": " فَاَثَرۡنَ بِہٖ نَقۡعًا ۙ﴿۵﴾", "english": " And raising clouds of dust thereby,", "french": " Et soulèvent ainsi des nuages de poussière,", "german": " und damit Staub aufwirbelnden,", "spanish": " Levantando así nubes de polvo,", "urdu": " جس کے نتیجہ میں اس (صبح کے وقت) میں غبار اڑاتے ہیں۔"}, {"arabic": " فَوَسَطۡنَ بِہٖ جَمۡعًا ۙ﴿۶﴾", "english": " And penetrating thereby into the centre of the enemy forces,", "french": " Et pénètrent par-là jusqu’au cœur des troupes ennemies ,", "german": " und dadurch in die Mitte (der Feinde) eindringenden –", "spanish": " Y penetrando de ese modo en el corazón de las filas del ene­migo ,", "urdu": " اور لشکر میں گھس جاتے ہیں۔"}, {"arabic": " اِنَّ الۡاِنۡسَانَ لِرَبِّہٖ لَکَنُوۡدٌ ۚ﴿۷﴾", "english": " Surely, man is ungrateful to his Lord;", "french": " Assurément, l’homme est ingrat envers son Seigneur ;", "german": " wahrlich, der Mensch ist undankbar gegen seinen Herrn;", "spanish": " En verdad, el hombre es desa­gradecido con su Señor;", "urdu": " انسان یقیناً اپنے رب کا بڑا ہی ناشکر گذار ہے۔"}, {"arabic": " وَ اِنَّہٗ عَلٰی ذٰلِکَ لَشَہِیۡدٌ ۚ﴿۸﴾", "english": " And surely, he is a witness unto that;", "french": " Et, sûrement, il en est témoin ;", "german": " wahrlich, er bezeugt es selber;", "spanish": " Y en verdad, él es testigo de ello,", "urdu": " اور وہ یقیناً اس پر (اپنے قول اور فعل سے) گواہی دے رہا ہے۔"}, {"arabic": " وَ اِنَّہٗ لِحُبِّ الۡخَیۡرِ لَشَدِیۡدٌ ؕ﴿۹﴾", "english": " And surely, he is very keen for the love of wealth.", "french": " Et, sûrement, il est follement amoureux de la richesse,", "german": " wahrlich, er ist zäh in der Liebe zum Besitz.", "spanish": " Y ciertamente, se entusiasma por amor a las riquezas.", "urdu": " اور وہ (باوجود اس کے) یقیناً مال کی محبت میں بہت بڑھا ہوا ہے۔"}, {"arabic": " اَفَلَا یَعۡلَمُ اِذَا بُعۡثِرَ مَا فِی الۡقُبُوۡرِ ۙ﴿۱۰﴾", "english": " Does not such a one know that when those in the graves are raised,", "french": " Ignore-t-il donc que lorsqu’on fera sortir ceux qui se trouvent dans les tombes,", "german": " Weiß er denn nicht, dass wenn der Inhalt der Gräber bloßgelegt wird,", "spanish": " ¿Es que ese no sabe que, cuan­do los que están en las tumbas sean resucitados ,", "urdu": " کیا ایسا انسان نہیں جانتا کہ جب وہ (لوگ) جو قبروں میں ہیں اٹھائے جائیں گے۔"}, {"arabic": " وَ حُصِّلَ مَا فِی الصُّدُوۡرِ ﴿ۙ۱۱﴾", "english": " And that which is in the breasts is brought forth,", "french": " Et que ce qui est dans les poitrines sera dévoilé,", "german": " und das, was in den Herzen ist, offenbar wird,", "spanish": " Y sea extraído lo que hay en sus corazones,", "urdu": " اور جو کچھ سینوں میں (چھپا پڑا) ہے نکال لیا جائے گا۔"}, {"arabic": " اِنَّ رَبَّہُمۡ بِہِمۡ یَوۡمَئِذٍ لَّخَبِیۡرٌ ٪﴿۱۲﴾", "english": " Surely their Lord will, on that day, be fully Aware of them.", "french": " Sûrement, leur Seigneur ce jour-là sera Très-Conscient de tout ce qui les concerne.", "german": " dass ihr Herr (allein) an jenem Tage sie am besten kennt?", "spanish": " En verdad, en ese día, su Señor estará totalmente informado en lo que a ellos concierne?.", "urdu": " اس دن ان کا رب یقیناً ان کی نگرانی کرنے والا ہوگا۔"}], "Surah": 100}