{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) بار بار رحم کرنے والا ہے (پڑھتا ہوں) ۔"}, {"arabic": " اَلۡحَمۡدُ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ۙ﴿۲﴾", "english": " All praise belongs to Allah, Lord of all the worlds,", "french": " Toutes les louanges appartiennent à Allāh, le Seigneur de tous les mondes,", "german": " Aller Preis gehört Allah, dem Herrn der Welten,", "spanish": " Toda alabanza pertenece a Al-lah sólo, Señor de todos los mundos,", "urdu": " ہر (قسم کی) تعریف کا اللہ (ہی) مستحق ہے (جو) تمام جہانوں کا رب (ہے)۔"}, {"arabic": " الرَّحۡمٰنِ الرَّحِیۡمِ ۙ﴿۳﴾", "english": " The Gracious, the Merciful,", "french": " Le Gracieux, le Miséricordieux,", "german": " dem Gnädigen, dem Barmherzigen,", "spanish": " El Clemente, el Misericordioso,", "urdu": " بے حد کرم کرنے والا‘ بار بار رحم کرنے والا۔"}, {"arabic": " مٰلِکِ یَوۡمِ الدِّیۡنِ ؕ﴿۴﴾", "english": " Master of the Day of Judgment.", "french": " Le Maître du Jour du Jugement.", "german": " dem Meister des Gerichtstages.", "spanish": " Dueño del Día del Juicio.", "urdu": " (اور) جزا سزا کے وقت کا مالک ہے۔"}, {"arabic": " اِیَّاکَ نَعۡبُدُ وَ اِیَّاکَ نَسۡتَعِیۡنُ ؕ﴿۵﴾", "english": " Thee alone do we worship and Thee alone do we implore for help.", "french": " C’est Toi Seul que nous adorons, et c’est de Toi Seul que nous implorons le secours.", "german": " Dir allein dienen wir, und zu Dir allein flehen wir um Hilfe.", "spanish": " A Ti sólo te adoramos y a Ti sólo imploramos ayuda.", "urdu": " (اے خدا)! ہم تیری ہی عبادت کرتے ہیں اور تجھ سے ہی مدد مانگتے ہیں۔"}, {"arabic": " اِہۡدِ نَا الصِّرَاطَ الۡمُسۡتَقِیۡمَ ۙ﴿۶﴾", "english": " Guide us in the right path —", "french": " Guide-nous sur le droit chemin –", "german": " Führe uns auf den geraden Weg,", "spanish": " Dirígenos por el camino recto,", "urdu": " ہمیں سیدھے راستے پر چلا۔"}, {"arabic": " صِرَاطَ الَّذِیۡنَ اَنۡعَمۡتَ عَلَیۡہِمۡ ۬ۙ غَیۡرِ الۡمَغۡضُوۡبِ عَلَیۡہِمۡ وَ لَا الضَّآلِّیۡنَ ٪﴿۷﴾", "english": " The path of those on whom Thou hast bestowed Thy blessings, those who have not incurred Thy displeasure, and those who have not gone astray.", "french": " Le chemin de ceux à qui Tu as accordé Tes faveurs, pas celui de ceux qui se sont attiré le courroux, ni de ceux qui se sont égarés.", "german": " den Weg derer, denen Du Gnade erwiesen hast, die nicht (Dein) Missfallen erregt haben und die nicht irregegangen sind.", "spanish": " El camino de aquellos a quienes Tú has concedido Tus bendiciones, de los que no han incurrido en el enojo y de los que no se han extraviado.", "urdu": " ان لوگوں کے راستے پر جن پر تو نے انعام کیا ہے جن پر نہ تو تیرا (بعد) میں غضب نازل ہوا (ہے) اور نہ وہ (بعد میں) گمراہ (ہو گئے) ہیں۔"}], "Surah": 1}