{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " عَمَّ یَتَسَآءَلُوۡنَ ۚ﴿۲﴾", "english": " About what do they question one another?", "french": " Sur quoi s’interrogent-ils les uns les autres ?", "german": " Wonach befragen sie einander?", "spanish": " ¿Sobre qué se interrogan mutua­mente?", "urdu": " یہ (لوگ) کس (چیز) کے بارے میں ایک دوسرے سے (بطور تعجب) سوال کر رہے ہیں۔"}, {"arabic": " عَنِ النَّبَاِ الۡعَظِیۡمِ ۙ﴿۳﴾", "english": " About the great Event,", "french": " Sur la nouvelle de très grande importance,", "german": " Nach dem großen Ereignis,", "spanish": " Sobre las noticias de gran importancia,", "urdu": " کیا اس (مذکورہ بالا یوم الفصل والی) عظیم (الشان) خبر کے بارہ میں۔"}, {"arabic": " الَّذِیۡ ہُمۡ فِیۡہِ مُخۡتَلِفُوۡنَ ؕ﴿۴﴾", "english": " Concerning which they differ.", "french": " Au sujet de laquelle ils diffèrent.", "german": " über das sie uneinig sind.", "spanish": " Respecto a las cuales discrepan.", "urdu": " جس کے بارے میں یہ لوگ (قرآن کی بتائی ہوئی حقیقت سے) اختلاف رکھتے ہیں۔"}, {"arabic": " کَلَّا سَیَعۡلَمُوۡنَ ۙ﴿۵﴾", "english": " Nay, soon they will come to know.", "french": " Non , mais ils sauront bientôt ;", "german": " Nein! sie werden es bald erfahren.", "spanish": " ¡No!, muy pronto sabrán.", "urdu": " خوب یاد رکھیں کہ اصل حقیقت ان کے عقیدوں کے خلاف ہے اور ایک دن وہ اسے معلوم کر لیں گے۔"}, {"arabic": " ثُمَّ کَلَّا سَیَعۡلَمُوۡنَ ﴿۶﴾", "english": " Nay, We say it again, they will soon come to know.", "french": " Non , mais Nous le disons encore une fois, ils sauront bientôt.", "german": " Und abermals nein! sie werden es bald erfahren.", "spanish": " ¡No!, lo diremos de nuevo, pronto lo sabrán.", "urdu": " پھر ہم کہتے ہیں کہ بات ان کے عقیدوں کے خلاف ہے اور یہ لوگ اس پیشگوئی کو جو اس سورت میں بیان کی گئی ہے ضرور جان لیں گے۔"}, {"arabic": " اَلَمۡ نَجۡعَلِ الۡاَرۡضَ مِہٰدًا ۙ﴿۷﴾", "english": " Have We not made the earth a bed,", "french": " N’avons-Nous pas fait la terre comme un lit,", "german": " Haben Wir nicht die Erde zu einem Bette gemacht,", "spanish": " ¿Acaso no hemos hecho la tierra como un lecho.", "urdu": " (سوچیں تو سہی کہ) کیا ہم نے زمین کو بچھونا نہیں بنایا۔"}, {"arabic": " وَّ الۡجِبَالَ اَوۡتَادًا ﴿۪ۙ۸﴾", "english": " And the mountains as pegs?", "french": " Et les montagnes comme des piquets ?", "german": " und die Berge zu Pflöcken?", "spanish": " Y las montañas como estacas?", "urdu": " اور پہاڑوں کو میخوں کے طور پر نہیں گاڑا۔"}, {"arabic": " وَّ خَلَقۡنٰکُمۡ اَزۡوَاجًا ۙ﴿۹﴾", "english": " And We have created you in pairs,", "french": " Et Nous vous avons créés en couples,", "german": " Und Wir haben euch in Paaren erschaffen,", "spanish": " Y os hemos creado en parejas,", "urdu": " اور (یہ بھی یاد رکھو کہ) ہم نے تم (سب لوگوں) کو جوڑا (جوڑا) بنایا ہے۔"}, {"arabic": " وَّ جَعَلۡنَا نَوۡمَکُمۡ سُبَاتًا ۙ﴿۱۰﴾", "english": " And We have made your sleep for rest,", "french": " Et Nous avons fait de votre sommeil une source de repos,", "german": " und Wir haben euch den Schlaf zur Ruhe gemacht", "spanish": " Y hemos hecho de vuestro sueño una fuente de descanso,", "urdu": " اور ہم نے تمہاری نیند کو موجب راحت بنایا ہے۔"}, {"arabic": " وَّ جَعَلۡنَا الَّیۡلَ لِبَاسًا ﴿ۙ۱۱﴾", "english": " And We have made the night as a covering,", "french": " Et Nous avons fait la nuit comme une couverture,", "german": " und die Nacht zu einer Hülle", "spanish": " Y hemos hecho la noche como un manto,", "urdu": " اور ہم نے رات کو پردہ پوش بنایا ہے۔"}, {"arabic": " وَّ جَعَلۡنَا النَّہَارَ مَعَاشًا ﴿۪۱۲﴾", "english": " And We have made the day for the activities of life.", "french": " Et Nous avons fait le jour comme un moyen de subsistance.", "german": " und den Tag zum Erwerb des Unterhalts.", "spanish": " Y hemos creado el día para ganarse el sustento.", "urdu": " اور ہم نے دن کو زندگی (کے اظہار) کا موقعہ بنایا ہے۔"}, {"arabic": " وَّ بَنَیۡنَا فَوۡقَکُمۡ سَبۡعًا شِدَادًا ﴿ۙ۱۳﴾", "english": " And We have built over you seven strong heavens ;", "french": " Et Nous avons bâti sur vous sept cieux solides ;", "german": " Und Wir haben über euch sieben starke (Himmel) erbaut;", "spanish": " Hemos creado sobre vosotros siete potentes cielos,", "urdu": " اور ہم نے تمہارے اوپر سات (بلند اور) مضبوط (آسمان) بنائے ہیں۔"}, {"arabic": " وَّ جَعَلۡنَا سِرَاجًا وَّہَّاجًا ﴿۪ۙ۱۴﴾", "english": " And We have made the sun a bright lamp.", "french": " Et Nous avons fait le soleil une lampe brillante.", "german": " und Wir haben eine hellbrennende Lampe gemacht.", "spanish": " Y creamos al sol como lámpara brillante.", "urdu": " اور ہم نے ایک چمکتا ہوا سورج (بھی) بنایا ہے۔"}, {"arabic": " وَّ اَنۡزَلۡنَا مِنَ الۡمُعۡصِرٰتِ مَآءً ثَجَّاجًا ﴿ۙ۱۵﴾", "english": " And We send down from the dripping clouds water pouring forth abundantly,", "french": " Et Nous faisons descendre des nuages qui dégouttent, de l’eau tombant abondamment,", "german": " Und Wir senden aus den Regenwolken Wasser in Strömen hernieder,", "spanish": " Y enviamos desde las nubes húmedas el agua que cae en abundancia.", "urdu": " اور ہم نے گھنے بادلوں سے کثرت سے بہنے والا پانی (بھی) اتارا ہے۔"}, {"arabic": " لِّنُخۡرِجَ بِہٖ حَبًّا وَّ نَبَاتًا ﴿ۙ۱۶﴾", "english": " That We may bring forth thereby grain and vegetation,", "french": " Afin que Nous fassions pousser par là des grains et de la végétation,", "german": " auf dass Wir damit Korn und Kraut hervorbringen mögen", "spanish": " Para hacer crecer con ella el grano y la vegetación.", "urdu": " تا کہ اس کے ذریعہ سے ہم دانے اور سبزیاں نکالیں۔"}, {"arabic": " وَّ جَنّٰتٍ اَلۡفَافًا ﴿ؕ۱۷﴾", "english": " And gardens of luxuriant growth.", "french": " Et des jardins luxuriants.", "german": " und üppige Gärten.", "spanish": " Y jardines con una vegetación exuberante.", "urdu": " اور گھنے باغ (اگائیں)"}, {"arabic": " اِنَّ یَوۡمَ الۡفَصۡلِ کَانَ مِیۡقَاتًا ﴿ۙ۱۸﴾", "english": " Surely, the Day of Decision has an appointed time:", "french": " Assurément, le Jour de la Décision a une heure fixée :", "german": " Fürwahr, der Tag der Entscheidung ist festgesetzt;", "spanish": " En verdad, el Día de la Decisión tiene la hora fijada:", "urdu": " یقیناً یہ فیصلے کا دن ایک مقرر وقت (پر آنے والا) ہے۔"}, {"arabic": " یَّوۡمَ یُنۡفَخُ فِی الصُّوۡرِ فَتَاۡتُوۡنَ اَفۡوَاجًا ﴿ۙ۱۹﴾", "english": " The day when the trumpet will be blown; and you will come in large groups;", "french": " Le jour où l’on sonnera de la trompe, et vous viendrez par groupes, les uns après les autres .", "german": " der Tag, da in die Posaune gestoßen wird und ihr kommt in Scharen,", "spanish": " El día en que sonará la trompeta; y acudiréis en multitudes, una tras otra;", "urdu": " جس دن کہ صور میں پھونکا جائے گا۔ پھر تم گروہ در گروہ ہو کر (ہمارے حضور میں) آٶ گے۔"}, {"arabic": " وَّ فُتِحَتِ السَّمَآءُ فَکَانَتۡ اَبۡوَابًا ﴿ۙ۲۰﴾", "english": " And the heaven shall be opened and shall become all doors;", "french": " Et le ciel sera ouvert et deviendra toutes portes.", "german": " und der Himmel öffnet sich und wird (wie) Tore,", "spanish": " El cielo se abrirá y se convertirá todo él en puertas;", "urdu": " اور آسمان کھول دیا جائے گا‘ یہاں تک کہ وہ دروازے (دروازے) ہو جائے گا۔"}, {"arabic": " وَّ سُیِّرَتِ الۡجِبَالُ فَکَانَتۡ سَرَابًا ﴿ؕ۲۱﴾", "english": " And the mountains shall be made to move and shall become as if they were a mirage.", "french": " Et les montagnes seront mises en mouvement et deviendront comme si elles étaient un mirage.", "german": " und die Berge schwinden dahin und werden zur Luftspiegelung.", "spanish": " Y se hará que las montañas se muevan y se convertirán en una especie de espejismo.", "urdu": " اور پہاڑ (اپنی جگہ سے) چلائے جائیں گے‘ یہاں تک کہ وہ سراب (کی مانند) ہو جائیں گے۔"}, {"arabic": " اِنَّ جَہَنَّمَ کَانَتۡ مِرۡصَادًا ﴿۪ۙ۲۲﴾", "english": " Surely Hell lies in ambush,", "french": " Assurément, l’Enfer se tient en embuscade,", "german": " Wahrlich, die Hölle ist ein Hinterhalt –", "spanish": " En verdad, el Infierno está al acecho,", "urdu": " یقیناً جہنم (ان لوگوں کی) گھات میں (لگی ہوئی) ہے۔"}, {"arabic": " لِّلطَّاغِیۡنَ مَاٰبًا ﴿ۙ۲۳﴾", "english": " A home for the rebellious,", "french": " Un endroit de retour pour les rebelles,", "german": " ein Heim für die Widerspenstigen,", "spanish": " Una morada para los rebeldes,", "urdu": " (اور) وہ سرکشوں کے لئے ٹھہرنے کی جگہ ہے۔"}, {"arabic": " لّٰبِثِیۡنَ فِیۡہَاۤ اَحۡقَابًا ﴿ۚ۲۴﴾", "english": " Who will tarry therein for ages.", "french": " Qui y resteront pendant très longtemps.", "german": " die auf endlose Zeit darin bleiben müssen.", "spanish": " Quienes permanecerán en él durante siglos.", "urdu": " وہ اس میں برسوں رہتے چلے جائیں گے۔"}, {"arabic": " لَا یَذُوۡقُوۡنَ فِیۡہَا بَرۡدًا وَّ لَا شَرَابًا ﴿ۙ۲۵﴾", "english": " They will taste therein neither sleep nor drink,", "french": " Ils n’y goûteront ni fraîcheur ni boisson,", "german": " Sie werden dort weder Erquickung noch Getränk kosten,", "spanish": " En él no probarán ni lo fresco ni la bebida.", "urdu": " (وہاں ان لوگوں کی یہ حالت ہوگی) کہ نہ تو وہ اس میں کسی قسم کی ٹھنڈک (محسوس کریں گے) اور نہ کوئی پینے کی چیز ان کو ملے گی (جو پیاس بجھا سکے)"}, {"arabic": " اِلَّا حَمِیۡمًا وَّ غَسَّاقًا ﴿ۙ۲۶﴾", "english": " Save boiling water and a stinking fluid —", "french": " Sauf de l’eau bouillante et un fluide puant et glacial –", "german": " es sei denn siedendes Wasser und stinkende Flüssigkeit:", "spanish": " Salvo agua caliente hirviendo o fría como el hielo.", "urdu": " ہاں مگر اللہ ان کو (تیز) گرم پانی اور (ناقابل برداشت) ٹھنڈا پانی دے گا۔"}, {"arabic": " جَزَآءً وِّفَاقًا ﴿ؕ۲۷﴾", "english": " A meet requital.", "french": " Une juste rétribution.", "german": " Eine angemessene Belohnung.", "spanish": " Como justa retribución.", "urdu": " (اس طرح انہیں ان کے اعمال کے) مطابق بدلہ (دیا جائے گا)"}, {"arabic": " اِنَّہُمۡ کَانُوۡا لَا یَرۡجُوۡنَ حِسَابًا ﴿ۙ۲۸﴾", "english": " Verily, they feared not the reckoning,", "french": " En vérité, ils ne s'attendaient pas à un quelque compte à rendre ,", "german": " Sie fürchteten keine Rechenschaft", "spanish": " En verdad, no sintieron temor a tener que rendir cuentas.", "urdu": " وہ یقیناً (کسی) محاسبہ کا ڈر (اپنے دلوں میں) نہیں رکھتے تھے۔"}, {"arabic": " وَّ کَذَّبُوۡا بِاٰیٰتِنَا کِذَّابًا ﴿ؕ۲۹﴾", "english": " And rejected Our Signs totally.", "french": " Et ils rejetèrent Nos Signes avec dureté.", "german": " und verwarfen gänzlich Unsere Zeichen.", "spanish": " Y rechazaron totalmente Nuestros Signos.", "urdu": " اور ہمارے نشانات کو سختی کے ساتھ جھٹلاتے تھے۔"}, {"arabic": " وَ کُلَّ شَیۡءٍ اَحۡصَیۡنٰہُ کِتٰبًا ﴿ۙ۳۰﴾", "english": " And every thing have We recorded in a Book.", "french": " Et Nous avons tout dénombré en écrit.", "german": " Und jegliches Ding haben Wir in einem Buche aufgezeichnet.", "spanish": " Mas todas las cosas las tenemos registradas en un Libro.", "urdu": " اور ہم نے (تو) ہر ایک چیز کو پوری طرح گن رکھا ہے۔"}, {"arabic": " فَذُوۡقُوۡا فَلَنۡ نَّزِیۡدَکُمۡ اِلَّا عَذَابًا ﴿٪۳۱﴾", "english": " ‘Taste ye therefore the punishment : We will give you no increase except in torment.’", "french": " « Goûtez donc le châtiment . Nous ne vous augmenterons qu’en supplices. »", "german": " Kostet drum (die Strafe); Wir werden euch nicht anders mehren als in der Pein.", "spanish": " “Probad, pues, el castigo; no os aumentaremos nada salvo el tormento”.", "urdu": " پس (اپنے اپنے اعمال کے مطابق) عذاب چکھو اور ہم تم کو (عذاب کے بعد) عذاب ہی دیتے چلے جائیں گے۔"}, {"arabic": " اِنَّ لِلۡمُتَّقِیۡنَ مَفَازًا ﴿ۙ۳۲﴾", "english": " Verily, for the righteous is a triumph:", "french": " En vérité, pour les pieux il y a un triomphe :", "german": " Wahrlich, für die Rechtschaffenen ist Glückseligkeit –", "spanish": " En verdad, para los justos será el triunfo:", "urdu": " یقیناً متقیوں کے لئے کامیابی (مقدر) ہے۔"}, {"arabic": " حَدَآئِقَ وَ اَعۡنَابًا ﴿ۙ۳۳﴾", "english": " Walled gardens and grape-vines,", "french": " Des jardins enclos et des vignes,", "german": " Gärten, umhegte, und Rebenberge.", "spanish": " Jardines amurallados y viñas,", "urdu": " (یعنی) باغات اور انگور۔"}, {"arabic": " وَّکَوَاعِبَ اَتۡرَابًا ﴿ۙ۳۴﴾", "english": " And young maidens of equal age,", "french": " Et des jeunes filles d’âge égal,", "german": " Und Jungfrauen, Altersgenossinnen,", "spanish": " Jóvenes doncellas de la misma edad,", "urdu": " اور ہم عمر نوجوان عورتیں۔"}, {"arabic": " وَّ کَاۡسًا دِہَاقًا ﴿ؕ۳۵﴾", "english": " And overflowing cups.", "french": " Et des coupes débordantes.", "german": " und übervolle Schalen.", "spanish": " Y copas rebosantes.", "urdu": " اور چھلکتے ہوئے پیالے۔"}, {"arabic": " لَا یَسۡمَعُوۡنَ فِیۡہَا لَغۡوًا وَّ لَا کِذّٰبًا ﴿ۚ۳۶﴾", "english": " Therein they will hear no idle talk nor lying:", "french": " Ils n’y entendront ni vains discours ni mensonges.", "german": " Dort hören sie weder eitles Gerede noch Lüge.", "spanish": " Allí no oirán conversaciones inútiles ni falsedades;", "urdu": " نہ تو وہ ان (جنتوں میں) لغو باتیں سنیں گے اور نہ (ان کی باتوں کو) کبھی کوئی جھٹلائے گا۔"}, {"arabic": " جَزَآءً مِّنۡ رَّبِّکَ عَطَآءً حِسَابًا ﴿ۙ۳۷﴾", "english": " A recompense from thy Lord — a gift in proportion to their works —", "french": " Une récompense de ton Seigneur – un don en proportion à leurs œuvres –", "german": " Eine Belohnung von deinem Herrn – eine Gabe entsprechend (ihren Werken) –,", "spanish": " Una recompensa de tu Señor: un don de acuerdo con sus obras.", "urdu": " انہیں تیرے رب کی طرف سے ایسا بدلہ دیا جائے گا‘ جو مناسب حال انعام ہوگا۔"}, {"arabic": " رَّبِّ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ مَا بَیۡنَہُمَا الرَّحۡمٰنِ لَا یَمۡلِکُوۡنَ مِنۡہُ خِطَابًا ﴿ۚ۳۸﴾", "english": " Lord of the heavens and the earth and all that is between them, the Gracious. They shall not have the power to address Him.", "french": " Le Seigneur des cieux et de la terre et de tout ce qui se trouve entre eux, le Dieu Gracieux. Ils ne seront pas en droit de Lui adresser la parole.", "german": " dem Herrn der, Himmel und der Erde und alles dessen, was zwischen den beiden ist, dem Gnadenreichen. Sie werden nicht vermögen, Ihn anzureden.", "spanish": " Señor de los cielos y la tierra y de todo lo que hay entre ellos, el Clemente. No tendrán autorización para dirigirse a Él.", "urdu": " (تیرے اس رب کی طرف سے جو) آسمانوں اور زمین اور ان دونوں کے درمیان جو کچھ ہے ان سب کا رب ہے (اور) بے حد کرم کرنے والا ہے۔ وہ اس کے حضور میں (بلا اجازت) بات کرنے کی طاقت نہیں رکھیں گے۔"}, {"arabic": " یَوۡمَ یَقُوۡمُ الرُّوۡحُ وَ الۡمَلٰٓئِکَۃُ صَفًّا ؕ٭ۙ لَّا یَتَکَلَّمُوۡنَ اِلَّا مَنۡ اَذِنَ لَہُ الرَّحۡمٰنُ وَ قَالَ صَوَابًا ﴿۳۹﴾", "english": " On the day when the Spirit and the angels will stand in rows, they shall not speak, except he whom the Gracious God will permit and who will speak only what is right.", "french": " Le jour où l’Esprit et les anges se tiendront debout en rangs, ils ne parleront pas sauf celui à qui le Dieu Gracieux le permettra, et qui ne dira que ce qui est juste.", "german": " Am Tage, da der Geist und die Engel in Reihen stehen, da werden sie nicht sprechen dürfen, ausgenommen der, dem der Gnadenreiche es erlaubt und der nur das Rechte redet.", "spanish": " El día en que el Espíritu y los ángeles permanezcan de pie en filas. No hablarán, salvo aquel a quien se lo permita el Dios Clemente, el cual hablará únicamente lo que es justo.", "urdu": " (یہ اس دن ہوگا) جس دن کہ روح کامل اور فرشتے صف باندھ کر کھڑے ہوں گے (اور) وہ بات نہ کر سکیں گے سوائے اس کے جسے رحمن (خدا) نے اجازت دی ہوگی اور (ایسا شخص صرف مناسب موقعہ اور) ٹھیک ٹھیک بات کہے گا۔"}, {"arabic": " ذٰلِکَ الۡیَوۡمُ الۡحَقُّ ۚ فَمَنۡ شَآءَ اتَّخَذَ اِلٰی رَبِّہٖ مَاٰبًا ﴿۴۰﴾", "english": " That day is sure to come. So let him, who will, seek recourse unto his Lord.", "french": " Ce jour viendra sûrement. Alors, que celui qui le veut, cherche son endroit de retour vers son Seigneur.", "german": " Jener Tag kommt gewiss. So möge, wer da will, bei seinem Herrn Einkehr halten.", "spanish": " Será un día que es seguro que llegará. Que quien lo desee recurra pues a su Señor.", "urdu": " یہ دن ہو کر رہنے والا ہے پس (تم میں سے) جو (شخص) چاہے اپنے رب کے پاس (اپنا) ٹھکانا بنالے۔"}], "Surah": 78}