{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے(پڑھتا ہوں)"}, {"arabic": " الٓرٰ ۟ تِلۡکَ اٰیٰتُ الۡکِتٰبِ الۡحَکِیۡمِ ﴿۲﴾", "english": " Alif Lam Ra. These are the verses of the Book that is full of wisdom.", "french": " Alif Lām Rā (Je suis Allāh, Je vois). Voici les versets du Livre plein de sagesse.", "german": " Alif Lâm Râ. Dieses sind die Verse des weisen Buches.", "spanish": " Alif Lam Ra. Éstos son los versículos del Libro que está lleno de sabiduría.", "urdu": " میں اللہ دیکھنے والا ہوں۔ یہ (یعنی اس سورۃ کی آیتیں) کامل (اور) پرحکمت کتاب کی آیتیں ہیں۔"}, {"arabic": " اَکَانَ لِلنَّاسِ عَجَبًا اَنۡ اَوۡحَیۡنَاۤ اِلٰی رَجُلٍ مِّنۡہُمۡ اَنۡ اَنۡذِرِ النَّاسَ وَ بَشِّرِ الَّذِیۡنَ اٰمَنُوۡۤا اَنَّ لَہُمۡ قَدَمَ صِدۡقٍ عِنۡدَ رَبِّہِمۡ ؕؔ قَالَ الۡکٰفِرُوۡنَ اِنَّ ہٰذَا لَسٰحِرٌ مُّبِیۡنٌ ﴿۳﴾", "english": " Is it a matter of wonder for men that We have inspired a man from among them, saying , ‘Warn mankind and give glad tidings to those who believe that they have a true rank of honour with their Lord?’ The disbelievers say, ‘Surely, this is a manifest enchanter.’", "french": " Cela étonne-t-il les gens que Nous ayons envoyé la révélation à un homme de parmi eux ainsi : « Avertis l’humanité et donne la bonne nouvelle à ceux qui croient qu’ils ont un rang de vérité auprès de leur Seigneur. » Les mécréants disent : « En vérité, c’est manifestement un enchanteur. »", "german": " Scheint es den Menschen so seltsam, dass Wir einem Manne aus ihrer Mitte die Eingebung sandten: \"Warne die Menschen und verkünde frohe Botschaft denen, die da glauben, dass sie einen wirklichen Rang bei ihrem Herrn besitzen\"? Die Ungläubigen sprechen: \"Fürwahr, das ist ein offenkundiger Zauberer.\"", "spanish": " ¿Es acaso sorprendente para la gente que hayamos inspirado a un hombre de ellos, diciendo: “Advierte a la humanidad y da a los que creen la buena noticia de que tendrán una elevada dignidad de verdad ante su Señor?”. Los incrédulos dicen: “En verdad, es un hechicero manifiesto”.", "urdu": " کیا لوگوں کے نزدیک ہمارا ان میں سے ایک شخص پر (یہ) وحی کرنا کہ لوگوں کو ہوشیار کر اور جو لوگ ایمان لائے ہیں انہیں بشارت دے کہ ان کے لئے ان کے رب کے حضور میں ایک ظاہر و باطن طور پر کامل درجہ ہے (ایسا) عجیب (امر) تھا (کہ) ان کافروں نے کہہ دیا کہ یہ (شخص) ضرور ہی کھلا کھلا دھوکہ باز ہے۔"}, {"arabic": " اِنَّ رَبَّکُمُ اللّٰہُ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ فِیۡ سِتَّۃِ اَیَّامٍ ثُمَّ اسۡتَوٰی عَلَی الۡعَرۡشِ یُدَبِّرُ الۡاَمۡرَ ؕ مَا مِنۡ شَفِیۡعٍ اِلَّا مِنۡۢ بَعۡدِ اِذۡنِہٖ ؕ ذٰلِکُمُ اللّٰہُ رَبُّکُمۡ فَاعۡبُدُوۡہُ ؕ اَفَلَا تَذَکَّرُوۡنَ ﴿۴﴾", "english": " Verily, your Lord is Allah Who created the heavens and the earth in six periods, then He settled Himself on the Throne; He governs everything. There is no intercessor with Him save after His permission. That is Allah, your Lord, so worship Him. Will you not, then, be admonished?", "french": " En vérité, votre Seigneur est Allāh Qui a créé les cieux et la terre en six périodes ; ensuite Il S’est établi fermement sur le Trône ; Il est le Régulateur de toute chose. Il n’y a aucun intercesseur auprès de Lui sauf après Sa permission. Voilà Allāh, votre Seigneur ; alors, adorez-Le. Ne voulez-vous donc pas prendre garde à cette admonition ?", "german": " Wahrlich, euer Herr ist Allah, Der die Himmel und die Erde erschuf in sechs Zeiten, dann setzte Er Sich auf den Thron; Er lenkt alles. Es gibt keinen Fürsprecher, es sei denn mit Seiner Erlaubnis. Dies ist Allah, euer Herr, so betet Ihn an. Wollt ihr euch denn nicht mahnen lassen?", "spanish": " En verdad, vuestro Señor es Al-lah, Quien creó los cielos y la tierra en seis períodos, y después Se sentó en el Trono; Él lo organiza todo. No existe intercesor ante Él salvo con su permiso. Así es Al-lah, vuestro Señor; adoradle pues. ¿No queréis ser advertidos?", "urdu": " تمہارا رب یقیناً اللہ ہے جس نے آسمانوں اور زمین کو چھ وقتوں میں پیدا کیا۔ پھر وہ عرش پر قرار فرما ہوا وہ ہر امر کا انتظام کرتا ہے (اس کے حضور میں) کوئی بھی (کسی کا) شفیع نہیں (ہوسکتا) سوائے اس کی اجازت کے (سنو)! یہ اللہ (مذکورہ بالا صفات والا ہے) (اور وہی) تمہارا رب ہے۔ اس لئے تم اسی کی عبادت کرو۔ کیا تم (باوجود ان باتوں کے) پھر بھی نصیحت حاصل نہیں کرو گے۔"}, {"arabic": " اِلَیۡہِ مَرۡجِعُکُمۡ جَمِیۡعًا ؕ وَعۡدَ اللّٰہِ حَقًّا ؕ اِنَّہٗ یَبۡدَؤُا الۡخَلۡقَ ثُمَّ یُعِیۡدُہٗ لِیَجۡزِیَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ بِالۡقِسۡطِ ؕ وَ الَّذِیۡنَ کَفَرُوۡا لَہُمۡ شَرَابٌ مِّنۡ حَمِیۡمٍ وَّ عَذَابٌ اَلِیۡمٌۢ بِمَا کَانُوۡا یَکۡفُرُوۡنَ ﴿۵﴾", "english": " To Him shall you all return. The promise of Allah is true. Surely, He originates the creation; then He reproduces it, that He may reward those who believe and do good works, with equity; and as for those who disbelieve, they shall have a drink of boiling water, and a painful punishment, because they disbelieved.", "french": " C’est à Lui que vous retournerez tous. La promesse d’Allāh est vraie. C’est Lui Qui commence la création ; puis Il la reproduit afin de récompenser avec justice ceux qui croient et font de bonnes œuvres ; et quant à ceux qui ne croient pas, ils auront de l’eau bouillante à boire et un châtiment douloureux, parce qu’ils niaient la vérité .", "german": " Zu Ihm ist euer aller Heimkehr: eine Verheißung Allahs in Wahrheit. Er bringt die Schöpfung hervor; dann lässt Er sie zurückkehren, auf dass Er jene, die glauben und gute Werke tun, belohne nach Billigkeit; die aber ungläubig sind, ihnen wird ein Trunk siedenden Wassers zuteil werden und schmerzliche Strafe, weil sie ungläubig waren.", "spanish": " A Él volveréis todos. La promesa de Al-lah es cierta. En verdad, Él origina la creación; después Él la reproduce, para poder recompensar a quienes creen y hacen buenas obras, con equidad; y en cuanto a quienes no creen, beberán agua hirviente y recibirán un doloroso castigo por no haber creído.", "urdu": " اسی کی طرف تم سب کو لوٹ کر جانا ہے (یہ) اللہ کا وعدہ ہے (جو) پورا ہو کر رہنے والا (ہے) وہ یقیناً مخلوق کو پیدا کرتا ہے۔ پھر اسے لوٹاتا ہے تا کہ جو لوگ ایمان لائے اور انہوں نے نیک (اور مناسب حال) کام کئے انہیں اجر میں کامل حصہ دے اور جن لوگوں نے کفر (اختیار) کیا ان کے لئے کھولتا ہوا پانی پینے کے لئے ہوگا اور ایک دردناک عذاب ہوگا کیونکہ وہ کفر کرتے (چلے جاتے ) تھے۔"}, {"arabic": " ہُوَ الَّذِیۡ جَعَلَ الشَّمۡسَ ضِیَآءً وَّ الۡقَمَرَ نُوۡرًا وَّ قَدَّرَہٗ مَنَازِلَ لِتَعۡلَمُوۡا عَدَدَ السِّنِیۡنَ وَ الۡحِسَابَ ؕ مَا خَلَقَ اللّٰہُ ذٰلِکَ اِلَّا بِالۡحَقِّ ۚ یُفَصِّلُ الۡاٰیٰتِ لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۶﴾", "english": " He it is Who made the sun radiate a brilliant light and the moon reflect a lustre, and ordained for it stages, that you might know the number of years and the reckoning of time . Allah has not created this but in truth. He details the Signs for a people who have knowledge.", "french": " C’est Lui Qui a fait le soleil rayonnant et la lune lustrée et Qui a décrété pour elle des phases, afin que vous sachiez le nombre des années et le calcul du temps . Allāh n’a créé ceci qu’avec la vérité. Il détaille les Signes pour des gens imbus de connaissance.", "german": " Er ist es, Der die Sonne zur Leuchte und den Mond zu einem Schimmer machte und ihm Stationen bestimmte, auf dass ihr die Anzahl der Jahre und die Berechnung kennen möchtet. Allah hat dies nicht anders denn in Weisheit geschaffen. Er legt die Zeichen einem Volke dar, das Wissen besitzt.", "spanish": " Él es Quien hizo el sol radiante y la luna brillante y ordenó sus fases, para que conocierais el número de años y el cómputo del tiempo . Al-lah no los creó sino con verdad. Él explica los Signos a los hombres que tienen conocimiento.", "urdu": " وہی ہے جس نے سورج کو ذاتی روشنی (والا) اور چاند کو نور (والا) بنایا ہے اور ایک اندازہ کے مطابق اس کی منزلیں بنائی ہیں تا کہ تمہیں سالوں کی گنتی اور حساب معلوم ہو۔ اس (سلسلہ) کو اللہ نے حق (وحکمت) کے ساتھ ہی پیدا کیا ہے وہ ان آیات کو علم والے لوگوں کے لئے تفصیل کے ساتھ بیان کرتا ہے۔"}, {"arabic": " اِنَّ فِی اخۡتِلَافِ الَّیۡلِ وَ النَّہَارِ وَ مَا خَلَقَ اللّٰہُ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ لَاٰیٰتٍ لِّقَوۡمٍ یَّتَّقُوۡنَ ﴿۷﴾", "english": " Verily, in the alternation of night and day, and in all that Allah has created in the heavens and the earth there are Signs for a God-fearing people.", "french": " En vérité, dans l’alternance de la nuit et du jour, et dans tout ce qu’Allāh a créé dans les cieux et sur la terre, il y a des Signes pour des gens qui craignent Allāh .", "german": " Wahrlich, in dem Wechsel von Nacht und Tag und in allem, das Allah in den Himmeln und auf der Erde erschaffen, sind Zeichen für ein gottesfürchtiges Volk.", "spanish": " En verdad, en la sucesión de la noche y el día, y en todo lo que Al-lah ha creado en los cielos y en la tierra hay Signos para las gentes que temen a Dios.", "urdu": " رات اور دن کے آگے پیچھے آنے اور جو کچھ اللہ نے آسمانوں اور زمین میں پیدا کیا ہے (اس میں) متقی لوگوں کے لئے یقینی طور پر بہت سے نشان ہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ لَا یَرۡجُوۡنَ لِقَآءَنَا وَ رَضُوۡا بِالۡحَیٰوۃِ الدُّنۡیَا وَ اطۡمَاَنُّوۡا بِہَا وَ الَّذِیۡنَ ہُمۡ عَنۡ اٰیٰتِنَا غٰفِلُوۡنَ ۙ﴿۸﴾", "english": " Those who look not for the meeting with Us and are content with the life of this world and feel at rest therewith, and those who are heedless of Our Signs —", "french": " Ceux qui n’aspirent pas à la rencontre avec Nous, et sont contents de la vie d’ici-bas et s’y sentent en tranquillité, et ceux qui ne se soucient pas de Nos Signes,", "german": " Die aber, die nicht auf die Begegnung mit Uns hoffen und zufrieden sind mit dem Leben in dieser Welt und sich dabei beruhigen, und die Unserer Zeichen achtlos sind –", "spanish": " Quienes no buscan el encuentro con Nosotros y están contentos con la vida de este mundo sintiéndose tranquilos con ella, y quienes no hacen caso de Nuestros Signos,", "urdu": " جو لوگ ہم سے ملنے کی امید نہیں رکھتے اور اس ورلی زندگی پر راضی ہو گئے ہیں اور اس پر انہوں نے اطمینان پکڑ لیا ہے اور (پھر) جو لوگ ہمارے نشانوں (کی طرف) سے غافل ہو گئے ہیں۔"}, {"arabic": " اُولٰٓئِکَ مَاۡوٰٮہُمُ النَّارُ بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۹﴾", "english": " It is these whose abode in Fire, because of what they earned.", "french": " Ce sont ceux-là dont l’habitation est le Feu à cause de ce qu’ils ont acquis.", "german": " sie sind es, deren Wohnstatt das Feuer ist, um dessentwillen, was sie sich erwarben.", "spanish": " Son aquellos cuya morada es el Fuego, por lo que han ganado.", "urdu": " ان (سب) کا ٹھکانا ان کی (اپنی) کمائی کی وجہ سے یقیناً (دوزخ کی) آگ ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ یَہۡدِیۡہِمۡ رَبُّہُمۡ بِاِیۡمَانِہِمۡ ۚ تَجۡرِیۡ مِنۡ تَحۡتِہِمُ الۡاَنۡہٰرُ فِیۡ جَنّٰتِ النَّعِیۡمِ ﴿۱۰﴾", "english": " But as for those who believe, and do good works — their Lord will guide them because of their faith. Rivers shall flow beneath them in the Gardens of Bliss.", "french": " Assurément, ceux qui croient et font de bonnes œuvres, leur Seigneur les guidera sur la voie du succès à cause de leur foi. Sous eux couleront des rivières dans les Jardins de la Félicité.", "german": " Jene jedoch, die da glauben und gute Werke tun, wird ihr Herr leiten um ihres Glaubens willen. Ströme werden unter ihnen hinfließen in den Gärten der Wonne.", "spanish": " Pero en cuanto a quienes creen, y hacen buenas obras, su Señor los guiará gracias a su fe. Correrán ríos debajo de ellos en los Jardines de la Felicidad.", "urdu": " جو لوگ ایمان لائے اور انہوں نے نیک (اور مناسب حال) عمل کئے انہیں ان کا رب ان کے ایمان کی وجہ سے (کامیابی کے راستہ کی طرف) ہدایت دے گا (اور) آسائش والی جنتوں میں انہی کے (تصرف کے) نیچے نہریں بہتی ہوں گی۔"}, {"arabic": " دَعۡوٰٮہُمۡ فِیۡہَا سُبۡحٰنَکَ اللّٰہُمَّ وَ تَحِیَّتُہُمۡ فِیۡہَا سَلٰمٌ ۚ وَ اٰخِرُ دَعۡوٰٮہُمۡ اَنِ الۡحَمۡدُ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ﴿٪۱۱﴾", "english": " Their prayer therein shall be, ‘Glory be to Thee, O Allah!’ and their greeting therein shall be, ‘Peace.’ And the conclusion of their prayer shall be, ‘All praise be to Allah, the Lord of the worlds.’", "french": " Là leur prière sera : « Gloire à Toi, ô Allāh ! » Et leur salutation entre eux y sera : « Paix ! » Et leur prière s’achèvera avec : « Louange à Allāh, le Seigneur des mondes. »", "german": " Ihr Ruf dort wird sein: \"Preis Dir, o Allah!\" Und ihr Gruß dort wird \"Frieden\" sein. Und zuletzt werden sie rufen: \"Aller Preis gehört Allah, dem Herrn der Welten.\"", "spanish": " Su oración en ellos será: “¡Gloria a Ti, oh Al-lah!”, y su saludo en ellos será: “¡Paz!”. Y la conclusión de su oración será: “Toda alabanza sea para Al-lah, el Señor de los mundos”.", "urdu": " ان (جنتوں) میں (خدا کے حضور) ان کی پکار (یہ) ہوگی اے اللہ! تو پاک ہے اور ان کی (ایک دوسرے کے لئے) دعا یہ ہوگی (کہ تم پر ہمیشہ کے لئے) سلامتی ہو اور سب سے آخر میں وہ بلند آواز سے یہ کہہ دیں گے کہ اللہ ہی سب تعریفوں کا مستحق ہے جو تمام جہانوں کا رب ہے۔"}, {"arabic": " وَ لَوۡ یُعَجِّلُ اللّٰہُ لِلنَّاسِ الشَّرَّ اسۡتِعۡجَالَہُمۡ بِالۡخَیۡرِ لَقُضِیَ اِلَیۡہِمۡ اَجَلُہُمۡ ؕ فَنَذَرُ الَّذِیۡنَ لَا یَرۡجُوۡنَ لِقَآءَنَا فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۱۲﴾", "english": " And if Allah were to hasten for men the ill they have earned as they would hasten on the acquisition of wealth, the end of their term of life would have been already brought upon them. But We leave those who look not for the meeting with Us to wander distractedly in their transgression.", "french": " Et si Allāh hâtait pour les hommes la rétribution de leurs méchanceté autant qu’ils voudraient hâter la fortune, ils seraient déjà arrivés à leur terme de vie. Mais Nous laissons ceux qui n’espèrent pas la rencontre avec Nous errer comme des fous dans leur transgression.", "german": " Wenn Allah den Menschen das Schlimme beschleunigte, wie sie das Reichwerden beschleunigen möchten, so wäre ihre Lebensfrist schon um. Allein Wir lassen die, welche nicht auf die Begegnung mit Uns hoffen, ziellos irregehen in ihrer Verblendung.", "spanish": " Pero si Al-lah tuviera que apresurar para los hombres el mal que se han ganado, como ellos se apresuran a la adquisición de la riqueza, les habría llegado ya el fin de su plazo de vida. Mas dejamos que quienes no esperan el encuentro con Nosotros vaguen distraídamente en su transgresión.", "urdu": " اور اگر اللہ لوگوں پر (ان کے اعمال کی) بدی (کا نتیجہ) ان کے مال کو جلد چاہنے کی طرح جلد وارد کرتا تو ان کی (زندگی کے اختتام کی) میعاد ان پر لائی جا چکی ہوتی۔ (مگر چونکہ ہم نے ایسا پسند نہیںکیا) اس لئے ہم ان لوگوں کو جو ہماری ملاقات کی امید نہیں رکھتے اس حالت میں چھوڑ رہے ہیں کہ وہ اپنی سرکشی میں سرگرداں پھر رہے ہیں۔"}, {"arabic": " وَ اِذَا مَسَّ الۡاِنۡسَانَ الضُّرُّ دَعَانَا لِجَنۡۢبِہٖۤ اَوۡ قَاعِدًا اَوۡ قَآئِمًا ۚ فَلَمَّا کَشَفۡنَا عَنۡہُ ضُرَّہٗ مَرَّ کَاَنۡ لَّمۡ یَدۡعُنَاۤ اِلٰی ضُرٍّ مَّسَّہٗ ؕ کَذٰلِکَ زُیِّنَ لِلۡمُسۡرِفِیۡنَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۳﴾", "english": " And when trouble befalls a man, he calls on Us, lying on his side, or sitting, or standing; but when We have removed his trouble from him, he goes his way as though he had never called on Us for the removal of the trouble that befell him. Thus it is that the doings of the extravagant are given a fair appearance in their eyes.", "french": " Et lorsque l’affliction frappe un homme, il fait appel à Nous allongé sur le côté ou assis ou debout ; mais lorsque Nous l’avons délivré de sa détresse, il s’en va comme s’il ne Nous avait jamais imploré de Nous pencher sur la misère qui l’affligeait. C’est ainsi que les actions des extravagants ont été rendues attrayantes à leurs yeux.", "german": " Wenn den Menschen Unheil trifft, ruft er Uns an, ob er nun auf der Seite liege oder sitze oder stehe; haben Wir aber sein Unheil von ihm fortgenommen, dann geht er seines Weges, als hätte er Uns nie angerufen um (Befreiung vom) Unheil, das ihn getroffen. Also wird den Maßlosen ihr Tun schön gemacht.", "spanish": " Y cuando la desgracia cae sobre un hombre, Nos invoca, echado sobre su costado, sentado o de pie; pero cuando le libramos de su desgracia, se aleja como si nunca hubiera Nos hubiera suplicado para salvarlo de la desdicha que le afligía. De este modo es como las acciones de los extravagantes se les hace aparecer justas ante sus ojos.", "urdu": " اور جب انسان کو تکلیف پہنچتی ہے تو وہ اپنے پہلو کے بل (لیٹا ہوا) یا بیٹھا ہوا یا کھڑا ہوا ہمیں پکارتا ہے۔ پھر جب ہم اس کی تکلیف کو اس سے دور کر دیتے ہیں تو وہ (اس طرح سے کتراکر) گذر جاتا ہے (کہ) گویا اس نے کسی تکلیف (کے دور کرنے) کے لئے جو اسے پہنچی تھی ہمیں پکارا ہی نہیں تھا۔ اسی طرح تمام حد سے بڑھ جانے والوں کو جو کچھ وہ کیا کرتے ہیں خوبصورت کرکے دکھلایا گیا ہے۔"}, {"arabic": " وَ لَقَدۡ اَہۡلَکۡنَا الۡقُرُوۡنَ مِنۡ قَبۡلِکُمۡ لَمَّا ظَلَمُوۡا ۙ وَ جَآءَتۡہُمۡ رُسُلُہُمۡ بِالۡبَیِّنٰتِ وَ مَا کَانُوۡا لِیُؤۡمِنُوۡا ؕ کَذٰلِکَ نَجۡزِی الۡقَوۡمَ الۡمُجۡرِمِیۡنَ ﴿۱۴﴾", "english": " And We destroyed the generations before you when they did wrong; and there came to them their Messengers with clear Signs, but they would not believe. Thus do We requite the guilty people.", "french": " Et Nous avons détruit plusieurs générations avant vous lorsqu’elles transgressèrent et alors que leurs Messagers leur avaient apporté avant cela des Signes manifestes ; mais elles ne voulurent pas croire. Ainsi récompensons-Nous les coupables.", "german": " Und Wir vernichteten viele Geschlechter vor euch, als sie frevelten; denn es kamen zu ihnen ihre Gesandten mit deutlichen Zeichen, sie aber wollten nicht glauben. Also vergelten Wir dem sündigen Volk.", "spanish": " Y destruimos a muchas generaciones que os precedieron cuando transgredieron; a pesar de que anteriormente les llegaran Mensajeros con Signos claros, pero no quisieron creer­­­. De este modo castigamos a las gentes culpables.", "urdu": " اور ہم یقینی طور پر تم سے پہلے (بھی) قوموں کے بعد قوموں کو جبکہ انہوں نے باوجود اس کے کہ ان کے پاس ان کے رسول کھلے نشان لے کر آئے تھے ظلم کیا تھا اور ایمان نہ لائے تھے ہلاک کر چکے ہیں ہم مجرم لوگوں کو اسی طرح بدلہ دیا کرتے ہیں۔"}, {"arabic": " ثُمَّ جَعَلۡنٰکُمۡ خَلٰٓئِفَ فِی الۡاَرۡضِ مِنۡۢ بَعۡدِہِمۡ لِنَنۡظُرَ کَیۡفَ تَعۡمَلُوۡنَ ﴿۱۵﴾", "english": " Then, We made you their successors in the earth after them, that We might see how you would act.", "french": " Ensuite, Nous avons fait de vous des successeurs sur la terre, après eux, pour voir comment vous agiriez.", "german": " Danach machten Wir euch zu ihren Nachfolgern auf der Erde, auf dass Wir sähen, wie ihr handeln würdet.", "spanish": " A continuación, os convertimos en sucesores en la tierra, tras ellos, para poder observar cómo os comportabais.", "urdu": " پھر ان کے بعد ہم نے تمہیں زمین میں (ان کا) جانشین بنایا‘ تا کہ ہم دیکھیں کہ تم کیسے عمل کرتے ہو۔"}, {"arabic": " وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیَاتُنَا بَیِّنٰتٍ ۙ قَالَ الَّذِیۡنَ لَا یَرۡجُوۡنَ لِقَآءَنَا ائۡتِ بِقُرۡاٰنٍ غَیۡرِ ہٰذَاۤ اَوۡ بَدِّلۡہُ ؕ قُلۡ مَا یَکُوۡنُ لِیۡۤ اَنۡ اُبَدِّلَہٗ مِنۡ تِلۡقَآیِٔ نَفۡسِیۡ ۚ اِنۡ اَتَّبِعُ اِلَّا مَا یُوۡحٰۤی اِلَیَّ ۚ اِنِّیۡۤ اَخَافُ اِنۡ عَصَیۡتُ رَبِّیۡ عَذَابَ یَوۡمٍ عَظِیۡمٍ ﴿۱۶﴾", "english": " And when Our clear Signs are recited unto them, those who look not for the meeting with Us say, ‘Bring a Qur’an other than this or change it.’ Say, ‘It is not for me to change it of my own accord. I only follow what is revealed to me. Indeed, I fear, if I disobey my Lord, the punishment of an awful day.’", "french": " Et quand leur sont récités Nos Signes manifestes, ceux qui n’espèrent pas la rencontre avec Nous disent : « Apporte un Coran autre que celui-ci ou change-le. » Réponds : « Ce n’est pas à moi de le changer de ma propre autorité. Je ne fais que suivre ce qui m’est révélé. En vérité, je crains, si je désobéissais à mon Seigneur, le châtiment d’un Jour Énorme. »", "german": " Und wenn Unsere deutlichen Zeichen ihnen vorgetragen werden, sagen jene, die nicht auf die Begegnung mit Uns hoffen: \"Bring einen anderen Qur-ân als diesen oder ändere ihn.\" Sprich: \"Es steht mir nicht zu, ihn aus eigenem Antrieb zu ändern. Ich folge nur dem, was mir offenbart ward. Ich befürchte, falls ich meinem Herrn ungehorsam bin, die Strafe eines schrecklichen Tags.\"", "spanish": " Y cuando se les recitan Nuestros Signos claros, los que no esperan la reunión con Nosotros, dicen: “Trae un Corán distinto a éste o cámbialo”. Diles: “No me corresponde a mí cambiarlo por mi propia voluntad. Yo sólo sigo lo que se me ha revelado. En verdad, si desobedezco a mi Señor, temo el castigo del día Inmenso”.", "urdu": " اور جب انہیں ہماری روشن آیات پڑھ کر سنائی جاتی ہیں تو جو لوگ ہمارے ملنے کی امید نہیں رکھتے وہ کہہ دیتے ہیں کہ (اے محمد)! تو اس کے سوا کوئی اور قرآن لے آ۔ یا اس میں (ہی کچھ) تغیر (وتبدل) کر دے۔ تو (انہیں) کہہ (کہ یہ) میرا کام نہیں کہ میں اس میں اپنی طرف سے (کوئی) تغیر (وتبدل) کردوں۔ میں (تو) جو (کچھ) مجھ پر وحی (سے حکم نازل) کیا جاتا ہے‘ اسی کی پیروی کرتا ہوں اور اگر میں اپنے رب کی نافرمانی کروں تو میں ایک بڑے (ہولناک) دن کے عذاب سے ڈرتا ہوں (کہ مجھے نہ آپکڑے) ۔"}, {"arabic": " قُلۡ لَّوۡ شَآءَ اللّٰہُ مَا تَلَوۡتُہٗ عَلَیۡکُمۡ وَ لَاۤ اَدۡرٰٮکُمۡ بِہٖ ۫ۖ فَقَدۡ لَبِثۡتُ فِیۡکُمۡ عُمُرًا مِّنۡ قَبۡلِہٖ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۱۷﴾", "english": " Say, ‘If Allah had so willed, I should not have recited it to you nor would He have made it known to you. I have indeed lived among you a whole lifetime before this. Will you not then understand?’", "french": " Dis : « Si Allāh l’avait voulu, je ne vous l’aurais pas récité, et Il ne vous l’aurait pas non plus fait connaître. Avant ceci, j’ai certainement passé toute une vie parmi vous. Ne voulez-vous donc pas comprendre ? »", "german": " Sprich: \"Hätte Allah es gewollt, so hätte ich ihn euch nicht vorgetragen, noch hätte Er ihn euch kundgemacht. Ich habe doch fürwahr ein Menschenalter unter euch gelebt vor diesem. Wollt ihr denn nicht begreifen?\"", "spanish": " Diles: “Si Al-lah hubiese querido, no os lo habría recitado ni os lo habría dado a conocer. En verdad, he vivido entre vosotros una vida antes de esto. ¿No queréis comprender?”.", "urdu": " (اور) تو (انہیں) کہہ کہ اگر اللہ کی (یہی) مشیت ہوتی (کہ اس کی جگہ کوئی اور تعلیم دی جائے) تو میں اسے تمہارے سامنے پڑھ کر نہ سناتا اور نہ وہ (ہی) تمہیں اس (تعلیم) سے آگاہ کرتا۔ چنانچہ اس سے پہلے میں ایک عرصہ دراز تم میں گزار چکا ہوں کیا پھر (بھی) تم عقل سے کام نہیں لیتے۔"}, {"arabic": " فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا اَوۡ کَذَّبَ بِاٰیٰتِہٖ ؕ اِنَّہٗ لَا یُفۡلِحُ الۡمُجۡرِمُوۡنَ ﴿۱۸﴾", "english": " Who is then more unjust than he who forges a lie against Allah or he who treats His Signs as lies? Surely, the guilty shall never prosper.", "french": " Qui, donc, est plus injuste de la façon la plus flagrante que celui qui invente un mensonge contre Allāh, ou celui qui traite Ses Signes de mensonges ? Assurément, les coupables ne prospéreront jamais.", "german": " Wer ist wohl sündiger als jeiner, der eine Lüge wider Allah erdichtet oder Seine Zeichen als Lügen behandelt? Wahrlich, die Schuldigen haben keinen Erfolg.", "spanish": " ¿Quién viola la justicia de manera mas flagrante que quien trama una mentira contra Al-lah o quien trata a Sus Signos como mentiras? En verdad, el culpable nunca prosperará.", "urdu": " پھر (تم ہی بتاٶ کہ) جو اللہ پر بہتان باندھے یا اس کے نشانات کو جھٹلائے اس سے بڑھ کر کون ظالم ہوگا (غرض) یہ یقینی بات ہے کہ مجرم لوگ کامیاب نہیں ہوتے۔"}, {"arabic": " وَ یَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ مَا لَا یَضُرُّہُمۡ وَ لَا یَنۡفَعُہُمۡ وَ یَقُوۡلُوۡنَ ہٰۤؤُلَآءِ شُفَعَآؤُنَا عِنۡدَ اللّٰہِ ؕ قُلۡ اَتُنَبِّـُٔوۡنَ اللّٰہَ بِمَا لَا یَعۡلَمُ فِی السَّمٰوٰتِ وَ لَا فِی الۡاَرۡضِ ؕ سُبۡحٰنَہٗ وَ تَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿۱۹﴾", "english": " And they worship, instead of Allah, that which neither harms them nor profits them; and they say, ‘These are our intercessors with Allah.’ Say, ‘Would you inform Allah of something He knows not in the heavens or in the earth?’ Holy is He, and high exalted above all that which they associate with Him .", "french": " Et ils adorent, à la place d’Allāh, ce qui ne peut ni leur nuire, ni leur profiter ; et ils disent : « Ce sont là nos intercesseurs auprès d’Allāh. « Dis : « Informerez-vous Allāh de ce qu’Il ne sait pas dans les cieux et sur la terre ? » Saint est-Il et exalté bien au-dessus de ce qu’ils Lui associent.", "german": " Sie verehren statt Allah das, was ihnen weder schaden noch nützen kann; und sie sagen: \"Das sind unsere Fürsprecher bei Allah.\" Sprich: \"Wollt ihr Allah von etwas Nachricht geben, was Er nicht kennt in den Himmeln oder auf der Erde?\" Heilig ist Er und hoch erhaben über das, was sie anbeten.", "spanish": " Mas en lugar de Al-lah, oran a quienes ni les perjudican ni les benefician; y dicen: “éstos son nuestros intercesores ante Al-lah”. Diles: “¿acaso informaríais a Al-lah de algo que Él desconozca en los cielos y en la tierra?”. ¡Glorioso es Él! Está elevado muy por encima de lo que Le asocian.", "urdu": " اور یہ (لوگ) اللہ کو چھوڑ کر ایسی چیز کی پرستش کرتے ہیں جو نہ انہیں نقصان دیتی ہے اور نہ نفع پہنچاتی ہے اور کہتے ہیں (کہ) یہ (ہمارے معبود) اللہ کے حضور میں ہمارے شفیع ہیں۔ تو (انہیں) کہہ (کہ) کیا تم اللہ کو وہ (بات) بتاتے ہو جس کے متعلق نہ آسمانوں میں (پائے جانے کا) اسے علم ہے اور نہ (ہی) زمین میں (کہیں اس کے وجود کا کوئی پتا ہے) وہ پاک ہے اور ان کے شریک ٹھہرانے سے وہ بالاتر ہے۔"}, {"arabic": " وَ مَا کَانَ النَّاسُ اِلَّاۤ اُمَّۃً وَّاحِدَۃً فَاخۡتَلَفُوۡا ؕ وَ لَوۡ لَا کَلِمَۃٌ سَبَقَتۡ مِنۡ رَّبِّکَ لَقُضِیَ بَیۡنَہُمۡ فِیۡمَا فِیۡہِ یَخۡتَلِفُوۡنَ ﴿۲۰﴾", "english": " And mankind were but one community, then they differed among themselves ; and had it not been for a word that had gone before from thy Lord, it would have already been judged between them concerning that in which they differed.", "french": " Et les hommes ne formaient autrefois qu’une seule communauté, mais par la suite, ils ont divergé entre eux ; et si ce n’était un décret que ton Seigneur avait déjà prononcé, leur sort aurait déjà été décidé conformément à ce sur quoi ils différaient.", "german": " Die Menschen waren einst nur eine einzige Gemeinde, dann aber wurden sie uneins; und wäre nicht ein Wort vorausgegangen von deinem Herrn, es wäre schon entschieden worden über das, darob sie uneins waren.", "spanish": " La humanidad no era más que una sola comunidad, pero más tarde discreparon , y de no haber sido por una palabra que había sido enviada antes por tu Señor, su suerte habría quedado marcada de acuerdo con todo lo que disintieron.", "urdu": " اور (تمام) لوگ ایک ہی گروہ (بنے ہوئے) تھے۔ پھر انہوں نے آپس میں اختلاف (پیدا) کر لیا اور جو بات تیرے رب کی طرف سے پہلے (بصورت وعدہ) آچکی ہے اگر وہ (مانع) نہ ہوتی تو جس (امر) میں وہ اختلاف کر رہے ہیں اس کے متعلق ان کے درمیان (کبھی کا) فیصلہ (صادر) کیا جا چکا ہوتا۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ لَوۡ لَاۤ اُنۡزِلَ عَلَیۡہِ اٰیَۃٌ مِّنۡ رَّبِّہٖ ۚ فَقُلۡ اِنَّمَا الۡغَیۡبُ لِلّٰہِ فَانۡتَظِرُوۡا ۚ اِنِّیۡ مَعَکُمۡ مِّنَ الۡمُنۡتَظِرِیۡنَ ﴿٪۲۱﴾", "english": " And they say, ‘Why has not a Sign been sent down to him from his Lord?’ Say, ‘The unseen belongs only to Allah. So wait; I am with you among those who wait.’", "french": " Et ils disent : « Pourquoi un Signe de son Seigneur n’est-il pas descendu sur lui ? » Dis : « La connaissance de l’invisible appartient à Allāh. Attendez donc. En vérité, je suis avec vous parmi ceux qui attendent. »", "german": " Und sie sagen: \"Warum ist nicht ein Zeichen zu ihm herabgesandt worden von seinem Herrn?\" Sprich: \"Das Verborgene ist Allahs allein. Drum wartet; siehe, ich warte auch mit euch.\"", "spanish": " Y dicen: “¿Por qué no se le ha enviado un Signo de su Señor?”. Diles: “a Al-lah pertenece lo invisible. Esperad, pues, estoy con vosotros entre los que esperan”.", "urdu": " اور وہ کہتے ہیں کہ اس (رسول) پر اس کے رب کی طرف سے کوئی نشان کیوں نہیں اتارا گیا تو (انہیں) کہہ (کہ) ہر غیب (کی بات کا علم) اللہ ہی کو حاصل ہے اس لئے تم (اس کا) انتظار کرو‘ میں (بھی) تمہارے ساتھ انتظار کرنے والوں میں سے ہوں۔"}, {"arabic": " وَ اِذَاۤ اَذَقۡنَا النَّاسَ رَحۡمَۃً مِّنۡۢ بَعۡدِ ضَرَّآءَ مَسَّتۡہُمۡ اِذَا لَہُمۡ مَّکۡرٌ فِیۡۤ اٰیَاتِنَا ؕ قُلِ اللّٰہُ اَسۡرَعُ مَکۡرًا ؕ اِنَّ رُسُلَنَا یَکۡتُبُوۡنَ مَا تَمۡکُرُوۡنَ ﴿۲۲﴾", "english": " And when We make people taste of mercy after adversity has touched them, behold, they begin to plan against Our Signs. Say, ‘Allah is swifter in planning.’ Surely, Our messengers write down all that you plan.", "french": " Dès que Nous faisons goûter une miséricorde à un peuple accablé par la calamité, et voilà qu’ils se mettent à tramer contre Nos Signes. Dis : « Allāh est bien plus prompt à faire des plans. » Assurément, Nos messagers tiennent un registre de ce que vous tramez.", "german": " Und wenn Wir die Menschen Barmherzigkeit kosten lassen, nachdem Unheil sie betroffen, siehe, sie beginnen, wider Unsere Zeichen Anschläge zu schmieden. Sprich: \"Allah ist schneller im Anschlag.\" Unsere Gesandten schreiben alles nieder, was ihr an Anschlägen plant.", "spanish": " En el momento en que hacemos probar Nuestra misericordia a la gente que ha sido afligida con la adversidad, comienzan inmediatamente a tramar contra Nuestros Signos. Diles: “Al-lah es más rápido en hacer proyectos”. En verdad, Nuestros Mensajeros toman nota de lo que conspiráis.", "urdu": " اور جب لوگوں کو کسی تکلیف کے بعد جو انہیں پہنچی ہو ہم (کسی قدر اپنی) رحمت (کا مزہ) چکھاتے ہیں تو جھٹ ہمارے نشانوں کے متعلق ان کی طرف سے کوئی (نہ کوئی مخالفانہ) تدبیر ہونے لگتی ہے۔ تو (انہیں) کہہ (کہ اس کے مقابل پر) اللہ کی تدبیر تو بہت ہی جلد (کارگر) ہوا کرتی ہے (اور) تم جو تدابیر (بھی) کرتے ہو ہمارے فرستادے انہیں لکھتے رہتے ہیں۔"}, {"arabic": " ہُوَ الَّذِیۡ یُسَیِّرُکُمۡ فِی الۡبَرِّ وَ الۡبَحۡرِ ؕ حَتّٰۤی اِذَا کُنۡتُمۡ فِی الۡفُلۡکِ ۚ وَ جَرَیۡنَ بِہِمۡ بِرِیۡحٍ طَیِّبَۃٍ وَّ فَرِحُوۡا بِہَا جَآءَتۡہَا رِیۡحٌ عَاصِفٌ وَّ جَآءَہُمُ الۡمَوۡجُ مِنۡ کُلِّ مَکَانٍ وَّ ظَنُّوۡۤا اَنَّہُمۡ اُحِیۡطَ بِہِمۡ ۙ دَعَوُا اللّٰہَ مُخۡلِصِیۡنَ لَہُ الدِّیۡنَ ۬ۚ لَئِنۡ اَنۡجَیۡتَنَا مِنۡ ہٰذِہٖ لَنَکُوۡنَنَّ مِنَ الشّٰکِرِیۡنَ ﴿۲۳﴾", "english": " He it is Who enables you to journey through land and sea until, when you are on board the ships and they sail with them with a fair breeze and they rejoice in it, there overtakes them (the ships) a violent wind and the waves come on them from every side and they think they are encompassed, then they call upon Allah, purifying their religion for Him, saying , ‘If Thou deliver us from this, we will surely be of the thankful.’", "french": " C’est Lui Qui vous permet de voyager sur terre et sur mer, jusqu’au moment où, lorsque vous êtes à bord des navires et qu’ils voguent avec eux, poussés par une brise favorable et qu’ils s’en réjouissent, un vent féroce les surprend ; et les vagues déferlent sur eux de tous côtés et ils croient qu’ils sont cernés par une mort certaine , alors ils en appellent à Allāh, promettant d’être sincères dans leur foi en Lui en disant : « Si Tu nous sauves de ceci, nous serons certainement parmi les reconnaissants. »", "german": " Er ist es, Der euch instand setzt, über Land und Meer zu reisen, bis endlich, wenn ihr an (Bord) der Schiffe seid – und sie mit ihnen dahinsegeln mit gutem Wind und sie freuen sich dessen, da erfasst sie plötzlich ein Sturm, und die Wogen kommen über sie von allen Seiten, und sie meinen schon, sie seien rings umschlossen – dann rufen sie zu Allah in lauterem Gehorsam gegen Ihn: \"Wenn Du uns aus diesem errettest, so werden wir sicherlich unter den Dankbaren sein.\"", "spanish": " Él es Quien os permite viajar por tierra y por mar hasta que, cuando estáis a bordo de los buques y éstos navegan con una brisa agradable y se alegran con ella entonces les alcanza un viento tempestuoso las olas caen sobre ellos de todas partes y piensan haber sido rodeados, entonces invocan a Al-lah, prometiendo la sinceridad de su fe en Él, diciendo: “Si nos libras de esto, ciertamente seremos de los agradecidos”.", "urdu": " وہ (خدائے کریم) ہی ہے جو تمہیں (توفیق دیکر) خشکی اور تری میں چلاتا ہے۔ یہاں تک کہ جب تم لوگ کشتیوں میں (سوار) ہوتے ہو اور وہ عمدہ ہوا کے ذریعہ سے ان (لوگوں) کو بھی لیکر چل رہی ہوتی ہیں اور وہ ان پر اِترا رہے ہوتے ہیں تو ان پر ایک (تندو) تیز ہوا آجاتی ہے اور ہر طرف سے موج (پر موج) ان پر (چڑھ) آتی ہے اور وہ سمجھنے لگتے ہیں کہ (اب) وہ ہلاکت (کے منہ) میں آگئے ہیں تو (ایسے وقت میں) وہ (اپنی) اطاعت کو خدا کے لئے خالص کرتے ہوئے اس کو پکارتے ہیں (اور کہتے ہیں کہ اے اللہ)! اگر تو نے ہمیں اس (مصیبت) سے نجات دی تو ہم ضرور ہی (تیرے) شکر گذاروں (کے زمرہ) میں (داخل) ہو جائیں گے۔"}, {"arabic": " فَلَمَّاۤ اَنۡجٰہُمۡ اِذَا ہُمۡ یَبۡغُوۡنَ فِی الۡاَرۡضِ بِغَیۡرِ الۡحَقِّ ؕ یٰۤاَیُّہَا النَّاسُ اِنَّمَا بَغۡیُکُمۡ عَلٰۤی اَنۡفُسِکُمۡ ۙ مَّتَاعَ الۡحَیٰوۃِ الدُّنۡیَا ۫ ثُمَّ اِلَیۡنَا مَرۡجِعُکُمۡ فَنُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۲۴﴾", "english": " But when He has delivered them, lo! they begin to commit excesses in the earth wrongfully. O ye men, your excesses are only against your own selves. Have the enjoyment of the present life. Then to Us shall be your return; and We will inform you of what you used to do.", "french": " Mais lorsqu’Il les a sauvés, voilà qu’ils se mettent à commettre des excès sur la terre avec iniquité. Ô hommes, vos excès ne nuisent qu’à vous-mêmes – une simple jouissance de la vie d’ici-bas. Ensuite, c’est auprès de Nous que sera votre retour ; et Nous vous informerons de ce que vous aviez l’habitude de faire.", "german": " Doch wenn Er sie dann errettet hat, siehe, schon beginnen sie, wieder Gewalt auf Erden zu verüben ohne Recht. O ihr Menschen, eure Gewalttat richtet sich nur gegen euch selbst. (Genießet) die Gaben des Lebens hienieden. Zu Uns soll dann eure Heimkehr sein, dann werden Wir euch ankünden, was ihr gewirkt.", "spanish": " Pero cuando Él los ha librado, he ahí que empiezan a cometer excesos injustos en la tierra. ¡Oh humanos! vuestros excesos sólo son contra vosotros mismos: un mero placer de la vida presente. Después volveréis a Nosotros; y os informaremos de lo que solíais hacer.", "urdu": " پھر جب وہ انہیں (اس عذاب سے) نجات دیکر خشکی پر پہنچاتا ہے تو وہ جھٹ زمین میں ناحق سرکشی کرنے لگتے ہیں (اے لوگو)! تمہارا صرف ورلی زندگی کو چاہنا تمہارے نفسوں پر (وبال بن کر) پڑے گا۔ پھر ہماری طرف تمہاری واپسی ہوگی۔ تب جو (کچھ کہ) تم کرتے رہے ہوگے‘ ہم اس سے تمہیں آگاہ کریں گے۔"}, {"arabic": " اِنَّمَا مَثَلُ الۡحَیٰوۃِ الدُّنۡیَا کَمَآءٍ اَنۡزَلۡنٰہُ مِنَ السَّمَآءِ فَاخۡتَلَطَ بِہٖ نَبَاتُ الۡاَرۡضِ مِمَّا یَاۡکُلُ النَّاسُ وَ الۡاَنۡعَامُ ؕ حَتّٰۤی اِذَاۤ اَخَذَتِ الۡاَرۡضُ زُخۡرُفَہَا وَ ازَّیَّنَتۡ وَ ظَنَّ اَہۡلُہَاۤ اَنَّہُمۡ قٰدِرُوۡنَ عَلَیۡہَاۤ ۙ اَتٰہَاۤ اَمۡرُنَا لَیۡلًا اَوۡ نَہَارًا فَجَعَلۡنٰہَا حَصِیۡدًا کَاَنۡ لَّمۡ تَغۡنَ بِالۡاَمۡسِ ؕ کَذٰلِکَ نُفَصِّلُ الۡاٰیٰتِ لِقَوۡمٍ یَّتَفَکَّرُوۡنَ ﴿۲۵﴾", "english": " The likeness of the present life is only as water which We send down from the clouds, then there mingles with it the produce of the earth, of which men and cattle eat till, when the earth receives its ornature and looks beautiful and its owners think that they have power over it, there comes to it Our command by night or by day and We render it a field that is mown down, as if nothing had existed there the day before. Thus do We expound the Signs for a people who reflect.", "french": " La similitude de la vie sur terre est comme l’eau : Nous l’avons fait descendre du ciel et avec elle se mélange la végétation de la terre, dont se nourrissent les hommes et les bestiaux. Il continue à en être ainsi jusqu’à ce que la terre se soit revêtue de toute sa parure et soit devenue extrêmement belle – et ceux qui en sont propriétaires s’imaginent qu’ils détiennent le pouvoir total sur elle. Alors, soudainement de nuit ou de jour, descend sur elle Notre décret. Et Nous la transformons en un champ complètement fauché, comme si elle n’existait pas la veille. C’est ainsi que Nous expliquons les Signes pour un peuple qui réfléchit.", "german": " Das Gleichnis des irdischen Lebens ist nur wie das Wasser, das Wir herabsenden aus den Wolken; dann vermischen sich damit die Gewächse der Erde, davon Mensch und Vieh sich nähren, bis dass – wenn die Erde ihren Schmuck empfängt und schön geputzt erscheint und ihre Bewohner glauben, sie hätten Macht über sie – Unser Befehl zu ihr kommt in der Nacht oder am Tag und Wir sie zu einem niedergemähten Acker machen, als habe sie nicht gediehen am Tag zuvor. Also machen Wir die Zeichen klar für ein Volk, das nachzudenken vermag.", "spanish": " El ejemplo de la vida presente es como el del agua que hacemos descender del cielo; con ella se mezcla la vegetación de la tierra, de la que participan los hombres y el ganado. Así continúa ocurriendo hasta que la tierra florece plenamente y madura en belleza. Entonces quienes la poseen se sienten dueños de ella; pero entonces viene Nuestro designio, de noche o de día, y la convertimos en un campo segado, como si nada hubiese existido en ella el día anterior. Así exponemos los Signos para las gentes que reflexionan.", "urdu": " اس ورلی زندگی کی حالت (تو) اس پانی کی طرح ہے‘ جسے ہم نے بادل سے برسایا‘ پھر اس کے ساتھ زمین کی روئیدگی جسے آدمی اور چارپائے کھاتے ہیں مل (کر یک جان ہو) گئی۔ یہاں تک کہ جب زمین نے (اس کے ذریعہ سے) اپنی کمال درجہ کی زینت کو پالیا ور خوب صورت ہوگئی اور اس کے مالکوں نے سمجھ لیا کہ (اب) وہ اس پر قابو یافتہ ہیں تو اس پر دن یا رات کو (عذاب کے متعلق) ہمارا حکم آگیا۔ اور ہم نے اسے ایک کٹے ہوئے کھیت کی طرح کر دیا گویا یہاں کل (کچھ) تھا (ہی) نہیں۔ (غرض) جو لوگ سوچ سے کام لیتے ہیں ان کے لئے ہم اسی طرح (اپنی) آیات کو کھول کر بیان کرتے ہیں۔"}, {"arabic": " وَ اللّٰہُ یَدۡعُوۡۤا اِلٰی دَارِ السَّلٰمِ ؕ وَ یَہۡدِیۡ مَنۡ یَّشَآءُ اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۲۶﴾", "english": " And Allah calls to the abode of peace, and guides whom He pleases to the straight path.", "french": " Et Allāh appelle vers la Demeure de la paix et guide qui Il veut vers un droit chemin.", "german": " Und Allah lädt zur Wohnstatt des Friedens und leitet, wen Er will, auf den geraden Weg.", "spanish": " Pues Al-lah llama a la morada de la paz, y guía a quien desea por el camino recto.", "urdu": " اور اللہ سلامتی کے گھر کی طرف بلاتا ہے اور جسے پسند کرتا ہے (اسے) ایک سیدھی راہ پر چلا (کر منزل مقصود تک پہنچا) دیتا ہے۔"}, {"arabic": " لِلَّذِیۡنَ اَحۡسَنُوا الۡحُسۡنٰی وَ زِیَادَۃٌ ؕ وَ لَا یَرۡہَقُ وُجُوۡہَہُمۡ قَتَرٌ وَّ لَا ذِلَّۃٌ ؕ اُولٰٓئِکَ اَصۡحٰبُ الۡجَنَّۃِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۲۷﴾", "english": " For those who do good deeds, there shall be the best reward and yet more blessings . And neither darkness nor ignominy shall cover their faces. It is these who are the inmates of Heaven; therein shall they abide.", "french": " Pour ceux qui font de bonnes œuvres, il y aura la meilleure récompense et davantage de bénédictions. Et ni l’obscurité ni l’ignominie ne leur couvriront le visage. Ceux-là seront les habitants du Paradis, et ils y demeureront éternellement.", "german": " Denen, die Gutes tun, soll der beste (Lohn) werden, und noch mehr. Weder Dunkel noch Schmach soll ihr Antlitz bedecken. Sie sind die Bewohner des Himmels; darin werden sie ewig weilen.", "spanish": " Para quienes hacen buenas obras, habrá la mejor recompensa y bendiciones aún mayores . Y sus rostros no quedarán cubiertos por las sombras ni serán humillados. Son éstos los moradores del Cielo; en él habitarán.", "urdu": " ان لوگوں کے لئے جنہوں نے نیکو کاری اختیار کی بہترین انجام ہوگا اور (اس پر) مزید (انعامات بھی)ـــ-- ان کے چہروں پر نہ غبار چھائے گا اور نہ ذلت (کے آثار ہوں گے) یہ لوگ جنت کے مکین ہیں (اور) اس میں رہتے چلے جائیں گے۔"}, {"arabic": " وَ الَّذِیۡنَ کَسَبُوا السَّیِّاٰتِ جَزَآءُ سَیِّئَۃٍۭ بِمِثۡلِہَا ۙ وَ تَرۡہَقُہُمۡ ذِلَّۃٌ ؕ مَا لَہُمۡ مِّنَ اللّٰہِ مِنۡ عَاصِمٍ ۚ کَاَنَّمَاۤ اُغۡشِیَتۡ وُجُوۡہُہُمۡ قِطَعًا مِّنَ الَّیۡلِ مُظۡلِمًا ؕ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۲۸﴾", "english": " And as for those who do evil deeds, the punishment of an evil shall be the like thereof, and ignominy shall cover them. They shall have none to protect them against Allah. And they shall look as if their faces had been covered with dark patches of night. It is these who are the inmates of the Fire; therein shall they abide.", "french": " Et quant à ceux qui font de mauvaises actions, le châtiment d’un mal sera un mal égal, et l’humiliation les couvrira. Ils n’auront personne pour les protéger contre Allāh. Et ils paraîtront comme si leur visage était couvert de sombres taches de nuit. Ceux-là seront les habitants du Feu, et ils y demeureront longtemps.", "german": " Die aber Böses tun – Strafe für eine böse Tat ist in gleichem Maße. Schmach wird sie bedecken; keinen Schützer werden sie haben vor Allah (und es soll sein), als ob ihre Angesichter verhüllt wären mit finsteren Nachtfetzen. Sie sind die Bewohner des Feuers; darin müssen sie bleiben.", "spanish": " En cuanto a quienes cometan malas acciones, el castigo de la maldad será similar a ella, y quedarán cubiertos por la humillación. No tendrán a nadie que les proteja contra Al-lah. Y parecerá como si sus rostros hubiesen sido cubiertos con lóbregos jirones de la noche. Éstos son los habitantes del Fuego; en él morarán.", "urdu": " اور جنہوں نے بدیاں کی ہوں گی (ان کے لئے) بدی کا بدلہ اس (بدی کے) برابر ہوگا اور انہیں ذلت پہنچے گی اور کوئی بھی انہیں اللہ (کے عذاب) سے بچانے والا نہیں ہوگا (اور ان کی حالت ایسی ہوگی) گویا ان کے مونہوں پر رات کے کئی (کئی) تاریک ٹکڑے ڈال دئے گئے ہیں۔ یہ (لوگ) آگ (میں رہنے) والے ہیں۔ اس میں لمبے عرصہ تک رہتے چلے جائیں گے۔"}, {"arabic": " وَ یَوۡمَ نَحۡشُرُہُمۡ جَمِیۡعًا ثُمَّ نَقُوۡلُ لِلَّذِیۡنَ اَشۡرَکُوۡا مَکَانَکُمۡ اَنۡتُمۡ وَ شُرَکَآؤُکُمۡ ۚ فَزَیَّلۡنَا بَیۡنَہُمۡ وَ قَالَ شُرَکَآؤُہُمۡ مَّا کُنۡتُمۡ اِیَّانَا تَعۡبُدُوۡنَ ﴿۲۹﴾", "english": " And remember the day when We shall gather them all together, then shall We say to those who ascribed partners to God , “ Stand back in your places, you and your ‘partners’”. Then We shall separate them widely, one from another, and their ‘partners’ will say: ‘It was not us that you worshipped.", "french": " Et prenez garde au jour où Nous les rassemblerons tous ensemble ; c’est alors que Nous dirons à ceux qui ont attribué des associés à Allāh : « Restez là où vous êtes, vous et vos faux dieux que vous associez à Allāh . » Puis, Nous les séparerons, et ceux qu’ils avaient considérés comme partenaires diront : « Ce n’était certainement pas nous que vous adoriez. »", "german": " Und (gedenke) des Tages, da Wir sie versammeln werden allzumal, dann werden Wir zu denen, die Götzen anbeteten, sprechen: \"An euren Platz, ihr und eure Götzen!\" Dann scheiden Wir sie voneinander, und ihre Götzen werden sprechen: \"Nicht uns habt ihr angebetet.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=10:29&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=10:29&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic30\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic30\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/10:30' style='text-decoration:underline'>10:30</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(30)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control30\"></i></button> <audio id=\"player30\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَکَفٰی بِاللّٰہِ شَہِیۡدًۢا بَیۡنَنَا وَ بَیۡنَکُمۡ اِنۡ کُنَّا عَنۡ عِبَادَتِکُمۡ لَغٰفِلِیۡنَ ﴿۳۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘So Allah is <em>now </em>sufficient as a Witness between us and you. We were certainly unaware of your worship.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘So Allah is <i>now </i>sufficient as a Witness between us and you. <sup class='ref'>[<a class='ref' data-id='ref_10_30_e' href='#'>e</a>]</sup>We were certainly unaware of your worship.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_10_30_e'>e</span></div> <div><div class='reference' data-id='ref_10_30_e' style='display:none'> <p><b>e.</b> <a href='/quran/46:6' target=_blank>46:6</a>. (<a href='javascript:void(0)' data-id='ref_10_30_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس اللہ ہی ہمارے اور تمہارے درمیان بطور گواہ کافی ہے۔ یقیناً ہم تمہارے عبادت کرنے سے بے خبر تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پس تمہارے درمیان اور ہمارے درمیان (خود) اللہ کافی گواہ ہے۔ ہم تمہاری پرستش سے قطعاًبے خبر تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« Aussi, Allāh est Témoin suffisant entre vous et nous. Nous ignorions totalement votre adoration. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em> “</em>Así, Al-lah es Testigo suficiente entre nosotros y vosotros. Desconocíamos totalmente vuestra devoción”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Allah genügt nun als Zeuge zwischen uns und euch. Wir haben wahrhaftig nichts gewusst von eurer Anbetung.\"", "spanish": " Cuidado con el día en el que reunamos a todos, cuando digamos a los que asocian partícipes a Dios: “ Quedaos en vuestros lugares, vosotros y vuestros dioses asociados”. Entonces los separaremos, y aquellos a quienes consideraban sus socios dirán: “No es a nosotros a quienes adorabais”.", "urdu": " اور (اے لوگو! اس دن کو یاد کرو) جس دن ہم ان سب کو جمع کریں گے پھر جنہوں نے شرک کیا (ہوگا) انہیں ہم کہیں گے (کہ پرے ہٹ کر) اپنی جگہ پر (کھڑے رہو) تم بھی اور تمہارے (بنائے ہوئے خدائی کے) حصہ دار (بھی) پھر ہم ان میں آپس میں (بھی) جدائی ڈال دیں گے اور ان کے (بنائے ہوئے خدا کے) شریک (انہیں) کہیں گے (کہ) تم ہماری عبادت (توہرگز) نہیں کرتے تھے۔"}], "Surah": 10}