{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لیکر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یٰۤاَیُّہَا النَّاسُ اتَّقُوۡا رَبَّکُمُ الَّذِیۡ خَلَقَکُمۡ مِّنۡ نَّفۡسٍ وَّاحِدَۃٍ وَّ خَلَقَ مِنۡہَا زَوۡجَہَا وَ بَثَّ مِنۡہُمَا رِجَالًا کَثِیۡرًا وَّ نِسَآءً ۚ وَ اتَّقُوا اللّٰہَ الَّذِیۡ تَسَآءَلُوۡنَ بِہٖ وَ الۡاَرۡحَامَ ؕ اِنَّ اللّٰہَ کَانَ عَلَیۡکُمۡ رَقِیۡبًا ﴿۲﴾", "english": " O ye people! fear your Lord, Who created you from a single soul and created therefrom its mate, and from them twain spread many men and women; and fear Allah, in Whose name you appeal to one another, and fear Him particularly respecting ties of relationship. Verily, Allah watches over you.", "french": " Ô hommes ! craignez votre Seigneur Qui vous a créés d’un seul être et en a créé sa moitié pour en former un couple , et Qui, de ces deux-là, a répandu sur la terre de nombreux hommes et femmes ; craignez Allāh au nom de Qui vous faites appel les uns aux autres, et craignez-Le surtout en ce qui concerne les liens de parenté. En vérité, Allāh vous surveille.", "german": " O ihr Menschen, fürchtet euren Herrn, Der euch aus einem einzigen Wesen erschaffen hat; aus diesem erschuf Er ihm die Gefährtin, und aus beiden ließ Er viele Männer und Frauen sich vermehren. Fürchtet Allah, in Dessen Namen ihr einander bittet, und (fürchtet Ihn besonders in der Pflege der) Verwandtschaftsbande. Wahrlich, Allah wacht über euch.", "spanish": " ¡Oh, hombres! temed a vuestro Señor quien os creó de un solo ser, del cual creó a su pareja, y de los dos hizo descender a muchos hombres mujeres; y temed a Al-lah, en cuyo nombre recurrís unos a otros, y temedle particularmente respetando los lazos del parentesco. En verdad, Al-lah os observa.", "urdu": " اے لوگو! اپنے رب کا تقویٰ اختیار کرو جس نے تمہیں ایک (ہی) جان سے پیدا کیا۔ اور اس (کی جنس) سے (ہی) اس کا جوڑا پیدا کیا۔ اور ان دونوں میں سے بہت سے مرد اور عورتیں (پیدا کرکے دنیا میں) پھیلائے اور اللہ کا تقویٰ (اس لئے بھی) اختیار کرو کہ اس کے ذریعہ سے تم آپس میں سوال کرتے ہو۔ اور خصوصاً رشتہ داریوں (کے معاملہ) میں (تقویٰ سے کام لو) اللہ تم پر یقیناً نگران ہے۔"}, {"arabic": " وَ اٰتُوا الۡیَتٰمٰۤی اَمۡوَالَہُمۡ وَ لَا تَتَبَدَّلُوا الۡخَبِیۡثَ بِالطَّیِّبِ ۪ وَ لَا تَاۡکُلُوۡۤا اَمۡوَالَہُمۡ اِلٰۤی اَمۡوَالِکُمۡ ؕ اِنَّہٗ کَانَ حُوۡبًا کَبِیۡرًا ﴿۳﴾", "english": " And give to the orphans their property and exchange not the bad for the good, and devour not their property with your own. Surely, it is a great sin.", "french": " Et donnez leurs biens aux orphelins, et n’échangez pas le mauvais pour le bon, et ne dévorez pas leurs biens en les mélangeant avec les vôtres. Assurément c’est là un grand péché.", "german": " Und gebt den Waisen ihren Besitz und vertauscht nicht Gutes mit Schlechtem, und verzehrt nicht ihren Besitz zusammen mit dem eurigen. Gewiss, das ist eine schwere Sünde.", "spanish": " Y entregad a los huérfanos sus bienes, no cambiéis lo malo por lo bueno, ni devoréis sus bienes mediante los vuestros. En verdad, eso es un gran pecado.", "urdu": " اور یتیموں کو ان کے مال دے دو۔ اور پاک (مال) کے بدلہ میں ناپاک (مال) نہ لو۔ اور ان کے مال اپنے مالوں سے (ملا کر) نہ کھاٶ۔ یہ یقیناً بڑا گناہ ہے۔"}, {"arabic": " وَ اِنۡ خِفۡتُمۡ اَلَّا تُقۡسِطُوۡا فِی الۡیَتٰمٰی فَانۡکِحُوۡا مَا طَابَ لَکُمۡ مِّنَ النِّسَآءِ مَثۡنٰی وَ ثُلٰثَ وَ رُبٰعَ ۚ فَاِنۡ خِفۡتُمۡ اَلَّا تَعۡدِلُوۡا فَوَاحِدَۃً اَوۡ مَا مَلَکَتۡ اَیۡمَانُکُمۡ ؕ ذٰلِکَ اَدۡنٰۤی اَلَّا تَعُوۡلُوۡا ؕ﴿۴﴾", "english": " And if you fear that you will not be fair in dealing with the orphans, then marry of women as may be agreeable to you, two, or three, or four; and if you fear you will not deal justly, then marry only one or what your right hands possess. That is the nearest way for you to avoid injustice.", "french": " Et si vous - la société - craignez de ne pas pouvoir agir avec justice envers les orphelins laissés sans protection par la guerre , alors épousez des femmes de votre choix, deux, trois ou quatre ; et si vous craignez de ne pouvoir agir équitablement, alors n’en épousez qu’ une, ou épousez ce que votre main droite possède. Cela est la voie la plus proche pour vous afin d’éviter l’injustice", "german": " Und wenn ihr fürchtet, ihr würdet nicht gerecht gegen die Waisen handeln, dann heiratet Frauen, die euch genehm dünken, zwei oder drei oder vier; und wenn ihr fürchtet, ihr könnt nicht billig handeln, dann (heiratet nur) eine oder was eure Rechte besitzt. Also könnt ihr das Unrecht eher vermeiden.", "spanish": " Y si teméis que la sociedad falle en hacer justicia en suntos referentes a los huérfanos la al finalizar la guerra , entonces casaros con mujeres de vuestra elección, dos, res o cuatro; pero si teméis no poder mantener la equidad, casaos sólo con una o con lo que posea vuestra diestra. Éste es el camino más seguro para que evitéis la injusticia.", "urdu": " اور اگر تمہیں (یہ) خوف ہو کہ تم یتیموں (کے بارہ) میں انصاف نہ کر سکو گے تو جو (صورت) تمہیں پسند ہو (کرلو‘ یعنی) (غیر یتیم) عورتوں میں سے دو دو (سے) اور تین تین (سے) اور چار چار سے نکاح کر لو۔ لیکن اگر تمہیں (یہ) خوف ہو کہ تم عدل نہ کر سکو گے تو ایک ہی (عورت) سے یا ان (لونڈیوں) سے جو تمہارے ہاتھوں میں ہیں نکاح کرو یہ (طریق اس بات کے) بہت قریب ہے کہ تم ظالم نہ ہو جاٶ۔"}, {"arabic": " وَ اٰتُوا النِّسَآءَ صَدُقٰتِہِنَّ نِحۡلَۃً ؕ فَاِنۡ طِبۡنَ لَکُمۡ عَنۡ شَیۡءٍ مِّنۡہُ نَفۡسًا فَکُلُوۡہُ ہَنِیۡٓــًٔا مَّرِیۡٓــًٔا ﴿۵﴾", "english": " And give the women their dowries willingly. But if they, of their own pleasure, remit to you a part thereof, then enjoy it as something pleasant and wholesome.", "french": " Et donnez de plein gré leurs dots aux femmes. Cependant, si de leur bon plaisir, elles vous en remettent une partie, alors profitez-en sans hésitation et avec plaisir.", "german": " Und gebt den Frauen ihre Morgengabe gutwillig. Erlassen sie euch aber aus freien Stücken einen Teil davon, so genießt ihn als etwas Erfreuliches und Bekömmliches.", "spanish": " Y entregad de buen grado su dote a las mujeres. Pero si ellas, por su propia voluntad, os devuelven una parte de ella, disfrutadla como algo agradable y edificante.", "urdu": " اور عورتوں کو ان کے مہر دلی خوشی سے ادا کرو۔ پھر اگر وہ اپنے دل کی خوشی سے اس میں سے تمہیں کچھ دے دیں تو یہ جانتے ہوئے کہ وہ تمہارے لئے مزے اور انجام کے لحاظ سے اچھا ہے تم اسے بے شک کھاٶ۔"}, {"arabic": " وَ لَا تُؤۡتُوا السُّفَہَآءَ اَمۡوَالَکُمُ الَّتِیۡ جَعَلَ اللّٰہُ لَکُمۡ قِیٰمًا وَّ ارۡزُقُوۡہُمۡ فِیۡہَا وَ اکۡسُوۡہُمۡ وَ قُوۡلُوۡا لَہُمۡ قَوۡلًا مَّعۡرُوۡفًا ﴿۶﴾", "english": " And give not to the foolish your property which Allah has made for you a means of support; but feed them therewith and clothe them and speak to them words of kind advice.", "french": " Ne remettez pas la charge des biens qui vous appartiennent et qu’Allāh a fait pour vous un moyen d’existence, à ceux qui sont mentalement incapables de les gérer correctement . Aussi, nourrissez-les-en et vêtez-les et parlez-leur avec bienveillance.", "german": " Und gebt den Schwachsinnigen nicht euer Gut, das Allah euch zum Unterhalt anvertraut hat; sondern nährt sie damit und kleidet sie und sprecht Worte der Güte zu ihnen.", "spanish": " Y no entreguéis la custodia de los bienes que os pertenecen, que Al-lah os ha dado como medio de subsistencia, a los que son mentalmente incapaces de manejarlos adecuadamente. Por tanto, alimentadles y vestidles convenientemente y dirigidles palabras amables.", "urdu": " اور نا سمجھوں کو اپنے مال جنہیں اللہ نے تمہارے لئے سہارا بنایا ہے نہ دو اور ان میں سے انہیں کھلاٶ اور انہیں پہناٶ اور انہیں مناسب (اور اچھی) باتیں کہو۔"}, {"arabic": " وَ ابۡتَلُوا الۡیَتٰمٰی حَتّٰۤی اِذَا بَلَغُوا النِّکَاحَ ۚ فَاِنۡ اٰنَسۡتُمۡ مِّنۡہُمۡ رُشۡدًا فَادۡفَعُوۡۤا اِلَیۡہِمۡ اَمۡوَالَہُمۡ ۚ وَ لَا تَاۡکُلُوۡہَاۤ اِسۡرَافًا وَّ بِدَارًا اَنۡ یَّکۡبَرُوۡا ؕ وَ مَنۡ کَانَ غَنِیًّا فَلۡیَسۡتَعۡفِفۡ ۚ وَ مَنۡ کَانَ فَقِیۡرًا فَلۡیَاۡکُلۡ بِالۡمَعۡرُوۡفِ ؕ فَاِذَا دَفَعۡتُمۡ اِلَیۡہِمۡ اَمۡوَالَہُمۡ فَاَشۡہِدُوۡا عَلَیۡہِمۡ ؕ وَ کَفٰی بِاللّٰہِ حَسِیۡبًا ﴿۷﴾", "english": " And prove the orphans until they attain the age of marriage; then, if you find in them sound judgment, deliver to them their property; and devour it not in extravagance and haste against their growing up. And whoso is rich, let him abstain; and whoso is poor, let him eat thereof with equity. And when you deliver to them their property, then call witnesses in their presence. And Allah is sufficient as a Reckoner.", "french": " Et mettez à l’épreuve l’entendement des orphelins jusqu’à ce qu’ils soient en âge de se marier ; ensuite, si vous trouvez chez eux un jugement sain, remettez-leur leurs biens ; et ne les gaspillez pas à la hâte de façon extravagante de peur qu’ils ne soient en âge de les recevoir . Que celui qui est riche s’abstienne, et que celui qui est pauvre en prélève seulement ce qui est raisonnable. Et lorsque vous leur remettrez leurs biens, prenez des témoins en leur présence. Et Allāh suffit comme Comptable.", "german": " Und prüfet die Waisen, bis sie das heiratsfähige (Alter) erreicht haben; wenn ihr dann an ihnen Verständigkeit wahrnehmet, so gebt ihnen ihren Besitz zurück; und zehrt ihn nicht verschwenderisch und hastig auf, weil sie großjährig würden. Wer reich ist, enthalte sich ganz; und wer arm ist, zehre (davon) nach Billigkeit. Und wenn ihr ihnen ihren Besitz zurückgebt, dann nehmt Zeugen in ihrer Gegenwart. Und Allah genügt zur Rechenschaft.", "spanish": " Y probad el entendimiento de los huérfanos hasta que alcancen la edad del matrimonio; entonces, si los encontráis de sano juicio, entregadles sus bienes; y no los gastéis en extravagancias y deprisa antes de que ellos crezcan; quien sea rico que se abstenga; y el pobre que tome de ellos con moderación. Mas cuando les entreguéis sus bienes, llamad a unos testigos ante ellos. Y Al-lah es suficiente como Juez.", "urdu": " اور یتیموں کی آزمائش اس وقت تک کہ وہ شادی (کی عمر) کو پہنچ جائیں کرتے رہو۔ پھر اگر تم ان میں سمجھ (کے آثار) دیکھو تو ان کے مال انہیں واپس دے دو۔ اور ان کے جوان ہو جانے (کے خوف) سے ان (مالوں) کو ناجائز طور پر اور جلدی (جلدی) نہ کھا جاٶ اور جو کوئی مال دار ہو اسے چاہیے کہ وہ (اس مال کے استعمال سے) کلی طور پر اجتناب کرے۔ لیکن جو نادار ہو وہ مناسب طور پر (اس مال میں سے) کھائے۔ پھر جب تم انہیں ان کے مال واپس دو تو ان (یتامی) کے روبرو گواہ مقرر کرلو اور اللہ حساب لینے کے لحاظ سے (اکیلا) کافی ہے۔"}, {"arabic": " لِلرِّجَالِ نَصِیۡبٌ مِّمَّا تَرَکَ الۡوَالِدٰنِ وَ الۡاَقۡرَبُوۡنَ ۪ وَ لِلنِّسَآءِ نَصِیۡبٌ مِّمَّا تَرَکَ الۡوَالِدٰنِ وَ الۡاَقۡرَبُوۡنَ مِمَّا قَلَّ مِنۡہُ اَوۡ کَثُرَ ؕ نَصِیۡبًا مَّفۡرُوۡضًا ﴿۸﴾", "english": " For men is a share of that which parents and near relations leave; and for women is a share of that which parents and near relations leave, whether it be little or much — a determined share.", "french": " Pour les hommes il y a une part de ce que laissent les parents et les proches parents, et pour les femmes il y a une part de ce que laissent les parents et les proches parents, que ce soit peu ou beaucoup – une part déterminée.", "german": " Den Männern gebührt ein Anteil von dem, was Eltern und nahe Anverwandte hinterlassen; und den Frauen gebührt ein Anteil von dem, was Eltern und nahe Anverwandte hinterlassen, ob es wenig sei oder viel – ein bestimmter Anteil.", "spanish": " A los hombres les corresponde una parte de lo que dejan sus padres y parientes cercanos; a las mujeres les corresponde también una parte de lo que dejan sus padres y parientes cercanos, sea poco o mucho: una parte determinada.", "urdu": " اور مردوں کا (بھی) اور عورتوں کا بھی اس (مال) میں سے جو ان کے ماں باپ اور قریبی رشتہ دار چھوڑ جائیں ایک حصہ ہے۔ خواہ اس (ترکہ) میں سے تھوڑا بچا ہو یا بہت (یہ) ایک معین حصہ ہے جو (خداتعالیٰ کی طرف سے) مقرر کیا گیا ہے۔"}, {"arabic": " وَ اِذَا حَضَرَ الۡقِسۡمَۃَ اُولُوا الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنُ فَارۡزُقُوۡہُمۡ مِّنۡہُ وَ قُوۡلُوۡا لَہُمۡ قَوۡلًا مَّعۡرُوۡفًا ﴿۹﴾", "english": " And when other relations and orphans and the poor are present at the division of heritage , give them something therefrom and speak to them words of kindness.", "french": " Et quand d’ autres parents ainsi que des orphelins et des pauvres assistent au partage, donnez-leur-en quelque chose , et parlez-leur avec bonté.", "german": " Und wenn (andere) Verwandte und Waisen und Arme bei der Erbteilung zugegen sind, so gebt ihnen etwas davon und sprecht Worte der Güte zu ihnen.", "spanish": " Y cuando en la distribución de la herencia estén presentes otros familiares, huérfanos y menesterosos, dadles algo de ella y dirigidles palabras amables.", "urdu": " اور جب (ترکہ کی) تقسیم کے وقت (دوسرے) قرابت دار اور یتیم اور مسکین (بھی) آجائیں تو اس میں سے کچھ انہیں (بھی) دے دو۔ اور انہیں مناسب (اور عمدہ) باتیں کہو۔"}, {"arabic": " وَ لۡیَخۡشَ الَّذِیۡنَ لَوۡ تَرَکُوۡا مِنۡ خَلۡفِہِمۡ ذُرِّیَّۃً ضِعٰفًا خَافُوۡا عَلَیۡہِمۡ ۪ فَلۡیَتَّقُوا اللّٰہَ وَ لۡیَقُوۡلُوۡا قَوۡلًا سَدِیۡدًا ﴿۱۰﴾", "english": " And let those fear God who, if they should leave behind them their own weak offspring, would be anxious for them. Let them, therefore, fear Allah and let them say the right word.", "french": " Et qu’ils craignent Allāh , ceux qui, s’ils devaient laisser derrière eux leurs propres enfants faibles, craindraient pour eux. Qu’ils craignent donc Allāh et qu’ils parlent avec droiture.", "german": " Und jene mögen (Gott) fürchten, die, sollten sie selbst schwache Nachkommen hinterlassen, um sie besorgt wären. Mögen sie daher Allah fürchten und das rechte Wort sprechen.", "spanish": " Y teman a Dios quienes, si dejaran tras ellos una descendencia débil, se sentirían angustiados por ella. Que teman a Al-lah y digan la palabra justa.", "urdu": " اور جو لوگ ڈرتے ہوں کہ اگر وہ اپنے بعد کمزور اولاد چھوڑ گئے تو اس کا کیا بنے گا ان کو (دوسرے یتیموں کے متعلق بھی) اللہ کے ڈر سے کام لینا چاہیئے اور چاہیئے کہ وہ صاف اور سیدھی بات کہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یَاۡکُلُوۡنَ اَمۡوَالَ الۡیَتٰمٰی ظُلۡمًا اِنَّمَا یَاۡکُلُوۡنَ فِیۡ بُطُوۡنِہِمۡ نَارًا ؕ وَ سَیَصۡلَوۡنَ سَعِیۡرًا ﴿٪۱۱﴾", "english": " Surely, they who devour the property of orphans unjustly, only swallow fire into their bellies, and they shall burn in a blazing fire.", "french": " Assurément, ceux qui dévorent injustement les biens des orphelins, n’avalent que du feu dans leur ventre et ils brûleront dans une Fournaise.", "german": " Jene, die den Besitz der Waisen widerrechtlich verzehren, schlucken nur Feuer in ihren Bauch, und sie sollen in flammendes Feuer eingehen.", "spanish": " En verdad, quienes devoran injustamente los bienes de los huérfanos no hacen más que tragar fuego en sus entrañas, pues arderán en un fuego llameante.", "urdu": " جو لوگ ظلم سے یتیموں کے مال کھاتے ہیں وہ یقیناً اپنے پیٹوں میں صرف آگ بھرتے ہیں اور وہ یقیناً شعلہ زن آگ میں داخل ہوں گے۔"}, {"arabic": " یُوۡصِیۡکُمُ اللّٰہُ فِیۡۤ اَوۡلَادِکُمۡ ٭ لِلذَّکَرِ مِثۡلُ حَظِّ الۡاُنۡثَیَیۡنِ ۚ فَاِنۡ کُنَّ نِسَآءً فَوۡقَ اثۡنَتَیۡنِ فَلَہُنَّ ثُلُثَا مَا تَرَکَ ۚ وَ اِنۡ کَانَتۡ وَاحِدَۃً فَلَہَا النِّصۡفُ ؕ وَ لِاَبَوَیۡہِ لِکُلِّ وَاحِدٍ مِّنۡہُمَا السُّدُسُ مِمَّا تَرَکَ اِنۡ کَانَ لَہٗ وَلَدٌ ۚ فَاِنۡ لَّمۡ یَکُنۡ لَّہٗ وَلَدٌ وَّ وَرِثَہٗۤ اَبَوٰہُ فَلِاُمِّہِ الثُّلُثُ ۚ فَاِنۡ کَانَ لَہٗۤ اِخۡوَۃٌ فَلِاُمِّہِ السُّدُسُ مِنۡۢ بَعۡدِ وَصِیَّۃٍ یُّوۡصِیۡ بِہَاۤ اَوۡ دَیۡنٍ ؕ اٰبَآؤُکُمۡ وَ اَبۡنَآؤُکُمۡ لَا تَدۡرُوۡنَ اَیُّہُمۡ اَقۡرَبُ لَکُمۡ نَفۡعًا ؕ فَرِیۡضَۃً مِّنَ اللّٰہِ ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا حَکِیۡمًا ﴿۱۲﴾", "english": " Allah commands you concerning your children: a male shall have as much as the share of two females; but if there be females only, numbering more than two, then they shall have two-thirds of what the deceased leaves; and if there be one, she shall have the half. And his parents shall have each of them a sixth of the inheritance, if he have a child; but if he have no child and his parents be his heirs, then his mother shall have a third; and if he have brothers and sisters, then his mother shall have a sixth, after the payment of any bequests he may have bequeathed or of debt. Your fathers and your children, you know not which of them is nearest to you in benefit. This fixing of portions is from Allah. Surely, Allah is All- Knowing, Wise.", "french": " Allāh vous ordonne au sujet de vos enfants qu’ un garçon aura autant que la part de deux filles, mais s’il n’y a que des filles et plus de deux, alors elles auront deux tiers de ce que laissera le défunt ; et s’il n’y a qu’une seule fille, elle aura la moitié de l’héritage . Et le père et la mère du défunt auront chacun le sixième de ce qu’il laisse, s’il a un enfant ; mais s’il est sans enfant, et que ses parents sont ses héritiers, alors sa mère aura un tiers ; et s’il a des frères et des sœurs , alors sa mère aura un sixième, après paiement de tout legs qu’il aurait pu faire ou de dettes. De vos ascendants ou de vos enfants, vous ne savez pas lequel vous fait le plus de bien. Cette fixation des parts émane d’Allāh. Assurément, Allāh est Omniscient et Sage.", "german": " Allah verordnet euch in Bezug auf eure Kinder: ein Knabe hat so viel als Anteil wie zwei Mädchen; sind aber (bloß) Mädchen da, und zwar mehr als zwei, dann sollen sie zwei Drittel seiner (des Verstorbenen) Erbschaft haben; ist´s nur eines, so hat es die Hälfte. Und für seine Eltern ist je ein Sechstel der Erbschaft, wenn er ein Kind hat; hat er aber kein Kind und seine Eltern sind seine Erben, dann soll seine Mutter ein Drittel haben; und wenn er Geschwister hat, dann soll seine Mutter ein Sechstel erhalten, nach allen etwa von ihm gemachten Vermächtnissen oder Schulden. Eure Eltern und eure Kinder: ihr wisst nicht, wer von ihnen euch an Nutzen näher steht. Eine Verordnung von Allah – wahrlich, Allah ist allwissend, allweise.", "spanish": " Al-lah os ordena en relación con vuestros hijos: el varón tendrá la arte de dos mujeres; pero si sólo hay mujeres, en número superior a dos, tendrán dos tercios de lo que deja el difunto; y si hay una, recibirá la mitad. Y sus padres tendrán cada uno la sexta parte de la herencia si tuviera un hijo; pero si el difunto no tiene hijos y sus padres son sus herederos, la madre recibirá un tercio; y si tiene hermanos y hermanas, su madre recibirá la sexta parte, después de pagado cualquier legado que hubiera dispuesto o las deudas. En cuanto a vuestros padres y vuestros hijos, desconocéis cuáles de ellos representan un mayor beneficio para vosotros. Esta fijación de partes procede de Al-lah. En verdad, Al-lah es Omnisciente, Sabio.", "urdu": " اللہ تمہاری اولاد کے متعلق تمہیں حکم دیتا ہے (کہ) (ایک) مرد کا (حصہ) دو عورتوں کے حصہ کے برابر ہے اور اگر (اولاد) عورتیں (ہی عورتیں) ہوں جو دو سے اوپر ہوں تو ان کے لئے (بھی) جو کچھ اس (مرنے والے) نے چھوڑا ہو (اس کا) دو تہائی مقرر ہے اور اگر ایک (ہی عورت) ہو تو اس کے لئے (ترکہ کا) آدھا ہے اور اگر اس (مرنے والے) کے اولاد ہو تو اس کے ماں باپ کے لئے (یعنی) ان میں سے ہر ایک کے لئے اس کے ترکہ میں سے چھٹا حصہ (مقرر) ہے اور اگر اس کے اولاد نہ ہو اور اس کے ماں باپ (ہی) اس کے وارث ہوں تو اس کی ماں کا تیسرا حصہ (مقرر) ہے لیکن اگر اس کے بھائی (بہن موجود) ہوں تو اس کی ماں کا چھٹا حصہ (مقرر) ہے (یہ سب حصے) اس کی وصیت اور (اس کے) قرض (کی ادائیگی) کے بعد (ادا ہوں گے) تم نہیں جانتے کہ تمہارے باپ (دادوں) اور تمہارے بیٹوں میں سے کون تمہارے لئے زیادہ نفع رساں ہے۔ (یہ) اللہ کی طرف سے فرض مقرر کیا گیا ہے۔ اللہ یقیناً بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ لَکُمۡ نِصۡفُ مَا تَرَکَ اَزۡوَاجُکُمۡ اِنۡ لَّمۡ یَکُنۡ لَّہُنَّ وَلَدٌ ۚ فَاِنۡ کَانَ لَہُنَّ وَلَدٌ فَلَکُمُ الرُّبُعُ مِمَّا تَرَکۡنَ مِنۡۢ بَعۡدِ وَصِیَّۃٍ یُّوۡصِیۡنَ بِہَاۤ اَوۡ دَیۡنٍ ؕ وَ لَہُنَّ الرُّبُعُ مِمَّا تَرَکۡتُمۡ اِنۡ لَّمۡ یَکُنۡ لَّکُمۡ وَلَدٌ ۚ فَاِنۡ کَانَ لَکُمۡ وَلَدٌ فَلَہُنَّ الثُّمُنُ مِمَّا تَرَکۡتُمۡ مِّنۡۢ بَعۡدِ وَصِیَّۃٍ تُوۡصُوۡنَ بِہَاۤ اَوۡ دَیۡنٍ ؕ وَ اِنۡ کَانَ رَجُلٌ یُّوۡرَثُ کَلٰلَۃً اَوِ امۡرَاَۃٌ وَّ لَہٗۤ اَخٌ اَوۡ اُخۡتٌ فَلِکُلِّ وَاحِدٍ مِّنۡہُمَا السُّدُسُ ۚ فَاِنۡ کَانُوۡۤا اَکۡثَرَ مِنۡ ذٰلِکَ فَہُمۡ شُرَکَآءُ فِی الثُّلُثِ مِنۡۢ بَعۡدِ وَصِیَّۃٍ یُّوۡصٰی بِہَاۤ اَوۡ دَیۡنٍ ۙ غَیۡرَ مُضَآرٍّ ۚ وَصِیَّۃً مِّنَ اللّٰہِ ؕ وَ اللّٰہُ عَلِیۡمٌ حَلِیۡمٌ ﴿ؕ۱۳﴾", "english": " And you shall have half of that which your wives leave, if they have no child; but if they have a child, then you shall have a fourth of that which they leave, after the payment of any bequests they may have bequeathed or of debt. And they shall have a fourth of that which you leave, if you have no child; but if you have a child, then they shall have an eighth of that which you leave, after the payment of any bequests you may have bequeathed or of debt. And if there be a man or a woman whose heritage is to be divided and he or she has neither parent nor child, and he or she has a brother or a sister, then each one of them shall have a sixth. But if they be more than that, then they shall be equal sharers in one-third, after the payment of any bequests which may have been bequeathed or of debt, without prejudice to the debt . This is an injunction from Allah, and Allah is All-Knowing, Forbearing.", "french": " Et vous aurez la moitié de ce que laisseront vos épouses si elles meurent sans enfant ; mais si elles ont un enfant, alors vous aurez droit à un quart de ce qu’elles laisseront après paiement de tout legs qu’elles auraient pu faire ou de dettes. Et elles auront droit à un quart de ce que vous laisserez si vous n’avez pas d’enfant ; mais si vous avez un enfant, alors elles auront droit à un huitième de ce que vous laisserez, après paiement de tout legs que vous aurez pu faire ou de dettes. Et s’il y a un homme ou une femme dont la succession doit être partagée, et que lui ou elle n’ait ni parent ni enfant, et que lui ou elle ait un frère ou une sœur, alors chacun d’eux aura droit à un sixième. Mais s’il y a plus de deux, alors ils se partageront un tiers à part égale, après paiement de tout legs qui aura pu être fait ou de dettes, sans aucune intention de nuire à quiconque. Ceci est une injonction d’Allāh, et Allāh est Omniscient et Indulgent.", "german": " Und ihr habt die Hälfte von dem, was eure Frauen hinterlassen, falls sie kein Kind haben; haben sie aber ein Kind, dann habt ihr ein Viertel von ihrer Erbschaft, nach allen etwa von ihnen gemachten Vermächtnissen oder Schulden. Und sie haben ein Viertel von eurer Erbschaft, falls ihr kein Kind habt; habt ihr aber ein Kind, dann hat sie ein Achtel von eurer Erbschaft, nach allen etwa von euch gemachten Vermächtnissen oder Schulden. Und wenn es sich um eine Person handelt – männlich oder weiblich –, deren Erbschaft geteilt werden soll, und sie hat weder Eltern noch Kinder, hat aber einen Bruder oder eine Schwester, dann haben diese je ein Sechstel. Sind aber mehr (Geschwister) vorhanden, dann sollen sie sich in ein Drittel teilen zu (gleichen) Teilen, nach allen etwa gemachten Vermächtnissen oder Schulden, ohne Beeinträchtigung – eine Vorschrift von Allah, und Allah ist allwissend, milde.", "spanish": " Y vosotros recibiréis la mitad de lo que dejen vuestras esposas, si no tienen hijos; pero si tienen un hijo, recibiréis la cuarta parte de lo que dejen, después de pagado cualquier legado que hubieran dispuesto o las deudas. Si no tenéis hijos, ellas recibirán la cuarta parte de lo que dejéis, pero si los tenéis, recibirán la octava parte de lo que dejéis, después de pagado cualquier legado que hubierais dispuesto o las deudas. Y si hubiera un hombre o una mujer cuya herencia ha de ser dividida y no tiene padre ni hijos, pero tiene un hermano o una hermana, cada uno de ellos recibirá una sexta parte. Pero si fuesen más de dos, recibirán a partes iguales un tercio, después de pagado cualquier legado que hubieran dispuesto o las deudas, sin intentar causar sufrimiento a nadie. Esto es un mandato de Al-lah, pues Al-lah es Omnisciente, Tolerante.", "urdu": " اور تمہاری بیویاں جو کچھ چھوڑ جائیں اگر ان کے اولاد نہ ہو تو ان (کے ترکہ) کا آدھا (حصہ) تمہارا ہے اور اگر ان کی اولاد (موجود) ہو تو جو کچھ انہوں نے چھوڑا ہو اس کا چوتھا (حصہ) تمہارا ہے (یہ حصے) وصیت اور (ان کے) قرض (کی ادائیگی) کے بعد (بچے ہوئے مال میں سے ہوں گے) اور اگر تمہارے ہاں اولاد نہ ہو تو جو کچھ تم چھوڑ جاٶ اس میں سے چوتھا (حصہ) ان (بیویوں) کا ہے۔ اور اگر تمہارے ہاں اولاد ہو تو جو کچھ تم چھوڑ جاٶ اس میں سے آٹھواں (حصہ) ان کا ہے (یہ حصے) وصیت اور (تمہارے) قرض (کی ادائیگی) کے بعد (ہوں گے) اور جس مرد یا عورت کا ورثہ تقسیم کیا جاتا ہے اگر اس کا نہ باپ ہو نہ اولاد اور اس کا کوئی بھائی یا بہن ہو تو ان میں سے ہر ایک کا چھٹا (حصہ) ہوگا اور اگر وہ اس سے زیادہ ہوں تو وہ (سب) تیسرے (حصے) میں شریک ہوں گے (یہ حصے) وصیت اور (مرنے والے کے) قرض (کی ادائیگی) کے بعد (بچے ہوئے مال کے لحاظ سے ہوں گے) (اس تقسیم میں) کسی کو ضرر پہنچانا مقصود نہیںہونا چاہیے (اور یہ) اللہ کی طرف سے (تمہیں) حکم (دیا جاتا) ہے اور اللہ خوب جاننے والا (اور) بردبار ہے۔"}, {"arabic": " تِلۡکَ حُدُوۡدُ اللّٰہِ ؕ وَ مَنۡ یُّطِعِ اللّٰہَ وَ رَسُوۡلَہٗ یُدۡخِلۡہُ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ وَ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿۱۴﴾", "english": " These are the limits set by Allah; and whoso obeys Allah and His Messenger, He will make him enter Gardens through which streams flow; therein shall they abide; and that is a great triumph.", "french": " Voici donc les limites fixées par Allāh ; et celui qui obéit à Allāh et à Son Messager, Il le fera entrer dans des Jardins sous lesquels coulent des ruisseaux ; ils y demeureront éternellement, et c’est là le triomphe suprême.", "german": " Dies sind die Schranken Allahs; und wer Allah und Seinem Gesandten gehorcht, den führt Er in Gärten ein, durch die Ströme fließen; darin sollen sie weilen; und das ist die große Glückseligkeit.", "spanish": " Éstos son límites fijados por Al-lah; y a quien obedezca a Al-lah y a Su Mensajero, Él lo introducirá en jardines por los que corren ríos; allí morarán y será un gran triunfo.", "urdu": " یہ اللہ کی (مقرر کردہ) حدیں ہیں اور جو (لوگ) اللہ اور اس کے رسول کی اطاعت کریں انہیں وہ ان باغوں میںجن کے اندر نہریں بہتی ہوں گی داخل کرے گا (اور) وہ ان میں رہتے چلے جائیں گے اور یہی بڑی کامیابی ہے۔"}, {"arabic": " وَ مَنۡ یَّعۡصِ اللّٰہَ وَ رَسُوۡلَہٗ وَ یَتَعَدَّ حُدُوۡدَہٗ یُدۡخِلۡہُ نَارًا خَالِدًا فِیۡہَا ۪ وَ لَہٗ عَذَابٌ مُّہِیۡنٌ ﴿٪۱۵﴾", "english": " And whoso disobeys Allah and His Messenger and transgresses His limits, He will make him enter into Fire; therein shall he abide; and he shall have an humiliating punishment.", "french": " Et celui qui désobéit à Allāh et à Son Messager, et qui transgresse Ses limites, Il le fera entrer dans le Feu ; il y demeurera longtemps et subira un châtiment humiliant.", "german": " Und wer Allah und Seinem Gesandten Gehorsam versagt und Seine Schranken übertritt, den führt Er ins Feuer; darin muss er bleiben; und ihm wird schmähliche Strafe.", "spanish": " Pero quien desobedezca a Al-lah y a Su Mensajero y viole Sus límites, Él lo introducirá en el Fuego; allí morará, y sufrirá un castigo ignominioso.", "urdu": " اور جو (شخص) اللہ اور اس کے رسول کی نافرمانی کرے اور اس کی (مقرر کردہ) حدوں سے آگے نکل جائے اسے وہ آگ میں داخل کرے گا جس میں وہ ایک لمبے عرصہ تک رہتا چلا جائے گا اور اس کے لئے رسوا کرنے والا عذاب (مقدر) ہے۔"}, {"arabic": " وَ الّٰتِیۡ یَاۡتِیۡنَ الۡفَاحِشَۃَ مِنۡ نِّسَآئِکُمۡ فَاسۡتَشۡہِدُوۡا عَلَیۡہِنَّ اَرۡبَعَۃً مِّنۡکُمۡ ۚ فَاِنۡ شَہِدُوۡا فَاَمۡسِکُوۡ ہُنَّ فِی الۡبُیُوۡتِ حَتّٰی یَتَوَفّٰہُنَّ الۡمَوۡتُ اَوۡ یَجۡعَلَ اللّٰہُ لَہُنَّ سَبِیۡلًا ﴿۱۶﴾", "english": " And those of your women who are guilty of lewdness — call to witness four of you against them; and if they bear witness, then confine them to the houses until death overtake them or Allah open for them a way.", "french": " Et s’il y a certaines d’entre vos femmes qui soient coupables d’indécence, que quatre d’entre vous témoignent contre elles ; et s’ils témoignent, alors retenez-les dans les maisons jusqu’à ce que la mort les emporte ou qu’Allāh leur ouvre une voie.", "german": " Und wenn welche von euren Frauen Unziemliches begehen, dann ruft vier von euch als Zeugen gegen sie auf; bezeugen sie es, dann schließet sie in die Häuser ein, bis der Tod sie ereilt oder Allah ihnen einen Ausweg eröffnet.", "spanish": " Sobre aquéllas de vuestras mujeres que sean culpables de adulterio –llamad a cuatro testigos de los vuestros; y si lo confirman, confinadlas en sus casas hasta que les llegue la muerte o Al-lah les abra otro camino.", "urdu": " اور تمہاری عورتوں میں سے جو کسی معروف ناپسندیدہ فعل کے قریب جائیں ان کے متعلق ان پر اپنے (یعنی رشتہ داروں یا ہمسایوں) میں سے چار گواہ طلب کرو۔ پس اگر وہ (چار گواہ) گواہی دے دیں تو تم انہیں (اپنے) گھروں میں اس وقت تک کہ انہیں موت آجائے یا اللہ ان کے لئے کوئی (اور) راہ نکالے روکے رکھو۔"}, {"arabic": " وَ الَّذٰنِ یَاۡتِیٰنِہَا مِنۡکُمۡ فَاٰذُوۡہُمَا ۚ فَاِنۡ تَابَا وَ اَصۡلَحَا فَاَعۡرِضُوۡا عَنۡہُمَا ؕ اِنَّ اللّٰہَ کَانَ تَوَّابًا رَّحِیۡمًا ﴿۱۷﴾", "english": " And if two men from among you are guilty of it, punish them both. And if they repent and amend, then leave them alone; surely, Allah is Oft-Returning with compassion and is Merciful.", "french": " Et si deux hommes de parmi vous en sont coupables, punissez les deux. Et s’ils se repentent et s’amendent, alors laissez-les. Assurément, Allāh revient sans cesse avec compassion et est Miséricordieux.", "german": " Und wenn zwei Männer unter euch solches begehen, dann bestrafet sie beide. Wenn sie dann bereuen und sich bessern, so lasst sie für sich; wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Y si dos de vuestros hombres son culpables de ello, castigad a ambos. Pero si se arrepienten y se enmiendan, dejadlos solos; en verdad, Al-lah es Remisorio con compasión y es Misericordioso.", "urdu": " اور تم میں سے جو دو مرد ناپسندیدہ فعل کے قریب جائیں تو تم انہیں دکھ پہنچاٶ پھر اگر وہ دونوں توبہ کرلیں اور اصلاح کر لیں تو ان سے چشم پوشی کرو۔ اللہ یقیناً بہت ہی توبہ قبول کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " اِنَّمَا التَّوۡبَۃُ عَلَی اللّٰہِ لِلَّذِیۡنَ یَعۡمَلُوۡنَ السُّوۡٓءَ بِجَہَالَۃٍ ثُمَّ یَتُوۡبُوۡنَ مِنۡ قَرِیۡبٍ فَاُولٰٓئِکَ یَتُوۡبُ اللّٰہُ عَلَیۡہِمۡ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ﴿۱۸﴾", "english": " Verily, Allah undertakes to accept the repentance of only those who do evil ignorantly and then repent soon after. These are they to whom Allah turns with mercy; and Allah is All-Knowing, Wise.", "french": " En vérité, Allāh S’engage à n’accepter le repentir que de ceux qui font le mal par ignorance et s’ en repentent peu après. Voilà ceux vers qui Allāh Se tourne avec clémence, et Allāh est Omniscient, Sage.", "german": " Allahs Vergebung ist nur für jene, die unwissentlich Böses tun und bald darauf Reue zeigen. Solchen wendet Sich Allah erbarmend zu; und Allah ist allwissend, allweise.", "spanish": " En verdad, Al-lah sólo se compromete a aceptar el arrepentimiento de los que hacen el mal por ignorancia y se arrepienten pronto. Hacia éstos se vuelve a Al-lah con misericordia; pues Al-lah es Omnisciente, Sabio.", "urdu": " توبہ (کا قبول کرنا) اللہ پر صرف ان (لوگوں) کے لئے (واجب) ہے جو جہالت سے بدی کے مرتکب ہوں۔ پھر جلد (ہی) توبہ کرلیں۔ اور یہ لوگ ایسے ہیں کہ اللہ ان پر مہربانی کرتا ہے اور اللہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ لَیۡسَتِ التَّوۡبَۃُ لِلَّذِیۡنَ یَعۡمَلُوۡنَ السَّیِّاٰتِ ۚ حَتّٰۤی اِذَا حَضَرَ اَحَدَہُمُ الۡمَوۡتُ قَالَ اِنِّیۡ تُبۡتُ الۡـٰٔنَ وَ لَا الَّذِیۡنَ یَمُوۡتُوۡنَ وَ ہُمۡ کُفَّارٌ ؕ اُولٰٓئِکَ اَعۡتَدۡنَا لَہُمۡ عَذَابًا اَلِیۡمًا ﴿۱۹﴾", "english": " There is no acceptance of repentance for those who continue to do evil until, when death faces one of them, he says, ‘I do repent now;’ nor for those who die disbelievers. It is these for whom We have prepared a painful punishment.", "french": " Il n’y a pas d’acceptation de repentir pour ceux qui continuent à faire le mal, jusqu’au moment où la mort se présente à l’un d’entre eux et où il dit : « Je me repens maintenant » ; ni pour ceux qui meurent mécréants. Pour ceux-là, Nous avons préparé un châtiment douloureux.", "german": " Doch Vergebung ist nicht für jene, die so lange Böses tun, bis zuletzt, wenn der Tod einem von ihnen naht, er spricht: \"Ich bereue nun\", noch für die, die als Ungläubige sterben. Ihnen haben Wir schmerzliche Strafe bereitet.", "spanish": " Pero no se aceptará el arrepentimiento de los que persisten haciendo el mal hasta que la muerte se presenta ante uno de ellos y dice: “Ahora me arrepiento”; ni de los que mueren en la incredulidad. Para ellos hemos preparado un doloroso castigo.", "urdu": " اور توبہ (کے قبول ہونے کا حق) ان لوگوں کے لئے نہیں جو بدیاں کرتے (چلے جاتے) ہیں۔ یہاں تک کہ جب ان میں سے کسی کے سامنے موت (کی گھڑی) آجاتی ہے تو کہتا ہے کہ میں نے اب یقیناً توبہ کر لی ہے اور نہ ان لوگوں کے لئے ہے جو کفر (ہی) کی حالت میں مر جاتے ہیں۔ یہ لوگ ایسے ہیں کہ ہم نے ان کے لئے دردناک عذاب تیار کر رکھا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا یَحِلُّ لَکُمۡ اَنۡ تَرِثُوا النِّسَآءَ کَرۡہًا ؕ وَ لَا تَعۡضُلُوۡہُنَّ لِتَذۡہَبُوۡا بِبَعۡضِ مَاۤ اٰتَیۡتُمُوۡہُنَّ اِلَّاۤ اَنۡ یَّاۡتِیۡنَ بِفَاحِشَۃٍ مُّبَیِّنَۃٍ ۚ وَ عَاشِرُوۡہُنَّ بِالۡمَعۡرُوۡفِ ۚ فَاِنۡ کَرِہۡتُمُوۡہُنَّ فَعَسٰۤی اَنۡ تَکۡرَہُوۡا شَیۡئًا وَّ یَجۡعَلَ اللّٰہُ فِیۡہِ خَیۡرًا کَثِیۡرًا ﴿۲۰﴾", "english": " O ye who believe! it is not lawful for you to inherit women against their will; nor should you detain them wrongfully that you may take away part of that which you have given them, except that they be guilty of a flagrant evil; and consort with them in kindness; and if you dislike them, it may be that you dislike a thing wherein Allah has placed much good.", "french": " Ô vous qui croyez ! Il ne vous est pas permis d’hériter des femmes contre leur gré ; vous ne devez pas non plus les retenir injustement de force afin de pouvoir leur dérober une partie de ce que vous leur avez donné, à moins qu’elles ne se soient rendues coupables d’un acte indécent flagrant ; et vivez avec elles avec bienveillance ; et si elles vous déplaisent, il se peut que ce qui vous déplaît soit une chose dans laquelle Allāh a mis beaucoup de bien.", "german": " O die ihr glaubt, es ist euch nicht erlaubt, Frauen gegen [ihren] Willen zu beerben; noch sollt ihr sie widerrechtlich zurückhalten, um (ihnen) einen Teil von dem wegzunehmen, was ihr ihnen gabt, es sei denn, sie hätten offenbare Schändlichkeit begangen; und geht gütig mit ihnen um. Wenn ihr eine Abneigung gegen sie empfindet, wer weiß, vielleicht empfindet ihr Abneigung gegen etwas, in das Allah aber viel Gutes gelegt hat.", "spanish": " ¡Oh vosotros, los que creéis! no os es lícito heredar a vuestras mujeres contra su voluntad; ni retenerlas injustamente para retirarles parte de lo que les habéis dado, a menos que sean culpables de una maldad manifiesta; y convivid con ellas con benevolencia, pues si no os gustan, es posible que no os guste algo en lo que Dios ha puesto un gran bien.", "urdu": " اے ایماندارو! تمہارے لئے (یہ) جائز نہیں کہ تم زبردستی عورتوں کے وارث بن جاٶ۔ اور تم انہیں اس غرض سے تنگ نہ کرو کہ جو (کچھ) تم نے انہیں دیا ہے اس میں سے کچھ (چھین کر) لے جاٶ۔ ہاں اگر وہ کسی کھلی (کھلی) بدی کی مرتکب ہوں (تو اس کا حکم اوپر گذر چکا ہے) اور ان سے اچھا سلوک کرو اور اگر تم انہیں ناپسند کرو تو (یاد رکھو کہ یہ) بالکل ممکن ہے کہ تم ایک چیز کو ناپسند کرو اور اللہ اس میں بہت (سا) بہتری (کا سامان) پیدا کر دے۔"}, {"arabic": " وَ اِنۡ اَرَدۡتُّمُ اسۡتِبۡدَالَ زَوۡجٍ مَّکَانَ زَوۡجٍ ۙ وَّ اٰتَیۡتُمۡ اِحۡدٰہُنَّ قِنۡطَارًا فَلَا تَاۡخُذُوۡا مِنۡہُ شَیۡئًا ؕ اَتَاۡخُذُوۡنَہٗ بُہۡتَانًا وَّ اِثۡمًا مُّبِیۡنًا ﴿۲۱﴾", "english": " And if you desire to take one wife in place of another and you have given one of them a treasure, take not aught therefrom. Will you take it by lying and with manifest sinfulness?", "french": " Et si vous désirez prendre une femme à la place d’une autre, et que vous ayez donné un trésor à l’une d’entre elles, n’en reprenez rien. Voudriez-vous le reprendre au prix d’une fausse accusation ou d’un péché manifeste ?", "german": " Und wenn ihr eine Frau gegen eine andere tauschen möchtet und habt der einen bereits einen Schatz gegeben, so nehmt nichts davon zurück. Möchtet ihr es etwa durch Lüge und offenbare Sünde zurücknehmen?", "spanish": " Y si deseáis tomar a una esposa en lugar de otra y habéis entregado una posesión a una de ellas, no se la quitéis. ¿Seríais capaces de quitárselo mintiendo y con iniquidad manifiesta?", "urdu": " اور اگر تم (ایک) بیوی کی جگہ (دوسری) بیوی بدلنا چاہو اور تم ان میں سے ایک کو ایک ڈھیر (مال کا) دے چکے ہو تو (بھی) اس (مال) سے کچھ (واپس) نہ لو۔ کیا تم اسے بہتان اور کھلے (کھلے) گناہ کے ذریعہ سے لو گے؟"}, {"arabic": " وَ کَیۡفَ تَاۡخُذُوۡنَہٗ وَ قَدۡ اَفۡضٰی بَعۡضُکُمۡ اِلٰی بَعۡضٍ وَّ اَخَذۡنَ مِنۡکُمۡ مِّیۡثَاقًا غَلِیۡظًا ﴿۲۲﴾", "english": " And how can you take it when one of you has been alone with the other, and they (the women) have taken from you a strong covenant?", "french": " Et comment le reprendriez vous quand vous vous êtes rencontrés intimement l’un et l’autre, et qu’elles ont reçu de vous un engagement solide ?", "german": " Und wie könnt ihr es nehmen, wo ihr eins miteinander geworden seid und sie (die Frauen) ein festes Versprechen von euch abgenommen haben?", "spanish": " Y ¿cómo podríais quitárselo si habéis convivido a solas el uno con el otro, y ellas (las mujeres) han recibido vuestra solemne promesa?", "urdu": " اور تم اس (مال) کو کس طرح لے سکتے ہو جبکہ تم آپس میں مل چکے ہو اور وہ (بیویاں) تم سے ایک مضبوط عہد لے چکی ہیں۔"}, {"arabic": " وَ لَا تَنۡکِحُوۡا مَا نَکَحَ اٰبَآؤُکُمۡ مِّنَ النِّسَآءِ اِلَّا مَا قَدۡ سَلَفَ ؕ اِنَّہٗ کَانَ فَاحِشَۃً وَّ مَقۡتًا ؕ وَ سَآءَ سَبِیۡلًا ﴿٪۲۳﴾", "english": " And marry not those women whom your fathers married, except what has already passed. It is a thing foul and hateful and an evil way.", "french": " Sauf si cela a déjà eu lieu, ne prenez pas pour femmes celles que vos pères avaient épousées. C’est une infamie, une abomination et une conduite indigne.", "german": " Und heiratet nicht solche Frauen, die eure Väter geheiratet hatten, außer das sei bereits geschehen. Es war schändlich, zornerregend – ein übler Brauch!", "spanish": " Y no os caséis con las mujeres que vuestros padres han tenido por esposas, salvo que se trate de un hecho consumado. Es algo abominable y odioso y un pésimo camino.", "urdu": " اور ان عورتوں میں سے جنہیں تمہارے باپ دادے نکاح میں لا چکے ہوں کسی سے نکاح نہ کرو مگر جو (پہلے) گذر گیا (سو گذر گیا) یہ (فعل) یقیناً گندہ اور غصہ دلانے والا تھا اور (یہ) بہت بری رسم تھی۔"}, {"arabic": " حُرِّمَتۡ عَلَیۡکُمۡ اُمَّہٰتُکُمۡ وَ بَنٰتُکُمۡ وَ اَخَوٰتُکُمۡ وَ عَمّٰتُکُمۡ وَ خٰلٰتُکُمۡ وَ بَنٰتُ الۡاَخِ وَ بَنٰتُ الۡاُخۡتِ وَ اُمَّہٰتُکُمُ الّٰتِیۡۤ اَرۡضَعۡنَکُمۡ وَ اَخَوٰتُکُمۡ مِّنَ الرَّضَاعَۃِ وَ اُمَّہٰتُ نِسَآئِکُمۡ وَ رَبَآئِبُکُمُ الّٰتِیۡ فِیۡ حُجُوۡرِکُمۡ مِّنۡ نِّسَآئِکُمُ الّٰتِیۡ دَخَلۡتُمۡ بِہِنَّ ۫ فَاِنۡ لَّمۡ تَکُوۡنُوۡا دَخَلۡتُمۡ بِہِنَّ فَلَا جُنَاحَ عَلَیۡکُمۡ ۫ وَ حَلَآئِلُ اَبۡنَآئِکُمُ الَّذِیۡنَ مِنۡ اَصۡلَابِکُمۡ ۙ وَ اَنۡ تَجۡمَعُوۡا بَیۡنَ الۡاُخۡتَیۡنِ اِلَّا مَا قَدۡ سَلَفَ ؕ اِنَّ اللّٰہَ کَانَ غَفُوۡرًا رَّحِیۡمًا ﴿ۙ۲۴﴾", "english": " Forbidden to you are your mothers, and your daughters, and your sisters, and your fathers’ sisters, and your mothers’ sisters, and brother’s daughters, and sister’s daughters, and your foster -mothers that have given you suck, and your foster-sisters, and the mothers of your wives, and your stepdaughters, who are your wards by your wives unto whom you have gone in — but if you have not gone in unto them, there shall be no sin upon you — and the wives of your sons that are from your loins; and it is forbidden to you to have two sisters together in marriage , except what has already passed; surely, Allah is Most Forgiving, Merciful.", "french": " Vous sont interdites vos mères, vos filles, vos sœurs, les sœurs de vos pères, les sœurs de vos mères, les filles de votre frère, les filles de votre sœur, vos mères nourricières qui vous ont allaités, vos sœurs de lait, les mères de vos femmes, vos belles-filles, qui sont vos pupilles, par les femmes avec lesquelles vous avez consommé le mariage – mais si le mariage n’a pas été consommé, ce ne sera pas un péché pour vous – et les femmes de vos fils qui sont sortis de vos reins ; et il vous est défendu d’avoir deux sœurs en même temps en état de mariage , sauf si cela a déjà eu lieu ; assurément, Allāh est Très-Pardonnant, Miséricordieux.", "german": " Verboten sind euch eure Mütter und eure Töchter und eure Schwestern, eures Vaters Schwestern und eurer Mutter Schwestern, die Bruderstöchter und die Schwestertöchter, eure Nährmütter, die euch gesäugt, und eure Milchschwestern, und die Mütter eurer Frauen und eure Stieftöchter – die in eurem Schutze sind – von euren Frauen, denen ihr schon beigewohnt; doch wenn ihr ihnen noch nicht beigewohnt habt, dann soll´s euch keine Sünde sein. Ferner die Frauen eurer Söhne, die von euren Lenden sind; auch dass ihr zwei Schwestern gleichzeitig habt, außer das sei bereits geschehen; wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Os están prohibidas vuestras madres, vuestras hijas, vuestras hermanas, las hermanas de vuestros padres y las de vuestras madres, las hijas de un hermano y las de una hermana, vuestras nodrizas que os hayan amamantado, vuestras hermanas de leche y las madres de vuestras esposas, vuestras ahijadas, que son vuestras pupilas por ser hijas de las mujeres con las que hayáis cohabitado –pero si no habéis cohabitado con ellas, no cometéis pecado- y las esposas de vuestros hijos carnales; y os está prohibido contraer matrimonio a la vez con dos hermanas, salvo que se trate de un hecho consumado; en verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " تمہاری مائیں اور تمہاری بیٹیاں اور تمہاری بہنیں اور تمہاری پھوپھیاں اور تمہاری خالائیں اور (تمہاری) بھتیجیاں اور (تمہاری) بھانجیاں اور تمہاری (رضاعی) مائیں جنہوں نے تمہیں دودھ پلایا ہو اور تمہاری رضاعی بہنیں اور تمہاری ساسیں اور تمہاری وہ سوتیلی لڑکیاں جو تمہاری ان بیویوں سے ہوں جن سے تم خلوت کر چکے ہو اور وہ تمہارے گھروں میں پلتی ہوں تم پر حرام کی گئی ہیں۔ لیکن اگر تم نے ان (بیویوں) سے خلوت نہ کی ہو تو (ان کی لڑکیوں سے نکاح کرنے میں) تم پر کوئی گناہ نہیں‘ اور (اسی طرح) تمہارے ان بیٹوں کی بیویاں جو تمہاری پشت سے ہوں (تم پر حرام ہیں) اور یہ (بھی) کہ تم دو بہنوں کو (اپنے نکاح میں) جمع کرو۔ ہاں جو گذر گیا (سو گذر گیا) اللہ یقیناً بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَّ الۡمُحۡصَنٰتُ مِنَ النِّسَآءِ اِلَّا مَا مَلَکَتۡ اَیۡمَانُکُمۡ ۚ کِتٰبَ اللّٰہِ عَلَیۡکُمۡ ۚ وَ اُحِلَّ لَکُمۡ مَّا وَرَآءَ ذٰلِکُمۡ اَنۡ تَبۡتَغُوۡا بِاَمۡوَالِکُمۡ مُّحۡصِنِیۡنَ غَیۡرَ مُسٰفِحِیۡنَ ؕ فَمَا اسۡتَمۡتَعۡتُمۡ بِہٖ مِنۡہُنَّ فَاٰتُوۡہُنَّ اُجُوۡرَہُنَّ فَرِیۡضَۃً ؕ وَ لَا جُنَاحَ عَلَیۡکُمۡ فِیۡمَا تَرٰضَیۡتُمۡ بِہٖ مِنۡۢ بَعۡدِ الۡفَرِیۡضَۃِ ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا حَکِیۡمًا ﴿۲۵﴾", "english": " And forbidden to you are married women, except such as your right hands possess. This has Allah enjoined on you. And allowed to you are those beyond that, that you seek them by means of your property, marrying them properly and not committing fornication. And for the benefit you receive from them, give them their dowries, as fixed, and there shall be no sin for you in anything you mutually agree upon, after the fixing of the dowry . Surely, Allah is All-Knowing, Wise.", "french": " Vous sont interdites les femmes qui sont déjà mariées, excepté celles que votre main droite possède. Voilà ce qu’Allāh vous a prescrit. Et il vous est permis toutes les autres femmes que vous chercherez au moyen de vos biens, les épousant convenablement et non en débauchés. Et en retour des avantages provenant d’elles, remettez-leur leurs dots comme une obligation et il n’y aura pas de péché une fois la question de la dot réglée, concernant ce que vous pourrez consentir l’un à l’autre. Assurément Allāh est Omniscient, Sage.", "german": " Und (verboten sind euch) verheiratete Frauen, ausgenommen solche, die eure Rechte besitzt. Eine Verordnung Allahs für euch. Und erlaubt sind euch alle anderen, dass ihr sie sucht mit den Mitteln eures Vermögens, nur in richtiger Ehe und nicht in Unzucht. Und für die Freuden, die ihr von ihnen empfanget, gebt ihnen ihre Morgengabe, wie festgesetzt, und es soll keine Sünde für euch liegen in irgendetwas, worüber ihr euch gegenseitig einigt nach der Festsetzung (der Morgengabe). Wahrlich, Allah ist allwissend, allweise.", "spanish": " Y os están prohibidas las mujeres casadas, excepto lo que posean vuestras diestras. Esto os ha ordenado Al-lah. Y os está permitido lo que no queda mencionado, que podáis buscar gracias a vuestros bienes, desposándolas decentemente y evitando la fornicación. Y por el beneficio que recibís de ellas, entregadles sus dotes, según lo estipulado, y no pecaréis en lo que acordéis mutuamente después de fijada la dote . Ciertamente, Al-lah es Omnisciente, Sabio.", "urdu": " اور (پہلے سے) منکوحہ عورتیں (بھی تم پر حرام ہیں) باستثنا ان عورتوں کے جو تمہاری ملکیت میں آجائیں۔ یہ اللہ نے تم پر فرض کیا ہے اور جو ان (اوپر کی بیان کردہ عورتوں) کے سوا ہوں وہ تمہارے لئے (بعد نکاح) حلال ہیں (یعنی اس طرح سے) کہ تم اپنے مالوں کے ذریعہ (انہیں) طلب کرو بشرطیکہ تم شادی کرنے والے ہو زنا کرنے والے نہ ہو۔ پھر (یہ شرط بھی ہے کہ) اگر تم نے ان سے نفع اٹھایا ہو تو تم انہیں ان کے مہر بہ مقدار موعود ادا کرو۔ اور (مہر) مقرر ہو جانے کے بعد جس (کمی بیشی) پر تم باہم راضی ہو جاٶ اس کے متعلق تمہیں کوئی گناہ نہ ہوگا اللہ یقیناً بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ مَنۡ لَّمۡ یَسۡتَطِعۡ مِنۡکُمۡ طَوۡلًا اَنۡ یَّنۡکِحَ الۡمُحۡصَنٰتِ الۡمُؤۡمِنٰتِ فَمِنۡ مَّا مَلَکَتۡ اَیۡمَانُکُمۡ مِّنۡ فَتَیٰتِکُمُ الۡمُؤۡمِنٰتِ ؕ وَ اللّٰہُ اَعۡلَمُ بِاِیۡمَانِکُمۡ ؕ بَعۡضُکُمۡ مِّنۡۢ بَعۡضٍ ۚ فَانۡکِحُوۡہُنَّ بِاِذۡنِ اَہۡلِہِنَّ وَ اٰتُوۡہُنَّ اُجُوۡرَہُنَّ بِالۡمَعۡرُوۡفِ مُحۡصَنٰتٍ غَیۡرَ مُسٰفِحٰتٍ وَّ لَا مُتَّخِذٰتِ اَخۡدَانٍ ۚ فَاِذَاۤ اُحۡصِنَّ فَاِنۡ اَتَیۡنَ بِفَاحِشَۃٍ فَعَلَیۡہِنَّ نِصۡفُ مَا عَلَی الۡمُحۡصَنٰتِ مِنَ الۡعَذَابِ ؕ ذٰلِکَ لِمَنۡ خَشِیَ الۡعَنَتَ مِنۡکُمۡ ؕ وَ اَنۡ تَصۡبِرُوۡا خَیۡرٌ لَّکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿٪۲۶﴾", "english": " And whoso of you cannot afford to marry free, believing women, let him marry what your right hands possess, namely, your believing handmaids. And Allah knows your faith best; you are all one from another; so marry them with the leave of their masters and give them their dowries according to what is fair, they being chaste, not committing fornication, nor taking secret paramours. And if, after they are married, they are guilty of lewdness, they shall have half the punishment prescribed for free women. This is for him among you who fears lest he should commit sin. And that you restrain yourselves is better for you; and Allah is Most Forgiving, Merciful.", "french": " Et quiconque parmi vous n’aurait pas les moyens d’épouser les femmes libres croyantes, qu’il épouse celles que votre main droite possède, à savoir vos servantes croyantes. Et Allāh connaît votre foi mieux que quiconque. Vous êtes tous les uns des autres ; épousez-les donc avec l’autorisation de leurs maîtres, et donnez-leur leurs dots, en toute justice, pourvu qu’elles soient chastes, qu’elles ne commettent pas de fornication et qu’elles ne prennent pas d’amants en cachette. Et si après être mariées, elles sont coupables d’obscénités, elles auront la moitié du châtiment prescrit pour les femmes mariées libres. Ceci est pour celui d’entre vous qui craindrait de pécher ; mais si vous vous refrénez, cela vaudra encore mieux pour vous ; et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und wer von euch es sich nicht leisten kann, freie, gläubige Frauen zu heiraten: dann was eure Rechte besitzt, nämlich eure gläubigen Kriegsgefangenen. Und Allah kennt euren Glauben am besten. Die einen von euch sind von den anderen; so heiratet sie mit Erlaubnis ihrer Herren und gebt ihnen ihre Morgengabe nach Billigkeit, wenn sie keusch sind, nicht Unzucht treiben noch insgeheim Liebhaber nehmen. Und wenn sie, nachdem sie verheiratet sind, der Geilheit schuldig werden, dann sollen sie die Hälfte der Strafe erleiden, die für freie Frauen vorgeschrieben ist. Das gilt für den unter euch, der sich vor der Sünde fürchtet. Dass ihr euch aber zurückhaltet, ist besser für euch; und Allah ist allverzeihend, barmherzig.", "spanish": " Y aquel de vosotros que no pueda permitirse contraer matrimonio con mujeres creyentes libres, que se case con lo que posean vuestras diestras, es decir, vuestras siervas creyentes. Porque Al-lah conoce bien vuestra fe; sois todos uno del otro; casaos, pues, con el permiso de sus tutores y entregadles sus dotes según lo que es justo, si son castas, no cometen fornicación ni tienen amantes secretos. Y si después de casadas, son culpables de adulterio, sufrirán la mitad del castigo prescrito para las mujeres libres. Esto es para aquel de vosotros que tema caer en el pecado. Pero si os abstenéis será mejor para vosotros; y Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور جو (کوئی) تم میں سے آزاد مومن عورتوں سے شادی کرنے کی بالکل طاقت نہ رکھتا ہو (وہ) تمہاری مملوکہ (عورتوں) یعنی تمہاری مومن لونڈیوں میں سے کسی سے نکاح کر لے۔ اور اللہ تمہارے ایمان کو سب سے زیادہ جانتا ہے۔ تم ایک دوسرے سے (تعلق رکھتے) ہو۔ پس ان سے ان کے مالکوں کی اجازت سے نکاح کرو۔ اور ان کے مہر جب کہ وہ پاکباز ہوں نہ کہ زناکار اور نہ مخفی دوست بنانے والیاں انہیں دستور کے مطابق ادا کردو۔ پھر جب وہ نکاح میں آجائیں تو اگر وہ کسی قسم کی بے حیائی کی مرتکب ہوں تو ان کی سزا آزاد عورتوں کی نسبت نصف ہوگی۔ یہ (اجازت) اس کے لئے ہے جو تم میں سے گناہ سے ڈرتا ہو۔ اور تمہارا صبر کرنا تمہارے لئے بہتر ہے۔ اور اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " یُرِیۡدُ اللّٰہُ لِیُبَیِّنَ لَکُمۡ وَ یَہۡدِیَکُمۡ سُنَنَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ وَ یَتُوۡبَ عَلَیۡکُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۲۷﴾", "english": " Allah desires to make clear to you, and guide you to, the paths of those before you, and to turn to you in mercy. And Allah is All- Knowing, Wise.", "french": " Allāh désire vous éclairer et vous guider sur les chemins de vos devanciers, et aussi Se tourner vers vous avec clémence. Et Allāh est Omniscient, Sage.", "german": " Allah will euch die Wege derer klar machen, die vor euch waren, und euch dahin leiten und Sich in Gnade zu euch kehren. Und Allah ist allwissend, allweise.", "spanish": " Al-lah desea mostraros con claridad y guiaros por los caminos de quienes os precedieron, y volver a vosotros con misericordia. Y Al-lah es Omnisciente, Sabio.", "urdu": " اللہ چاہتا ہے کہ جو لوگ تم سے پہلے (گذرے) ہیں ان کے طریقے تمہارے لئے بیان کرے اور (ان کی طرف) تمہاری راہنمائی کرے اور تم پر شفقت کرے اور اللہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ اللّٰہُ یُرِیۡدُ اَنۡ یَّتُوۡبَ عَلَیۡکُمۡ ۟ وَ یُرِیۡدُ الَّذِیۡنَ یَتَّبِعُوۡنَ الشَّہَوٰتِ اَنۡ تَمِیۡلُوۡا مَیۡلًا عَظِیۡمًا ﴿۲۸﴾", "english": " And Allah wishes to turn to you in mercy, but those who follow their low desires wish that you should stray far away.", "french": " Et Allāh désire se tourner vers vous avec clémence, mais ceux qui suivent leurs bas désirs veulent que votre penchant pour eux soit très grand.", "german": " Und Allah wünscht Sich in Gnade zu euch zu kehren, die aber den niederen Gelüsten folgen, wünschen, dass ihr euch erniedrigt.", "spanish": " Y Al-lah desea volver a vosotros con misericordia, pero quienes siguen sus bajos deseos ansían extraviaros lejos.", "urdu": " اور اللہ تو (یہ) چاہتا ہے کہ تم پر شفقت کرے اور جو لوگ بری خواہشوں کے پیچھے پڑتے ہیں وہ چاہتے ہیں کہ تم (بدی کی طرف) بالکل جھک جاٶ۔"}, {"arabic": " یُرِیۡدُ اللّٰہُ اَنۡ یُّخَفِّفَ عَنۡکُمۡ ۚ وَ خُلِقَ الۡاِنۡسَانُ ضَعِیۡفًا ﴿۲۹﴾", "english": " Allah desires to lighten your burden, for man has been created weak.", "french": " Allāh désire alléger votre fardeau, car l’homme a été créé faible.", "german": " Allah will eure Bürde erleichtern, denn der Mensch ward schwach erschaffen.", "spanish": " Al-lah desea aligerar vuestra carga, porque el hombre ha sido creado débil.", "urdu": " اللہ چاہتا ہے کہ تم سے (بوجھ) ہلکا کرے اور انسان کو کمزور پیدا کیا گیا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَاۡکُلُوۡۤا اَمۡوَالَکُمۡ بَیۡنَکُمۡ بِالۡبَاطِلِ اِلَّاۤ اَنۡ تَکُوۡنَ تِجَارَۃً عَنۡ تَرَاضٍ مِّنۡکُمۡ ۟ وَ لَا تَقۡتُلُوۡۤا اَنۡفُسَکُمۡ ؕ اِنَّ اللّٰہَ کَانَ بِکُمۡ رَحِیۡمًا ﴿۳۰﴾", "english": " O ye who believe! devour not your property among yourselves by unlawful means, except that you earn by trade with mutual consent. And kill not yourselves. Surely, Allah is Merciful to you.", "french": " Ô vous qui croyez ! Ne dévorez pas entre vous vos biens par des moyens illicites, à moins que ce soit une transaction entre vous par consentement mutuel. Et ne vous tuez pas vous-mêmes économiquement . Allāh est assurément Miséricordieux envers vous.", "german": " O die ihr glaubt, zehrt euren Besitz nicht untereinander auf durch Falsches, es sei denn, dass ihr im Handel (verdient) mit gegenseitigem Einverständnis. Und tötet euch nicht selbst. Siehe, Allah ist barmherzig gegen euch.", "spanish": " ¡Oh vosotros, los que creéis! no devoréis vuestros bienes entre vosotros por medios ilícitos, excepto que lo ganéis por el comercio y por mutuo consentimiento. Y no os matéis vosotros mismos. En verdad, Al-lah es Misericordioso con vosotros.", "urdu": " اے ایماندارو! تم آپس میں ناجائز طور پر اپنے مال نہ کھاٶ۔ ہاں یہ جائز ہے کہ (مال کا حصول) آپس کی رضا کے ساتھ تجارت کے ذریعہ سے ہو۔ اور تم اپنے آپ کو قتل نہ کرو۔ اللہ یقیناً تم پر باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ عُدۡوَانًا وَّ ظُلۡمًا فَسَوۡفَ نُصۡلِیۡہِ نَارًا ؕ وَ کَانَ ذٰلِکَ عَلَی اللّٰہِ یَسِیۡرًا ﴿۳۱﴾", "english": " And whosoever does that by way of transgression and injustice, We shall cast him into Fire; and that is easy with Allah.", "french": " Et quiconque fait cela par transgression et injustice, Nous le jetterons au Feu, et cela est facile pour Allāh.", "german": " Und wer das in Frevelhaftigkeit und Ungerechtigkeit tut, den werden Wir ins Feuer stoßen; und das ist Allah ein leichtes.", "spanish": " Mas a quien lo haga con iniquidad e injusticia, lo haremos entrar en el Fuego: es cosa fácil para Al-lah.", "urdu": " اور جو (شخص بھی) یہ (یعنی دوسرے کا مال کھانا) زیادتی اور ظلم کی عادت کی وجہ سے کرے گا اسے ہم ضرور آگ میں ڈالیں گے اور یہ (امر) اللہ کے لئے آسان ہے۔"}, {"arabic": " اِنۡ تَجۡتَنِبُوۡا کَبَآئِرَ مَا تُنۡہَوۡنَ عَنۡہُ نُکَفِّرۡ عَنۡکُمۡ سَیِّاٰتِکُمۡ وَ نُدۡخِلۡکُمۡ مُّدۡخَلًا کَرِیۡمًا ﴿۳۲﴾", "english": " If you keep away from the more grievous of the things which are forbidden you, We will remove from you your minor evils and admit you to a place of great honour.", "french": " Si vous vous abstenez des plus graves péchés qui vous sont interdits, Nous vous débarrasserons de vos méfaits et Nous vous admettrons dans un lieu de grand honneur.", "german": " Wenn ihr euch von den schwereren unter den euch verbotenen Dingen fernhaltet, dann werden Wir eure geringeren Übel von euch hinwegnehmen und euch an einen ehrenvollen Platz führen.", "spanish": " Si os alejáis de las peores cosas de las que os están prohibidas, os absolveremos de vuestras faltas menores y os admitiremos en un lugar de gran honra.", "urdu": " جن (باتوں) سے تمہیں روکا جاتا ہے۔ اگر ان میں سے بڑی (بڑی باتوں) سے تم دور رہو تو ہم تم سے تمہارے عیب دور کر دیں گے اور تمہیں معزز مقام میں داخل کریں گے۔"}, {"arabic": " وَ لَا تَتَمَنَّوۡا مَا فَضَّلَ اللّٰہُ بِہٖ بَعۡضَکُمۡ عَلٰی بَعۡضٍ ؕ لِلرِّجَالِ نَصِیۡبٌ مِّمَّا اکۡتَسَبُوۡا ؕ وَ لِلنِّسَآءِ نَصِیۡبٌ مِّمَّا اکۡتَسَبۡنَ ؕ وَ سۡئَلُوا اللّٰہَ مِنۡ فَضۡلِہٖ ؕ اِنَّ اللّٰہَ کَانَ بِکُلِّ شَیۡءٍ عَلِیۡمًا ﴿۳۳﴾", "english": " And covet not that whereby Allah has made some of you excel others. Men shall have a share of that which they have earned, and women a share of that which they have earned. And ask Allah of His bounty. Surely, Allah has perfect knowledge of all things.", "french": " Et ne convoitez pas ces choses par lesquelles Allāh a fait que certains d’entre vous surpassent les autres. Les hommes recevront une part de ce qu’ils auront gagné, et les femmes recevront une part de ce qu’elles auront gagné. Et demandez à Allāh de Sa munificence. Assurément, Allāh a une parfaite connaissance de toutes choses.", "german": " Und begehrt nicht das, womit Allah die einen von euch vor den anderen ausgezeichnet hat. Die Männer sollen ihren Anteil erhalten nach ihrem Verdienst, und die Frauen sollen ihren Anteil erhalten nach ihrem Verdienst. Und bittet Allah um Seine Huld. Wahrlich, Allah hat vollkommene Kenntnis von allen Dingen.", "spanish": " Y no ambicionéis aquello en lo que Al-lah ha hecho que algunos superéis a otros. Los hombres tendrán una parte de lo que han ganado y las mujeres parte de lo que también han ganado. Pedid a Al-lah de Su magnanimidad. En verdad, Al-lah conoce perfectamente todas las cosas.", "urdu": " اور جس (چیز کے ذریعہ) سے اللہ نے تم میں سے بعض کو بعض (دوسروں) پر فضیلت دی ہے اس کی خواہش نہ کرو۔ جو کچھ مردوں نے کمایا ہے اس میں سے ان کا حصہ ہے اور جو کچھ عورتوں نے کمایا ہے اس میں سے ان کا حصہ ہے اور تم اللہ (ہی) سے اس کے فضل کا حصہ مانگو۔ اللہ ہر ایک چیز کو یقیناً بہت جاننے والا ہے۔"}, {"arabic": " وَ لِکُلٍّ جَعَلۡنَا مَوَالِیَ مِمَّا تَرَکَ الۡوَالِدٰنِ وَ الۡاَقۡرَبُوۡنَ ؕ وَ الَّذِیۡنَ عَقَدَتۡ اَیۡمَانُکُمۡ فَاٰتُوۡہُمۡ نَصِیۡبَہُمۡ ؕ اِنَّ اللّٰہَ کَانَ عَلٰی کُلِّ شَیۡءٍ شَہِیۡدًا ﴿٪۳۴﴾", "english": " And to every one We have appointed heirs to what the parents and the relations leave, and also those with whom your oaths have ratified a contract. So give them their portion. Surely, Allah watches over all things.", "french": " Et pour chacun, Nous avons nommé des héritiers pour ce que laisseront les parents et les proches parents et aussi pour ceux avec lesquels vous vous êtes engagés sous la foi du serment. Alors donnez-leur leur part. En vérité, Allāh surveille tout.", "german": " Und einem jeden haben Wir Erben bestimmt für das, was Eltern und Verwandte hinterlassen und jene, mit denen eure Eide einen Bund bekräftigt haben. So gebt ihnen denn ihr Teil. Siehe, Allah hat aller Dinge acht.", "spanish": " Y hemos instituido a cada uno heredero de lo que dejan sus padres y familiares, y también aquellos con quienes vuestros juramentos ratificaron un contrato. Dadles, pues, su parte. En verdad, Al-lah vigila todas las cosas.", "urdu": " اور ہر ایک (شخص) کے لئے ہم نے اس کے ترکہ کے متعلق وارث مقرر کردئے ہیں (وہ وارث) ماں باپ اور قریبی رشتہ دار (ہیں) اور وہ (بھی) جن کے ساتھ تم نے پکے عہدو پیمان کیے ہیں (یعنی بیویاں یا خاوند) سو ان کو بھی ان کا مقررہ حصہ دو۔ اور اللہ ہر ایک امر پر یقیناً نگران ہے۔"}, {"arabic": " اَلرِّجَالُ قَوّٰمُوۡنَ عَلَی النِّسَآءِ بِمَا فَضَّلَ اللّٰہُ بَعۡضَہُمۡ عَلٰی بَعۡضٍ وَّ بِمَاۤ اَنۡفَقُوۡا مِنۡ اَمۡوَالِہِمۡ ؕ فَالصّٰلِحٰتُ قٰنِتٰتٌ حٰفِظٰتٌ لِّلۡغَیۡبِ بِمَا حَفِظَ اللّٰہُ ؕ وَ الّٰتِیۡ تَخَافُوۡنَ نُشُوۡزَہُنَّ فَعِظُوۡہُنَّ وَ اہۡجُرُوۡہُنَّ فِی الۡمَضَاجِعِ وَ اضۡرِبُوۡہُنَّ ۚ فَاِنۡ اَطَعۡنَکُمۡ فَلَا تَبۡغُوۡا عَلَیۡہِنَّ سَبِیۡلًا ؕ اِنَّ اللّٰہَ کَانَ عَلِیًّا کَبِیۡرًا ﴿۳۵﴾", "english": " Men are guardians over women because Allah has made some of them excel others, and because they (men) spend of their wealth. So virtuous women are those who are obedient, and guard the secrets of their husbands with Allah’s protection. And as for those on whose part you fear disobedience, admonish them and leave them alone in their beds, and chastise them. Then if they obey you, seek not a way against them. Surely, Allah is High, Great.", "french": " Les hommes sont les gardiens des femmes, parce qu’Allāh a fait que les uns surpassent les autres et parce qu’ils dépensent de leurs biens. Ainsi les femmes vertueuses sont celles qui sont obéissantes et gardent les secrets de leurs maris avec la protection d’Allāh. Et quant à celles dont vous craignez la désobéissance, admonestez-les, et laissez-les seules dans leur lit et si besoin en est châtiez-les. Alors si elles vous obéissent, ne cherchez pas de moyen contre elles. Assurément, Allāh est Très-Elevé et est Grand sans comparaison.", "german": " Die Männer sind die Verantwortlichen über die Frauen, weil Allah die einen vor den anderen ausgezeichnet hat und weil sie von ihrem Vermögen hingeben. Darum sind tugendhafte Frauen die Gehorsamen und die (ihrer Gatten) Geheimnisse mit Allahs Hilfe wahren. Und jene, von denen ihr Widerspenstigkeit befürchtet, ermahnt sie, lasst sie allein in den Betten und straft sie. Wenn sie euch dann gehorchen, so sucht keine Ausrede gegen sie; Allah ist hoch erhaben, groß.", "spanish": " Los hombres son protectores de las mujeres porque Al-lah ha hecho que algunos de ellos sobresalgan sobre otros y porque ellos (los hombres) gastan de sus bienes. Así pues, las mujeres virtuosas son las que son obedientes y guardan los secretos de sus maridos con la protección de Al-lah. En cuanto a aquéllas de las que temáis desobediencia, amonestadlas, dejadlas solas en sus lechos y castigadlas. Pero si después os obedecen, no busquéis otro camino contra ellas. Ciertamente, Al-lah es Excelso, Grande.", "urdu": " مرد عورتوں پراس فضیلت کے سبب سے جو اللہ نے ان میں سے بعض کو دوسروں پر دی ہے اوراس سبب سے کہ وہ اپنے مالوں میں سے (عورتوںپر) خرچ کر چکے ہیں نگران (قرار دیئے گئے) ہیں۔ پس نیک عورتیں فرمانبرداراوراللہ کی مدد سے پوشیدہ امورکی محافظ ہوتی ہیں اورجن کی نافرمانی کا تمہیں خوف ہو (تم) انہیں نصیحت کرواورانہیں خواب گاہوں میں اکیلا چھوڑ دواورانہیں مارو۔ پھراگروہ تمہاری اطاعت کرنے لگیں تو ان کے خلاف کوئی بہانہ نہ تلاش کرو۔ اللہ یقیناً بہت بلند (اور) بڑا ہے۔"}, {"arabic": " وَ اِنۡ خِفۡتُمۡ شِقَاقَ بَیۡنِہِمَا فَابۡعَثُوۡا حَکَمًا مِّنۡ اَہۡلِہٖ وَ حَکَمًا مِّنۡ اَہۡلِہَا ۚ اِنۡ یُّرِیۡدَاۤ اِصۡلَاحًا یُّوَفِّقِ اللّٰہُ بَیۡنَہُمَا ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا خَبِیۡرًا ﴿۳۶﴾", "english": " And if you fear a breach between them, then appoint an arbiter from his folk and an arbiter from her folk. If they (the arbiters) desire reconciliation, Allah will effect it between them. Surely, Allah is All-Knowing, All-Aware.", "french": " Et si vous craignez une rupture entre les deux, alors désignez un arbitre de sa famille à lui, et un arbitre de sa famille à elle. Si les deux désirent une réconciliation, Allāh amènera l’entente entre eux. Assurément, Allāh est Omniscient, Très-Conscient.", "german": " Und befürchtet ihr ein Zerwürfnis zwischen ihnen, dann bestimmt einen Schiedsrichter aus seiner Sippe und einen Schiedsrichter aus ihrer Sippe. Wenn diese dann Aussöhnung herbeiführen wollen, so wird Allah zwischen ihnen (den Eheleuten) vergleichen. Siehe, Allah ist allwissend, allkundig.", "spanish": " Y si teméis una ruptura entre ellos, nombrad a un árbitro de la gente de él y a otro de la de ella. Si desean la reconciliación, Al-lah la realizará entre ellos. En verdad, Al-lah es Omnisciente, el que Todo lo Sabe.", "urdu": " اور اگر تمہیں ان دونوں (یعنی میاں بیوی) کے آپس (کے تعلقات) میں تفرقہ کا خوف ہو تو ایک پنچ اس (یعنی مرد) کے رشتہ داروں سے اور ایک پنچ اس (یعنی عورت) کے رشتہ داروں سے مقرر کرو (پھر) اگر وہ دونوں (پنچ) صلح کرانا چاہیں تو اللہ ان دونوں (میاں بیوی) کے درمیان موافقت پیدا کر دے گا۔ اللہ یقیناً بہت جاننے والا (اور) خبردار ہے۔"}, {"arabic": " وَ اعۡبُدُوا اللّٰہَ وَ لَا تُشۡرِکُوۡا بِہٖ شَیۡئًا وَّ بِالۡوَالِدَیۡنِ اِحۡسَانًا وَّ بِذِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ الۡجَارِ ذِی الۡقُرۡبٰی وَ الۡجَارِ الۡجُنُبِ وَ الصَّاحِبِ بِالۡجَنۡۢبِ وَ ابۡنِ السَّبِیۡلِ ۙ وَ مَا مَلَکَتۡ اَیۡمَانُکُمۡ ؕ اِنَّ اللّٰہَ لَا یُحِبُّ مَنۡ کَانَ مُخۡتَالًا فَخُوۡرَا ﴿ۙ۳۷﴾", "english": " And worship Allah and associate naught with Him, and show kindness to parents, and to kindred, and orphans, and the needy, and to the neighbour that is a kinsman and the neighbour that is a stranger, and the companion by your side, and the wayfarer, and those whom your right hands possess. Surely, Allah loves not the proud and the boastful,", "french": " Et adorez Allāh et ne Lui associez rien et témoignez de la bonté envers les parents, les proches parents, les orphelins et les indigents, le voisin qui vous est apparenté, et le voisin qui vous est étranger, et le compagnon qui est à votre côté, le voyageur, et ceux que vos mains droites possèdent. Assurément, Allāh n’aime pas les gens orgueilleux et vaniteux,", "german": " Verehrt Allah und setzet Ihm nichts zur Seite, und (erweiset) Güte den Eltern, den Verwandten, den Waisen und den Bedürftigen, dem Nachbarn, der ein Anverwandter, und dem Nachbarn, der ein Fremder ist, dem Gefährten an eurer Seite und dem Wanderer und denen, die eure Rechte besitzt. Wahrlich, Allah liebt nicht die Stolzen, die Prahler;", "spanish": " Y adorad a Al-lah y no asociéis nada a Él y mostrad bondad a los padres, a los parientes, a los huérfanos y necesitados, al vecino afín a vosotros y al extraño, al compañero que está a vuestro lado, al viajero y a los que poseen vuestras diestras. En verdad, Al-lah no ama a los orgullosos ni a los jactanciosos;", "urdu": " اور تم اللہ کی عبادت کرو اور کسی چیز کو اس کا شریک نہ بناٶ اور والدین کے ساتھ (بہت) احسان (کرو) اور (نیز) رشتہ داروں اور یتیموں اور مسکینوں کے ساتھ اور (اسی طرح) رشتہ دار ہمسایوں اور بے تعلق ہمسایوں اور پہلو (میں بیٹھنے) والے لوگوں اور مسافروں اور جن کے تم مالک ہو (ان کے ساتھ بھی) (اور) جو متکبر اور اترانے والے ہوں انہیں اللہ ہرگز پسند نہیں کرتا۔"}, {"arabic": " ۣالَّذِیۡنَ یَبۡخَلُوۡنَ وَ یَاۡمُرُوۡنَ النَّاسَ بِالۡبُخۡلِ وَ یَکۡتُمُوۡنَ مَاۤ اٰتٰہُمُ اللّٰہُ مِنۡ فَضۡلِہٖ ؕ وَ اَعۡتَدۡنَا لِلۡکٰفِرِیۡنَ عَذَابًا مُّہِیۡنًا ﴿ۚ۳۸﴾", "english": " Who are niggardly and enjoin people to be niggardly, and conceal that which Allah has given them of His bounty. And We have prepared for the disbelievers an humiliating punishment,", "french": " Ceux qui sont avares et encouragent l’avarice chez les autres, et qui dissimulent ce qu’Allāh leur a accordé de Sa munificence – et Nous avons préparé pour les mécréants un châtiment humiliant –", "german": " die da geizig sind und die Menschen zum Geiz verleiten, und verhehlen, was Allah ihnen von Seiner Huld gewährt hat. Und Wir haben den Ungläubigen schmähliche Strafe bereitet;", "spanish": " Que son avaros y ordenan a los hombres ser tacaños, y ocultan lo que Al-lah les ha dado de Su magnanimidad. Pues para los incrédulos hemos preparado un castigo ignominioso;", "urdu": " جو (خود بھی) بخل کرتے ہیں اور (دوسرے( لوگوں کو (بھی) بخل کرنے کی ہدایت کرتے ہیں اور جو کچھ اللہ نے اپنے فضل سے انہیں دیا ہے اسے چھپاتے ہیں اور ہم نے کافروں کے لئے ذلیل کرنے والا عذاب تیار کیا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ رِئَآءَ النَّاسِ وَ لَا یُؤۡمِنُوۡنَ بِاللّٰہِ وَ لَا بِالۡیَوۡمِ الۡاٰخِرِ ؕ وَ مَنۡ یَّکُنِ الشَّیۡطٰنُ لَہٗ قَرِیۡنًا فَسَآءَ قَرِیۡنًا ﴿۳۹﴾", "english": " And for those who spend their wealth to be seen of men, and believe not in Allah nor the Last Day. And whoso has Satan for his companion, let him remember that an evil companion is he.", "french": " Et pour ceux qui dépensent leurs biens par ostentation, et ne croient ni en Allāh ni au Jour Dernier. Et quiconque a Satan comme compagnon, qu’il se souvienne quel mauvais compagnon il est.", "german": " und jenen, die ihr Gut spenden den Leuten zur Schau, und nicht an Allah und an den Jüngsten Tag glauben. Und wer Satan zum Gefährten hat – welch ein übler Gefährte ist er!", "spanish": " Y también para quienes gastan su dinero para ser vistos por los hombres y no creen en Al-lah ni en el Último Día. Y quien tenga a Satanás por compañero, recordadle qué pésimo compañero tiene.", "urdu": " اور جو لوگ اپنے مال لوگوں کو دکھانے کے لئے خرچ کرتے ہیں اور نہ اللہ پر ایمان رکھتے ہیں اور نہ پیچھے آنے والے دن پر (ان کا انجام برا ہوگا) اور جس (شخص) کا شیطان ساتھی ہو (وہ یاد رکھے کہ) وہ بہت برا ساتھی ہے۔"}, {"arabic": " وَ مَاذَا عَلَیۡہِمۡ لَوۡ اٰمَنُوۡا بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ اَنۡفَقُوۡا مِمَّا رَزَقَہُمُ اللّٰہُ ؕ وَ کَانَ اللّٰہُ بِہِمۡ عَلِیۡمًا ﴿۴۰﴾", "english": " And what harm would have befallen them, if they had believed in Allah and the Last Day and spent out of what Allah has given them? And Allah knows them full well.", "french": " Et quel mal leur serait survenu s’ils avaient cru en Allāh et au Jour Dernier et qu’ils avaient dépensé de ces biens qu'Allāh leur a accordés ? Et Allāh les connaît très bien.", "german": " Und was würde ihnen (Böses) widerfahren sein, hätten sie an Allah und an den Jüngsten Tag geglaubt und von dem gespendet, was Allah ihnen gegeben? Und Allah kennt sie wohl.", "spanish": " Pero ¿qué daño les habría sobrevenido si hubiesen creído en Al-lah y en el Último Día y gastado de lo que Al-lah les ha dado? Y Al-lah les conoce muy bien.", "urdu": " اور ان پر کیا (قہر ٹوٹتا) تھا اگر وہ اللہ پر اور پیچھے آنے والے دن پر ایمان لے آتے اور جو (کچھ) اللہ نے انہیں دیا ہے اس میں سے (اس کی راہ میں) خرچ کرتے‘ اور اللہ ان کے متعلق خوب علم رکھتا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ لَا یَظۡلِمُ مِثۡقَالَ ذَرَّۃٍ ۚ وَ اِنۡ تَکُ حَسَنَۃً یُّضٰعِفۡہَا وَ یُؤۡتِ مِنۡ لَّدُنۡہُ اَجۡرًا عَظِیۡمًا ﴿۴۱﴾", "english": " Surely, Allah wrongs not any one even by the weight of an atom. And if there be a good deed, He multiplies it and gives from Himself a great reward.", "french": " Assurément, Allāh ne fait de tort à personne même pas du poids d’un atome. Et s’il est une bonne action, Il la multiplie et octroie, de Sa part, une très grande récompense.", "german": " Wahrlich, Allah, Er tut nicht Unrecht auch nur für eines Stäubchens Gewicht. Und ist da irgendeine gute Tat, so verdoppelt Er sie viele Male und gibt von Sich aus großen Lohn.", "spanish": " En verdad, Al-lah no es injusto con nadie ni en el peso de un átomo. Y si se realizan buenas obras, Él las multiplica y concede por Su parte una magnífica recompensa.", "urdu": " اللہ ہرگز ایک ذرہ بھر بھی ظلم نہیں کرے گا اور اگر (کسی کی) کوئی نیکی ہوگی تو اسے بڑھائے گا اور اپنے پاس سے (بھی) بہت بڑا اجر دے گا۔"}, {"arabic": " فَکَیۡفَ اِذَا جِئۡنَا مِنۡ کُلِّ اُمَّۃٍۭ بِشَہِیۡدٍ وَّ جِئۡنَا بِکَ عَلٰی ہٰۤؤُلَآءِ شَہِیۡدًا ﴿ؕ۴۲﴾؃", "english": " And how will it fare with them when We shall bring a witness from every people, and shall bring thee as a witness against these!", "french": " Et quel sera l’état de ces gens quand Nous produirons un témoin de chaque communauté, et que Nous te ferons venir comme témoin contre ceux-là ?", "german": " Und wie (wird es ihnen ergehen), wenn Wir aus jedem Volk einen Zeugen herbeibringen und dich als Zeugen herbeibringen wider diese?", "spanish": " Y ¿qué suerte correrán cuando traigamos a un testigo de cada pueblo y te presentemos a ti como testigo contra ellos?", "urdu": " اور ان کا کیا حال ہوگا جب ہم ہر ایک جماعت میں سے ایک گواہ لائیں گے اور تجھے ان لوگوں کے متعلق (بطور) گواہ لائیں گے۔"}, {"arabic": " یَوۡمَئِذٍ یَّوَدُّ الَّذِیۡنَ کَفَرُوۡا وَ عَصَوُا الرَّسُوۡلَ لَوۡ تُسَوّٰی بِہِمُ الۡاَرۡضُ ؕ وَ لَا یَکۡتُمُوۡنَ اللّٰہَ حَدِیۡثًا ﴿٪۴۳﴾", "english": " On that day those who disbelieved and disobeyed the Messenger will wish that the earth were made level with them, and they shall not be able to conceal anything from Allah.", "french": " Ce jour-là, ceux qui n’ont pas cru et qui ont désobéi au Messager souhaiteront que la terre fût nivelée sur eux ; et ils ne pourront rien cacher à Allāh.", "german": " An jenem Tage werden die, welche ungläubig waren und dem Gesandten den Gehorsam versagten, wünschen, dass doch die Erde über ihnen geebnet würde, und sie werden nichts vor Allah verbergen können.", "spanish": " En ese día los que no creyeron al Mensajero y lo desobedecieron desearían que se les tragara la tierra, pero no podrán esconder nada a Al-lah.", "urdu": " اس دن جنہوں نے کفر کیا ہے اور (اس) رسول کی نافرمانی کی ہے خواہش کریں گے کہ (کاش) ان کو زمین میں دفن کر دیا جاتا۔ اور وہ اللہ سے کوئی بات نہ چھپا سکیں گے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَقۡرَبُوا الصَّلٰوۃَ وَ اَنۡتُمۡ سُکٰرٰی حَتّٰی تَعۡلَمُوۡا مَا تَقُوۡلُوۡنَ وَ لَا جُنُبًا اِلَّا عَابِرِیۡ سَبِیۡلٍ حَتّٰی تَغۡتَسِلُوۡا ؕ وَ اِنۡ کُنۡتُمۡ مَّرۡضٰۤی اَوۡ عَلٰی سَفَرٍ اَوۡ جَآءَ اَحَدٌ مِّنۡکُمۡ مِّنَ الۡغَآئِطِ اَوۡ لٰمَسۡتُمُ النِّسَآءَ فَلَمۡ تَجِدُوۡا مَآءً فَتَیَمَّمُوۡا صَعِیۡدًا طَیِّبًا فَامۡسَحُوۡا بِوُجُوۡہِکُمۡ وَ اَیۡدِیۡکُمۡ ؕ اِنَّ اللّٰہَ کَانَ عَفُوًّا غَفُوۡرًا ﴿۴۴﴾", "english": " O ye who believe! approach not Prayer when you are not in full possession of your senses, until you know what you say, nor when you are unclean, except when you are travelling along a way, until you have bathed. And if you are ill or you are on a journey while unclean , or if one of you comes from the privy or you have touched women and you find no water, then betake yourselves to pure dust and wipe therewith your faces and your hands. Surely, Allah is Most Indulgent, Most Forgiving.", "french": " Ô vous qui croyez ! N’approchez pas la Prière quand vous êtes dans un état de confusion mentale jusqu’à ce que vous ayez pleine connaissance de ce que vous dites, ni quand vous êtes dans un état d’impureté – sauf si vous êtes en voyage – avant de vous être lavés. Et si vous êtes malades ou en voyage et que vous n’êtes pas purs ou si l’un d’entre vous revient après s’être soulagé ou si vous avez touché des femmes, et que vous ne trouviez pas d’eau, alors recourez à la poussière pure et essuyez-vous- en le visage et les mains. Assurément Allāh est Très-Indulgent et est Très-Pardonnant.", "german": " O die ihr glaubt, nahet nicht dem Gebet, wenn ihr nicht bei Sinnen seid, bis ihr klar versteht, was ihr sprecht, noch im Zustande der Unreinheit – ausgenommen als Reisende unterwegs –, bis ihr gebadet habt. Und wenn ihr krank seid oder auf einer Reise (im Zustande der Unreinheit), oder einer von euch kommt vom Abtritt und wenn ihr Frauen berührt habt und findet kein Wasser, dann nehmt reinen Sand und reibt euch damit Gesicht und Hände. Wahrlich, Allah ist nachsichtig, allverzeihend.", "spanish": " ¡Oh vosotros, los que creéis! no os acerquéis a la Oración con la mente confusa hasta que sepáis lo que decís, ni cuando estéis impuros, y no recéis hasta que no os bañéis, excepto si estáis de viaje o nfermos. Mas si estáis enfermos o de viaje y no estáis limpios , o si uno de vosotros acaba de hacer sus necesidades o cohabitado con su mujer y no encuentra agua, recurrid a la arena pura y frotaos con ella la cara y las manos. En verdad, Al-lah es el Sumo Indulgente, Perdonador.", "urdu": " اے ایماندارو! جب تک تم اپنے حواس میں نہ ہو نماز کے قریب نہ جاٶ اس وقت تک کہ تم جو (کچھ) کہہ رہے ہو اسے سمجھنے (نہ) لگو اور نہ ہی جنبی ہونے کی حالت میں (نماز کے قریب جاٶ) جب تک نہا (نہ) لو سوائے اس کے کہ تم راستہ پر چل رہے ہو۔ اور اگر تم مریض ہو یا سفر پر ہو (اور تم جنبی ہو تو تیمم کر لیا کرو) یا تم میں سے کوئی جائے ضرور سے آیا ہو (اور تم کو پانی نہ ملے) اور تم عورتوں سے ہم صحبت بھی ہو چکے ہو (یعنی جنبی ہو) اور تمہیں پانی نہ ملے تو پاک مٹی کا قصد کرو (یعنی تیمم کرو) پھر (تم ان مٹی والے ہاتھوں کو) اپنے مونہوں اور ہاتھوں پر ملو۔ اللہ یقیناً بہت معاف کرنے والا (اور) بہت بخشنے والا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ اُوۡتُوۡا نَصِیۡبًا مِّنَ الۡکِتٰبِ یَشۡتَرُوۡنَ الضَّلٰلَۃَ وَ یُرِیۡدُوۡنَ اَنۡ تَضِلُّوا السَّبِیۡلَ ﴿ؕ۴۵﴾", "english": " Dost thou not know of those who were given a portion of the Book? They buy error and desire that you too may lose the way.", "french": " N’as-tu pas entendu parler de ceux à qui une partie du Livre avait été transmise ? Ils achètent l’erreur et désirent que vous vous égariez du droit chemin.", "german": " Weißt du nicht von jenen, denen ein Teil der Schrift gegeben wurde? Sie erkaufen Irrtum und wünschen, dass (auch) ihr vom Wege abirrt.", "spanish": " ¿No has visto a quienes se entregó una parte del Libro? Compran el error y desean que vosotros os desviéis también del camino.", "urdu": " کیا تجھے ان لوگوں کا حال معلوم نہیں جنہیں کتاب (الٰہی) سے کچھ حصہ دیا گیا تھا کہ وہ گمراہی کو اختیار کر رہے ہیں اور چاہتے ہیں کہ تم (بھی اصل) راستہ سے بھٹک جاٶ۔"}, {"arabic": " وَ اللّٰہُ اَعۡلَمُ بِاَعۡدَآئِکُمۡ ؕ وَ کَفٰی بِاللّٰہِ وَلِیًّا ٭۫ وَّ کَفٰی بِاللّٰہِ نَصِیۡرًا ﴿۴۶﴾", "english": " And Allah knows your enemies full well. And sufficient is Allah as a Friend, and sufficient is Allah as a Helper.", "french": " Et Allāh connaît le mieux vos ennemis. Allāh suffit comme Ami et Allāh suffit comme Aide.", "german": " Und Allah kennt eure Feinde besser. Allah genügt als Freund, und Allah genügt als Helfer.", "spanish": " Pero Al-lah conoce muy bien a vuestros enemigos. Y Al-lah es suficiente como Amigo, y suficiente como Socorredor.", "urdu": " اور اللہ تمہارے دشمنوں کو (تم سے) بڑھ کر جانتا ہے اور اللہ دوستی میں کافی ہے اور اللہ مددگار ہونے کے لحاظ سے بھی کافی ہے۔"}, {"arabic": " مِنَ الَّذِیۡنَ ہَادُوۡا یُحَرِّفُوۡنَ الۡکَلِمَ عَنۡ مَّوَاضِعِہٖ وَ یَقُوۡلُوۡنَ سَمِعۡنَا وَ عَصَیۡنَا وَ اسۡمَعۡ غَیۡرَ مُسۡمَعٍ وَّ رَاعِنَا لَـیًّۢا بِاَلۡسِنَتِہِمۡ وَ طَعۡنًا فِی الدِّیۡنِ ؕ وَ لَوۡ اَنَّہُمۡ قَالُوۡا سَمِعۡنَا وَ اَطَعۡنَا وَ اسۡمَعۡ وَ انۡظُرۡنَا لَکَانَ خَیۡرًا لَّہُمۡ وَ اَقۡوَمَ ۙ وَ لٰکِنۡ لَّعَنَہُمُ اللّٰہُ بِکُفۡرِہِمۡ فَلَا یُؤۡمِنُوۡنَ اِلَّا قَلِیۡلًا ﴿۴۷﴾", "english": " There are some among the Jews who pervert words from their proper places. And they say, ‘We hear and we disobey,’ and ‘hear thou without being heard,’ and ‘Ra‘ina,’ screening with their tongues what is in their minds and seeking to injure the Faith. And if they had said, ‘We hear and we obey,’ and ‘hear thou ,’ and ‘Unzurna,’ it would have been better for them and more upright. But Allah has cursed them for their disbelief; so they believe but little.", "french": " Il en est certains chez les Juifs qui faussent le sens des mots ; ils disent : « Nous entendons et nous désobéissons » et « Entends sans qu’on t’entende » et « Rā‘inā, » cachant avec leur langue ce qu’ils ont dans la pensée en vue de nuire à la Foi. Et s’ils avaient dit : « Nous entendons et nous obéissons » et « entends » et « Unẓurnā » (jette un regard sur nous), cela aurait mieux valu pour eux et aurait été plus droit. Mais Allāh les a maudits à cause de leur mécréance ; ainsi ils croient bien peu.", "german": " Es gibt welche unter den Juden, die Worte aus ihren Stellungen verdrehen und sagen: \"Wir hören und wir gehorchen nicht\", und \"Höre, ohne gehört zu werden\", und \"Sei uns nachsichtig\", indem sie mit ihren Zungen lügen und den Glauben verlästern. Und hätten sie gesagt: \"Wir hören und wir gehorchen\", und \"Höre\", und \"Schaue gnädig auf uns\", es wäre besser für sie gewesen und aufrechter. Doch Allah hat sie von Sich gewiesen um ihres Unglaubens willen; also glauben sie nur wenig.", "spanish": " Hay entre los judíos quienes cambian las palabras de su lugar adecuado y dicen: “Oímos y desobedecemos”, “escucha tú sin ser oído” y “nuestro Pastor”, profiriendo con sus lenguas lo que hay en sus mentes e intentando injuriar la fe. Y si hubiesen dicho “oímos y obedecemos”, “escucha tú” y “Unzurna”, habría sido mejor y más recto para ellos. Pero Al-lah los maldijo por su incredulidad; porque no creen sino poco.", "urdu": " جو لوگ یہودی ہیں ان میں سے بعض (خدا کی) باتوں کو ان کی جگہوں سے ادل بدل دیتے ہیں اور کہتے ہیں کہ ہم نے سنا اور باوجود اس کے ہم نے نافرمانی کی اور (کہتے ہیں کہ) تو ہماری باتیں سن (خدا کا کلام) تجھے کبھی نہ سنایا جائے اور ہمارا لحاظ کر (یہ بات) اپنی زبانوں سے جھوٹ بولتے ہوئے اور دین میں طعن کرتے ہوئے (کہتے ہیں) اور اگر وہ یوں کہتے کہ ہم نے سنا اور ہم نے مان لیا اور (کہتے کہ) سن اور ہم پر (رحمت کی) نظر کر تو ان کے لئے بہتر اور زیادہ درستی کا موجب ہوتا (مگر وہ اس سے نہ صرف محروم رہے) بلکہ اللہ نے ان کے کفر کی وجہ سے ان پر لعنت کی اس لئے وہ ایمان نہیں لاتے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ اٰمِنُوۡا بِمَا نَزَّلۡنَا مُصَدِّقًا لِّمَا مَعَکُمۡ مِّنۡ قَبۡلِ اَنۡ نَّطۡمِسَ وُجُوۡہًا فَنَرُدَّہَا عَلٰۤی اَدۡبَارِہَاۤ اَوۡ نَلۡعَنَہُمۡ کَمَا لَعَنَّاۤ اَصۡحٰبَ السَّبۡتِ ؕ وَ کَانَ اَمۡرُ اللّٰہِ مَفۡعُوۡلًا ﴿۴۸﴾", "english": " O ye People of the Book! believe in what We have sent down, fulfilling that which is with you, before We destroy some of the leaders and turn them on their backs or curse them as We cursed the People of the Sabbath. And the decree of Allah is bound to be carried out.", "french": " Ô vous Gens du livre ! Croyez en ce que Nous avons envoyé, accomplissant ce qui est déjà en votre possession, avant que Nous n’infligions certains de vos leaders d’humiliation, leur faisant tourner le dos et fuir, ou que Nous ne les maudissions comme Nous avons maudit les gens du Sabbat. Et le décret d’Allāh est certain d’être accompli.", "german": " O ihr, denen die Schrift gegeben wurde, glaubet an das, was Wir herabsandten, bestätigend das, was (schon) bei euch ist, bevor Wir einige der Führer vernichten und sie umlegen auf ihre Rücken oder sie verfluchen, wie Wir die Sabbatleute verfluchten. Und Allahs Befehl wird vollzogen werden.", "spanish": " ¡Oh vosotros, Pueblo del Libro! creed en lo que hemos revelado, en cumplimiento de lo que tenéis antes de que inflijamos humillación a vuestros jefes y los hagamos volver sobre sus talones o los maldigamos omo hicimos con el pueblo del Sabbath. Y la sentencia de Al-lah está destinada a que se cumpla.", "urdu": " اے لوگو! جنہیں کتاب (الٰہی) دی گئی تھی اس (کتاب) پر جسے ہم نے (اب) اتارا ہے جو اس (کلام الٰہی) کو پورا کرنے والی ہے جو تمہارے پاس (پہلے سے موجود) ہے اس سے پیشتر ایمان لے آٶ کہ ہم تم میں سے بڑے آدمیوں کو ہلاک کر دیں اور ان کو ان کی پیٹھوں کے بل پھرا دیں یا جس طرح ہم نے سبت والوں پر لعنت کی تھی اسی طرح ان پر (بھی) لعنت کریں اور اللہ کی بات (ضرور پوری) ہو کر رہے گی۔"}, {"arabic": " اِنَّ اللّٰہَ لَا یَغۡفِرُ اَنۡ یُّشۡرَکَ بِہٖ وَ یَغۡفِرُ مَا دُوۡنَ ذٰلِکَ لِمَنۡ یَّشَآءُ ۚ وَ مَنۡ یُّشۡرِکۡ بِاللّٰہِ فَقَدِ افۡتَرٰۤی اِثۡمًا عَظِیۡمًا ﴿۴۹﴾", "english": " Surely, Allah will not forgive that any partner be associated with Him; but He will forgive whatever is short of that to whomsoever He pleases. And whoso associates partners with Allah has indeed devised a very great sin.", "french": " Assurément, Allāh ne pardonnera pas qu’on Lui donne des associés ; mais en dehors de cela, Il pardonnera à qui Il veut. Mais quiconque donne des associés à Allāh commet en effet un très grand péché.", "german": " Wahrlich, Allah wird es nicht vergeben, dass Ihm Götter zur Seite gestellt werden; doch vergibt Er das, was geringer ist als dies, wem Er will. Und wer Allah Götter zur Seite stellt, der hat wahrhaftig eine gewaltige Sünde ersonnen.", "spanish": " En verdad, Al-lah no perdonará que se le asocie nadie a Él; pero sí perdonará, exceptuado esto, a quien Le plazca, en lo que respecta a faltas menores. Pues quien asocia otras divinidades a Al-lah ha inventado, en verdad, un gravísimo pecado.", "urdu": " اللہ (اس بات کو) ہرگز معاف نہیں کرے گا کہ (کسی کو) اس کا شریک قرار دیا جائے اور جو (گناہ) اس سے ادنیٰ ہو اسے جس کے حق میں چاہے گا معاف کر دے گا اور جس نے اللہ کے ساتھ (کسی کو) شریک قرار دیا ہو تو (سمجھو کہ) اس نے (بہت) بڑی بدی (کی بات) بنائی۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ یُزَکُّوۡنَ اَنۡفُسَہُمۡ ؕ بَلِ اللّٰہُ یُزَکِّیۡ مَنۡ یَّشَآءُ وَ لَا یُظۡلَمُوۡنَ فَتِیۡلًا ﴿۵۰﴾", "english": " Dost thou not know of those who hold themselves to be pure? Nay, it is Allah Who purifies whomsoever He pleases, and they will not be wronged a whit.", "french": " N’as-tu pas entendu parler de ceux qui se considèrent purs ? Mais c’est Allāh qui purifie qui Il veut, et ils ne seront pas lésés d’un iota.", "german": " Weißt du nicht von denen, die sich selber reinsprechen? Nein, Allah ist es, Der reinspricht, wen Er will, und kein Quentchen Unrecht sollen sie leiden.", "spanish": " ¿No has visto a los que se presentan a sí mismos como puros? No, es Al-lah quien purifica a quien le place, y no serán frustrados lo más mínimo.", "urdu": " کیا تجھے ان لوگوں کا حال معلوم نہیں جو اپنے آپ کو پاک قرار دیتے ہیں (ان کا یہ حق نہیں) بلکہ اللہ جسے پسند کرتا ہے اس کو پاک قرار دیتا ہے اور ان پر کھجور کی گٹھلی کی لکیر کے برابر بھی ظلم نہیں کیا جائے گا۔"}, {"arabic": " اُنۡظُرۡ کَیۡفَ یَفۡتَرُوۡنَ عَلَی اللّٰہِ الۡکَذِبَ ؕ وَ کَفٰی بِہٖۤ اِثۡمًا مُّبِیۡنًا ﴿٪۵۱﴾", "english": " Behold, how they forge a lie against Allah! And sufficient is that as a manifest sin.", "french": " Voyez comment ils inventent le mensonge contre Allāh ! Et cela est suffisant comme péché manifeste.", "german": " Schau, wie sie Lüge wider Allah erdichten. Und das allein ist genug als offenkundige Sünde.", "spanish": " ¡Mira cómo traman una mentira contra Al-lah! Eso es suficiente como pecado manifiesto.", "urdu": " دیکھ! وہ کس طرح اللہ پر جھوٹ باندھ رہے ہیں اور یہ (بات) کافی (طور پر) کھلا (کھلا) گناہ ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ اُوۡتُوۡا نَصِیۡبًا مِّنَ الۡکِتٰبِ یُؤۡمِنُوۡنَ بِالۡجِبۡتِ وَ الطَّاغُوۡتِ وَ یَقُوۡلُوۡنَ لِلَّذِیۡنَ کَفَرُوۡا ہٰۤؤُلَآءِ اَہۡدٰی مِنَ الَّذِیۡنَ اٰمَنُوۡا سَبِیۡلًا ﴿۵۲﴾", "english": " Dost thou not know of those who were given a portion of the Book? They believe in evil things and follow those who transgress, and they say of the disbelievers, ‘These are better guided in religion than those who believe.’", "french": " N’as-tu pas entendu parler de ceux à qui une partie du Livre fut donnée ? Ils croient à des choses maléfiques et suivent ceux qui transgressent. Et ils disent à propos des mécréants : « Ceux-ci sont mieux guidés en matière de religion que ceux qui croient. »", "german": " Weißt du nicht von denen, denen ein Teil der Schrift gegeben wurde? Sie glauben an Nutzloses und an die Frevler, und sie sprechen von den Ungläubigen: \"Sie sind in der Lehre besser geleitet als die Gläubigen.\"", "spanish": " ¿No has visto a quienes se entregó una parte del Libro? Creen en cosas malvadas, siguen a los pecadores y dicen de los incrédulos: “Son mejor guiados que los que creen en la religión”.", "urdu": " کیا تجھے ان لوگوں کا حال معلوم نہیں جنہیں کتاب (الٰہی) میں سے کچھ حصہ دیا گیا تھا (کہ) وہ بے فائدہ (باتوں) اور حد سے بڑھنے والوں پر ایمان رکھتے ہیں اور کافروں کے متعلق کہتے ہیں کہ یہ لوگ مومنوں کی نسبت زیادہ ہدایت یافتہ ہیں۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ لَعَنَہُمُ اللّٰہُ ؕ وَ مَنۡ یَّلۡعَنِ اللّٰہُ فَلَنۡ تَجِدَ لَہٗ نَصِیۡرًا ﴿ؕ۵۳﴾", "english": " They it is whom Allah has cursed; and he whom Allah curses, thou shalt not find for him a helper.", "french": " Voilà ceux qu’Allāh a maudits ; et celui qu’Allāh maudit, tu ne trouveras personne pour le secourir.", "german": " Diese sind es, die Allah von Sich gewiesen hat; und wen Allah von Sich weist, keinen Helfer wirst du ihm finden.", "spanish": " A ésos es a quienes Al-lah ha maldecido, y no podrás encontrar defensor para el que haya sido maldecido por Al-lah.", "urdu": " یہ وہ لوگ ہیں جن پر اللہ نے لعنت کی ہے اور جس پر اللہ لعنت کرے تو اس کا مددگار ہرگز (کسی کو) نہیں پائے گا۔"}, {"arabic": " اَمۡ لَہُمۡ نَصِیۡبٌ مِّنَ الۡمُلۡکِ فَاِذًا لَّا یُؤۡتُوۡنَ النَّاسَ نَقِیۡرًا ﴿ۙ۵۴﴾", "english": " Have they a share in the kingdom? Then would they not give men even so much as the little hollow in the back of a date-stone.", "french": " Ont-ils une part dans le royaume ? Même alors ils ne donneraient aux hommes pas même autant que le petit creux d’un noyau de datte.", "german": " Haben sie einen Anteil an der Herrschaft? Dann würden sie den Menschen nicht einmal so viel wie die Rille am Dattelkern abgeben.", "spanish": " ¿Tienen acaso parte en el reino? Aunque la tuvieran no darían a los hombres ni el pequeño hueco de un hueso de dátil.", "urdu": " کیا ان کا حکومت میں کوئی حصہ ہے؟ تب تو وہ لوگوں کو کھجور کی گٹھلی کے سوراخ کے برابر بھی نہ دیں گے۔"}, {"arabic": " اَمۡ یَحۡسُدُوۡنَ النَّاسَ عَلٰی مَاۤ اٰتٰہُمُ اللّٰہُ مِنۡ فَضۡلِہٖ ۚ فَقَدۡ اٰتَیۡنَاۤ اٰلَ اِبۡرٰہِیۡمَ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ اٰتَیۡنٰہُمۡ مُّلۡکًا عَظِیۡمًا ﴿۵۵﴾", "english": " Or do they envy men for what Allah has given them out of His bounty? If that is so , surely, We gave the Book and Wisdom to the children of Abraham also and We also gave them a great kingdom.", "french": " Ou bien, envient-ils aux hommes ce qu’Allāh leur a donné de Sa munificence ? S’il en est ainsi, Nous avons assurément aussi donné aux enfants d’Abraham le Livre et la Sagesse, et Nous leur avons aussi donné un grand royaume.", "german": " Oder beneiden sie die Menschen um das, was Allah ihnen aus Seiner Huld geschenkt hat? Nun wohl, Wir gaben den Kindern Abrahams das Buch und die Weisheit, und Wir gaben ihnen ein mächtiges Reich.", "spanish": " ¿O envidian a los hombres por lo que Al-lah les ha concedido de Su magnanimidad? Si así es, en verdad, dimos el Libro y la abiduría también a los hijos de Abraham, y les dimos además un gran reino.", "urdu": " یا جو (کچھ) اللہ نے اپنے فضل سے لوگوں کو دیا ہے (کیا) وہ اس کی بنا پر ان سے حسد کرتے ہیں؟ (اگر یہ بات ہے) تو ہم نے ابراہیم کی اولاد کو (بھی) کتاب اور حکمت دی تھی۔ اور (نیز) ہم نے ان کو بڑی حکومت دی تھی۔"}, {"arabic": " فَمِنۡہُمۡ مَّنۡ اٰمَنَ بِہٖ وَ مِنۡہُمۡ مَّنۡ صَدَّ عَنۡہُ ؕ وَ کَفٰی بِجَہَنَّمَ سَعِیۡرًا ﴿۵۶﴾", "english": " And of them were some who believed in him; and of them were others who turned away from him. And sufficient is Hell as a blazing fire.", "french": " Et il y avait parmi eux ceux qui ont cru en lui ; et il y en avait d’autres qui se sont détournés de lui ; et l’Enfer leur suffira comme une Fournaise pour y brûler .", "german": " Und einige von ihnen glaubten daran, andere aber wandten sich davon ab. Und die Hölle ist stark genug als ein Flammenfeuer.", "spanish": " Algunos de ellos creyeron en él; y otros se apartaron de él. Mas el Infierno bastará con su fuego llameante.", "urdu": " پھر ان میں سے بعض تو اس (نئی کتاب) پر ایمان لے آئے اور بعض ان میں سے اس سے رک رہے اور جہنم تمازت میں بہت زیادہ ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِنَا سَوۡفَ نُصۡلِیۡہِمۡ نَارًا ؕ کُلَّمَا نَضِجَتۡ جُلُوۡدُہُمۡ بَدَّلۡنٰہُمۡ جُلُوۡدًا غَیۡرَہَا لِیَذُوۡقُوا الۡعَذَابَ ؕ اِنَّ اللّٰہَ کَانَ عَزِیۡزًا حَکِیۡمًا ﴿۵۷﴾", "english": " Those who disbelieve in Our Signs, We shall soon cause them to enter Fire. As often as their skins are burnt up, We shall give them in exchange other skins that they may taste the punishment. Surely, Allah is Mighty, Wise.", "french": " En vérité, ceux qui ne croient pas à Nos Signes, Nous ne tarderons pas à les faire entrer dans un Feu. Aussi souvent que leur peau sera consumée, Nous leur en donnerons une autre en échange, afin qu’ils puissent continuer à goûter le châtiment. Assurément, Allāh est Puissant, Sage.", "german": " Die Unseren Zeichen Glauben versagen, die werden Wir bald ins Feuer stoßen. Sooft ihre Haut verbrannt ist, geben Wir ihnen eine andere Haut, damit sie die Strafe auskosten. Wahrlich, Allah ist allmächtig, allweise.", "spanish": " A quienes no crean en Nuestros Signos los introduciremos pronto en el Fuego. En cuanto se les queme la piel, les daremos una piel nueva para que sientan el castigo. En verdad, Al-lah es Poderoso, Sabio.", "urdu": " جن لوگوں نے ہماری آیات کا انکار کیا ہے ہم جلدی (ہی) انہیں آگ میں ڈالیں گے جب کبھی بھی ان کی کھالیں گل جائیں گی۔ ہم انہیں ان کے سوا اور کھالیں بدل کر دے دیں گے (اور ہم یہ) اس لئے (کریں گے) تا (کہ) وہ عذاب (کا مزا) چکھیں اللہ یقیناً غالب (اور) حکمت والا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ سَنُدۡخِلُہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ؕ لَہُمۡ فِیۡہَاۤ اَزۡوَاجٌ مُّطَہَّرَۃٌ ۫ وَّ نُدۡخِلُہُمۡ ظِلًّا ظَلِیۡلًا ﴿۵۸﴾", "english": " And those who believe and do good works, We shall make them enter Gardens through which streams flow, to abide therein for ever; therein shall they have pure spouses; and We shall admit them to a place of pleasant and plenteous shade.", "french": " Et ceux qui croient et font de bonnes œuvres, Nous les ferons entrer dans des Jardins sous lesquels coulent des rivières, pour qu’ ils y demeurent à tout jamais ; ils y auront des conjoints/es purifiés/es par Nous ; et Nous les admettrons sous un ombrage dense.", "german": " Die aber glauben und gute Werke tun, die wollen Wir in Gärten führen, durch die Ströme fließen, darin sie ewig weilen und immerdar; dort sollen sie reine Gefährten und Gefährtinnen haben, und Wir gewähren ihnen Zutritt zu einem (Ort) wohltätigen und reichlichen Schattens.", "spanish": " Pero a quienes crean y hagan buenas obras los introduciremos en jardines por los que corren ríos, para que habiten en ellos para siempre; allí tendrán conyuges purificadas por Nosotros ; y los admitiremos en un lugar con una agradable y densa sombra.", "urdu": " اور جو لوگ ایمان لائے ہیں اور انہوں نے نیک اعمال کیے ہیں انہیں ہم ضرور ایسے باغات میں داخل کریں گے جن کے نیچے نہریں بہتی ہیں وہ ہمیشہ ان میں رہتے چلے جائیں گے۔ ان کے لئے ان میں پاک بیویاں ہوں گی۔ اور ہم انہیں گھنے سایہ میں رہنے کے لئے داخل کریں گے۔"}, {"arabic": " اِنَّ اللّٰہَ یَاۡمُرُکُمۡ اَنۡ تُؤَدُّوا الۡاَمٰنٰتِ اِلٰۤی اَہۡلِہَا ۙ وَ اِذَا حَکَمۡتُمۡ بَیۡنَ النَّاسِ اَنۡ تَحۡکُمُوۡا بِالۡعَدۡلِ ؕ اِنَّ اللّٰہَ نِعِمَّا یَعِظُکُمۡ بِہٖ ؕ اِنَّ اللّٰہَ کَانَ سَمِیۡعًۢا بَصِیۡرًا ﴿۵۹﴾", "english": " Verily, Allah commands you to make over the trusts to those entitled to them, and that, when you judge between men, you judge with justice. And surely excellent is that with which Allah admonishes you! Allah is All-Hearing, All-Seeing.", "french": " En vérité, Allāh vous commande de céder les charges à qui de droit, et quand vous jugez entre les hommes, de juger avec justice. Et assurément ce à quoi Allāh vous exhorte est excellent ; en vérité, Allāh entend tout et voit tout.", "german": " Allah gebietet euch, dass ihr die Treuhandschaft jenen übergebt, die ihrer würdig sind; und wenn ihr zwischen Menschen richtet, dass ihr richtet nach Gerechtigkeit. Fürwahr, herrlich ist, wozu Allah euch ermahnt. Allah ist allhörend, allsehend.", "spanish": " En verdad, Al-lah os ordena devolver lo depositado a sus propietarios y que, cuando juzguéis entre hombres, lo hagáis con justicia. ¡Ciertamente es excelente aquello a lo que Al-lah os exhorta! Al-lah es quien todo lo oye y todo lo ve.", "urdu": " اللہ تمہیں یقیناً (اس بات کا) حکم دیتا ہے کہ تم امانتیں ان کے مستحقوں کے سپرد کرو۔ اور (یہ کہ) جب تم لوگوں کے درمیان فیصلہ کرو تو عدل سے فیصلہ کرو اللہ جس بات کی تمہیں نصیحت کرتا ہے وہ یقیناً بہت (ہی) اچھی ہے۔ اللہ یقیناً بہت سننے والا (اور) دیکھنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَطِیۡعُوا اللّٰہَ وَ اَطِیۡعُوا الرَّسُوۡلَ وَ اُولِی الۡاَمۡرِ مِنۡکُمۡ ۚ فَاِنۡ تَنَازَعۡتُمۡ فِیۡ شَیۡءٍ فَرُدُّوۡہُ اِلَی اللّٰہِ وَ الرَّسُوۡلِ اِنۡ کُنۡتُمۡ تُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ؕ ذٰلِکَ خَیۡرٌ وَّ اَحۡسَنُ تَاۡوِیۡلًا ﴿٪۶۰﴾", "english": " O ye who believe! obey Allah, and obey His Messenger and those who are in authority among you. And if you differ in anything among yourselves, refer it to Allah and His Messenger if you are believers in Allah and the Last Day. That is best and most commendable in the end.", "french": " Ô vous qui croyez ! obéissez à Allāh et obéissez au Messager, et à ceux qui ont de l’autorité sur vous ; et si vous êtes en litige sur n’importe quelle question, référez-la à Allāh et au Messager, si vous croyez en Allāh et au Jour Dernier. Cela vaut mieux et est excellent par rapport au résultat.", "german": " O die ihr glaubt, gehorchet Allah und gehorchet dem Gesandten und denen, die Befehlsgewalt unter euch haben. Und wenn ihr in etwas uneins seid, so bringet es vor Allah und den Gesandten, so ihr an Allah glaubt und an den Jüngsten Tag. Das ist das Beste und am Ende auch das Empfehlenswerteste.", "spanish": " ¡Oh vosotros, los que creéis! obedeced a Al-lah, a Su Mensajero y a los que tienen autoridad sobre vosotros. Y si disputáis respecto a cualquier asunto, sometedlo a Al-lah y al Mensajero, si sois creyentes en Al-lah y en el Último Día. Esto es al final lo mejor y más recomendable.", "urdu": " اے ایماندارو! اللہ کی اطاعت کرو اور رسول کی اور اپنے فرمانرواٶں کی بھی اطاعت کرو‘ پھر اگر تم (حکام سے) کسی امر میں اختلاف کرو تو اگر تم اللہ اور پیچھے آنے والے دن پر ایمان رکھتے ہو تو اسے اللہ اور رسول کی طرف لوٹا دو (اور ان کے حکم کی روشنی میں معاملہ طے کرو( یہ (بات) بہتر اور انجام کے لحاظ سے زیادہ اچھی ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ یَزۡعُمُوۡنَ اَنَّہُمۡ اٰمَنُوۡا بِمَاۤ اُنۡزِلَ اِلَیۡکَ وَ مَاۤ اُنۡزِلَ مِنۡ قَبۡلِکَ یُرِیۡدُوۡنَ اَنۡ یَّتَحَاکَمُوۡۤا اِلَی الطَّاغُوۡتِ وَ قَدۡ اُمِرُوۡۤا اَنۡ یَّکۡفُرُوۡا بِہٖ ؕ وَ یُرِیۡدُ الشَّیۡطٰنُ اَنۡ یُّضِلَّہُمۡ ضَلٰلًۢا بَعِیۡدًا ﴿۶۱﴾", "english": " Dost thou not know of those who pretend that they believe in what has been revealed to thee and what has been revealed before thee? They desire to seek judgment from the rebellious, although they were commanded not to obey them. And Satan desires to lead them far astray.", "french": " N’as-tu pas entendu parler de ceux qui prétendent croire à ce qui t’a été révélé et à ce qui a été révélé avant toi ? Ils désirent demander un jugement du Malin, quoiqu’ils aient reçu l’ordre de le nier. Et Satan veut les conduire loin dans l’égarement.", "german": " Weißt du nicht von denen, die vorgeben zu glauben, was zu dir hinabgesandt worden und was vor dir hinabgesandt worden ist? Sie wollen den Rechtsspruch bei den Frevlern suchen, wiewohl ihnen befohlen ward, nicht auf jene zu hören; denn Satan will sie in die weite Irre führen.", "spanish": " ¿No has visto a quienes pretenden creer en lo que te ha sido revelado y en lo revelado antes que a ti? Desean que los rebeldes dicten sentencia, aunque se les ordenó que no los obedecieran. Pero Satanás desea extraviarlos muy lejos.", "urdu": " کیا تو نے ان لوگوں کا حال نہیں دیکھا جو دعویٰ کرتے ہیں کہ جو (کچھ) تیری طرف نازل کیا گیا ہے اور (نیز) جو تجھ سے پہلے نازل کیا گیا تھا وہ اس پر ایمان لے آئے ہیں اور باوجود اس کے کہ ان کو حکم دیا گیا تھا کہ سرکشوں سے فیصلہ نہ کرائیں اور ان کے کہے پر نہ چلیں وہ چاہتے ہیں کہ انہی سے فیصلہ کرائیں کیونکہ شیطان چاہتا ہے کہ انہیں خطرناک گمراہی میں ڈال دے۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ تَعَالَوۡا اِلٰی مَاۤ اَنۡزَلَ اللّٰہُ وَ اِلَی الرَّسُوۡلِ رَاَیۡتَ الۡمُنٰفِقِیۡنَ یَصُدُّوۡنَ عَنۡکَ صُدُوۡدًا ﴿ۚ۶۲﴾", "english": " And when it is said to them, ‘Come ye to what Allah has sent down and to His Messenger,’ thou seest the hypocrites turn away from thee with aversion.", "french": " Et lorsqu’on leur dit : « Venez vers ce qu’Allāh a fait descendre et vers le Messager, » tu vois les hypocrites s’écarter bien loin de toi.", "german": " Und wenn ihnen gesagt wird: \"Kommt her zu dem, was Allah herabgesandt hat, und zu dem Gesandten\", siehst du die Heuchler sich in Widerwillen von dir abwenden.", "spanish": " Y cuando se les dice: “Volved a lo que Al-lah ha revelado y a Su Mensajero”, ves cómo los hipócritas se apartan de ti con desdén.", "urdu": " اور جب ان سے کہا جاتا ہے کہ جو کچھ اللہ نے اتارا ہے‘ اس کی طرف اور رسول کی طرف آٶ تو تو منافقوں کو دیکھتا ہے کہ وہ تجھ سے بالکل پیچھے ہٹ جاتے ہیں۔"}, {"arabic": " فَکَیۡفَ اِذَاۤ اَصَابَتۡہُمۡ مُّصِیۡبَۃٌۢ بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ ثُمَّ جَآءُوۡکَ یَحۡلِفُوۡنَ ٭ۖ بِاللّٰہِ اِنۡ اَرَدۡنَاۤ اِلَّاۤ اِحۡسَانًا وَّ تَوۡفِیۡقًا ﴿۶۳﴾", "english": " Then how is it that when an affliction befalls them because of what their hands have sent on before them, they come to thee swearing by Allah, saying , ‘We meant nothing but the doing of good and reconciliation?’", "french": " Alors comment se fait-il que lorsqu’un malheur les frappe par suite de ce que leurs mains ont envoyé devant eux , ils viennent à toi en jurant par Allāh en disant : « Nous ne voulions rien faire d’autre qu’un acte de bonté et de conciliation. »", "german": " Nun aber, wenn ein Unheil sie trifft für ihre Taten, kommen sie zu dir, schwörend bei Allah: \"Wir wollten ja nur Gutes und Versöhnliches.\"", "spanish": " Si es así, ¿por qué cuando se abate la desgracia sobre ellos, debido a lo que sus propias manos hicieron antes, acuden a ti jurando por Al-lah y diciendo: “No queríamos más que un acto de amabilidad y de concordia”?", "urdu": " پھر (یہ) کیوں (ہوتا ہے کہ) جب ان پر ان کے افعال کے نتیجہ میں کوئی مصیبت آتی ہے تو وہ (گھبرا جاتے ہیں اور) تیرے پاس اللہ کی قسمیں کھاتے ہوئے آتے ہیں کہ ہم نے تو صرف نیک سلوک اور صلح کرانے کا ارادہ کیا تھا۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ یَعۡلَمُ اللّٰہُ مَا فِیۡ قُلُوۡبِہِمۡ ٭ فَاَعۡرِضۡ عَنۡہُمۡ وَ عِظۡہُمۡ وَ قُلۡ لَّہُمۡ فِیۡۤ اَنۡفُسِہِمۡ قَوۡلًۢا بَلِیۡغًا ﴿۶۴﴾", "english": " These are they, the secrets of whose hearts Allah knows well. So turn away from them and admonish them and speak to them an effective word concerning their own selves.", "french": " Ce sont ceux dont Allāh connaît ce qui est dans leurs cœurs. Alors détourne-toi d’eux, admoneste-les et dis-leur une parole efficace les concernant.", "german": " Diese sind es, von denen Allah wohl weiß, was in ihren Herzen ist. So wende dich ab von ihnen und ermahne sie und sprich ein eindringliches Wort zu ihnen über sie selbst.", "spanish": " En cuanto a ellos, Al-lah conoce muy bien los secretos de sus corazones. Apártate pues de ellos, exhórtales y dirígeles palabras persuasivas respecto a si mismos.", "urdu": " یہ وہ لوگ ہیں کہ جو (کچھ) ان کے دلوں میں ہے اللہ اسے (خوب) جانتا ہے۔ پس تو ان سے اعراض کر۔ اور انہیں نصیحت کر۔ اور انہیں ان کے نفوس کے متعلق موثر بات کہہ۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنَا مِنۡ رَّسُوۡلٍ اِلَّا لِیُطَاعَ بِاِذۡنِ اللّٰہِ ؕ وَ لَوۡ اَنَّہُمۡ اِذۡ ظَّلَمُوۡۤا اَنۡفُسَہُمۡ جَآءُوۡکَ فَاسۡتَغۡفَرُوا اللّٰہَ وَ اسۡتَغۡفَرَ لَہُمُ الرَّسُوۡلُ لَوَجَدُوا اللّٰہَ تَوَّابًا رَّحِیۡمًا ﴿۶۵﴾", "english": " And We have sent no Messenger but that he should be obeyed by the command of Allah. And if they had come to thee when they had wronged their souls, and asked forgiveness of Allah, and if the Messenger also had asked forgiveness for them, they would have surely found Allah Oft-Returning with compassion and Merciful.", "french": " Et Nous n’avons envoyé aucun Messager qui ne dût être obéi par ordre d’Allāh. Et s’ils étaient venus à toi après avoir fait du tort à leur âme, et avaient imploré le pardon d’Allāh, et que le Messager eût demandé le pardon en leur faveur, ils auraient assurément trouvé qu’Allāh revient sans cesse avec compassion et est Miséricordieux.", "german": " Und Wir entsandten nur darum einen Gesandten, dass ihm gehorcht würde nach Allahs Gebot. Und wären sie zu dir gekommen, nachdem sie sich versündigt, und hätten Allahs Verzeihung erfleht und hätte der Gesandte (auch) für sie um Verzeihung gebeten, sie hätten gewiss Allah mitleidsvoll vergebend, barmherzig gefunden.", "spanish": " Y no hemos enviado a ningún Mensajero, salvo para que fuera obedecido por mandato de Al-lah. Y si hubieran acudido a ti cuando dañaron sus propias almas, pidiendo el perdón de Al-lah; y si el Mensajero hubiera pedido también perdón por ellos, iertamente hubieran encontrado a Al-lah Remisorio con compasión y Misericordioso.", "urdu": " اور ہم نے کوئی رسول (بھی) سوائے اس غرض کے کہ اللہ کے حکم سے اس کی اطاعت کی جائے نہیں بھیجا اور جب انہوں نے اپنی جانوں پر ظلم کیا تھا اگر (اس وقت) وہ تیرے پاس آتے اور اللہ سے بخشش چاہتے اور رسول (بھی) ان کے حق میں بخشش طلب کرتا تو وہ ضرور اللہ کو بہت شفقت کرنے والا (اور) باربار رحم کرنے والا پاتے۔"}, {"arabic": " فَلَا وَ رَبِّکَ لَا یُؤۡمِنُوۡنَ حَتّٰی یُحَکِّمُوۡکَ فِیۡمَا شَجَرَ بَیۡنَہُمۡ ثُمَّ لَا یَجِدُوۡا فِیۡۤ اَنۡفُسِہِمۡ حَرَجًا مِّمَّا قَضَیۡتَ وَ یُسَلِّمُوۡا تَسۡلِیۡمًا ﴿۶۶﴾", "english": " But no, by thy Lord, they are not believres until they make thee judge in all that is in dispute between them and then find not in their hearts any demur concerning that which thou decidest and submit with full submission.", "french": " Mais non, par ton Seigneur ! Ils ne seront pas croyants à moins qu’ils te prennent comme juge de tous leurs différends ; et qu’ensuite ils ne trouvent pas en eux-mêmes d’objections à tes décisions et qu’ils se soumettent complètement.", "german": " Aber nein, bei deinem Herrn, sie sind nicht eher Gläubige, als bis sie dich zum Richter über alles machen, was zwischen ihnen strittig ist, und dann in ihren Herzen kein Bedenken finden gegen deinen Entscheid, und sich in Ergebung fügen.", "spanish": " Pero no, por tu Señor, no serán creyentes mientras no te hagan juez de todo lo que les separa y no encuentren en sus corazones objeción alguna a lo que tú decidas y se sometan con plena sumisión.", "urdu": " پس تیرے رب کی قسم ہے کہ جب تک وہ (ہر) اس بات میں جس کے متعلق ان میں جھگڑا ہو جائے تجھے حکم نہ بنائیں (اور) پھر جو فیصلہ تو کرے اس سے اپنے نفوس میں کسی قسم کی تنگی نہ پائیں اور پورے طور پر فرمانبردار (نہ) ہو جائیں ہرگز ایمان دار نہ ہوں گے۔"}, {"arabic": " وَ لَوۡ اَنَّا کَتَبۡنَا عَلَیۡہِمۡ اَنِ اقۡتُلُوۡۤا اَنۡفُسَکُمۡ اَوِ اخۡرُجُوۡا مِنۡ دِیَارِکُمۡ مَّا فَعَلُوۡہُ اِلَّا قَلِیۡلٌ مِّنۡہُمۡ ؕ وَ لَوۡ اَنَّہُمۡ فَعَلُوۡا مَا یُوۡعَظُوۡنَ بِہٖ لَکَانَ خَیۡرًا لَّہُمۡ وَ اَشَدَّ تَثۡبِیۡتًا ﴿ۙ۶۷﴾", "english": " And if We had commanded them, ‘Kill your people or leave your homes,’ they would not have done it except a few of them; and if they had done what they are exhorted to do, it would surely have been better for them and conducive to greater strength.", "french": " Et si Nous leur avions donné ce commandement : « Sacrifiez votre vie ou quittez vos demeures, » hormis quelques-uns d’entre eux, ils ne l’auraient pas fait ; et s’ils avaient fait ce qu’on les exhorte à faire, cela aurait sûrement mieux valu pour eux et aurait été un moyen plus solide pour le raffermissement de leurs pas .", "german": " Und hätten Wir ihnen befohlen: \"Tötet euch selbst oder verlasset eure Häuser\", sie würden es nicht getan haben, ausgenommen einige wenige von ihnen; hätten sie aber das getan, wozu sie aufgefordert wurden, es wäre wahrlich besser für sie gewesen und stärkender.", "spanish": " Pero si les hubiésemos ordenado: “Sacrificad vuestras vidas o abandonad vuestros hogares”, no lo habrían hecho excepto unos pocos de ellos; y, si hubiesen hecho lo que se les ordena, ciertamente hubiese sido mejor para ellos y les hubiera dado una mayor fuerza;", "urdu": " اور اگر ہم انہیں (یہ) حکم دیتے کہ تم اپنے آپ کو قتل کر دو یا یہ کہ اپنے گھروں سے نکل جاٶ تو ان میں سے چند کے سوا (باقی) یہ (کام) نہ کرتے اور اگر وہ جس (کام) کی انہیں نصیحت کی جاتی اسے کر لیتے تو ان کے لئے بہتر اور زیادہ پختگی کا موجب ہوتا۔"}, {"arabic": " وَّ اِذًا لَّاٰتَیۡنٰہُمۡ مِّنۡ لَّدُنَّـاۤ اَجۡرًا عَظِیۡمًا ﴿ۙ۶۸﴾", "english": " And then We would have surely given them a great reward from Ourself;", "french": " Et alors Nous leur aurions sûrement donné de Notre part une très grande récompense ;", "german": " Und dann hätten Wir ihnen gewiss einen großen Lohn von Uns aus gegeben;", "spanish": " Entonces les habríamos dado en verdad una magnífica recompensa Nuestra;", "urdu": " اور اس صورت میں ہم انہیں یقیناً اپنے پاس سے (بہت) بڑا بدلہ دیتے۔"}, {"arabic": " وَّ لَہَدَیۡنٰہُمۡ صِرَاطًا مُّسۡتَقِیۡمًا ﴿۶۹﴾", "english": " And We would surely have guided them in the right path.", "french": " Et Nous les aurions sûrement guidés vers le droit chemin.", "german": " und Wir hätten sie sicher geleitet auf den geraden Weg.", "spanish": " Y los habríamos guiado, ciertamente, por el camino recto.", "urdu": " اور (نیز) ہم انہیں ضرور سیدھا راستہ دکھاتے۔"}, {"arabic": " وَ مَنۡ یُّطِعِ اللّٰہَ وَ الرَّسُوۡلَ فَاُولٰٓئِکَ مَعَ الَّذِیۡنَ اَنۡعَمَ اللّٰہُ عَلَیۡہِمۡ مِّنَ النَّبِیّٖنَ وَ الصِّدِّیۡقِیۡنَ وَ الشُّہَدَآءِ وَ الصّٰلِحِیۡنَ ۚ وَ حَسُنَ اُولٰٓئِکَ رَفِیۡقًا ﴿ؕ۷۰﴾", "english": " And whoso obeys Allah and this Messenger of His shall be among those on whom Allah has bestowed His blessings, namely, the Prophets, the Truthful, the Martyrs, and the Righteous. And excellent companions are these.", "french": " Et quiconque obéit à Allāh et au Messager sera du nombre de ceux sur lesquels Allāh a répandu Ses bienfaits, à savoir, les Prophètes, les Véridiques, les Martyrs et les Justes ; ce sont là d’excellents compagnons.", "german": " Wer Allah und dem Gesandten gehorcht, soll unter denen sein, denen Allah Seine Huld gewährt hat, nämlich unter den Propheten, den Wahrhaftigen, den Blutzeugen und den Gerechten; und das sind die besten Gefährten.", "spanish": " Pues quien obedece a Al-lah y a este Mensajero suyo, estará entre aquellos a quienes Al-lah ha concedido sus bendiciones; a saber: los Profetas, los Veraces, los Mártires y los Justos. ¡Qué excelente compañeros son éstos!", "urdu": " اور جو (لوگ بھی) اللہ اور اس رسول کی اطاعت کریں گے وہ ان لوگوں میں شامل ہوں گے جن پر اللہ نے انعام کیا ہے یعنی انبیاء اور صدیقین اور شہداء اور صالحین (میں) اور یہ لوگ (بہت ہی) اچھے رفیق ہیں۔"}, {"arabic": " ذٰلِکَ الۡفَضۡلُ مِنَ اللّٰہِ ؕ وَ کَفٰی بِاللّٰہِ عَلِیۡمًا ﴿٪۷۱﴾", "english": " This grace is from Allah, and sufficient is Allah, the All-Knowing.", "french": " Cette grâce émane d’Allāh et Allāh suffit du fait de Son Omniscience.", "german": " Solche Gnade ist von Allah, und Allah weiß zur Genüge.", "spanish": " Esta gracia procede de Al-lah y suficiente es Al-lah, el Omnisciente.", "urdu": " یہ فضل اللہ کی طرف سے ہے۔ اور اللہ بہت جاننے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا خُذُوۡا حِذۡرَکُمۡ فَانۡفِرُوۡا ثُبَاتٍ اَوِ انۡفِرُوۡا جَمِیۡعًا ﴿۷۲﴾", "english": " O ye who believe! take your precautions; then either go forth in separate parties or go forth all together.", "french": " Ô vous qui croyez ! Prenez vos précautions ; ensuite partez, en groupes séparés ou tous ensemble.", "german": " O die ihr glaubt, seid auf eurer Hut, dann zieht entweder truppweise aus oder alle zusammen.", "spanish": " ¡Oh vosotros, los que creéis! tomad vuestras precauciones; y acto seguido avanzad en grupos separados o en bloque.", "urdu": " اے ایماندارو! اپنے بچاٶ (کے سامان ہر وقت) تیار رکھو اور (خواہ) چھوٹی جماعتوں میں (گھروں سے) نکلو یا بڑی جماعتوں میں نکلو (ہمیشہ حفاظت کے سامان پاس رکھا کرو)"}, {"arabic": " وَ اِنَّ مِنۡکُمۡ لَمَنۡ لَّیُبَطِّئَنَّ ۚ فَاِنۡ اَصَابَتۡکُمۡ مُّصِیۡبَۃٌ قَالَ قَدۡ اَنۡعَمَ اللّٰہُ عَلَیَّ اِذۡ لَمۡ اَکُنۡ مَّعَہُمۡ شَہِیۡدًا ﴿۷۳﴾", "english": " And among you there is he who will tarry behind, and if a misfortune befall you, he says, ‘Surely, Allah has been gracious to me, since I was not present with them.’", "french": " Et parmi vous, il y a celui qui s’attardera, et qui, si un malheur vous frappe, dira : « Allāh en vérité m’a fait une faveur, puisque je n’étais pas un témoin de ce malheur ensemble avec eux. »", "german": " Unter euch ist wohl mancher, der zurückbleibt, und wenn euch ein Unglück trifft, sagt er: \"Wahrlich, Allah ist gnädig zu mir gewesen, dass ich nicht bei ihnen zugegen war.\"", "spanish": " Mas hay entre vosotros quien se quedará rezagado, y si sufrís un revés, dirá: “En verdad, Al-lah ha sido generoso conmigo, ya que no estuve con ellos”.", "urdu": " اور تم میں سے بعض (آدمی) یقیناً ایسے (بھی ہوتے) ہیں جو (ہر کام کے موقعہ پر) لازماً پیچھے رہتے ہیں اور اگر تمہیں کوئی مصیبت پہنچے تو کہتے ہیں کہ اللہ نے مجھ پر احسان کیا ہے کہ میں ان کے ساتھ حاضر نہ تھا۔"}, {"arabic": " وَ لَئِنۡ اَصَابَکُمۡ فَضۡلٌ مِّنَ اللّٰہِ لَیَقُوۡلَنَّ کَاَنۡ لَّمۡ تَکُنۡۢ بَیۡنَکُمۡ وَ بَیۡنَہٗ مَوَدَّۃٌ یّٰلَیۡتَنِیۡ کُنۡتُ مَعَہُمۡ فَاَفُوۡزَ فَوۡزًا عَظِیۡمًا ﴿۷۴﴾", "english": " But if there comes to you some good fortune from Allah, he says, as if there were no love between you and him, ‘Would that I had been with them, then should I have indeed achieved a great success!’", "french": " Mais si c’est une grâce qu’Allāh vous envoie, il dira, comme si aucune amitié ne vous liait : « Que n’ai-je été avec eux ! J’aurais alors remporté un très grand succès ! »", "german": " Begegnet euch aber ein Glück von Allah, dann sagt er, als wäre keine Freundschaft zwischen euch und ihm: \"Wäre ich doch bei ihnen gewesen, dann hätte ich einen großen Erfolg errungen!\"", "spanish": " Pero si os llega un favor procedente de Al-lah, dice, como si no existiera amor entre vosotros y él: “Ojalá hubiese estado con ellos, pues habría conseguido un gran éxito”.", "urdu": " اور اگر اللہ کی طرف سے تمہیں کوئی فضل (کی بات) پہنچے تو وہ لازماًکہہ اٹھتے ہیں کہ کاش ہم (بھی) ان کے ساتھ ہوتے تا کہ (بہت) بڑی کامیابی پاتے گویا کہ ان کے اور تمہارے درمیان کوئی دوستانہ تعلق تھا ہی نہیں۔"}, {"arabic": " فَلۡیُقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ الَّذِیۡنَ یَشۡرُوۡنَ الۡحَیٰوۃَ الدُّنۡیَا بِالۡاٰخِرَۃِ ؕ وَ مَنۡ یُّقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ فَیُقۡتَلۡ اَوۡ یَغۡلِبۡ فَسَوۡفَ نُؤۡتِیۡہِ اَجۡرًا عَظِیۡمًا ﴿۷۵﴾", "english": " Let those then fight in the cause of Allah who would sell the present life for the Hereafter. And whoso fights in the cause of Allah, be he slain or be he victorious, We shall soon give him a great reward.", "french": " Qu’ils combattent donc pour la cause d’Allāh, ceux qui vendraient bien la vie d’ici-bas pour l’au-delà. Et quiconque combat pour la cause d’Allāh, qu’il soit tué ou qu’il soit victorieux, Nous lui donnerons une très grande récompense.", "german": " Lasst also solche für Allahs Sache kämpfen, die das irdische Leben hinzugeben gewillt sind für das zukünftige. Und wer für Allahs Sache ficht, ob er fällt oder siegt, Wir werden ihm bald großen Lohn gewähren.", "spanish": " Que combatan pues, por la causa de Al-lah quienes estén dispuestos a sacrificar la presente vida por el Más Allá. Y a quien luche por la causa de Al-lah, tanto si muere como si sale victorioso, le daremos pronto una recompensa.", "urdu": " پس جو لوگ ورلی زندگی کو چھوڑ کر آخرت کو اختیار کرتے ہیں۔ انہیں اللہ کی راہ میں جنگ کرنی چاہیئے۔ اور جو اللہ کی راہ میں جنگ کرے پھر مارا جائے یا غالب آجائے تو اسے ہم جلد (ہی بہت) بڑا اجر دیں گے۔"}, {"arabic": " وَ مَا لَکُمۡ لَا تُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ وَ الۡمُسۡتَضۡعَفِیۡنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الۡوِلۡدَانِ الَّذِیۡنَ یَقُوۡلُوۡنَ رَبَّنَاۤ اَخۡرِجۡنَا مِنۡ ہٰذِہِ الۡقَرۡیَۃِ الظَّالِمِ اَہۡلُہَا ۚ وَ اجۡعَلۡ لَّنَا مِنۡ لَّدُنۡکَ وَلِیًّا ۚۙ وَّ اجۡعَلۡ لَّنَا مِنۡ لَّدُنۡکَ نَصِیۡرًا ﴿ؕ۷۶﴾", "english": " And what is the matter with you that you fight not in the cause of Allah and of the weak — men, women and children — who say, ‘Our Lord, take us out of this town, whose people are oppressors, and make for us some friend from Thyself, and make for us from Thyself some helper?’", "french": " Qu’avez-vous donc à ne pas vous battre pour la cause d’Allāh et de ceux qui ont été rendus faibles – hommes, femmes, enfants – qui disent : « Notre Seigneur, fais-nous sortir de cette ville dont les habitants sont des oppresseurs, et envoie-nous de Ta part un ami et envoie-nous de Ta part un aide ? »", "german": " Und was ist euch, dass ihr nicht kämpfet für Allahs Sache und für die der Schwachen – Männer, Frauen und Kinder –, die sprechen: \"Unser Herr, führe uns heraus aus dieser Stadt, deren Bewohner Bedrücker sind, und gib uns von Dir einen Beschützer, und gib uns von Dir einen Helfer\"?", "spanish": " Y ¿qué os ocurre que no combatís por la causa de Al-lah y de los débiles -hombres, mujeres y niños- que dicen: “Señor nuestro, sácanos de esta ciudad cuyos habitantes son opresores y consíguenos de Tu parte, un defensor”?", "urdu": " اور تمہیں کیا (ہوگیا) ہے کہ تم اللہ کی (راہ میں) اور ان کمزور مردوں اور عورتوں اور بچوں کی راہ میں جنگ نہیں کرتے جو کہتے ہیں کہ اے ہمارے رب! ہمیں اس بستی سے جس کے رہنے والے ظالم ہیں نکال اور اپنی جناب سے ہمارا کوئی دوست بنا (کربھیج) اور اپنے حضور سے (کسی کو) ہمارا مددگار بنا (کر کھڑا کر) ۔"}, {"arabic": " اَلَّذِیۡنَ اٰمَنُوۡا یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ ۚ وَ الَّذِیۡنَ کَفَرُوۡا یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ الطَّاغُوۡتِ فَقَاتِلُوۡۤا اَوۡلِیَآءَ الشَّیۡطٰنِ ۚ اِنَّ کَیۡدَ الشَّیۡطٰنِ کَانَ ضَعِیۡفًا ﴿٪۷۷﴾", "english": " Those who believe fight in the cause of Allah, and those who disbelieve fight in the cause of the Evil One. Fight ye therefore against the friends of Satan; surely, Satan’s strategy is weak!", "french": " Les croyants combattent pour la cause d’Allāh et les mécréants combattent pour la cause du Malin. Combattez donc les amis de Satan ; assurément, la stratégie de Satan est faible !", "german": " Die da glauben, kämpfen für Allahs Sache, und die nicht glauben, kämpfen für die Sache des Bösen. Kämpft darum wider die Freunde Satans! Denn gewiss, Satans Feldherrnkunst ist schwach.", "spanish": " Los creyentes combaten por la causa de Al-lah y los incrédulos por la causa del Maligno. ¡Combatid, pues, contra los amigos de Satanás; pues en verdad la estrategia de Satanás es débil!", "urdu": " جو لوگ مومن ہیں وہ اللہ کی راہ میں جنگ کرتے ہیں۔ اور جو کافر ہیں وہ شیطان کی راہ میں جنگ کرتے ہیں۔ اس لئے تم شیطان کے دوستوں سے جنگ کرو۔ شیطان کی تدبیر کمزور (ہوتی) ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ قِیۡلَ لَہُمۡ کُفُّوۡۤا اَیۡدِیَکُمۡ وَ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ ۚ فَلَمَّا کُتِبَ عَلَیۡہِمُ الۡقِتَالُ اِذَا فَرِیۡقٌ مِّنۡہُمۡ یَخۡشَوۡنَ النَّاسَ کَخَشۡیَۃِ اللّٰہِ اَوۡ اَشَدَّ خَشۡیَۃً ۚ وَ قَالُوۡا رَبَّنَا لِمَ کَتَبۡتَ عَلَیۡنَا الۡقِتَالَ ۚ لَوۡ لَاۤ اَخَّرۡتَنَاۤ اِلٰۤی اَجَلٍ قَرِیۡبٍ ؕ قُلۡ مَتَاعُ الدُّنۡیَا قَلِیۡلٌ ۚ وَ الۡاٰخِرَۃُ خَیۡرٌ لِّمَنِ اتَّقٰی ۟ وَ لَا تُظۡلَمُوۡنَ فَتِیۡلًا ﴿۷۸﴾", "english": " Dost thou not know of those to whom it was said: ‘Restrain your hands, observe Prayer and pay the Zakat?’ And when fighting has been prescribed for them, behold! a section of them fear men as they should fear Allah, or with still greater fear; and they say, ‘Our Lord, why hast Thou prescribed fighting for us? Wouldst Thou not grant us respite yet a while?’ Say, ‘The benefit of this world is little and the Hereafter will be better for him who fears God ; and you shall not be wronged a whit.’", "french": " N’as-tu pas entendu parler de ceux à qui il fut dit : « Retenez vos mains, observez la Prière et payez la Zakāt » ? Et quand il leur a été commandé de combattre, voilà qu’une partie d’entre eux se mirent à craindre les hommes comme ils devraient craindre Allāh, ou encore davantage et ils dirent : « Notre Seigneur, pourquoi nous as-Tu prescrit le combat ? Pourquoi ne nous accordes-Tu pas du répit pour quelque temps » ? Dis : « Les avantages d’ici-bas sont peu, et l’au-delà vaudra mieux pour celui qui craint Allāh ; et vous ne serez pas lésés, même pas d’un iota. »", "german": " Hast du nicht Kunde von denen, welchen gesagt wurde: \"Zügelt eure Hände, verrichtet das Gebet und zahlet die Zakât\"? Doch wenn ihnen Kampf verordnet wurde, da fürchtete ein Teil von ihnen die Menschen, wie man Allah fürchtet, oder mit noch größerer Furcht; und sie sagten: \"Unser Herr, warum hast Du uns Kampf verordnet? Möchtest Du uns nicht noch eine Weile Aufschub gewähren?\" Sprich: \"Der Vorteil dieser Welt ist gering und das Jenseits wird besser sein für den Gottesfürchtigen; und kein Quentchen Unrecht sollt ihr erleiden.\"", "spanish": " ¿No has visto a quienes se les dijo: “Contened vuestras manos, cumplid la Oración y pagad el Zakat”? Mas cuando se les prescribió el combate, ¡mirad! una parte de ellos temen a los hombres como deberían temer a Al-lah e incluso con mayor temor; y dicen: “Señor nuestro, ¿por qué nos has prescrito el combate? ¿Por qué no nos concedes un poco más de tregua?” Diles: “El provecho de este mundo es mínimo y el Más Allá será mejor para quien teme a Dios; y no seréis perjudicados en lo más mínimo”.", "urdu": " کیا تجھے ان لوگوں کا حال معلوم نہیں جنہیں کہا گیا تھا کہ تم اپنے ہاتھوں کو روکے رکھو اور نماز قائم کرو اور زکٰوۃ دو (لیکن وہ جنگ کی طرف مائل تھے) لیکن جب جنگ کرنا ان پر فرض کیا گیا تو یکدم ان میں سے کچھ آدمی لوگوں سے اسی طرح ڈرنے لگے جس طرح خدا سے ڈرنا چاہیئے بلکہ اس سے بھی زیادہ اور کہنے لگے کہ اے ہمارے رب! تو نے ہم پر جنگ کرنا کیوں فرض کیا ہے۔ کیوں نہ تو نے کچھ دیر کے لئے ہمیں (اور) ڈھیل دی۔ تو کہہ دے (کہ) دنیا کا فائدہ حقیر ہے اور جو تقویٰ اختیار کرے اس کے لئے پیچھے آنے والی (زندگی) بہتر ہے اور تم پر کھجور کی گٹھلی کے اندر کی لکیر کے برابر (بھی) ظلم نہ کیا جائے گا۔"}, {"arabic": " اَیۡنَ مَا تَکُوۡنُوۡا یُدۡرِکۡکُّمُ الۡمَوۡتُ وَ لَوۡ کُنۡتُمۡ فِیۡ بُرُوۡجٍ مُّشَیَّدَۃٍ ؕ وَ اِنۡ تُصِبۡہُمۡ حَسَنَۃٌ یَّقُوۡلُوۡا ہٰذِہٖ مِنۡ عِنۡدِ اللّٰہِ ۚ وَ اِنۡ تُصِبۡہُمۡ سَیِّئَۃٌ یَّقُوۡلُوۡا ہٰذِہٖ مِنۡ عِنۡدِکَ ؕ قُلۡ کُلٌّ مِّنۡ عِنۡدِ اللّٰہِ ؕ فَمَالِ ہٰۤؤُلَآءِ الۡقَوۡمِ لَا یَکَادُوۡنَ یَفۡقَہُوۡنَ حَدِیۡثًا ﴿۷۹﴾", "english": " Wheresoever you may be, death will overtake you, even if you be in strongly built towers. And if some good befalls them, they say, ‘This is from Allah;’ and if evil befalls them, they say, ‘This is from thee.’ Say, ‘All is from Allah.’ What has happened to these people that they come not near understanding anything?", "french": " Où que vous soyez, la mort vous atteindra, même si vous vous trouvez dans des tours solidement construites. Et si un bien leur arrive, ils disent : « C’est de la part d’Allāh. » Et si un mal les atteint, ils disent : « Cela est de toi. » Dis : « Tout provient d’Allāh. » Qu’ont-ils donc ces gens qui sont si loin de comprendre la moindre chose ?", "german": " Wo ihr auch sein mögt, der Tod ereilt euch doch, und wäret ihr in hohen Burgen. Und wenn ihnen Gutes begegnet, sagen sie: \"Das ist von Allah\", und wenn ihnen Schlimmes begegnet, sagen sie: \"Das ist von dir.\" Sprich: \"Alles ist von Allah.\" Was ist diesem Volk widerfahren, dass sie so weit davon sind, etwas zu begreifen?", "spanish": " Dondequiera que estéis os alcanzará la muerte, aunque os encontréis en torres inexpugnables. Si les sucede algo bueno dicen: “Esto procede de Al-lah”, pero si es una desgracia dicen: “Esto procede de ti”. Diles: “Todo procede de Al-lah”. ¿Qué le ha sucedido a esa gente que apenas comprende nada?", "urdu": " تم جہاں کہیں بھی ہو موت تمہیں آپکڑے گی خواہ تم مضبوط قلعوں میں (ہی کیوں نہ) ہو اور اگر انہیں (یعنی مذکورہ بالا لوگوں کو) کوئی بھلائی پہنچتی ہے تو کہتے ہیں کہ یہ اللہ کی طرف سے ہے اور اگر کوئی برائی پہنچتی ہے تو کہتے ہیں کہ یہ تیری طرف سے ہے۔ تو کہہ دے (کہ) سب (کچھ) اللہ (ہی) کی طرف سے ہے پس ان لوگوں کو کیا ہو گیا ہے کہ کسی بات کے سمجھنے کے قریب (تک) نہیں جاتے۔"}, {"arabic": " مَاۤ اَصَابَکَ مِنۡ حَسَنَۃٍ فَمِنَ اللّٰہِ ۫ وَ مَاۤ اَصَابَکَ مِنۡ سَیِّئَۃٍ فَمِنۡ نَّفۡسِکَ ؕ وَ اَرۡسَلۡنٰکَ لِلنَّاسِ رَسُوۡلًا ؕ وَ کَفٰی بِاللّٰہِ شَہِیۡدًا ﴿۸۰﴾", "english": " Whatever of good comes to thee is from Allah; and whatever of evil befalls thee is from thyself. And We have sent thee as a Messenger to mankind. And sufficient is Allah as a Witness.", "french": " Quelque bien qui t’arrive est d’Allāh ; et quelque mal qui t’atteigne est de toi-même. Et Nous ne t’avons envoyé qu’en tant que Messager auprès de l’humanité. Et Allāh suffit comme Témoin.", "german": " Was dich Gutes trifft, kommt von Allah, und was dich Schlimmes trifft, kommt von dir selbst. Und Wir haben dich als einen Gesandten zu den Menschen entsandt. Und Allah genügt als Zeuge.", "spanish": " Todo el bien que te acontece procede de Al-lah; y el mal que te aflige procede de ti mismo. Y te hemos enviado a la humanidad como Mensajero. Pues Al-lah basta como Testigo.", "urdu": " جو بھلائی تجھے پہنچے وہ تو اللہ کی طرف سے ہے۔ اور جو برائی تجھے پہنچے وہ تیری اپنی طرف سے ہے۔اور ہم نے تجھے لوگوں کے لئے رسول بنا کر بھیجا ہے۔ اور اللہ خوب اچھا گواہ ہے۔"}, {"arabic": " مَنۡ یُّطِعِ الرَّسُوۡلَ فَقَدۡ اَطَاعَ اللّٰہَ ۚ وَ مَنۡ تَوَلّٰی فَمَاۤ اَرۡسَلۡنٰکَ عَلَیۡہِمۡ حَفِیۡظًا ﴿ؕ۸۱﴾", "english": " Whoso obeys the Messenger obeys Allah indeed; and whoso turns away, then We have not sent thee as a keeper over them.", "french": " Quiconque obéit au Messager, obéit alors sûrement à Allāh, et quiconque se détourne, alors, Nous ne t’avons pas envoyé à eux pour les surveiller.", "german": " Wer dem Gesandten gehorcht, der gehorcht in der Tat Allah; und wer sich abkehrt – wohlan, Wir haben dich nicht gesandt zum Hüter über sie.", "spanish": " Quien obedece al Mensajero obedece ciertamente a Al-lah; en cuanto a los que vuelven la espalda: no te hemos enviado como guardián de ellos.", "urdu": " جو رسول کی اطاعت کرے (تو سمجھو کہ) اس نے اللہ کی اطاعت کی اور جو لوگ پیٹھ پھیر گئے تو (یاد رہے کہ) ہم نے تجھے ان پر نگہبان بنا کر نہیں بھیجا۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ طَاعَۃٌ ۫ فَاِذَا بَرَزُوۡا مِنۡ عِنۡدِکَ بَیَّتَ طَآئِفَۃٌ مِّنۡہُمۡ غَیۡرَ الَّذِیۡ تَقُوۡلُ ؕ وَ اللّٰہُ یَکۡتُبُ مَا یُبَیِّتُوۡنَ ۚ فَاَعۡرِضۡ عَنۡہُمۡ وَ تَوَکَّلۡ عَلَی اللّٰہِ ؕ وَ کَفٰی بِاللّٰہِ وَکِیۡلًا ﴿۸۲﴾", "english": " And they say: ‘Obedience is our guiding principle ;’ but when they go forth from thy presence, a section of them spends the night scheming against what thou sayest. Allah records whatever they scheme by night. So turn away from them, and put thy trust in Allah. And sufficient is Allah as a Disposer of affairs.", "french": " Et ils disent de leur bouche seulement : « L’obéissance ! « mais lorsqu’ils s'éloignent de ta présence, une partie d’entre eux passe la nuit à dire des choses autres que ce que tu dis. Allāh enregistre leurs complots nocturnes. Ainsi, détourne-toi d’eux et mets ta confiance en Allāh. Et Allāh suffit comme Protecteur.", "german": " Und sie sagen: \"Gehorsam (ist unser Leitsatz)\", doch wenn sie von dir gehen, dann ersinnt ein Teil von ihnen Anschläge gegen das, was du gesagt. Allah aber zeichnet alles auf, was sie an Anschlägen ersinnen. So wende dich von ihnen ab und vertraue auf Allah. Und Allah genügt als Vertrauter.", "spanish": " Y dicen: “La obediencia es el principio que nos guía”; pero cuando se retiran de tu presencia, una parte de ellos pasa la noche intrigando contra lo que tú dices. Mas Al-lah toma nota de cuanto traman por la noche. Aléjate, pues, de ellos y pon tu confianza en Al-lah. Al-lah es suficiente como Ordenador de asuntos.", "urdu": " اور وہ کہتے ہیں (کہ ہمارا کام تو) فرمانبرداری (ہے) پھر جب تیرے پاس سے چلے جاتے ہیں تو ان میں سے ایک گروہ جو کچھ تو کہتا ہے اس کے مخالف تدبیریں کرتا ہے۔ اور جو تدبیریں وہ کرتے ہیں اللہ انہیں محفوظ کرتا جاتا ہے اس لئے تو ان سے اعراض کر اور اللہ پر بھروسہ رکھ اور اللہ کے بعد کسی اور کارساز کی ضرورت نہیں۔"}, {"arabic": " اَفَلَا یَتَدَبَّرُوۡنَ الۡقُرۡاٰنَ ؕ وَ لَوۡ کَانَ مِنۡ عِنۡدِ غَیۡرِ اللّٰہِ لَوَجَدُوۡا فِیۡہِ اخۡتِلَافًا کَثِیۡرًا ﴿۸۳﴾", "english": " Will they not, then, meditate upon the Qur’an? Had it been from anyone other than Allah, they would surely have found therein much disagreement.", "french": " Ne veulent-ils donc pas méditer sur le Coran ? Si cela avait été d’un autre qu’Allāh, ils y auraient assurément trouvé beaucoup de contradictions.", "german": " Wollen sie denn nicht über den Qur-ân nachsinnen? Wäre er von einem anderen als Allah, sie würden gewiss manchen Widerspruch darin finden.", "spanish": " ¿Acaso no meditarán en el Corán? Si procediera de alguien que no fuera Al-lah, ciertamente hallarían en él muchas contradicciones.", "urdu": " پس کیا وہ (لوگ) قرآن پر غور نہیں کرتے اور (نہیں سمجھتے کہ) اگر وہ اللہ کے سوا (کسی اور) کی طرف سے ہوتا تو وہ یقیناً اس میں بہت سا اختلاف پاتے۔"}, {"arabic": " وَ اِذَا جَآءَہُمۡ اَمۡرٌ مِّنَ الۡاَمۡنِ اَوِ الۡخَوۡفِ اَذَاعُوۡا بِہٖ ؕ وَ لَوۡ رَدُّوۡہُ اِلَی الرَّسُوۡلِ وَ اِلٰۤی اُولِی الۡاَمۡرِ مِنۡہُمۡ لَعَلِمَہُ الَّذِیۡنَ یَسۡتَنۡۢبِطُوۡنَہٗ مِنۡہُمۡ ؕ وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ لَاتَّبَعۡتُمُ الشَّیۡطٰنَ اِلَّا قَلِیۡلًا ﴿۸۴﴾", "english": " And when there comes to them any tidings whether of peace or of fear, they spread it about; whereas if they had referred it to the Messenger and to those in authority among them, surely those of them, who can elicit the truth from it, would have understood it. And had it not been for the grace of Allah upon you and His mercy, you would have followed Satan, save a few.", "french": " Et lorsqu’ils reçoivent des nouvelles, que ce soit de paix ou de peur, ils les répandent, tandis que s’ils s'en étaient référés au Messager et à ceux d’entre eux qui exercent l’autorité, sûrement ceux d’entre eux qui sont capables de les examiner d'un œil critique, les auraient bien comprises. Et sans la grâce d’Allāh sur vous et Sa miséricorde, à part quelques-uns, vous auriez suivi Satan.", "german": " Und wenn etwas von Frieden oder Furcht zu ihnen dringt, verbreiten sie es; hätten sie es aber vor den Gesandten und vor jene gebracht, die unter ihnen Befehlsgewalt haben, dann würden sicherlich die unter ihnen, die es entschleiern können, es verstanden haben. Und wäre nicht Allahs Gnade über euch und Seine Barmherzigkeit, ihr wäret alle dem Satan gefolgt, bis auf einige wenige.", "spanish": " Y cuando conjeturan rumores respecto a un asunto de paz o de alarma, los divulgan; mientras que si los hubieran transmitido al Mensajero y a quienes detentan la autoridad, en verdad que quienes hubieran examinado críticamente el tema, podrían saber la verdad. De no ser por la gracia de Al-lah para vosotros y por Su misericordia, habríais seguido a Satanás, salvo unos pocos.", "urdu": " اور جب (بھی) ان کے پاس امن (کی) یا خوف کی کوئی بات پہنچتی ہے تو وہ اسے مشہور کر دیتے ہیں اور اگر وہ اسے رسول کی طرف اور اپنے حکام کی طرف لے جاتے تو ان میں سے جو (لوگ) اس (یعنی مقررہ بات کی اصلیت) کو معلوم کر لیا کرتے ہیں اس (کی حقیقت) کو پالیتے اور اگر تم پر اللہ کا فضل اور اس کی رحمت نہ ہوتی تو سوائے چند ایک کے (باقی لوگ) شیطان کے پیچھے چل پڑتے۔"}, {"arabic": " فَقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ ۚ لَا تُکَلَّفُ اِلَّا نَفۡسَکَ وَ حَرِّضِ الۡمُؤۡمِنِیۡنَ ۚ عَسَی اللّٰہُ اَنۡ یَّکُفَّ بَاۡسَ الَّذِیۡنَ کَفَرُوۡا ؕ وَ اللّٰہُ اَشَدُّ بَاۡسًا وَّ اَشَدُّ تَنۡکِیۡلًا ﴿۸۵﴾", "english": " Fight, therefore, in the cause of Allah — thou art not made responsible except for thyself — and urge on the believers. It may be that Allah will restrain the might of those that disbelieve; and Allah is stronger in might and stronger in inflicting punishment.", "french": " Combats donc pour la cause d’Allāh – on t’a fait responsable que de toi-même – et exhorte les croyants. Il se peut qu’Allāh refrène les assauts des mécréants, car Allāh est Plus Redoutable dans la guerre et est Plus Sévère en punition exemplaire.", "german": " Kämpfe darum für Allahs Sache – du wirst für keinen verantwortlich gemacht als für dich selbst – und sporne die Gläubigen an. Vielleicht wird Allah den Krieg der Ungläubigen aufhalten; und Allah ist stärker im Krieg und strenger im Strafen.", "spanish": " Combatid, pues, por la causa de Al-lah –tú solo eres responsable de ti mismo- y exhorta a los creyentes. Tal vez Al-lah reprima el poder de los incrédulos; pues Al-lah es más fuerte en poder y más fuerte a la hora de infligir el castigo.", "urdu": " سو تُو اللہ کی راہ میں لڑائی کر تجھے اپنے نفس کے سوا (کسی کا) ذمہ دار نہیں ٹھہرایا جاتا۔ اور (تیرا کام صرف یہ ہے کہ) تو مومنوں کو ترغیب دے۔ بالکل ممکن ہے کہ اللہ کافروں کی جنگ کو روک دے اور اللہ کی جنگ سب سے بڑھ کر سخت (ہوتی) ہے اور اس کا عذاب بھی سب سے بڑھ کر سخت (ہوتا) ہے۔"}, {"arabic": " مَنۡ یَّشۡفَعۡ شَفَاعَۃً حَسَنَۃً یَّکُنۡ لَّہٗ نَصِیۡبٌ مِّنۡہَا ۚ وَ مَنۡ یَّشۡفَعۡ شَفَاعَۃً سَیِّئَۃً یَّکُنۡ لَّہٗ کِفۡلٌ مِّنۡہَا ؕ وَ کَانَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ مُّقِیۡتًا ﴿۸۶﴾", "english": " Whoso makes a righteous intercession shall have a share thereof, and whoso makes an evil intercession, shall have a like portion thereof; and Allah is Powerful over everything.", "french": " Quiconque fera une intercession vertueuse en aura une part et quiconque fera une mauvaise intercession en aura une portion égale des mauvaises conséquences ; et Allāh est Puissant sur toute chose.", "german": " Wer in gerechter Sache Fürsprache einlegt, dem soll ein Anteil daran werden, und wer in ungerechter Sache Fürsprache einlegt, dem soll ein gleicher Anteil daran werden; und Allah ist mächtig über alle Dinge.", "spanish": " Quien interceda en una buena causa tendrá parte en ella, y quien lo haga en una causa inicua, compartirá sus malas consecuencias ; pues Al-lah es Poderoso sobre todas las cosas.", "urdu": " جو (شخص) اچھی سفارش کرے اس کے لئے اس میں سے ایک حصہ ہوگا اور جو شخص بری سفارش کرے اس میں سے اس کے لئے (ویسا ہی) حصہ ہوگا۔ اور اللہ ہر ایک امر پر کامل قدرت رکھتا ہے۔"}, {"arabic": " وَ اِذَا حُیِّیۡتُمۡ بِتَحِیَّۃٍ فَحَیُّوۡا بِاَحۡسَنَ مِنۡہَاۤ اَوۡ رُدُّوۡہَا ؕ اِنَّ اللّٰہَ کَانَ عَلٰی کُلِّ شَیۡءٍ حَسِیۡبًا ﴿۸۷﴾", "english": " And when you are greeted with a prayer, greet ye with a better prayer or at least return it. Surely, Allah takes account of all things.", "french": " Et lorsqu’on vous salue d’une prière, saluez d’une prière meilleure ou tout au moins retournez-la. En vérité Allāh tient compte de tout.", "german": " Und wenn ihr mit einem Glückwunsch gegrüßt werdet, so grüßet mit einem schöneren wieder oder gebt ihn (wenigstens) zurück. Siehe, Allah führt Rechenschaft über alle Dinge.", "spanish": " Si recibís una expresión de amistad devolvedla en la misma medida, o incluso mayor. Ciertamente, Al-lah tiene en cuenta todas las cosas.", "urdu": " اور جب تمہیں کوئی دعا دی جائے تو تم اس سے اچھی دعا دو یا (کم سے کم) اسی کو لوٹا دو۔ اللہ یقیناً ہر ایک امر کا حساب لینے والا ہے۔"}, {"arabic": " اَللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَ ؕ لَیَجۡمَعَنَّکُمۡ اِلٰی یَوۡمِ الۡقِیٰمَۃِ لَا رَیۡبَ فِیۡہِ ؕ وَ مَنۡ اَصۡدَقُ مِنَ اللّٰہِ حَدِیۡثًا ﴿٪۸۸﴾", "english": " Allah is He beside Whom there is none worthy of worship. He will certainly continue to assemble you till the Day of Resurrection, about which there is no doubt. And who is more truthful in his word than Allah?", "french": " Allāh ! En dehors de Lui, aucun n’est digne d’adoration. Il continuera assurément à vous rassembler jusqu’au Jour de la Résurrection, à propos duquel il n’y a aucun doute. Et qui plus qu’Allāh est fidèle à sa parole ?", "german": " Allah – niemand ist anbetungswürdig außer Ihm. Er wird euch weiter versammeln bis zum Tage der Auferstehung, über den kein Zweifel ist. Und wer ist wahrhafter in der Rede als Allah?", "spanish": " ¡Al-lah! fuera de Él no existe nada que merezca adoración. Él continuará ciertamente congregándoos hasta el Día de la Resurrección, sobre el cual no hay duda alguna. Pues ¿quién es más verídico en su palabra que Al-lah?", "urdu": " اللہ (وہ ذات ہے کہ) اس کے سوا کوئی معبود نہیں وہ تمہیں بلاشک و شبہ قیامت کے دن تک جمع کرتا (چلا) جائے گا جس کے آنے میں کوئی شک نہیں اور اللہ سے بڑھ کر کس کی بات سچی (ہوسکتی) ہے۔"}, {"arabic": " فَمَا لَکُمۡ فِی الۡمُنٰفِقِیۡنَ فِئَتَیۡنِ وَ اللّٰہُ اَرۡکَسَہُمۡ بِمَا کَسَبُوۡا ؕ اَتُرِیۡدُوۡنَ اَنۡ تَہۡدُوۡا مَنۡ اَضَلَّ اللّٰہُ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَلَنۡ تَجِدَ لَہٗ سَبِیۡلًا ﴿۸۹﴾", "english": " What has happened to you that you are divided into two parties regarding the hypocrites? And Allah has overthrown them because of what they earned. Desire ye to guide him whom Allah has caused to perish? And for him whom Allah causes to perish thou shalt not find a way.", "french": " Qu’est-ce qui vous prend pour que vous soyez divisés en deux groupes au sujet des hypocrites ? Et Allāh les a renversés pour ce qu’ils ont mérité. Désirez-vous guider celui qu’Allāh a jugé égaré ? Et celui qu’Allāh a jugé égaré, tu ne trouveras pour lui aucune voie.", "german": " Was ist denn euch widerfahren, dass ihr in zwei Parteien gespalten seid gegenüber den Heuchlern? Und Allah hat sie verstoßen um dessentwillen, was sie begangen. Wolltet ihr einem den Weg weisen, den Allah ins Verderben hat gehen lassen? Und wen Allah ins Verderben gehen lässt, für den findest du keinen Weg.", "spanish": " ¿Qué os ha ocurrido que estáis divididos en dos bandos respecto a los hipócritas? Al-lah los derrocó por lo que habían merecido. ¿Os gustaría guiar a quien Al-lah ha hecho perecer? Y no encontraréis camino para quien Al-lah ha hecho perecer.", "urdu": " اور تمہیں کیا (ہوگیا) ہے (کہ تم) منافقوں کے متعلق دو گروہ (ہو رہے) ہو۔ حالانکہ جو کچھ انہوں نے کمایا ہے اس کے سبب سے اللہ نے انہیں اوندھا کر دیا ہے کیا جسے اللہ نے ہلاک کر دیا ہے تم اسے راہ پر لاٶ گے؟ اور جسے اللہ ہلاک کرے تو اس کے لئے ہرگز کوئی رستہ نہ پائے گا۔"}, {"arabic": " وَدُّوۡا لَوۡ تَکۡفُرُوۡنَ کَمَا کَفَرُوۡا فَتَکُوۡنُوۡنَ سَوَآءً فَلَا تَتَّخِذُوۡا مِنۡہُمۡ اَوۡلِیَآءَ حَتّٰی یُہَاجِرُوۡا فِیۡ سَبِیۡلِ اللّٰہِ ؕ فَاِنۡ تَوَلَّوۡا فَخُذُوۡہُمۡ وَ اقۡتُلُوۡہُمۡ حَیۡثُ وَجَدۡتُّمُوۡہُمۡ ۪ وَ لَا تَتَّخِذُوۡا مِنۡہُمۡ وَلِیًّا وَّ لَا نَصِیۡرًا ﴿ۙ۹۰﴾", "english": " They wish that you should disbelieve as they have disbelieved, so that you may become all alike. Take not, therefore, friends from among them, until they emigrate in the way of Allah. And if they turn away, then seize them and kill them wherever you find them; and take no friend nor helper from among them;", "french": " Ils voudraient que vous deveniez mécréants comme eux afin que vous deveniez tous pareils. Alors ne prenez pas d’amis parmi eux jusqu’à ce qu’ils émigrent dans le chemin d’Allāh. Et s’ils tournent le dos, alors saisissez-les et tuez-les où que vous les trouviez, et ne prenez parmi eux ni ami ni aide ;", "german": " Sie wünschen, dass ihr ungläubig werdet, wie sie ungläubig sind, so dass ihr alle gleich seiet. Nehmet euch daher keinen von ihnen zum Freund, ehe sie nicht auswandern auf Allahs Weg. Und wenn sie sich abkehren, dann ergreifet sie und tötet sie, wo immer ihr sie auffindet; und nehmet euch keinen von ihnen zum Freunde oder zum Helfer;", "spanish": " Desean que dejéis de creer, como dejaron de creer ellos, para que seáis todos iguales. No os haréis, pues, amigos de ninguno de ellos hasta que no hayan emigrado en el camino de Al-lah. Y si se alejan, capturadlos y matadlos dondequiera que los encontréis; y no toméis por amigo o por defensor a ninguno de ellos;", "urdu": " وہ چاہتے ہیں کہ جس طرح وہ (خود) کافر ہو چکے ہیں کاش! تم (بھی اسی طرح) کافر ہوجاٶ۔ اور (وہ اور تم) برابر ہو جاٶ۔ اس لئے جب تک وہ اللہ کی راہ میں ہجرت (نہ) کریں تم ان میں سے (کسی کو) دوست نہ بناٶ۔ پھر اگر وہ پھر جائیں تو تم انہیں پکڑو اور جہاں انہیں پاٶ انہیں قتل کردو اور نہ ان میں سے (کسی کو) دوست بناٶ اور نہ مددگار۔"}, {"arabic": " اِلَّا الَّذِیۡنَ یَصِلُوۡنَ اِلٰی قَوۡمٍۭ بَیۡنَکُمۡ وَ بَیۡنَہُمۡ مِّیۡثَاقٌ اَوۡ جَآءُوۡکُمۡ حَصِرَتۡ صُدُوۡرُہُمۡ اَنۡ یُّقَاتِلُوۡکُمۡ اَوۡ یُقَاتِلُوۡا قَوۡمَہُمۡ ؕ وَ لَوۡ شَآءَ اللّٰہُ لَسَلَّطَہُمۡ عَلَیۡکُمۡ فَلَقٰتَلُوۡکُمۡ ۚ فَاِنِ اعۡتَزَلُوۡکُمۡ فَلَمۡ یُقَاتِلُوۡکُمۡ وَ اَلۡقَوۡا اِلَیۡکُمُ السَّلَمَ ۙ فَمَا جَعَلَ اللّٰہُ لَکُمۡ عَلَیۡہِمۡ سَبِیۡلًا ﴿۹۱﴾", "english": " Except those who are connected with a people between whom and you there is a pact, or those who come to you, while their hearts shrink from fighting you or fighting their own people. And if Allah had so pleased, He would have given them power over you, then they would have surely fought you. So, if they keep aloof from you and fight you not, and make you an offer of peace, then remember that Allah has allowed you no way of aggression against them.", "french": " Excepté ceux qui sont en relation avec un peuple entre lequel et vous existe un pacte, ou bien ceux qui viennent à vous leur cœur refusant de vous combattre ou de combattre leur propre peuple. Et si Allāh l’avait voulu, Il aurait pu faire qu’ils vous dominent ; et ils vous auraient sûrement combattus. Aussi, s’ils se tiennent à l’écart de vous et ne vous combattent pas, et vous offrent la paix, alors rappelez-vous qu’ Allāh ne vous a permis aucune voie d’agression à leur égard.", "german": " außer denen, die Verbindung haben mit einem Volke, mit dem ihr ein Bündnis habt, und die zu euch kommen, weil ihre Herzen davor zurückschrecken, wider euch oder wider ihr eigenes Volk zu kämpfen. Und wenn Allah es wollte, Er hätte ihnen Macht über euch geben können, dann hätten sie sicherlich wider euch gekämpft. Darum, wenn sie sich von euch fernhalten und nicht wider euch kämpfen, sondern euch Frieden bieten: dann hat Allah euch keinen Weg gegen sie erlaubt.", "spanish": " Excepto los relacionados con un pueblo entre el cual y vosotros haya una alianza, o quienes vinieren a vosotros con sus corazones arrepentidos por haber combatido contra vosotros o contra su propia gente. Si Al-lah lo hubiera querido, les habría dado poder sobre vosotros, y ciertamente os habrían combatido. Por tanto, si se antienen alejados de vosotros, no os combaten y os ofrecen la paz, recordad que Al-lah no os permite ningún modo de agresión en su contra.", "urdu": " باستثنا ء ان لوگوں کے جو (یا تو) کسی ایسی قوم سے تعلق رکھتے ہوں جن کے اور تمہارے درمیان (کوئی) معاہدہ ہو (اور) وہ تمہارے پاس اس حالت میں آئیں کہ تم سے جنگ کرنے (سے) یا اپنی قوم سے جنگ کرنے سے ان کے سینے انقباض رکھتے ہوں اور اگر اللہ چاہتا تو انہیں یقیناً تم پر غلبہ دیتا۔ تب وہ ضرور تم سے لڑتے پس اگر وہ تم سے کنارہ کش ہو جائیں اور تم سے جنگ نہ کریں اور تمہاری طرف صلح (کی طرح) ڈالیں تو اللہ نے تمہارے لئے ان کے خلاف (تعدی کا) کوئی رستہ (باقی) نہیں رکھا۔"}, {"arabic": " سَتَجِدُوۡنَ اٰخَرِیۡنَ یُرِیۡدُوۡنَ اَنۡ یَّاۡمَنُوۡکُمۡ وَ یَاۡمَنُوۡا قَوۡمَہُمۡ ؕ کُلَّمَا رُدُّوۡۤا اِلَی الۡفِتۡنَۃِ اُرۡکِسُوۡا فِیۡہَا ۚ فَاِنۡ لَّمۡ یَعۡتَزِلُوۡکُمۡ وَ یُلۡقُوۡۤا اِلَیۡکُمُ السَّلَمَ وَ یَکُفُّوۡۤا اَیۡدِیَہُمۡ فَخُذُوۡہُمۡ وَ اقۡتُلُوۡہُمۡ حَیۡثُ ثَقِفۡتُمُوۡہُمۡ ؕ وَ اُولٰٓئِکُمۡ جَعَلۡنَا لَکُمۡ عَلَیۡہِمۡ سُلۡطٰنًا مُّبِیۡنًا ﴿٪۹۲﴾", "english": " You will find others who desire to be secure from you and to be secure from their own people. Whenever they are made to revert to hostility, they fall headlong into it. Therefore, if they do not keep aloof from you nor offer you peace nor restrain their hands, then seize them and kill them, wherever you find them. Against these We have given you clear authority.", "french": " Vous en trouverez d’autres qui désireront être en paix avec vous et en paix avec leur propre peuple. Toutes les fois qu’on les fait retourner aux hostilités, irrésistiblement ils s'y jettent tête baissée. Si donc ils ne se tiennent pas éloignés de vous, et ne vous offrent pas la paix, et ne retiennent pas leurs mains, alors saisissez-les et tuez-les où que vous les trouviez. Contre ceux-là Nous vous avons donné un argument clair.", "german": " Ihr werdet noch andere finden, die wünschen, in Frieden mit euch und in Frieden mit ihrem eigenen Volk zu sein. Sooft sie wieder zur Feindseligkeit verleitet werden, stürzen sie kopfüber hinein. Wenn sie sich also nicht von euch fernhalten noch euch Frieden bieten noch ihre Hände zügeln, dann ergreifet sie und tötet sie, wo immer ihr sie auffindet. Denn gegen diese haben Wir euch volle Gewalt gegeben.", "spanish": " Encontraréis a otros que desean estar seguros respecto a vosotros y a su propia gente. Cada vez que se les hace renunciar a la hostilidad, caen de cabeza en ella. Así pues, si no se mantienen alejados de vosotros, no os ofrecen la paz ni retienen sus manos, capturadlos y matadlos dondequiera que los encontréis. Contra éstos os damos autoridad absoluta.", "urdu": " تم ضرور (کچھ) اور لوگوں کو (ایسا) پاٶ گے کہ وہ چاہتے ہیں کہ تم سے (بھی) امن میں رہیں اور اپنی قوم سے (بھی) امن میںرہیں جب بھی انہیں فتنہ کی طرف لوٹایا گیا (ہے) تو وہ اس میں اوندھے منہ گرائے جاتے رہے ہیں۔ پس اگر وہ تم سے کنارہ کش نہ ہو جائیں اور تمہاری طرف صلح (کی طرح نہ) ڈالیں اور اپنے ہاتھوں کو روک (نہ) لیں۔ تو تم انہیں پکڑو اور جہاں (کہیں) انہیں پاٶ انہیں قتل کرو۔ اور یہ لوگ ایسے ہیں کہ ہم نے ان کے خلاف تمہیں روشن حجت دی ہے۔"}, {"arabic": " وَ مَا کَانَ لِمُؤۡمِنٍ اَنۡ یَّقۡتُلَ مُؤۡمِنًا اِلَّا خَطَـًٔا ۚ وَ مَنۡ قَتَلَ مُؤۡمِنًا خَطَـًٔا فَتَحۡرِیۡرُ رَقَبَۃٍ مُّؤۡمِنَۃٍ وَّ دِیَۃٌ مُّسَلَّمَۃٌ اِلٰۤی اَہۡلِہٖۤ اِلَّاۤ اَنۡ یَّصَّدَّقُوۡا ؕ فَاِنۡ کَانَ مِنۡ قَوۡمٍ عَدُوٍّ لَّکُمۡ وَ ہُوَ مُؤۡمِنٌ فَتَحۡرِیۡرُ رَقَبَۃٍ مُّؤۡمِنَۃٍ ؕ وَ اِنۡ کَانَ مِنۡ قَوۡمٍۭ بَیۡنَکُمۡ وَ بَیۡنَہُمۡ مِّیۡثَاقٌ فَدِیَۃٌ مُّسَلَّمَۃٌ اِلٰۤی اَہۡلِہٖ وَ تَحۡرِیۡرُ رَقَبَۃٍ مُّؤۡمِنَۃٍ ۚ فَمَنۡ لَّمۡ یَجِدۡ فَصِیَامُ شَہۡرَیۡنِ مُتَتَابِعَیۡنِ ۫ تَوۡبَۃً مِّنَ اللّٰہِ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ﴿۹۳﴾", "english": " It does not become a believer to kill a believer unless it be by mistake. And he who kills a believer by mistake shall free a believing slave, and pay blood money to be handed over to his heirs, unless they remit it as charity. But if the person slain be of a people hostile to you, and be a believer, then the offender shall free a believing slave; and if he be of a people between whom and you is a pact, then the offender shall pay blood money to be handed over to his heirs, and free a believing slave. But whoso finds not one , then he shall fast for two consecutive months — a mercy from Allah. And Allah is All-Knowing, Wise.", "french": " Il ne convient pas à un croyant de tuer un autre croyant à moins que ce ne soit par erreur. Et celui qui tue un croyant par inadvertance devra affranchir un esclave croyant et payer le prix du sang à ses héritiers, à moins que ceux-ci ne le remettent par charité. Mais si la victime appartient à un peuple qui vous est hostile, et qu’elle soit croyante, alors le coupable devra affranchir un esclave croyant ; et si elle est d’un peuple avec lequel vous avez fait un pacte, alors le coupable paiera le prix du sang pour que ceci soit remis à ses héritiers, et affranchira un esclave croyant. Mais celui qui n’ en trouvera aucun , jeûnera pendant deux mois consécutifs - une expiation imposée par Allāh. Et Allāh est Omniscient, Sage.", "german": " Keinem Gläubigen steht es zu, einen anderen Gläubigen zu töten, es sei denn aus Versehen. Und wer einen Gläubigen aus Versehen tötet: dann die Befreiung eines gläubigen Sklaven und Blutgeld an seine Erben, es sei denn, sie erlassen es aus Mildtätigkeit. War er (der Getötete) aber von einem Volk, das euch feind ist, und ist er (der Totschläger) gläubig: dann die Befreiung eines gläubigen Sklaven; war er aber von einem Volk, mit dem ihr ein Bündnis habt: dann das Blutgeld an seine Erben und die Befreiung eines gläubigen Sklaven. Wer [das] nicht kann: dann zwei Monate hintereinander fasten – eine Barmherzigkeit von Allah. Und Allah ist allwissend, allweise.", "spanish": " No es propio de un creyente matar a otro creyente, salvo que sea por error. Y quien mate a un creyente por error pondrá en libertad a un esclavo creyente, y pagará una indemnización para que sea entregada a sus herederos, a menos que éstos lo perdonen por caridad. ero si la víctima fuese de un pueblo enemigo, y es creyente, el culpable pondrá en libertad a un esclavo creyente, y si uese de un pueblo con el que tenéis un pacto, el culpable pagará una indemnización que será entregada a sus herederos y pondrá en libertad a un esclavo creyente. Mas quien no encuentre uno, ayunará durante dos meses consecutivos: como penitencia impuesta por Al-lah-. Pues Al-lah es Omnisciente, Sabio.", "urdu": " اور کسی مومن کی یہ شان نہیں کہ وہ کسی مومن کو قتل کرے۔ سوائے (اس کے کہ) غلطی کے (ساتھ ایسا ہو جائے) اور جو (مومن) کسی مومن کو نادانستہ قتل کردے تو (اس پر) ایک مومن (غلام کی) گردن کا آزاد کرنا‘ اور خون بہا دینا (واجب) ہوگا۔ جو اس کے ورثا کو دیا جائے گا۔ سوائے اس (صورت) کے کہ وہ اسے بطور صدقہ (چھوڑ) دیں اور اگر وہ (مقتول) کسی تمہاری دشمن قوم سے ہو اور وہ (خود) مومن ہو۔ تو (اس فعل پر صرف) ایک مومن (غلام کی) گردن کا آزاد کرنا (کافی) ہوگا۔ اور اگر وہ (مقتول) کسی ایسی قوم میں سے ہو۔ جس کے درمیان اور تمہارے درمیان معاہدہ ہو۔ تو (قاتل پر) خون بہا (واجب) ہوگا۔ جو اس (مقتول) کے ورثا کو دیا جائے گا۔ اسی طرح ایک مومن (غلام کی) گردن کا آزاد کرنا بھی ضروری ہوگا۔ اور جو (اس کی طاقت) نہ پائے۔ تو (اس پر) دو مہینوں کے متواتر روزے رکھنا (واجب) ہوگا یہ (نرمی) اللہ کی طرف سے شفقت کے طور پر ہے اور اللہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ مَنۡ یَّقۡتُلۡ مُؤۡمِنًا مُّتَعَمِّدًا فَجَزَآؤُہٗ جَہَنَّمُ خٰلِدًا فِیۡہَا وَ غَضِبَ اللّٰہُ عَلَیۡہِ وَ لَعَنَہٗ وَ اَعَدَّ لَہٗ عَذَابًا عَظِیۡمًا ﴿۹۴﴾", "english": " And whoso kills a believer intentionally, his reward shall be Hell wherein he shall abide. And Allah will be wroth with him and will curse him and will prepare for him a great punishment.", "french": " Et quiconque tue un croyant à dessein recevra l’Enfer comme récompense, où il demeurera longtemps. Allāh sera courroucé contre lui, le maudira et préparera à son intention un très grand châtiment.", "german": " Und wer einen Gläubigen vorsätzlich tötet, dessen Lohn ist die Hölle, worin er bleiben soll. Allah wird ihm zürnen und ihn von Sich weisen und ihm schwere Strafe bereiten.", "spanish": " Y quien mate intencionadamente a un creyente, su recompensa será el Infierno, y en él morará. Y Al-lah le mostrará Su ira, lo maldecirá y le preparará un severo castigo.", "urdu": " اور جو (شخص) کسی مومن کو دانستہ قتل کر دے تو اس کی سزا جہنم ہوگی۔ وہ اس میں دیر تک رہتا چلا جائے گا اور اللہ اس سے ناراض ہوگا اور اسے (اپنی جناب سے) دور کر دے گا اور اس کے لئے (بہت) بڑا عذاب تیار کرے گا۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا ضَرَبۡتُمۡ فِیۡ سَبِیۡلِ اللّٰہِ فَتَبَیَّنُوۡا وَ لَا تَقُوۡلُوۡا لِمَنۡ اَلۡقٰۤی اِلَیۡکُمُ السَّلٰمَ لَسۡتَ مُؤۡمِنًا ۚ تَبۡتَغُوۡنَ عَرَضَ الۡحَیٰوۃِ الدُّنۡیَا ۫ فَعِنۡدَ اللّٰہِ مَغَانِمُ کَثِیۡرَۃٌ ؕ کَذٰلِکَ کُنۡتُمۡ مِّنۡ قَبۡلُ فَمَنَّ اللّٰہُ عَلَیۡکُمۡ فَتَبَیَّنُوۡا ؕ اِنَّ اللّٰہَ کَانَ بِمَا تَعۡمَلُوۡنَ خَبِیۡرًا ﴿۹۵﴾", "english": " O ye who believe! when you go forth in the cause of Allah, make proper investigation and say not to anyone who greets you with the greeting of peace, ‘Thou art not a believer.’ You seek the goods of this life, but with Allah are good things in plenty. Such were you before this, but Allah conferred His special favour on you; so do make proper investigation. Surely, Allah is well aware of what you do.", "french": " Ô croyants ! Quand vous vous mettez en campagne dans la cause d’Allāh, renseignez-vous bien, et ne dites pas à celui qui vous adressera le salut de paix, « Tu n’es pas un croyant. » Vous chercherez les biens de la vie d’ici-bas, alors qu’auprès d’Allāh il y a des biens en abondance. Autrefois vous étiez ainsi, mais Allāh vous a accordé Sa grâce. Aussi donc renseignez-vous bien. Assurément, Allāh est Très-Conscient de ce que vous faites.", "german": " O die ihr glaubt, wenn ihr auszieht auf Allahs Weg, so stellt erst gehörig Nachforschung an und sagt nicht zu jedem, der euch den Friedensgruß bietet: \"Du bist kein Gläubiger.\" Ihr trachtet nach den Gütern des irdischen Lebens doch bei Allah ist des Guten Fülle. Also waret ihr einst, dann aber hat Allah Seine Huld über euch ergossen; darum stellt erst gehörig Nachforschung an. Siehe, Allah ist eures Tuns wohl kundig.", "spanish": " ¡Oh vosotros, los que creéis! cuando avancéis por la causa de Al-lah, informaos cuidadosamente y no digáis a quien os saluda con el saludo de la paz: “Tú no eres creyente”. Buscáis las cosas buenas de este mundo, pero es con Al-lah donde hay abundancia e cosas buenas. Así erais antes, pero Al-lah os otorgó Su favor especial; informaos pues cuidadosamente. En verdad, Al-lah es perfectamente consciente de lo que hacéis.", "urdu": " اے ایماندارو! جب تم اللہ کی راہ میں سفر کرو تو چھان بین کر لیا کرو۔اورجو تمہیں سلام کہے اسے (یہ) نہ کہا کرو کہ تو مومن نہیں۔ تم ورلی زندگی کا سامان چاہتے ہو۔ سو اللہ کے پاس بہت سی غنیمتیں ہیں پہلے تم (بھی) ایسے ہی تھے۔ پھر اللہ نے تم پر احسان کیا۔ پس تم پر لازم ہے (کہ) تم چھان بین کر لیا کرو۔ جو کچھ تم کرتے ہو اس سے اللہ یقیناً آگاہ ہے۔"}, {"arabic": " لَا یَسۡتَوِی الۡقٰعِدُوۡنَ مِنَ الۡمُؤۡمِنِیۡنَ غَیۡرُ اُولِی الضَّرَرِ وَ الۡمُجٰہِدُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ؕ فَضَّلَ اللّٰہُ الۡمُجٰہِدِیۡنَ بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ عَلَی الۡقٰعِدِیۡنَ دَرَجَۃً ؕ وَ کُلًّا وَّعَدَ اللّٰہُ الۡحُسۡنٰی ؕ وَ فَضَّلَ اللّٰہُ الۡمُجٰہِدِیۡنَ عَلَی الۡقٰعِدِیۡنَ اَجۡرًا عَظِیۡمًا ﴿ۙ۹۶﴾", "english": " Those of the believers who sit still , excepting the disabled ones, and those who strive in the cause of Allah with their wealth and their persons, are not equal. Allah has exalted in rank those who strive with their wealth and their persons above those who sit still . And to each Allah has promised good. And Allah has exalted those who strive above those who sit still , by a great reward,", "french": " Ceux d’entre les croyants qui restent tranquillement assis, mis à part les handicapés, ne sont pas égaux à ceux qui luttent pour la cause d’Allāh, avec leurs biens et leurs personnes. Allāh a placé ceux qui luttent avec leurs personnes et avec leurs biens à un rang bien plus élevé que ceux qui restent tranquillement assis ; alors qu’à chacun, Allāh a promis le bien. Et Allāh a élevé ceux qui luttent au-dessus de ceux qui restent assis par une très grande récompense ;", "german": " Die unter den Gläubigen, die stillsitzen – ausgenommen die Gebrechlichen –, und die, welche für Allahs Sache ihr Gut und Blut einsetzen im Streit, sie sind nicht gleich. Allah hat die mit ihrem Gut und Blut Streitenden im Range erhöht über die Stillsitzenden. Einem jeden aber hat Allah Gutes verheißen; doch die Gottesstreiter hat Er vor den Stillsitzenden ausgezeichnet durch einen großen Lohn –", "spanish": " No son iguales los creyentes que se quedan sentados, exceptuados los incapacitados, que los que se sacrifican por la causa de Al-lah con sus bienes y personas. Al-lah ha exaltado en rango a uienes se sacrifican con sus bienes y personas respecto a los que se quedan sentados. Y aunque Al-lah ha prometido lo mejor a todos, ha exaltado a los que se sacrifican por encima de los que permanecen sentados, con una gran recompensa,", "urdu": " مومنوں میں سے ایسے بیٹھ رہنے والے جو ضرر رسیدہ نہیں ہیں اور اپنے مالوں اور اپنی جانوں کے ساتھ اللہ کی راہ میں جہاد کرنے والے برابر نہیں (ہوسکتے) اللہ نے اپنے مالوں اور اپنی جانوں کے ذریعہ جہاد کرنے والوں کو (پیچھے) بیٹھ رہنے والوں پر درجہ میں فضیلت دی ہے اور سب سے اللہ نے بھلائی کا وعدہ کیا ہے۔اور اللہ نے جہاد کرنے والوں کو (پیچھے) بیٹھ رہنے والوں پر (بہت) بڑے اجر کا وعدہ کرکے (ضرور) فضیلت دی ہے۔"}, {"arabic": " دَرَجٰتٍ مِّنۡہُ وَ مَغۡفِرَۃً وَّ رَحۡمَۃً ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿٪۹۷﴾", "english": " Namely, by degrees of excellence bestowed by Him, and by special forgiveness and mercy. And Allah is Most Forgiving, Merciful.", "french": " C’est-à-dire par des degrés d’excellence de Sa part, ainsi qu’un pardon et une miséricorde. Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Rangstufen von Ihm und Vergebung und Barmherzigkeit; denn Allah ist allvergebend, barmherzig.", "spanish": " Es decir, con distintos grados de excelencia concedidos por Él, y con especial perdón y misericordia ; pues Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " (اس فضیلت کے معنے) اس (خدا) کی طرف سے بہت سے درجات اور مغفرت کا ملنا ہے اسی طرح حصول رحمت ہے اور اللہ بہت ہی بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ تَوَفّٰہُمُ الۡمَلٰٓئِکَۃُ ظَالِمِیۡۤ اَنۡفُسِہِمۡ قَالُوۡا فِیۡمَ کُنۡتُمۡ ؕ قَالُوۡا کُنَّا مُسۡتَضۡعَفِیۡنَ فِی الۡاَرۡضِ ؕ قَالُوۡۤا اَلَمۡ تَکُنۡ اَرۡضُ اللّٰہِ وَاسِعَۃً فَتُہَاجِرُوۡا فِیۡہَا ؕ فَاُولٰٓئِکَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ سَآءَتۡ مَصِیۡرًا ﴿ۙ۹۸﴾", "english": " Verily, those whom the angels cause to die while they are wronging their own souls, they (the angels) will say to them : ‘What were you after?’ They will reply: ‘We were treated as weak in the land.’ They will say, ‘Was not Allah’s earth vast enough for you to emigrate therein?’ It is these whose abode shall be Hell, and an evil destination it is;", "french": " En vérité, ceux que les anges font mourir alors qu’ils nuisent à leur propre âme, ils - les anges - leur diront : « Dans quelle situation étiez-vous ? » Ils répondront : « Nous étions traités sur terre comme des faibles. » Les anges leur diront : « La terre d’Allāh n’était-elle pas assez vaste pour vous permettre d’émigrer ? » Voilà ceux dont la demeure sera l’Enfer. Et quelle mauvaise destination !", "german": " Zu jenen, die – Unrecht gegen sich selbst tuend – von Engeln dahingerafft werden, werden diese sprechen: \"Wonach strebtet ihr?\" Sie werden antworten: \"Wir wurden als Schwache im Lande behandelt.\" Da sprechen jene: \"War Allahs Erde nicht weit genug für euch, dass ihr darin hättet auswandern können?\" Sie sind es, deren Aufenthalt die Hölle sein wird, und übel ist die Bestimmung;", "spanish": " En verdad, a quienes los ángeles hacen morir mientras están perjudicando sus propias almas, ellos (los ángeles) les dirán: “¿Qué buscabais?”. Responderán: “Fuimos tratados como débiles en la tierra”. Dirán: “¿No era la tierra de Al-lah suficientemente amplia para que pudierais emigrar?”. Éstos son los que morarán en el Infierno; ¡qué pésimo destino!;", "urdu": " جن لوگوں کو ملائکہ نے اس حالت میں وفات دی کہ وہ اپنی جانوں پر ظلم کر رہے تھے وہ (ان سے) کہیں گے کہ تم کس (خیال) میں تھے؟ وہ (یعنی ہجرت سے گریز کرنے والے جواب میں) کہیں گے کہ ہم ملک میں کمزور سمجھے جاتے تھے (اس لئے ہجرت نہیں کی) وہ (فرشتے) جواب دیں گے کیا اللہ کی زمین وسیع نہ تھی؟ کہ تم اس میں ہجرت کرجاتے پس ان لوگوں کا ٹھکانا جہنم ہوگا اور وہ رہنے کے لحاظ سے بہت (ہی) بری جگہ ہے۔"}, {"arabic": " اِلَّا الۡمُسۡتَضۡعَفِیۡنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الۡوِلۡدَانِ لَا یَسۡتَطِیۡعُوۡنَ حِیۡلَۃً وَّ لَا یَہۡتَدُوۡنَ سَبِیۡلًا ﴿ۙ۹۹﴾", "english": " Except such weak ones among men, women and children, as are incapable of adopting any plan or of finding any way.", "french": " Excepté ceux qui sont rendus faibles de parmi les hommes, les femmes et les enfants qui sont incapables d’adopter un plan ou de trouver une voie de sortie .", "german": " ausgenommen nur die Schwachen unter den Männern, Frauen und Kindern, die außerstande sind, einen Plan zu fassen oder einen Weg zu finden.", "spanish": " Excepto los hombres, mujeres y niños verdaderamente débiles, que son incapaces de preparar un plan o hallar algún camino.", "urdu": " ہاں وہ لوگ جو مردوں‘ عورتوں اور بچوں میں سے فی الواقع کمزور تھے (اور) وہ کسی تدبیر کی طاقت نہ رکھتے تھے اور نہ کوئی راہ انہیں نظر آتی تھی۔"}, {"arabic": " فَاُولٰٓئِکَ عَسَی اللّٰہُ اَنۡ یَّعۡفُوَ عَنۡہُمۡ ؕ وَ کَانَ اللّٰہُ عَفُوًّا غَفُوۡرًا ﴿۱۰۰﴾", "english": " As to these, maybe Allah will efface their sins; for Allah is the Effacer of sins, and is Most Forgiving.", "french": " Et quant à ceux-là, il se peut qu’Allāh efface leurs péchés, car Allāh est Effaceur des péchés et est Très-Pardonnant.", "german": " Diese sind es, denen Allah bald vergeben wird; denn Allah ist allvergebend, allverzeihend.", "spanish": " Tal vez Al-lah suprima los pecados de éstos; porque Al-lah es Remisorio y es el Sumo Indulgente.", "urdu": " ان لوگوں کے متعلق خدا کی بخشش قریب ہے‘ کیونکہ اللہ ہے ہی بہت معاف کرنے والا اور بخشنے والا۔"}, {"arabic": " وَ مَنۡ یُّہَاجِرۡ فِیۡ سَبِیۡلِ اللّٰہِ یَجِدۡ فِی الۡاَرۡضِ مُرٰغَمًا کَثِیۡرًا وَّ سَعَۃً ؕ وَ مَنۡ یَّخۡرُجۡ مِنۡۢ بَیۡتِہٖ مُہَاجِرًا اِلَی اللّٰہِ وَ رَسُوۡلِہٖ ثُمَّ یُدۡرِکۡہُ الۡمَوۡتُ فَقَدۡ وَقَعَ اَجۡرُہٗ عَلَی اللّٰہِ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۱۰۱﴾٪", "english": " And whoso emigrates from his country in the cause of Allah will find in the earth an abundant place of refuge and plentifulness. And whoso goes forth from his home, emigrating in the cause of Allah and His Messenger, and death overtakes him, his reward lies on Allah, and Allah is Most Forgiving, Merciful.", "french": " Et quiconque quittera son pays pour la cause d’Allāh, trouvera sur la terre de nombreuses occasions et une abondance de biens qui susciteraient la frustration de l’ennemi . Et quiconque quittera sa maison, émigrant pour la cause d’Allāh et de Son Messager, et qui sera surpris par la mort, sa récompense incombe à Allāh, et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Wer für die Sache Allahs auswandert, der wird auf Erden genug Stätten der Zuflucht und der Fülle finden. Und wer sein Haus verlässt und auswandert auf Allahs und Seines Gesandten Weg und dabei vom Tode ereilt wird, dessen Lohn obliegt sodann Allah, und Allah ist allverzeihend, barmherzig.", "spanish": " Mas quien emigre de su país por la causa de Al-lah, encontrará en la tierra un amplio lugar de refugio y abundancia. Y quien abandone su hogar, emigrando por la causa de Al-lah y de Su Mensajero, y le sorprenda la muerte, tendrá su recompensa en Al-lah, pues Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور جو (شخص بھی) اللہ کی راہ میں ہجرت کرے گا وہ ملک میں حفاظت کی بہت سی جگہیں اور فراخی (کے سامان) پائے گا۔ اور جو (شخص) اللہ اور اس کے رسول کی طرف اپنے گھر سے ہجرت کرکے نکلے پھر اسے موت آجائے تو (سمجھو کہ) اس کا اجر اللہ کے ذمہ ہو چکا اور اللہ بہت (ہی) بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ اِذَا ضَرَبۡتُمۡ فِی الۡاَرۡضِ فَلَیۡسَ عَلَیۡکُمۡ جُنَاحٌ اَنۡ تَقۡصُرُوۡا مِنَ الصَّلٰوۃِ ٭ۖ اِنۡ خِفۡتُمۡ اَنۡ یَّفۡتِنَکُمُ الَّذِیۡنَ کَفَرُوۡا ؕ اِنَّ الۡکٰفِرِیۡنَ کَانُوۡا لَکُمۡ عَدُوًّا مُّبِیۡنًا ﴿۱۰۲﴾", "english": " And when you journey in the land, it shall be no sin on you to shorten the Prayer, if you fear that those who disbelieve may give you trouble. Verily, the disbelievers are an open enemy to you.", "french": " Et quand vous êtes en voyage dans le pays, ce ne sera pas un péché de votre part de raccourcir la Prière, si vous craignez que les mécréants ne vous mettent en difficulté. En vérité les mécréants sont vos ennemis déclarés.", "german": " Und wenn ihr durch das Land zieht, dann soll es keine Sünde für euch sein, wenn ihr das Gebet verkürzt, so ihr fürchtet, die Ungläubigen würden euch bedrängen. Wahrlich, die Ungläubigen sind euch ein offenkundiger Feind.", "spanish": " Y cuando viajéis por la tierra, no pecaréis si abreviáis la Oración por temor a que os hostiguen los incrédulos. En verdad, los incrédulos son vuestros enemigos declarados.", "urdu": " اور اگر تم ڈرتے ہو کہ کافر تمہیں دکھ میں ڈالیں گے‘ تو جب تم ملک میں سفر کرو تو تمہیں کوئی گناہ نہیں کہ نماز کو چھوٹا کردو۔ کافر یقیناً تمہارے (کھلے) کھلے دشمن ہیں۔"}, {"arabic": " وَ اِذَا کُنۡتَ فِیۡہِمۡ فَاَقَمۡتَ لَہُمُ الصَّلٰوۃَ فَلۡتَقُمۡ طَآئِفَۃٌ مِّنۡہُمۡ مَّعَکَ وَ لۡیَاۡخُذُوۡۤا اَسۡلِحَتَہُمۡ ۟ فَاِذَا سَجَدُوۡا فَلۡیَکُوۡنُوۡا مِنۡ وَّرَآئِکُمۡ ۪ وَ لۡتَاۡتِ طَآئِفَۃٌ اُخۡرٰی لَمۡ یُصَلُّوۡا فَلۡیُصَلُّوۡا مَعَکَ وَ لۡیَاۡخُذُوۡا حِذۡرَہُمۡ وَ اَسۡلِحَتَہُمۡ ۚ وَدَّ الَّذِیۡنَ کَفَرُوۡا لَوۡ تَغۡفُلُوۡنَ عَنۡ اَسۡلِحَتِکُمۡ وَ اَمۡتِعَتِکُمۡ فَیَمِیۡلُوۡنَ عَلَیۡکُمۡ مَّیۡلَۃً وَّاحِدَۃً ؕ وَ لَا جُنَاحَ عَلَیۡکُمۡ اِنۡ کَانَ بِکُمۡ اَذًی مِّنۡ مَّطَرٍ اَوۡ کُنۡتُمۡ مَّرۡضٰۤی اَنۡ تَضَعُوۡۤا اَسۡلِحَتَکُمۡ ۚ وَ خُذُوۡا حِذۡرَکُمۡ ؕ اِنَّ اللّٰہَ اَعَدَّ لِلۡکٰفِرِیۡنَ عَذَابًا مُّہِیۡنًا ﴿۱۰۳﴾", "english": " And when thou art among them, and leadest the Prayer for them, let a party of them stand with thee and let them take their arms. And when they have performed their prostrations, let them go to your rear, and let another party, who have not yet prayed, come forward and pray with thee; and let them take their means of defence and their arms. The disbelievers wish that you be neglectful of your arms and your baggage that they may fall upon you at once. And it shall be no sin on you, if you are in trouble on account of rain or if you are sick, that you lay aside your arms. But you should always take your means of defence. Surely, Allah has prepared an humiliating punishment for the disbelievers.", "french": " Et quand tu te trouves parmi eux, et que tu diriges pour eux la Prière, qu’un groupe d’entre eux se mette debout avec toi et qu’ils prennent les armes. Et lorsqu’ils auront fini de se prosterner, qu’ils se retirent à l’arrière, et qu’un autre groupe, qui n’a pas encore prié, s’avance pour prier avec toi ; et qu’ils prennent leurs moyens de défense et leurs armes. Les mécréants voudraient que vous négligiez vos armes et vos bagages afin de pouvoir vous assaillir soudainement. Et si vous êtes gênés par la pluie ou souffrants, ce ne sera pas un péché de votre part de déposer vos armes. En tout cas prenez vos précautions pour votre défense. En vérité, Allāh a préparé pour les mécréants un châtiment humiliant.", "german": " Und wenn du unter ihnen bist und für sie das Gebet anführst, soll ein Teil von ihnen bei dir stehen, doch sollen sie ihre Waffen aufnehmen. Und wenn sie ihre Niederwerfungen vollführt haben, so sollen sie hinter euch treten, und eine andere Abteilung, die noch nicht gebetet hat, soll vortreten und mit dir beten; doch sollen sie auf ihrer Hut sein und ihre Waffen bei sich haben. Die Ungläubigen sähen es gerne, dass ihr eure Waffen und euer Gepäck außer acht ließet, so dass sie euch plötzlich überfallen könnten. Und es soll keine Sünde für euch sein, wenn ihr, falls ihr durch Regen leidet oder krank seid, eure Waffen ablegt. Seid jedoch (immer) auf eurer Hut. Wahrlich, Allah hat für die Ungläubigen schmähliche Strafe bereitet.", "spanish": " Y cuando estés entre ellos y les dirijas la Oración, que una parte de ellos permanezca de pie contigo y que tomen sus armas. Y cuando hayan realizado las postraciones, que se retiren detrás de ti y que otro grupo, que aún no haya orado, se adelante y ore contigo; y haz que tomen sus medios de defensa y sus armas. Los incrédulos desean que descuidéis vuestras armas y bagajes para poder caer sobre vosotros por sorpresa. Y no pecareis si dejáis vuestras armas porque os molesta la lluvia o estáis enfermos. Pero portad siempre vuestros medios de defensa. En verdad, Al-lah ha preparado un castigo ignominioso para los incrédulos.", "urdu": " اور جب تو (خود) ان میں ہو اور تو انہیں نماز پڑھائے تو ان میں سے ایک حصہ جماعت (کو چاہیئے کہ) تیرے ساتھ کھڑے ہوں اور اپنے ہتھیار لے لیں۔ پھر جب وہ سجدہ کر لیں تو وہ تمہارے پیچھے (حفاظت کے لئے) کھڑے ہو جائیں‘ پھر ایک اور حصہ جماعت جس نے نماز نہیں پڑھی (آگے) آجائے اور تیرے ساتھ نماز پڑھے اور وہ بھی اپنے بچاٶ کا سامان اور اپنے ہتھیار لئے رہیں۔ جو لوگ کافر ہیں وہ چاہتے ہیں کہ کاش تم اپنے ہتھیاروں اور اپنے سامانوں سے غافل ہو جاٶ تو وہ یکدم ہی تم پر آپڑیں اور اور اگر بارش کی وجہ سے تمہیں تکلیف ہو یا تم مریض ہو تو اپنے ہتھیار اتار دینے پر تمہیں کوئی گناہ نہ ہوگا۔ لیکن پھر بھی تمام احتیاطیں کرلو۔ اللہ نے کافروں کے لئے رسوا کر دینے والا عذاب یقیناً تیار کر چھوڑا ہے۔"}, {"arabic": " فَاِذَا قَضَیۡتُمُ الصَّلٰوۃَ فَاذۡکُرُوا اللّٰہَ قِیٰمًا وَّ قُعُوۡدًا وَّ عَلٰی جُنُوۡبِکُمۡ ۚ فَاِذَا اطۡمَاۡنَنۡتُمۡ فَاَقِیۡمُوا الصَّلٰوۃَ ۚ اِنَّ الصَّلٰوۃَ کَانَتۡ عَلَی الۡمُؤۡمِنِیۡنَ کِتٰبًا مَّوۡقُوۡتًا ﴿۱۰۴﴾", "english": " And when you have finished the Prayer, remember Allah while standing, and sitting, and lying on your sides. And when you are secure from danger , then observe Prayer in the prescribed form ; verily Prayer is enjoined on the believers to be performed at fixed hours.", "french": " Et quand vous aurez terminé la Prière, souvenez-vous d’Allāh, que vous soyez debout, assis ou couchés sur vos côtés. Et lorsque vous êtes en sécurité , alors observez la prière selon la forme prescrite ; la Prière est en vérité enjointe aux croyants pour être faite à des heures prescrites.", "german": " Und wenn ihr das Gebet beendet habt, dann gedenket Allahs im Stehen, Sitzen und wenn ihr auf eurer Seite liegt. Und wenn ihr in Sicherheit seid, dann verrichtet das Gebet (in der vorgeschriebenen Form); denn das Gebet zu bestimmten Zeiten ist den Gläubigen eine Pflicht.", "spanish": " Y cuando hayáis finalizado la Oración, recordad a Al-lah ya estéis de pie, sentados o tumbados sobre vuestros costados. Y cuando stéis fuera de peligro, cumplid la Oración de la forma prescrita; ciertamente la Oración se ordena a los creyentes para que sea practicada en los momentos prescritos.", "urdu": " اور جب تم نماز ادا کر چکو تو اللہ کو کھڑے اور بیٹھے اور اپنے پہلوٶں پر یاد کرتے رہو۔ پھر جب تم مطمئن ہو جاٶ تو نماز کو سنوار کر پڑھو۔ نماز مومنوں پر یقیناً ایک مو ٔقت فرض ہے۔"}, {"arabic": " وَ لَا تَہِنُوۡا فِی ابۡتِغَآءِ الۡقَوۡمِ ؕ اِنۡ تَکُوۡنُوۡا تَاۡلَمُوۡنَ فَاِنَّہُمۡ یَاۡلَمُوۡنَ کَمَا تَاۡلَمُوۡنَ ۚ وَ تَرۡجُوۡنَ مِنَ اللّٰہِ مَا لَا یَرۡجُوۡنَ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ﴿۱۰۵﴾٪", "english": " And slacken not in seeking these people. If you suffer, they too suffer even as you suffer. But you hope from Allah what they hope not. And Allah is All-Knowing, Wise.", "french": " Et ne faiblissez pas dans la recherche de ces gens. Si vous souffrez, eux aussi souffrent comme vous souffrez. Mais vous espérez d’Allāh ce qu’ils n’espèrent pas. Et Allāh est Omniscient, Sage.", "german": " Und höret nicht auf, solches Volk zu suchen. Leidet ihr, so leiden sie gerade so, wie ihr leidet. Doch ihr erhoffet von Allah, was sie nicht hoffen. Und Allah ist allwissend, allweise.", "spanish": " Y no desfallezcáis cuando veáis a esas gentes. Si sufrís, ellos sufren tanto como vosotros. Pero vosotros esperáis de Al-lah lo que ellos no esperan. Pues Al-lah es Omnisciente, Sabio.", "urdu": " اور تم اس قوم (یعنی دشمنوں) کی تلاش میں سستی نہ کرو اگر تمہیں تکلیف ہوتی ہے تو جس طرح تمہیں تکلیف ہوتی ہے انہیں بھی تکلیف ہوتی ہے۔ اور تم تو اللہ سے اس (فضل و کرم) کی امید رکھتے ہو جس کی وہ امید نہیں رکھتے‘ اور اللہ بہت (ہی) جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " اِنَّاۤ اَنۡزَلۡنَاۤ اِلَیۡکَ الۡکِتٰبَ بِالۡحَقِّ لِتَحۡکُمَ بَیۡنَ النَّاسِ بِمَاۤ اَرٰٮکَ اللّٰہُ ؕ وَ لَا تَکُنۡ لِّلۡخَآئِنِیۡنَ خَصِیۡمًا ﴿۱۰۶﴾ۙ", "english": " We have surely sent down to thee the Book comprising the truth, that thou mayest judge between men by that which Allah has taught thee. And be not thou a disputer for the faithless;", "french": " Nous avons assurément fait descendre sur toi le Livre qui comprend la vérité, afin que tu puisses juger entre les hommes par ce qu’Allāh t’a fait comprendre. Et ne plaide pas la cause de ceux qui trahissent la confiance.", "german": " Wir haben das Buch mit der Wahrheit zu dir niedergesandt, auf dass du zwischen den Menschen richten mögest, wie Allah es dir gezeigt hat. Sei also nicht Verfechter der Treulosen.", "spanish": " Te hemos revelado ciertamente el Libro que contiene la verdad, para que juzgues entre los hombres por lo que Al-lah te ha enseñado. Y no defiendas la causa de los que traicionan la confianza.", "urdu": " ہم نے تیری طرف (یہ) صداقت پر مشتمل کتاب یقیناً اس لئے اتاری ہے کہ تو لوگوں کے درمیان اس (حق) کے ذریعہ سے جو اللہ نے تجھے دکھایا ہے فیصلہ کرے اور تو خیانت کرنے والوں کی طرف سے جھگڑنے والا نہ بن۔"}, {"arabic": " وَّ اسۡتَغۡفِرِ اللّٰہَ ؕ اِنَّ اللّٰہَ کَانَ غَفُوۡرًا رَّحِیۡمًا ﴿۱۰۷﴾ۚ", "english": " And ask forgiveness of Allah. Surely, Allah is Most Forgiving, Merciful.", "french": " Et demande pardon à Allāh. Assurément, Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und bitte Allah um Verzeihung. Wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Y pide perdón a Al-lah. En verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور اللہ سے (اس کی) بخشش طلب کر۔ اللہ یقیناً بہت (ہی) بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ لَا تُجَادِلۡ عَنِ الَّذِیۡنَ یَخۡتَانُوۡنَ اَنۡفُسَہُمۡ ؕ اِنَّ اللّٰہَ لَا یُحِبُّ مَنۡ کَانَ خَوَّانًا اَثِیۡمًا ﴿۱۰۸﴾ۚۙ", "english": " And plead not on behalf of those who are dishonest to themselves. Surely, Allah loves not one who is perfidious and a great sinner.", "french": " Et ne plaide pas en faveur de ceux qui sont malhonnêtes envers eux-mêmes. Assurément, Allāh n’aime pas celui qui est perfide et grand pécheur.", "german": " Und verteidige nicht diejenigen, die sich selbst betrügen. Wahrlich, Allah liebt keinen, der ein Betrüger, ein großer Sünder ist.", "spanish": " No abogues por quienes son deshonestos con ellos mismos. En verdad, Al-lah no ama a quien es pérfido y un gran pecador.", "urdu": " اور تو ان لوگوں کی طرف سے جو اپنے نفسوں کی خیانت کرتے ہیں مت جھگڑ۔ جو (لوگ) خیانت میں بڑھے ہوئے اور بہت گنہگار ہوں اللہ انہیں پسند نہیں کرتا۔"}, {"arabic": " یَّسۡتَخۡفُوۡنَ مِنَ النَّاسِ وَ لَا یَسۡتَخۡفُوۡنَ مِنَ اللّٰہِ وَ ہُوَ مَعَہُمۡ اِذۡ یُبَیِّتُوۡنَ مَا لَا یَرۡضٰی مِنَ الۡقَوۡلِ ؕ وَ کَانَ اللّٰہُ بِمَا یَعۡمَلُوۡنَ مُحِیۡطًا ﴿۱۰۹﴾", "english": " They seek to hide from men, but they cannot hide from Allah; and He is with them when they spend the night plotting about matters of which He does not approve. And Allah encompasses what they do.", "french": " Ils se cachent des hommes, alors qu’ils ne peuvent se cacher d’Allāh ; et Il est auprès d’eux quand ils passent la nuit complotant des affaires dont Il n’approuve pas. Et Allāh cerne tout ce qu’ils font.", "german": " Sie möchten sich vor den Menschen verbergen, doch vor Allah können sie sich nicht verborgen halten; und Er ist bei ihnen, wenn sie nächtens Ränke schmieden für Dinge, die Er nicht billigt. Und Allah wird ihr Tun vereiteln.", "spanish": " Procuran ocultarse de los hombres, pero no se cuidan de ocultarse de Al-lah; y Él está con ellos cuando pasan la noche tramando sobre asuntos que Él no aprueba. Pues Al-lah abarca todo cuanto hacen.", "urdu": " وہ لوگوں سے پردہ رکھتے ہیں اور اللہ سے پردہ نہیں رکھتے۔ حالانکہ جب وہ رات کو ایسی باتوں کے مشورے کر رہے ہوتے ہیں جنہیں اللہ پسند نہیں کرتا (تو) وہ ان کے پاس ہوتا ہے اور جو کچھ وہ کر رہے ہیں اللہ اس کا قلع قمع کرنے والا ہے۔"}, {"arabic": " ہٰۤاَنۡتُمۡ ہٰۤؤُلَآءِ جٰدَلۡتُمۡ عَنۡہُمۡ فِی الۡحَیٰوۃِ الدُّنۡیَا ۟ فَمَنۡ یُّجَادِلُ اللّٰہَ عَنۡہُمۡ یَوۡمَ الۡقِیٰمَۃِ اَمۡ مَّنۡ یَّکُوۡنُ عَلَیۡہِمۡ وَکِیۡلًا ﴿۱۱۰﴾", "english": " Behold! you are they who pleaded for them in the present life. But who will plead with Allah for them on the Day of Resurrection, or who will be a guardian over them?", "french": " Voyez ! C’est vous qui avez plaidé pour eux dans la vie ici-bas. Mais qui plaidera pour eux auprès d’Allāh au Jour de la Résurrection ou qui sera leur protecteur ?", "german": " Seht, ihr habt sie verteidigt in diesem Leben. Wer aber wird sie vor Allah verteidigen am Tage der Auferstehung, oder wer wird ihnen ein Beschützer sein?", "spanish": " ¡Mirad! sois vosotros los que abogasteis por ellos en esta vida. Pero ¿quién abogará por ellos ante Al-lah en el Día de la Resurrección, o quién será su defensor?", "urdu": " سنو! تم وہ لوگ ہو جو ان کی طرف سے ورلی زندگی میں جھگڑتے رہے ہو‘ مگر قیامت کے دن ان کی طرف سے اللہ کے ساتھ کون جھگڑے گا یا کون ان کا محافظ ہوگا۔"}, {"arabic": " وَ مَنۡ یَّعۡمَلۡ سُوۡٓءًا اَوۡ یَظۡلِمۡ نَفۡسَہٗ ثُمَّ یَسۡتَغۡفِرِ اللّٰہَ یَجِدِ اللّٰہَ غَفُوۡرًا رَّحِیۡمًا ﴿۱۱۱﴾", "english": " And whoso does evil or wrongs his soul, and then asks forgiveness of Allah, will surely find Allah Most Forgiving, Merciful.", "french": " Et quiconque fait le mal ou nuit à son âme, et qui demande ensuite pardon à Allāh, trouvera Allāh Très-Pardonnant, Miséricordieux.", "german": " Wer Böses tut oder sich wider seine Seele versündigt und dann bei Allah Vergebung sucht, der wird Allah allvergebend, barmherzig finden.", "spanish": " Mas quien hace el mal o perjudica a su propia alma, y pide después perdón a Al-lah, comprobará ciertamente que Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور جو شخص (بھی) کوئی بدی کرے گا یا اپنے نفس پر ظلم کرے گا اس کے بعد اللہ سے (اپنے گناہوں کی) معافی چاہے گا (تو) وہ اللہ کو بہت بخشنے والا (اور) باربار رحم کرنے والا پائے گا۔"}, {"arabic": " وَ مَنۡ یَّکۡسِبۡ اِثۡمًا فَاِنَّمَا یَکۡسِبُہٗ عَلٰی نَفۡسِہٖ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ﴿۱۱۲﴾", "english": " And whoso commits a sin commits it only against his own soul. And Allah is All-Knowing, Wise.", "french": " Et quiconque commet un péché, le commet seulement contre sa propre âme. Et Allāh est Omniscient, Sage.", "german": " Und wer eine Sünde begeht, der begeht sie nur gegen seine eigene Seele. Und Allah ist allwissend, allweise.", "spanish": " Y quien comete un pecado sólo lo hace en perjuicio de su propia alma. Pues Al-lah es Omnisciente, Sabio.", "urdu": " اور جو شخص کوئی بدی کرے۔ اس کا فعل اسی پر (الٹ کر) پڑے گا۔ اور اللہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ مَنۡ یَّکۡسِبۡ خَطِیۡٓٮـَٔۃً اَوۡ اِثۡمًا ثُمَّ یَرۡمِ بِہٖ بَرِیۡٓــًٔا فَقَدِ احۡتَمَلَ بُہۡتَانًا وَّ اِثۡمًا مُّبِیۡنًا ﴿۱۱۳﴾٪", "english": " And whoso commits a fault or a sin, then imputes it to an innocent person, certainly bears the burden of a calumny and a manifest sin.", "french": " Et quiconque commet une faute ou un péché, et l’impute ensuite à un innocent, se charge d’une calomnie et d’un péché manifeste.", "german": " Und wer einen Fehler oder eine Sünde begeht und sie dann einem Unschuldigen zur Last legt, der trägt eine Verleumdung und offenbare Sünde.", "spanish": " Y quien comete una falta o un pecado, y se lo imputa a un inocente, ciertamente soporta la carga de una calumnia y de un pecado flagrante.", "urdu": " اور جو شخص کوئی قصور یا گناہ کرے پھر کسی بے قصور پر اس کا الزام لگا دے تو (سمجھو کہ) اس نے ایک جھوٹ اور کھلے کھلے گناہ کا بوجھ اٹھالیا۔"}, {"arabic": " وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکَ وَ رَحۡمَتُہٗ لَہَمَّتۡ طَّآئِفَۃٌ مِّنۡہُمۡ اَنۡ یُّضِلُّوۡکَ ؕ وَ مَا یُضِلُّوۡنَ اِلَّاۤ اَنۡفُسَہُمۡ وَ مَا یَضُرُّوۡنَکَ مِنۡ شَیۡءٍ ؕ وَ اَنۡزَلَ اللّٰہُ عَلَیۡکَ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ عَلَّمَکَ مَا لَمۡ تَکُنۡ تَعۡلَمُ ؕ وَ کَانَ فَضۡلُ اللّٰہِ عَلَیۡکَ عَظِیۡمًا ﴿۱۱۴﴾", "english": " And but for the grace of Allah upon thee and His mercy, a party of them had resolved to bring about thy ruin. And they ruin none but themselves and they cannot harm thee at all. Allah has sent down to thee the Book and Wisdom and has taught thee what thou knewest not, and great is Allah’s grace on thee.", "french": " Et sans la grâce d’Allāh sur toi et Sa miséricorde, certains d’entre eux avaient décidé de t’égarer, mais Il déjoua leurs desseins . En fait ils n’égarent qu’eux-mêmes et ils ne peuvent te faire aucun mal. Et Allāh a fait descendre sur toi le Livre et la Sagesse et t’a enseigné ce que tu ne savais pas, et la grâce d’Allāh sur toi est immense.", "german": " Und wäre nicht Allahs Gnade gegen dich und Seine Barmherzigkeit, ein Teil von ihnen hätte beschlossen, dich ins Verderben zu stürzen. Doch nur sich selbst stürzen sie ins Verderben, und dir können sie keinerlei Schaden tun. Allah hat das Buch und die Weisheit zu dir niedergesandt und dich gelehrt, was du nicht wusstest, und groß ist Allahs Gnade über dir.", "spanish": " Y si no fuera por la gracia de Al-lah contigo y por Su isericordia, un grupo de ellos había decidido extraviarte, pero El frustró sus designios . De hecho, no extravían a nadie salvo a si mismos y no pueden perjudicarte de modo alguno. Al-lah te ha revelado el Libro y la Sabiduría y te ha enseñado lo que desconocías, pues grande es la gracia de Dios para contigo.", "urdu": " اور اگر تجھ پر اللہ کا فضل اور اس کی رحمت نہ ہوتی تو (وہ یعنی دشمن اپنے بدارادہ میں کامیاب ہو جاتے چنانچہ) ان میں سے ایک گروہ (اس بات کا) پکا ارادہ کر چکا تھا کہ تجھے ہلاک کر دے اور وہ اپنے سوا کسی کو ہلاک نہیں کرتے اور تجھے کچھ بھی نقصان نہیں پہنچا سکتے اور اللہ نے تجھ پر کتاب اور حکمت اتاری ہے اور جو کچھ تو نہیں جانتا تھا تجھے سکھایا ہے اور تجھ پر اللہ کا (بہت) بڑا فضل ہے۔"}, {"arabic": " لَا خَیۡرَ فِیۡ کَثِیۡرٍ مِّنۡ نَّجۡوٰٮہُمۡ اِلَّا مَنۡ اَمَرَ بِصَدَقَۃٍ اَوۡ مَعۡرُوۡفٍ اَوۡ اِصۡلَاحٍۭ بَیۡنَ النَّاسِ ؕ وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ ابۡتِغَآءَ مَرۡضَاتِ اللّٰہِ فَسَوۡفَ نُؤۡتِیۡـہِ اَجۡرًا عَظِیۡمًا ﴿۱۱۵﴾", "english": " There is no good in many of their conferences except the conferences of such as enjoin charity, or goodness, or the making of peace among men. And whoso does that, seeking the pleasure of Allah, We shall soon bestow on him a great reward.", "french": " Rien de bien ne sort de la plupart de leurs consultations secrètes excepté lorsqu’ils décident de dépenser sur les pauvres, ou d’œuvrer pour le bien-être du peuple ou d’effectuer la réconciliation et la réforme parmi les gens. Et quant à celui qui fait cela en cherchant à plaire à Allāh, Nous lui accorderons bientôt une très grande récompense.", "german": " Nichts Gutes ist in den meisten ihrer geheimen Besprechungen, es sei denn (Besprechungen) von solchen, die zur Mildtätigkeit oder zur Güte oder zum Friedenstiften unter den Menschen ermahnen. Und wer das tut im Trachten nach Allahs Wohlgefallen, dem werden Wir bald einen großen Lohn gewähren.", "spanish": " No hay nada bueno que salga de sus reuniones secretas salvo cuando deciden gastar por la causa del pobre, en el bienestar público o en promover la reconciliación o reforma de las gentes. Y a quien así actúe, buscando el agrado de Al-lah, le concederemos pronto una magnífica recompensa.", "urdu": " ان لوگوں (کے مشوروں) کو مستثنیٰ کر کے جو صدقہ یا نیک بات یا لوگوں کے درمیان اصلاح کرنے کا حکم دیتے ہیں ان کے بہت سے مشوروں میں کوئی بھی بھلائی نہیں (ہوتی) اور جو شخص اللہ کی رضا جوئی کے لئے ایسا کرے (یعنی نیک مشورے کرے) ہم اسے (جلد ہی بہت) بڑا اجر دیں گے۔"}, {"arabic": " وَ مَنۡ یُّشَاقِقِ الرَّسُوۡلَ مِنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُ الۡہُدٰی وَ یَتَّبِعۡ غَیۡرَ سَبِیۡلِ الۡمُؤۡمِنِیۡنَ نُوَلِّہٖ مَا تَوَلّٰی وَ نُصۡلِہٖ جَہَنَّمَ ؕ وَ سَآءَتۡ مَصِیۡرًا ﴿۱۱۶﴾٪", "english": " And as to him who opposes the Messenger after guidance has become clear to him, and follows a way other than that of the believers, We shall let him pursue the way he is pursuing and shall cast him into Hell; and an evil destination it is.", "french": " Et quant à celui qui s’opposera au Messager après que la bonne direction lui est devenue claire, et qui suivra une voie autre que celle des croyants, Nous le laisserons poursuivre la voie qu’il poursuit et Nous le jetterons dans l’Enfer – et quelle mauvaise destination !", "german": " Jener aber, der sich dem Gesandten widersetzt, nachdem ihm der rechte Weg klar geworden, und einen anderen Weg befolgt als den der Gläubigen, den werden Wir verfolgen lassen, was er verfolgt, und werden ihn in die Hölle stürzen; und schlimm ist die Bestimmung.", "spanish": " En cuanto a quien se opone al Mensajero después de que se le ha mostrado claramente la guía y sigue un camino distinto al de los creyentes, lo dejaremos continuar por el camino que ha elegido y lo arrojaremos al Infierno; ¡qué pésimo destino!", "urdu": " اور جو شخص (بھی) ہدایت کے پوری طرح کھل جانے کے بعد (اس) رسول سے اختلاف ہی کرتا چلا جائے گا اور مومنوں کے طریق کے سوا (کسی اور طریق) پر چلے گا ہم اسے اسی چیز کے پیچھے لگا دیں گے جس کے پیچھے وہ پڑا ہوا ہے اور اسے جہنم میں ڈالیں گے اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ لَا یَغۡفِرُ اَنۡ یُّشۡرَکَ بِہٖ وَ یَغۡفِرُ مَا دُوۡنَ ذٰلِکَ لِمَنۡ یَّشَآءُ ؕ وَ مَنۡ یُّشۡرِکۡ بِاللّٰہِ فَقَدۡ ضَلَّ ضَلٰلًۢا بَعِیۡدًا ﴿۱۱۷﴾", "english": " Allah will not forgive that anything be associated with Him as partner, but He will forgive what is short of that to whomsoever He pleases. And whoso associates anything as partner with Allah has indeed strayed far away.", "french": " Allāh ne pardonnera pas qu’on Lui donne des associés, mais à part cela, Il pardonnera à qui Il veut. Et quiconque donne des associés à Allāh s’est en vérité égaré bien loin.", "german": " Allah wird es nicht vergeben, dass Ihm Götter zur Seite gestellt werden; doch vergibt Er das, was geringer ist als dies, wem Er will. Und wer Allah Götter zur Seite stellt, der ist fürwahr weit irregegangen.", "spanish": " Al-lah no perdonará que se Le asocie ningún otro copartícipe, pero perdonará cualquier falta inferior a ésta a quien desee. Pues quien ponga otra cosa al nivel de Al-lah, en verdad se ha extraviado muy lejos.", "urdu": " اللہ اس (گناہ) کو ہرگز نہیں بخشے گا کہ اس کا (کسی کو) شریک بنایا جائے اور جو (گناہ) اس سے ادنیٰ ہوگا (اسے) جس کے حق میں چاہے گا معاف کر دے گا اور جو شخص (کسی کو) اللہ کا شریک بنائے تو (سمجھو کہ) وہ (سیدھے راستہ سے) بہت دور جا پڑا۔"}, {"arabic": " اِنۡ یَّدۡعُوۡنَ مِنۡ دُوۡنِہٖۤ اِلَّاۤ اِنٰثًا ۚ وَ اِنۡ یَّدۡعُوۡنَ اِلَّا شَیۡطٰنًا مَّرِیۡدًا ﴿۱۱۸﴾ۙ", "english": " They invoke beside Him none but lifeless objects; and they invoke none but Satan, the rebellious,", "french": " Ils n’invoquent en dehors d’Allāh rien que des divinités femelles alors qu’ en vérité ils n’invoquent qu’un Satan rebelle,", "german": " Sie rufen neben Ihm nur Lebloses an, und sie rufen nur Satan an, den Empörer,", "spanish": " No invocan, aparte de Él, mas que a falsas diosas; en realidad no invocan más que a Satanás, el rebelde,", "urdu": " وہ اللہ کو چھوڑ کر بے جان چیزوں کے سوا (کسی کو) نہیں پکارتے بلکہ وہ سرکش شیطان کے سوا (اور کسی کو) نہیں پکارتے۔"}, {"arabic": " لَّعَنَہُ اللّٰہُ ۘ وَ قَالَ لَاَتَّخِذَنَّ مِنۡ عِبَادِکَ نَصِیۡبًا مَّفۡرُوۡضًا ﴿۱۱۹﴾ۙ", "english": " Whom Allah has cursed. And he said, ‘I will assuredly take a fixed portion from Thy servants;", "french": " Celui qu'Allāh a maudit. Et il a dit : « Je prendrai assurément de Tes serviteurs une part déterminée.", "german": " den Allah von Sich gewiesen hat und der gesagt hatte: \"Ich will wahrlich von Deinen Dienern einen bestimmten Teil nehmen;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=4:119&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=4:119&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic120\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic120\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/4:120' style='text-decoration:underline'>4:120</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(120)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control120\"></i></button> <audio id=\"player120\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَّ لَاُضِلَّنَّہُمۡ وَ لَاُمَنِّیَنَّہُمۡ وَ لَاٰمُرَنَّہُمۡ فَلَیُبَتِّکُنَّ اٰذَانَ الۡاَنۡعَامِ وَ لَاٰمُرَنَّہُمۡ فَلَیُغَیِّرُنَّ خَلۡقَ اللّٰہِ ؕ وَ مَنۡ یَّتَّخِذِ الشَّیۡطٰنَ وَلِیًّا مِّنۡ دُوۡنِ اللّٰہِ فَقَدۡ خَسِرَ خُسۡرَانًا مُّبِیۡنًا ﴿۱۲۰﴾ؕ</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And assuredly I will lead them astray and assuredly I will excite in them vain desires, and assuredly I will incite them and they will cut the ears of cattle; and assuredly I will incite them and they will alter Allah’s creation.’ And he who takes Satan for a friend beside Allah has certainly suffered a manifest loss.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And assuredly I will lead them astray and assuredly I will arouse in them vain desires, and assuredly I will incite them and they will cut the ears<sup class='ref'>[<a class='ref' data-id='ref_4_120_672' href='#'>672</a>]</sup> of cattle; and assuredly I will incite them and they will alter<sup class='ref'>[<a class='ref' data-id='ref_4_120_673' href='#'>673</a>]</sup> Allah’s creation.’ And whoever takes Satan for a friend instead of Allah, he certainly suffers a manifest loss. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_4_120_672'>672</span><span class='collapsible plus' data-id='ref_4_120_673'>673</span></div> <div><a name='672'></a><div class='reference' data-id='ref_4_120_672' style='display:none'> <p><b>672.</b> As a mark of their devotion to false deities, the Arabs used to cut the ears of dedicated animals in order to distinguish them from other animals. This foolish practice persists even to this day in some countries (<a href='javascript:void(0)' data-id='ref_4_120_672' class='ref'>close</a>)</p> </div> </div><div><a name='673'></a><div class='reference' data-id='ref_4_120_673' style='display:none'> <p><b>673.</b> The 'alteration of Allah’s creation' is done by (1) deifying God’s creation; (2) by changing and corrupting the religion of God; (3) by deforming or disfiguring the body of a newborn child; and (4) by turning to evil use that which Allah has created for good use. (<a href='javascript:void(0)' data-id='ref_4_120_673' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور میں ضرور ان کو گمراہ کروں گا اور ضرور انہیں امیدیں دلاؤں گا اور ضرور انہیں حکم دوں گا تو وہ ضرور مویشیوں کے کانوں پر زخم لگائیں گے اور میں ضرور اُنہیں حکم دوں گا تو وہ ضرور اللہ کی تخلیق میں تغیر کردیں گے۔ اور جس نے بھی اللہ کو چھوڑ کر شیطان کو دوست بنایا تو یقیناً اس نے کھلا کھلا نقصان اٹھایا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور انہیں لازماًگمراہ کروں گا اور یقیناً (بڑی بڑی) امیدیں بھی دلاٶں گا اور ان سے باصرار یہ خواہش کروں گا کہ وہ چوپایوں کے کان کاٹیں۔ اسی طرح خواہش کروں گا کہ وہ مخلوق خدا میں تبدیلی کریں اور جو اللہ کو چھوڑ کر شیطان کو دوست بنائے‘ تو (سمجھو کہ) وہ (کھلے) کھلے نقصان میں پڑ گیا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et assurément, je les égarerai, et assurément j’exciterai chez eux de vains désirs, et assurément je leur commanderai de sorte qu’ils feront des incisions aux oreilles des chameaux <em>et d’autres bestiaux</em> et assurément je leur commanderai et ils modifieront les créations d’Allāh. » Et celui qui prend Satan pour ami en dehors d’Allāh a, sans aucun doute, subi une perte manifeste.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y con toda seguridad los extraviaré y despertaré en ellos vanos deseos, y ciertamente les ordenaré que corten las orejas de los camellos <em>y otro tipo de ganado</em>, y ciertamente los incitaré y modificarán la creación de Al-lah”. Y quien tome a Satanás por amigo, en lugar de Al-lah, ciertamente sufrirá una enorme pérdida.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">wahrlich, ich will sie irreleiten; wahrlich, ich will eitle Wünsche in ihnen erregen; wahrlich, ich will sie aufreizen, und sie werden dem Vieh die Ohren abschneiden; wahrlich, ich will sie aufreizen, und sie werden Allahs Schöpfung verunstalten.\" Und wer sich Satan zum Freund nimmt statt Allah, der hat sicherlich einen offenkundigen Verlust erlitten.", "spanish": " A quien Al-lah ha maldecido. Él dijo: “Con toda seguridad me apoderaré de una parte determinada de Tus siervos”;", "urdu": " (اس شیطان کو) جسے اللہ نے (اپنی جناب سے) دور کر دیا ہے اور (جس نے یہ) کہا تھا کہ میں تیرے بندوں سے ضرور ہی ایک مقررہ حصہ لوں گا۔"}], "Surah": 4}