{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " لَاۤ اُقۡسِمُ بِہٰذَا الۡبَلَدِ ۙ﴿۲﴾", "english": " Nay, but I do swear by this city —", "french": " Non , mais Je prends à témoin cette cité –", "german": " Nein, aber Ich schwöre bei dieser Stadt -", "spanish": " ¡No! Mas juro por esta ciudad,", "urdu": " سن لو! تمہاری بات غلط ہے میں اس شہر (مکہ) کو تیری سچائی کے طور پر پیش کرتا ہوں۔"}, {"arabic": " وَ اَنۡتَ حِلٌّۢ بِہٰذَا الۡبَلَدِ ۙ﴿۳﴾", "english": " And thou art dwelling in this city —", "french": " Alors qu’un jour, tu vas descendre dans cette cité –", "german": " und du wirst diese Stadt betreten –", "spanish": " -Y tú eres morador de esta ciudad‑", "urdu": " اور (کہتا ہوں کہ اے محمد) تو (ایک دن) پھر اس شہر (مکہ) میں واپس آنے والا ہے۔"}, {"arabic": " وَ وَالِدٍ وَّ مَا وَلَدَ ۙ﴿۴﴾", "english": " And I swear by the begetter and whom he begot,", "french": " Et Je prends à témoin l’engendreur et l’engendré,", "german": " und bei dem Vater und dem Kind,", "spanish": " Y juro por quien engendra y el engendrado por él,", "urdu": " اور باپ کو بھی اور بیٹے کو بھی (شہادت کے طور پر پیش کرتا ہوں)"}, {"arabic": " لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ فِیۡ کَبَدٍ ؕ﴿۵﴾", "english": " We have surely created man to face hardships.", "french": " Nous avons assurément créé l’homme pour mener une vie de dur labeur,", "german": " wahrlich, Wir haben den Menschen zu einem Stande des Kampfes erschaffen.", "spanish": " Que en verdad creamos al hom­bre para se enfrentara a las tribulaciones.", "urdu": " ہم نے یقیناً انسان کو رہین محنت بنایا ہے۔"}, {"arabic": " اَیَحۡسَبُ اَنۡ لَّنۡ یَّقۡدِرَ عَلَیۡہِ اَحَدٌ ۘ﴿۶﴾", "english": " Does he think that no one has power over him?", "french": " S’imagine-t-il que personne n’a de pouvoir sur lui ?", "german": " Meint er, niemand habe Macht über ihn?", "spanish": " ¿Piensa acaso que nadie tiene poder sobre él?", "urdu": " کیا وہ یہ گمان کرتا ہے کہ اس پر کسی کا زور نہیں چلے گا۔"}, {"arabic": " یَقُوۡلُ اَہۡلَکۡتُ مَالًا لُّبَدًا ؕ﴿۷﴾", "english": " He says, ‘I have spent enormous wealth.’", "french": " Il dit : « J’ai gaspillé d'immenses richesses. »", "german": " Er spricht: \"Ich habe viel Gut aufgewendet.\"", "spanish": " Dice; “He gastado pródiga­mente”", "urdu": " وہ کہتا ہے کہ میں نے تو ڈھیروں ڈھیر مال لٹا دیا ہے۔"}, {"arabic": " اَیَحۡسَبُ اَنۡ لَّمۡ یَرَہٗۤ اَحَدٌ ؕ﴿۸﴾", "english": " Does he think that no one sees him?", "french": " S’imagine-t-il que personne ne le voit ?", "german": " Meint er, niemand sehe ihn?", "spanish": " ¿Piensa acaso que nadie le ve?", "urdu": " کیا وہ سمجھتا ہے کہ اسے کوئی دیکھنے والا نہیں ہے۔"}, {"arabic": " اَلَمۡ نَجۡعَلۡ لَّہٗ عَیۡنَیۡنِ ۙ﴿۹﴾", "english": " Have We not given him two eyes,", "french": " Ne lui avons-Nous pas donné deux yeux,", "german": " Haben Wir ihm nicht zwei Augen zugeteilt", "spanish": " ¿No le hemos dado dos ojos,", "urdu": " کیا ہم نے اس کے لئے دو آنکھیں نہیں پیدا کیں؟"}, {"arabic": " وَ لِسَانًا وَّ شَفَتَیۡنِ ۙ﴿۱۰﴾", "english": " And a tongue and two lips?", "french": " Et une langue et deux lèvres ?", "german": " und eine Zunge und zwei Lippen?", "spanish": " Una lengua y dos labios?", "urdu": " اور زبان بھی اور دو ہونٹ بھی (پیدا نہیں کیے؟)"}, {"arabic": " وَ ہَدَیۡنٰہُ النَّجۡدَیۡنِ ﴿ۚ۱۱﴾", "english": " And We have pointed out to him the two highways of good and evil .", "french": " Et Nous lui avons indiqué les deux grandes voies de l'Ascension.", "german": " Dann haben Wir ihm die beiden Heerstraßen (zu Gut und Böse) gewiesen,", "spanish": " Y le mostramos dos caminos ascendentes de nobleza.", "urdu": " پھر ہم نے اسے (ہدایت اور گمراہی کے) دونوں راستے بھی بتا دئیے ہیں۔"}, {"arabic": " فَلَا اقۡتَحَمَ الۡعَقَبَۃَ ﴿۫ۖ۱۲﴾", "english": " But he attempted not the ascent courageously .", "french": " Mais il ne s’est pas engagé avec rigueur dans Al-̒Aqabah.", "german": " doch er unternahm das Erklimmen nicht.", "spanish": " Pero no siguió el camino de “Aqabah”.", "urdu": " (مگر) وہ پھر بھی چوٹی پر نہ چڑھا۔"}, {"arabic": " وَ مَاۤ اَدۡرٰٮکَ مَا الۡعَقَبَۃُ ﴿ؕ۱۳﴾", "english": " And what should make thee know what the ascent is?", "french": " Et qu’est-ce qui te ferait savoir ce qu’est Al-̒Aqabah ?", "german": " Und was lässt dich wissen, was das Erklimmen ist?", "spanish": " Mas ¿Qué te haría conocer lo que es la “Aqabah”?", "urdu": " اور تجھے کس نے بتایا ہے کہ چوٹی کیا (ہے اور کس چیز کا نام) ہے؟"}, {"arabic": " فَکُّ رَقَبَۃٍ ﴿ۙ۱۴﴾", "english": " It is the freeing of a slave.", "french": " C’est la remise en liberté d’un esclave,", "german": " Die Befreiung eines Sklaven,", "spanish": " Es la liberación de un esclavo,", "urdu": " (چوٹی پر چڑھنا غلام کی) گردن چھڑانا ہے۔"}, {"arabic": " اَوۡ اِطۡعٰمٌ فِیۡ یَوۡمٍ ذِیۡ مَسۡغَبَۃٍ ﴿ۙ۱۵﴾", "english": " Or feeding in a day of hunger", "french": " Ou, par un jour de famine, de nourrir", "german": " oder die Speisung an einem Tage der Hungersnot,", "spanish": " O proveer alimento en un día de hambre", "urdu": " یا بھوک کے دن کھانا کھلانا ہے۔"}, {"arabic": " یَّتِیۡمًا ذَا مَقۡرَبَۃٍ ﴿ۙ۱۶﴾", "english": " An orphan near of kin,", "french": " Un orphelin qui est proche parent,", "german": " einer nah verwandten Waise,", "spanish": " A un pariente huérfano,", "urdu": " یتیم کو‘ جو قریبی ہو۔"}, {"arabic": " اَوۡ مِسۡکِیۡنًا ذَا مَتۡرَبَۃٍ ﴿ؕ۱۷﴾", "english": " Or a poor man lying in the dust.", "french": " Ou un indigent gisant dans la poussière.", "german": " oder eines Armen, der sich im Staube wälzt.", "spanish": " O a un pobre reducido a la mi­seria.", "urdu": " یا مسکین کو جو زمین پر گرا ہوا ہو۔"}, {"arabic": " ثُمَّ کَانَ مِنَ الَّذِیۡنَ اٰمَنُوۡا وَ تَوَاصَوۡا بِالصَّبۡرِ وَ تَوَاصَوۡا بِالۡمَرۡحَمَۃِ ﴿ؕ۱۸﴾", "english": " Again, he should have been of those who believe and exhort one another to perseverance and exhort one another to mercy.", "french": " De plus, il aurait dû être de ceux qui croient et s’exhortent les uns les autres à la persévérance, et s’exhortent les uns les autres à la miséricorde.", "german": " Wiederum, er sollte zu denen gehören, die glauben und einander ermahnen zur Geduld und einander ermahnen zur Barmherzigkeit.", "spanish": " De nuevo: debería ser de los que creen y se exhortan mu­tuamente a la perseverancia y se alientan mutuamente a la misericor­dia.", "urdu": " پھر (چوٹی پر چڑھنا یہ تھا کہ ان کاموں کے علاوہ) یہ ان میں سے بن جاتا جو ایمان لائے اور (جنہوں نے) ایک دوسرے کو صبر کی نصیحت کی اور ایک دوسرے کو رحم کرنے کی نصیحت کی۔"}, {"arabic": " اُولٰٓئِکَ اَصۡحٰبُ الۡمَیۡمَنَۃِ ﴿ؕ۱۹﴾", "english": " These are the people of the right hand.", "french": " Ceux-là sont les gens du côté droit.", "german": " Diese werden zur Rechten sein.", "spanish": " Estos son la gente de la de­recha.", "urdu": " یہی لوگ تو برکت والے ہونگے۔"}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِنَا ہُمۡ اَصۡحٰبُ الۡمَشۡـَٔمَۃِ ﴿ؕ۲۰﴾", "english": " But those who disbelieve Our Signs, they are the people of the left hand.", "french": " Mais ceux qui refusent de croire à Nos Signes, ils sont les gens du côté gauche.", "german": " Die aber nicht an Unsere Zeichen glauben, sie werden zur Linken sein.", "spanish": " Mas quienes no crean en Nuestros Signos, serán la gente de la izquierda.", "urdu": " اور جنہوں نے ہماری آیتوں کا کفر کیا وہ نحوست والے ہونگے۔"}], "Surah": 90}