{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یُسَبِّحُ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ۚ لَہُ الۡمُلۡکُ وَ لَہُ الۡحَمۡدُ ۫ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۲﴾", "english": " Whatever is in the heavens and whatever is in the earth glorifies Allah; His is the kingdom and His the praise, and He has power over all things.", "french": " Tout ce qui est dans les cieux et tout ce qui est sur la terre glorifient Allāh ; à Lui est le royaume, et à Lui les louanges, et Il a le pouvoir de faire tout ce qu’Il veut.", "german": " Was in den Himmeln ist und was auf Erden, preist Allah; Sein ist das Königreich und Sein das Lob, und Er vermag alle Dinge zu tun.", "spanish": " Cuanto hay en los cielos y cuanto hay en la tierra glorifica a Al-lah; Suyo es el reino y Suya la alabanza, pues Él tiene poder sobre todas las cosas.", "urdu": " آسمانوں اور زمین میں جو کچھ ہے اللہ کی تسبیح کر رہا ہے۔ بادشاہت بھی اسی کی ہے اور تعریف بھی اسی کی ہے اور وہ ہر چیز پر قادر ہے۔"}, {"arabic": " ہُوَ الَّذِیۡ خَلَقَکُمۡ فَمِنۡکُمۡ کَافِرٌ وَّ مِنۡکُمۡ مُّؤۡمِنٌ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۳﴾", "english": " It is He Who has created you, but some of you are disbelievers and some of you are believers; and Allah sees what you do.", "french": " C’est Lui Qui vous a créés, puis certains d’entre vous deviennent des mécréants, et certains d’entre vous deviennent des croyants ; et Allāh voit bien tout ce que vous faites.", "german": " Er ist es, Der euch erschaffen hat, aber einige unter euch sind Ungläubige und einige unter euch sind Gläubige; und Allah sieht, was ihr tut.", "spanish": " Él es Quien os ha creado, luego algunos de vosotros os hicisteis incrédulos y algunos de vosotros os volvisteis creyentes; mas Al-lah ve lo que hacéis.", "urdu": " وہی ہے جس نے تم کو پیدا کیا ہے۔ پس تم میں سے کوئی تو کافر بن جاتا ہے اور کوئی مومن بن جاتا ہے۔ اور اللہ تمہارے اعمال کو دیکھ رہا ہے۔"}, {"arabic": " خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ وَ صَوَّرَکُمۡ فَاَحۡسَنَ صُوَرَکُمۡ ۚ وَ اِلَیۡہِ الۡمَصِیۡرُ ﴿۴﴾", "english": " He created the heavens and the earth with truth, and He shaped you and made your shapes beautiful, and to Him is the ultimate return.", "french": " Il a créé les cieux et la terre en toute vérité, et Il vous a donné votre forme, et Il a rendu harmonieuses vos apparences, et vers Lui est la destination finale .", "german": " Er schuf die Himmel und die Erde in Weisheit, und Er gestaltete euch und machte eure Gestalt schön, und zu Ihm ist die Heimkehr.", "spanish": " Él creó los cielos y la tierra con verdad y os configuró e hizo excelentes vuestras formas, y hacia Él será el retorno último .", "urdu": " آسمانوں اور زمین کو اس نے ایک خاص غرض کے ماتحت پیدا کیا ہے اور اسی نے تمہاری صورتیں بنائی ہیں اور تمہاری صورتوں کو بہت اچھا بنایا ہے اور اسی کی طرف تم نے لوٹ کر جانا ہے۔"}, {"arabic": " یَعۡلَمُ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ وَ یَعۡلَمُ مَا تُسِرُّوۡنَ وَ مَا تُعۡلِنُوۡنَ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۵﴾", "english": " He knows whatever is in the heavens and the earth, and He knows what you conceal and what you disclose; and Allah knows full well all that is in the breasts.", "french": " Il connaît tout ce qui est dans les cieux et sur la terre, et Il sait ce que vous dissimulez et ce que vous révélez ; et Allāh sait très bien tout ce qui est dans les poitrines.", "german": " Er weiß, was in den Himmeln und auf Erden ist, und Er weiß, was ihr verhehlt und was ihr offenbart; und Allah kennt alles, was in den Herzen ist.", "spanish": " Él conoce cuanto hay en los cielos y en la tierra y sabe lo que cultáis y lo que reveláis; pues Al-lah sabe perfectamente todo lo que hay en los corazones.", "urdu": " آسمانوں اور زمین میں جو کچھ ہے وہ اسے جانتا ہے۔ اور اس عمل کو بھی جانتا ہے جسے تم چھپاتے ہو یا ظاہر کرتے ہو۔ اور اللہ دل کی باتوں کو بھی جانتا ہے۔"}, {"arabic": " اَلَمۡ یَاۡتِکُمۡ نَبَؤُا الَّذِیۡنَ کَفَرُوۡا مِنۡ قَبۡلُ ۫ فَذَاقُوۡا وَبَالَ اَمۡرِہِمۡ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۶﴾", "english": " Has not the news reached you of those who disbelieved before? So they tasted the evil consequences of their conduct, and they had a painful punishment.", "french": " La nouvelle ne vous est-elle pas parvenue de ceux qui ont refusé de croire auparavant ? Alors ils ont goûté les mauvaises conséquences de leur conduite, et ils ont eu un châtiment douloureux.", "german": " Ist nicht die Geschichte zu euch gedrungen von denen, die zuvor ungläubig waren? So kosteten sie die bösen Folgen ihres Betragens, und ihnen wird qualvolle Strafe.", "spanish": " ¿No os han llegado las noticias de los incrédulos que os precedieron? Así probaron las malvadas consecuencias de su conducta y sufrieron un doloroso castigo.", "urdu": " کیا تم کو اپنے سے پہلے کافروں کی خبریں نہیں پہنچیں۔ انہوں نے اپنے اعمال کی سزا بھگتی اور ان کے لئے دردناک عذاب (مقدر) ہے۔"}, {"arabic": " ذٰلِکَ بِاَنَّہٗ کَانَتۡ تَّاۡتِیۡہِمۡ رُسُلُہُمۡ بِالۡبَیِّنٰتِ فَقَالُوۡۤا اَبَشَرٌ یَّہۡدُوۡنَنَا ۫ فَکَفَرُوۡا وَ تَوَلَّوۡا وَّ اسۡتَغۡنَی اللّٰہُ ؕ وَ اللّٰہُ غَنِیٌّ حَمِیۡدٌ ﴿۷﴾", "english": " That was because their Messengers came to them with manifest Signs, but they said, ‘Shall mortals guide us?’ So they disbelieved and turned away, but Allah had never any need of them ; and Allah is Self- Sufficient, Worthy of all praise.", "french": " C’est parce que leurs Messagers sont venus à eux avec des Signes manifestes, mais qu’ils dirent : « Est-ce que ce sont des humains qui nous guideront ? » Aussi refusèrent-ils de croire, et ils tournèrent le dos, mais Allāh est Indépendant d’eux ; et Allāh Se suffit à Lui-Même, et est Digne de louange.", "german": " Dies, weil ihre Gesandten zu ihnen kamen mit klaren Beweisen. Sie aber sprachen: \"Sollen Sterbliche uns den Weg weisen?\" Also glaubten sie nicht und wandten sich ab, doch Allah bedurfte (ihrer) nicht; und Allah ist Sich Selbst genügend, preiswürdig.", "spanish": " Eso fue porque sus Mensajeros les llegaron con Signos manifiestos, pero dijeron: “¿Acaso ha de guiarnos los humanos?”. No creyeron, pues, y se apartaron, pero Al-lah nunca tuvo necesidad de ellos; pues Al-lah es Autosuficiente, Merecedor de toda alabanza.", "urdu": " یہ اس لئے ہوا کہ ان کے پاس ان کے رسول دلائل لیکر آتے رہے مگر وہ یہی جواب دیتے رہے کہ کیا انسانی شکل میں آنے والے لوگ ہی ہم کو ہدایت دیں گے (اگر ہدایت دینی ہوتی تو فرشتے آسمان سے اترتے) سو انہوں نے کفر کیا اور پیٹھ پھیر لی۔ اور اللہ نے بھی ان کے ایمان سے بے نیازی ظاہر کی اور اللہ ہر ایک سے بے احتیاج (اور) بڑی تعریفوں کا مستحق ہے۔"}, {"arabic": " زَعَمَ الَّذِیۡنَ کَفَرُوۡۤا اَنۡ لَّنۡ یُّبۡعَثُوۡا ؕ قُلۡ بَلٰی وَ رَبِّیۡ لَتُبۡعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلۡتُمۡ ؕ وَ ذٰلِکَ عَلَی اللّٰہِ یَسِیۡرٌ ﴿۸﴾", "english": " Those who disbelieve assert that they will not be raised up. Say, ‘Yea, by my Lord, you shall surely be raised up; then shall you surely be informed of what you did. And that is easy for Allah.’", "french": " Ceux qui refusent de croire affirment qu’ils ne seront pas ressuscités. Dis : « Si fait, par mon Seigneur, vous serez sûrement ressuscités, alors vous serez sûrement informés de ce que vous avez fait. Et cela est facile pour Allāh. »", "german": " Die da ungläubig sind, wähnen, sie würden nicht auferweckt werden. Sprich: \"Doch, bei meinem Herrn, ihr werdet gewisslich auferweckt werden; dann wird euch gewisslich verkündet werden, was ihr getan. Und das ist Allah ein leichtes.\"", "spanish": " Los incrédulos afirman que no serán resucitados. Diles: “¡Sí! por mi Señor; en verdad seréis resucitados; entonces seréis verdaderamente informados de lo que hicisteis. Eso es fácil para Al-lah”.", "urdu": " کافر خیال کرتے ہیں کہ کبھی بھی وہ (زندہ کرکے) نہیں اٹھائے جائیں گے تو کہہ دے جس طرح تم خیال کرتے ہو۔ ایسا نہیں ہوگا۔ بلکہ مجھ کو اپنے رب کی قسم تم کو زندہ کرکے اٹھایا جائے گا‘ پھر تم کو تمہارے اعمال سے واقف کیا جائے گا اور یہ بات اللہ پر آسان ہے۔"}, {"arabic": " فَاٰمِنُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ وَ النُّوۡرِ الَّذِیۡۤ اَنۡزَلۡنَا ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ خَبِیۡرٌ ﴿۹﴾", "english": " Believe, therefore, in Allah and His Messenger, and in the Light which We have sent down. And Allah is Well-Aware of all that you do.", "french": " Croyez donc en Allāh et en Son Messager, et à la Lumière que Nous avons fait descendre. Et Allāh est Très-Conscient de tout ce que vous faites.", "german": " Drum glaubet an Allah und Seinen Gesandten und an das Licht, das Wir herniedergesandt haben. Und Allah kennt wohl, was ihr tut.", "spanish": " Creed, pues, en Al-lah y en Su Mensajero y en la Luz que hemos revelado. Pues Al-lah conoce muy bien todo lo que hacéis.", "urdu": " پس اے لوگو! اللہ اور اس کے رسول پر ایمان لاٶ اور اس نور (یعنی قرآن) پر بھی جو ہم نے اتارا ہے اور اللہ تمہارے اعمال سے خبردار ہے۔"}, {"arabic": " یَوۡمَ یَجۡمَعُکُمۡ لِیَوۡمِ الۡجَمۡعِ ذٰلِکَ یَوۡمُ التَّغَابُنِ ؕ وَ مَنۡ یُّؤۡمِنۡۢ بِاللّٰہِ وَ یَعۡمَلۡ صَالِحًا یُّکَفِّرۡ عَنۡہُ سَیِّاٰتِہٖ وَ یُدۡخِلۡہُ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿۱۰﴾", "english": " The day when He shall gather you, on the Day of Gathering, that will be the day of mutual loss and gain . And whoso believes in Allah and does good deeds — He will remove from them the evil consequences of their deeds and He will make them enter Gardens through which streams flow, to abide therein for ever. That is the supreme triumph.", "french": " Le jour où Il vous rassemblera pour le Jour du Rassemblement ce sera là le jour des pertes et des gains. Et quiconque croit en Allāh et fait de bonnes œuvres – Il lui enlèvera ses méfaits, et Il l’admettra dans des Jardins sous lesquels coulent des ruisseaux, pour y demeurer éternellement. C’est là le triomphe suprême.", "german": " Der Zeitpunkt, da Er euch versammeln wird am Tage der Versammlung, das wird der Tag gegenseitigen Verlustes (und Gewinns) sein. Und wer an Allah glaubt und das Rechte tut – Er wird seine Übel von ihm nehmen und wird ihn in Gärten führen, durch die Ströme fließen, darin zu weilen auf immer. Das ist die höchste Glückseligkeit.", "spanish": " El día en que os reunirá en el Día de la Reunión, será el día de la ganancia y la pérdida. Mas a quienes crean en Al-lah y ractiquen las buenas obras sepan que Él retirará de ellos las consecuencias perversas de sus acciones y les hará entrar en Jardines por los que corren ríos, para que habiten en ellos para siempre. Ése es el triunfo supremo.", "urdu": " جس دن تم سب کو اکٹھا کرنے کے دن (یعنی قیامت کے دن زندہ کرکے) جمع کرے گا‘ یہ ہار جیت کے فیصلہ کا دن ہوگا اور جو کوئی اللہ پر ایمان لاتا ہے اور اس کے مطابق عمل کرتا ہے اللہ بھی اس کی بدیوں کو ڈھانپ دیتا ہے اور اس کو ایسی جنتوں میں داخل کرتا ہے جن کے نیچے نہریں بہتی ہیں۔ وہ ہمیشہ کے لئے ان میں رہتے چلے جائیں گے‘ یہ بہت بڑی کامیابی ہے۔"}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡا وَ کَذَّبُوۡا بِاٰیٰتِنَاۤ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ خٰلِدِیۡنَ فِیۡہَا ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿٪۱۱﴾", "english": " But as to those who disbelieve and reject Our Signs, these shall be the inmates of the Fire, wherein they shall abide; and an evil destination it is!", "french": " Mais quant à ceux qui refusent de croire et rejettent Nos Signes, ceux-là seront les habitants du Feu, ils y demeureront longtemps ; et quelle mauvaise destination !", "german": " Die aber ungläubig sind und Unsere Zeichen verwerfen, die sollen die Bewohner des Feuers sein, darin müssen sie bleiben; und eine schlimme Bestimmung ist das!", "spanish": " Mas en cuanto a quienes no creen y rechazan Nuestros Signos: éstos serán los habitantes del Fuego, en donde morarán; ¡qué pésimo destino es!", "urdu": " اور جنہوں نے کفر کیا اور ہماری آیتوں کو جھٹلایا‘ وہ دوزخی ہیں (اور) وہ دوزخ میں رہتے چلے جائیں گے اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " مَاۤ اَصَابَ مِنۡ مُّصِیۡبَۃٍ اِلَّا بِاِذۡنِ اللّٰہِ ؕ وَ مَنۡ یُّؤۡمِنۡۢ بِاللّٰہِ یَہۡدِ قَلۡبَہٗ ؕ وَ اللّٰہُ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۱۲﴾", "english": " There befalls not any affliction but by the leave of Allah. And whosoever believes in Allah — He guides his heart aright . And Allah knows all things full well.", "french": " Toute affliction ne survient qu’avec la permission d’Allāh. Et quiconque croit en Allāh – Il guide son cœur sur le droit chemin Et Allāh connaît très bien toutes les choses.", "german": " Kein Unglück trifft ein, außer mit Allahs Erlaubnis. Und wer an Allah glaubt – Er leitet sein Herz. Und Allah weiß alle Dinge.", "spanish": " Ninguna desgracia acontece si no es con el permiso de Al-lah. Y a uien crea en Al-lah, Él guiará su corazón por el camino recto. Pues Al-lah conoce muy bien todas las cosas.", "urdu": " کوئی مصیبت نہیں آتی‘ مگر اللہ کے حکم سے۔ اور جو اللہ پر ایمان لاتا ہے‘ وہ اس کے دل کو کامیابی کے طریقوں کی طرف پھیر دیتا ہے اور اللہ ہر چیز کو جانتا ہے۔"}, {"arabic": " وَ اَطِیۡعُوا اللّٰہَ وَ اَطِیۡعُوا الرَّسُوۡلَ ۚ فَاِنۡ تَوَلَّیۡتُمۡ فَاِنَّمَا عَلٰی رَسُوۡلِنَا الۡبَلٰغُ الۡمُبِیۡنُ ﴿۱۳﴾", "english": " And obey Allah and obey the Messenger. But if you turn away, then Our Messenger is responsible only for the clear conveying of the Message .", "french": " Et obéissez à Allāh, et obéissez au Messager. Mais si vous tournez le dos, alors Notre Messager n’est responsable que de la transmission claire du Message.", "german": " So gehorchet Allah und gehorchet dem Gesandten. Doch wenn ihr euch abkehrt, dann ist die Pflicht Unseres Gesandten nur die deutliche Verkündigung.", "spanish": " Obedeced a Al-lah y obedeced al Mensajero. Pero si volvéis la espalda, sabed que Nuestro Mensajero sólo es responsable de la clara transmisión del Mensaje.", "urdu": " اور اللہ اور رسول کی اطاعت کرو۔ لیکن اگر تم پھر جاٶ‘ تو ہمارے رسول پر صرف کھول کر بات پہنچا دینا ہی فرض ہے۔"}, {"arabic": " اَللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَ ؕ وَ عَلَی اللّٰہِ فَلۡیَتَوَکَّلِ الۡمُؤۡمِنُوۡنَ ﴿۱۴﴾", "english": " Allah! there is no God but He; so in Allah let the believers put their trust.", "french": " Allāh ! Il n’y a de dieu que Lui, donc que les croyants placent leur confiance en Allāh !", "german": " Allah! es gibt keinen Gott außer Ihm; und in Allah sollen die Gläubigen Vertrauen haben.", "spanish": " ¡Al-lah! No hay dios sino Él. Que, pongan los creyentes, pues, su confianza en Al-lah.", "urdu": " اللہ کے سوا کوئی معبود نہیں اور مومنوں کو اللہ پر ہی توکل کرنا چاہیے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنَّ مِنۡ اَزۡوَاجِکُمۡ وَ اَوۡلَادِکُمۡ عَدُوًّا لَّکُمۡ فَاحۡذَرُوۡہُمۡ ۚ وَ اِنۡ تَعۡفُوۡا وَ تَصۡفَحُوۡا وَ تَغۡفِرُوۡا فَاِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۵﴾", "english": " O ye who believe! surely among your wives and your children are some that are really your enemies, so beware of them. And if you overlook and forgive and pardon, then surely, Allah is Most Forgiving, Merciful.", "french": " Ô vous qui croyez ! sûrement parmi vos femmes et vos enfants il y en a qui sont vos ennemis ; Donc prenez garde à eux. Et si vous passez dessus et vous détournez votre regard et vous pardonnez, alors assurément Allāh est Très-Pardonnant, Miséricordieux.", "german": " O die ihr glaubt, wahrlich, unter euren Frauen und Kindern sind welche, die euch feind sind, so hütet euch vor ihnen. Und wenn ihr vergesst und Nachsicht übt und verzeiht, dann ist Allah allverzeihend, barmherzig.", "spanish": " ¡Oh vosotros, los creyentes! En verdad, entre vuestras esposas y vuestros hijos hay algunos que son enemigos vuestros; cuidado, ues con ellos. Mas si olvidáis, absolvéis y perdonáis, sabed que en verdad Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اے مومنو! تمہاری بیویوں اور اولادوں میں سے بعض ایسے ہیں جو تمہارے دشمن ہیں۔ پس ان سے ہوشیار رہو اور اگر تم عفو سے کام لو اور درگذر کرو‘ اور معاف کرو۔ تو اللہ بڑا معاف کرنے والا (اور) بے انتہا کرم کرنے والا ہے۔"}, {"arabic": " اِنَّمَاۤ اَمۡوَالُکُمۡ وَ اَوۡلَادُکُمۡ فِتۡنَۃٌ ؕ وَ اللّٰہُ عِنۡدَہٗۤ اَجۡرٌ عَظِیۡمٌ ﴿۱۶﴾", "english": " Verily, your wealth and your children are a trial; but with Allah is an immense reward.", "french": " En vérité, vos biens et vos enfants ne sont qu’une épreuve ; mais auprès d’Allāh il y a une immense récompense.", "german": " Eure Reichtümer und eure Kinder sind nur eine Versuchung; doch bei Allah ist großer Lohn.", "spanish": " Ciertamente vuestra riqueza y vuestros hijos son una tentación; mas con Al-lah os espera una inmensa recompensa.", "urdu": " تمہارے مال اور تمہاری اولادیں صرف ایک آزمائش کا ذریعہ ہیں۔ اور اللہ کے پاس بڑا اجر ہے۔"}, {"arabic": " فَاتَّقُوا اللّٰہَ مَا اسۡتَطَعۡتُمۡ وَ اسۡمَعُوۡا وَ اَطِیۡعُوۡا وَ اَنۡفِقُوۡا خَیۡرًا لِّاَنۡفُسِکُمۡ ؕ وَ مَنۡ یُّوۡقَ شُحَّ نَفۡسِہٖ فَاُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۱۷﴾", "english": " So fear Allah as best you can, and listen, and obey, and spend in His cause ; it will be good for yourselves. And whoso is rid of the covetousness of his own soul — it is such who shall be successful.", "french": " Craignez donc Allāh autant que vous pouvez, et écoutez, et obéissez, et dépensez pour Sa cause ; cela sera plus avantageux pour vos âmes. Et quiconque est débarrassé de sa propre avarice – ce sont ceux-là qui prospéreront.", "german": " So fürchtet Allah, soviel ihr nur könnt, und höret und gehorchet und spendet: es wird für euch selbst besser sein. Und wer vor seiner eigenen Habsucht bewahrt ist – das sind die Erfolgreichen.", "spanish": " Temed, pues, a Al-lah, lo mejor que podáis, escuchad, obedeced y gastad en Su causa; esto será bueno para vosotros. Mas quien se salve de su propia avaricia sepa que éstos los que serán bienaventurados.", "urdu": " پس جتنا ہو سکے اللہ کا تقویٰ اختیار کرو‘ اور اس کی بات سنو اور اس کی اطاعت کرو‘ اور اپنے مال اس کی راہ میں خرچ کرتے رہو۔ یہ تمہاری جانوں کے لئے بہتر ہوگا اور جو لوگ اپنے دل کے بخل سے بچائے جاتے ہیں وہ کامیاب ہوتے ہیں۔"}, {"arabic": " اِنۡ تُقۡرِضُوا اللّٰہَ قَرۡضًا حَسَنًا یُّضٰعِفۡہُ لَکُمۡ وَ یَغۡفِرۡ لَکُمۡ ؕ وَ اللّٰہُ شَکُوۡرٌ حَلِیۡمٌ ﴿ۙ۱۸﴾", "english": " If you lend to Allah a good loan, He will multiply it for you, and will forgive you; and Allah is Most Appreciating, Forbearing,", "french": " Si vous faites un bon prêt à Allāh, Il vous le multipliera, et Il vous pardonnera ; et Allāh est Très-Appréciateur, Indulgent,", "german": " Wenn ihr Allah ein stattliches Darlehen gewährt, so wird Er es euch um ein Vielfaches vermehren und wird euch vergeben; denn Allah ist erkenntlich, langmütig,", "spanish": " Si ofrendáis a Al-lah un buen préstamo, Él os lo multiplicará y os perdonará; pues Al-lah es el Sumo Apreciador, Tolerante.", "urdu": " اگر تم اللہ کے لئے اپنے مالوں میں سے ایک اچھا حصہ کاٹ کر الگ کر دو‘ تو وہ اس حصہ کو تمہارے لئے بڑھائے گا اور تمہارے لئے بخشش کے سامان پیدا کرے گا اور اللہ بہت قدر دان (اور) ہر بات کو سمجھنے والا ہے۔"}, {"arabic": " عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿٪۱۹﴾", "english": " The Knower of the unseen and the seen, the Mighty, the Wise.", "french": " Il est le Connaisseur de l’invisible et du visible, le Puissant, le Sage.", "german": " Wisser des Verborgenen und des Sichtbaren, der Allmächtige, der Allweise.", "spanish": " El Sabedor de lo invisible y lo visible, el Poderoso, el Sabio.", "urdu": " وہ حاضر اور غائب کو جانتا ہے اور غالب (اور) حکمت والا ہے۔"}], "Surah": 64}