{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لیکر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِقۡتَرَبَ لِلنَّاسِ حِسَابُہُمۡ وَ ہُمۡ فِیۡ غَفۡلَۃٍ مُّعۡرِضُوۡنَ ۚ﴿۲﴾", "english": " Nigh has drawn for men their reckoning, yet they turn away in heedlessness.", "french": " Le règlement de leur compte s’est rapproché pour les hommes, et malgré cela ils s’ en détournent avec insouciance.", "german": " Genaht ist den Menschen ihre Abrechnung, und doch wenden sie sich in Achtlosigkeit ab.", "spanish": " Se acerca el momento de que los hombres rindan cuenta, y sin embargo se alejan descuidados.", "urdu": " لوگوں سے حساب لینے کا وقت قریب پہنچ چکا ہے مگر وہ (پھر بھی) غفلت میں (پڑے ہوئے) ہیں اور اعراض کرتے جا رہے ہیں۔"}, {"arabic": " مَا یَاۡتِیۡہِمۡ مِّنۡ ذِکۡرٍ مِّنۡ رَّبِّہِمۡ مُّحۡدَثٍ اِلَّا اسۡتَمَعُوۡہُ وَ ہُمۡ یَلۡعَبُوۡنَ ۙ﴿۳﴾", "english": " There comes not to them any new admonition from their Lord, but they listen to it while they make sport of it .", "french": " Il ne leur vient aucune nouvelle admonition de leur Seigneur sans qu’ils ne s ’en moquent pendant qu’ils l’écoutent.", "german": " Keine neue Ermahnung kommt zu ihnen von ihrem Herrn, die sie nicht spöttelnd anhörten.", "spanish": " No les llega ninguna nueva amonestación de su Señor, sin que la escuchen al tiempo que se burlan de ella .", "urdu": " ان کے پاس ان کے رب کی طرف سے کبھی کوئی نئی یاد دہانی نہیں آتی مگر وہ اسے سنتے بھی جاتے ہیں اور اس سے ہنسی مذاق بھی کرتے جاتے ہیں۔"}, {"arabic": " لَاہِیَۃً قُلُوۡبُہُمۡ ؕ وَ اَسَرُّوا النَّجۡوَی ٭ۖ الَّذِیۡنَ ظَلَمُوۡا ٭ۖ ہَلۡ ہٰذَاۤ اِلَّا بَشَرٌ مِّثۡلُکُمۡ ۚ اَفَتَاۡتُوۡنَ السِّحۡرَ وَ اَنۡتُمۡ تُبۡصِرُوۡنَ ﴿۴﴾", "english": " And their hearts are forgetful. And they keep their counsels secret — those who act wrongfully, then say , ‘Is this man aught but a human being like ourselves? Will you then accede to magic while you see it ?’", "french": " Et leur cœur est oublieux. Et ils gardent leurs délibérations secrètes – ceux qui agissent injustement – puis disent : « Celui-ci est-il autre qu’un humain semblable à vous-mêmes ? Allez-vous donc céder à la magie alors que vous voyez clair ? »", "german": " Ihre Herzen sind vergesslich. Und sie besprechen sich insgeheim – sie, die da freveln – (dann sagen sie): \"Ist dieser etwas anderes als ein Mensch wie ihr? Wollt ihr denn zur Zauberei kommen, wo ihr seht?\"", "spanish": " Pues sus corazones son olvidadizos. Y conservan secretos sus designios, quienes actúan injustamente, diciendo: “¿No es acaso este hombre mas que un ser humano como vosotros? ¿Vais a aceptar la magia si la veis?”.", "urdu": " ان کے دل غفلت میں پڑے ہوئے ہیں۔ وہ لوگ جنہوں نے ظلم کیا چپکے چپکے مشورے کرتے ہیں (اور کہتے ہیں) کہ (دیکھتے نہیں) یہ شخص تم جیسا ہی ایک بشر ہے پھر کیا تم اس کی فریبانہ باتوں میں آتے ہو‘ حالانکہ تم خوب سمجھتے ہو۔"}, {"arabic": " قٰلَ رَبِّیۡ یَعۡلَمُ الۡقَوۡلَ فِی السَّمَآءِ وَ الۡاَرۡضِ ۫ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۵﴾", "english": " God said to the Prophet , “ Say , ‘My Lord knows what is spoken in the heaven and the earth. And He is the All-Hearing, the All-Knowing,’”", "french": " En réponse à cela le Prophète dit : « Mon Seigneur sait ce qui se dit dans les cieux et sur la terre. Et Il est Celui Qui entend tout, Celui Qui sait tout. »", "german": " Er sprach: \"Mein Herr weiß, was im Himmel und auf Erden gesprochen wird, und Er ist der Allhörende, der Allwissende.\"", "spanish": " Dios dijo al Profeta: “Diles: “Mi Señor sabe lo que se habla en el cielo y en la tierra. Él es Quien todo lo oye, el Omnisciente”.", "urdu": " (ان باتوں کو سن کر محمد رسول اللہ نے) کہا میرا رب جانتا ہے ان باتوں کو جو آسمان میں (کہی جاتی ہیں) اور (ان کو بھی) جو زمین میں (کہی جاتی) ہیں اور وہ بڑا سننے والا (اور) بڑا جاننے والا ہے۔"}, {"arabic": " بَلۡ قَالُوۡۤا اَضۡغَاثُ اَحۡلَامٍۭ بَلِ افۡتَرٰٮہُ بَلۡ ہُوَ شَاعِرٌ ۚۖ فَلۡیَاۡتِنَا بِاٰیَۃٍ کَمَاۤ اُرۡسِلَ الۡاَوَّلُوۡنَ ﴿۶﴾", "english": " Nay, they say, ‘ These are but confused dreams; nay, he has forged it; nay, he is but a poet. Let him then bring us a Sign just as the former Prophets were sent with Sign .’", "french": " « Non, » disent-ils, « ce ne sont que des rêves confus ; non, il l’a inventé ; non, il n ’est qu ’un poète. Qu’il nous apporte donc un Signe tout comme les anciens Prophètes furent envoyés avec des Signes ! »", "german": " Nein, sagen sie, \"aber wirre Träume; nein, er hat ihn erdichtet; nein, er ist (nur) ein Dichter. Möge er uns doch ein Zeichen bringen in der Art, wie die früheren (Propheten) entsandt wurden.\"", "spanish": " N o, ellos dicen: “Éstos no son más que sueños onfusos; ¡No, él los ha inventado! ¡No, él no es más que un poeta! ¡Que nos traiga un Signo al igual que los Profetas anteriores fueron enviados con Signos!”.", "urdu": " بلکہ انہوں نے (یعنی مخالفین) نے تو یہاں تک کہہ دیا ہے کہ یہ (کلام) تو پریشان خوابیں ہیں۔ بلکہ (پریشان خوابیں بھی نہیں) اس نے دیدہ و دانستہ یہ باتیں اپنے پاس سے بنالی ہیں بلکہ وہ ایک شاعرانہ مزاج رکھنے والا آدمی ہے (جس کے دماغ میں طرح طرح کے خیال اٹھتے رہتے ہیں) پس چاہیئے کہ ہمارے پاس کوئی نشان لے آئے جس طرح کہ پہلے رسول نشانوں کے ساتھ بھیجے گئے تھے۔"}, {"arabic": " مَاۤ اٰمَنَتۡ قَبۡلَہُمۡ مِّنۡ قَرۡیَۃٍ اَہۡلَکۡنٰہَا ۚ اَفَہُمۡ یُؤۡمِنُوۡنَ ﴿۷﴾", "english": " No township, before them, which We destroyed, ever believed. Would they then believe?", "french": " Avant eux, aucune ville que nous avons détruite, n’avait jamais cru. Ceux-ci croiraient-ils donc ?", "german": " Nie hat vor ihnen irgendeine Stadt je geglaubt, die Wir zerstörten. Würden sie denn glauben?", "spanish": " Ninguna ciudad anterior a ellos, que destruimos, creyó nunca. ¿Creerán, pues, ellos?", "urdu": " ان سے پہلی بستیوں میں سے بھی جن کو ہم نے ہلاک کر دیا تھا کوئی ایمان نہیں لایا تھا تو پھر کیا یہ ایمان لے آئیں گے۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنَا قَبۡلَکَ اِلَّا رِجَالًا نُّوۡحِیۡۤ اِلَیۡہِمۡ فَسۡـَٔلُوۡۤا اَہۡلَ الذِّکۡرِ اِنۡ کُنۡتُمۡ لَا تَعۡلَمُوۡنَ ﴿۸﴾", "english": " And We sent none as Messengers before thee but men to whom We sent revelations. So ask the people of the Reminder, if you know not.", "french": " Et avant toi, Nous n’avons envoyé en tant que Messagers que des hommes à qui Nous avons donné des révélations. Demandez donc à ceux qui sont versés dans les Rappels Divins , si vous ne savez pas.", "german": " Und Wir entsandten vor dir lediglich Männer, denen Wir Offenbarung zuteil werden ließen – fragt nur diejenigen, die die Ermahnung besitzen, wenn ihr nicht wisset.", "spanish": " Mas antes de ti, no enviamos como Mensajeros a nadie que no fuese un hombre a quien le entregamos la Revelación. Preguntad pues a los que poseen el conocimiento de la Escritura si es que no lo sabéis.", "urdu": " اور ہم تجھ سے پہلے (بھی ہمیشہ) مردوں ہی کو رسول بنا کر بھیجا کرتے تھے اور ہم ان کی طرف وحی کرتے تھے اور (اے منکرو) اگر تم (یہ بات) نہیں جانتے تو اہل کتاب سے پوچھ کر دیکھ لو۔"}, {"arabic": " وَ مَا جَعَلۡنٰہُمۡ جَسَدًا لَّا یَاۡکُلُوۡنَ الطَّعَامَ وَ مَا کَانُوۡا خٰلِدِیۡنَ ﴿۹﴾", "english": " And We did not give them bodies that ate no food, nor were they to live for ever.", "french": " Et Nous ne leur avons pas fait des corps qui ne mangeaient pas de nourriture, non plus qu’ils ne devaient vivre pour toujours.", "german": " Und Wir machten ihnen nicht einen Leib, dass sie keine Speise äßen, noch dass sie ewig lebten.", "spanish": " No los dotamos de cuerpos que no comieran alimentos ni habían de vivir para siempre.", "urdu": " اور ہم نے ان رسولوں کو ایسا جسم نہیں دیا تھا کہ وہ کھانا نہ کھاتے ہوں اور نہ وہ غیر معمولی عمر پانے والے لوگ تھے۔"}, {"arabic": " ثُمَّ صَدَقۡنٰہُمُ الۡوَعۡدَ فَاَنۡجَیۡنٰہُمۡ وَ مَنۡ نَّشَآءُ وَ اَہۡلَکۡنَا الۡمُسۡرِفِیۡنَ ﴿۱۰﴾", "english": " Then We fulfilled to them Our promise; and We saved them and those whom We pleased; and We destroyed the transgressors.", "french": " Puis Nous remplîmes pour eux Notre promesse ; et Nous les sauvâmes et aussi ceux que Nous voulûmes ; mais Nous détruisîmes les transgresseurs.", "german": " Dann erfüllten Wir ihnen das Versprechen; und Wir erretteten sie und wen Wir wollten; die Übertreter aber vernichteten Wir.", "spanish": " Luego cumplimos con ellos Nuestra promesa; los salvamos a ellos y a quienes quisimos; y destruimos a los transgresores.", "urdu": " اور ہم نے جو وعدہ ان سے کیا تھا اسے پورا کر دکھایا اور ان کو اوران کے سوا جن کو چاہا (دشمنوں سے) نجات دی اور جو حد سے بڑھنے والے تھے ان کو ہلاک کردیا۔"}, {"arabic": " لَقَدۡ اَنۡزَلۡنَاۤ اِلَیۡکُمۡ کِتٰبًا فِیۡہِ ذِکۡرُکُمۡ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿٪۱۱﴾", "english": " We have now sent down to you a Book wherein lies your glory and eminence; will you not then understand?", "french": " Nous avons maintenant fait descendre pour vous un Livre dans lequel se trouve tout ce dont vous pourriez avoir besoin pour votre admonestation. Ne voulez-vous donc pas comprendre ?", "german": " Wir haben euch ein Buch hernieder gesandt, worin eure Ehre liegt; wollt ihr denn nicht begreifen?", "spanish": " Ahora os hemos enviado un Libro en el que hay todo lo que necesitáis para vuestra exhortación; ¿no entenderéis pues?", "urdu": " ہم نے تمہاری طرف ایک ایسی کتاب اتاری ہے جس میں تمہاری بزرگی کے سامان ہیں کیا تم عقل نہیں کرتے۔"}, {"arabic": " وَ کَمۡ قَصَمۡنَا مِنۡ قَرۡیَۃٍ کَانَتۡ ظَالِمَۃً وَّ اَنۡشَاۡنَا بَعۡدَہَا قَوۡمًا اٰخَرِیۡنَ ﴿۱۲﴾", "english": " And how many a township that acted wrongfully have We utterly destroyed, and raised up after it another people!", "french": " Et combien d’agglomérations, qui avaient agi injustement, avons-Nous totalement détruites, et suscité après elles d’autres peuples.", "german": " Wie so manche Stadt, voll der Ungerechtigkeit, haben Wir schon niedergebrochen und nach ihr ein anderes Volk erweckt!", "spanish": " ¡Cuántas ciudades que obraron injustamente hemos destruido totalmente, exaltando tras ellas a otros pueblos!", "urdu": " اور کتنی ہی بستیاں ہیں جو ظلم کیا کرتی تھیں کہ ہم نے ان کو کاٹ کر رکھ دیا اور ان کے بعد ایک اور قوم کو پیدا کر دیا۔"}, {"arabic": " فَلَمَّاۤ اَحَسُّوۡا بَاۡسَنَاۤ اِذَا ہُمۡ مِّنۡہَا یَرۡکُضُوۡنَ ﴿ؕ۱۳﴾", "english": " And when they felt Our punishment, lo, they began to flee from it.", "french": " Et quand ils sentirent Notre châtiment, voilà qu’ils se mirent à s’enfuir.", "german": " Und da sie Unsere Strafe verspürten, siehe, da begannen sie davor zu fliehen.", "spanish": " Mas cuando advirtieron Nuestro castigo, he ahí que empezaron a huir de ella.", "urdu": " پس جب (ہلاک ہونے والے لوگوں نے) ہمارے عذاب کو محسوس کیا تو لگے (اس سے بچنے کے لئے) دوڑنے۔"}, {"arabic": " لَا تَرۡکُضُوۡا وَ ارۡجِعُوۡۤا اِلٰی مَاۤ اُتۡرِفۡتُمۡ فِیۡہِ وَ مَسٰکِنِکُمۡ لَعَلَّکُمۡ تُسۡـَٔلُوۡنَ ﴿۱۴﴾", "english": " ‘Flee not, but return to the comforts in which you exulted, and to your dwellings that you might be approached and consulted as before .’", "french": " « Ne fuyez pas, mais retournez aux conforts dans lesquels vous jubiliez, et à vos habitations afin qu’on vous fasse rendre des comptes. »", "german": " Fliehet nicht, sondern kehret zurück zu dem Behagen, das ihr genießen durftet, und zu euren Wohnstätten, damit ihr befragt werdet.", "spanish": " “No huyáis, sino volved a las comodidades en las que os alborozabais, y a vuestras viviendas, para que seáis convocados a rendir cuentas” .", "urdu": " (تب ہم نے کہا) دوڑو نہیں‘ اور ان چیزوں کی طرف جن کے ذریعہ سے تم آرام کی زندگی بسر کرتے تھے اور اپنے گھروں کی طرف واپس جاٶ تا کہ تم سے تمہارے اعمال کے متعلق سوال کیا جائے۔"}, {"arabic": " قَالُوۡا یٰوَیۡلَنَاۤ اِنَّا کُنَّا ظٰلِمِیۡنَ ﴿۱۵﴾", "english": " They said, ‘Alas for us, we were indeed wrongdoers!’", "french": " Ils dirent : « Hélas pour nous ! En vérité nous étions des injustes ! »", "german": " Sie sprachen: \"O weh uns, wir waren wahrlich Frevler!\"", "spanish": " Respondieron: “¡Ay de nosotros, fuimos en verdad injustos!”.", "urdu": " اس کا انہوں نے یہ جواب دیا کہ اے افسوس! ہم تو (عمر بھر) ظلم ہی کرتے رہے۔"}, {"arabic": " فَمَا زَالَتۡ تِّلۡکَ دَعۡوٰٮہُمۡ حَتّٰی جَعَلۡنٰہُمۡ حَصِیۡدًا خٰمِدِیۡنَ ﴿۱۶﴾", "english": " And this ceased not to be their cry till We mowed them down, reduced to ashes.", "french": " Et ceci ne cessa d’être leur cri jusqu’à ce que Nous les eûmes fauchés et réduits en cendres.", "german": " Und dieser ihr Ruf hörte nicht eher auf, als bis Wir sie niedermähten, in Asche verwandelnd.", "spanish": " Y éste no dejó de ser su lamento hasta que los segamos, reduciéndolos a cenizas.", "urdu": " اور وہ یہی بات کہتے چلے گئے‘ یہاں تک کہ ہم نے ان کو ایک کٹی ہوئی کھیتی کی طرح کر دیا۔ جس کی سب رونق برباد ہو چکی تھی۔"}, {"arabic": " وَ مَا خَلَقۡنَا السَّمَآءَ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَا لٰعِبِیۡنَ ﴿۱۷﴾", "english": " And We created not the heaven and the earth and all that is between the two in play.", "french": " Et Nous n’avons pas créé par jeu le ciel et la terre, et tout ce qui se trouve entre les deux.", "german": " Wir erschufen den Himmel und die Erde und was zwischen beiden ist nicht zum Spiel.", "spanish": " Pues no creamos el cielo y la tierra y todo lo que hay entre ambos como pasatiempo.", "urdu": " اور ہم نے آسمان کو اور زمین کو اور جو کچھ ان دونوں کے درمیان ہے۔ محض کھیل کے طور پر پید انہیں کیا (بلکہ ان کی پیدائش میں حکمت تھی)۔"}, {"arabic": " لَوۡ اَرَدۡنَاۤ اَنۡ نَّتَّخِذَ لَہۡوًا لَّاتَّخَذۡنٰہُ مِنۡ لَّدُنَّاۤ ٭ۖ اِنۡ کُنَّا فٰعِلِیۡنَ ﴿۱۸﴾", "english": " If We had wished to find a pastime, We would surely have found it in what is with Us if at all We were to do such a thing .", "french": " Si Nous avions désiré trouver un passe-temps, Nous l’aurions assurément trouvé dans ce qui est avec Nous, si jamais Nous devions faire une chose pareille .", "german": " Hätten Wir Uns einen Zeitvertreib schaffen wollen, so konnten Wir ihn wohl mit Uns treiben, wenn Wir das überhaupt wollten.", "spanish": " Si hubiésemos deseado encontrar un pasatiempo, lo habríamos encontrado ciertamente en lo que está en Nosotros, si es que fuéramos a hacer una cosa así.", "urdu": " اگر ہم نے کوئی دل بہلاوا ہی تجویز کرنا ہوتا‘ تو اس کو اپنے قرب میں تجویز کرتے۔"}, {"arabic": " بَلۡ نَقۡذِفُ بِالۡحَقِّ عَلَی الۡبَاطِلِ فَیَدۡمَغُہٗ فَاِذَا ہُوَ زَاہِقٌ ؕ وَ لَکُمُ الۡوَیۡلُ مِمَّا تَصِفُوۡنَ ﴿۱۹﴾", "english": " Nay, We hurl the truth at falsehood, and it breaks its head, and lo, it perishes. And woe be to you for that which you ascribe to God .", "french": " Bien au contraire, Nous lançons la vérité contre la fausseté, et elle lui brise la tête, et voilà qu’elle périt ! Et malheur à vous pour ce que vous attribuez à Allāh .", "german": " Nein, Wir schleudern die Wahrheit wider die Lüge, und sie zerschmettert ihr das Haupt, und siehe, sie vergeht. Und wehe euch ob dessen, was ihr aussagt!", "spanish": " No, con la verdad refutamos la falsedad, rompiendo así su cabeza, y e ahí que perece. Pues ¡ay de vosotros! por lo que achacáis a Dios.", "urdu": " لیکن ہم تو حق کو باطل پر اٹھا مارتے ہیں اور وہ اس کا سر توڑ دیتا ہے اور وہ (باطل) فوراً ہی بھاگ جاتا ہے اور تم پر تمہاری باتوں کی وجہ سے افسوس ہے۔"}, {"arabic": " وَ لَہٗ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ مَنۡ عِنۡدَہٗ لَا یَسۡتَکۡبِرُوۡنَ عَنۡ عِبَادَتِہٖ وَ لَا یَسۡتَحۡسِرُوۡنَ ﴿ۚ۲۰﴾", "english": " To Him belongs whosoever is in the heavens and the earth. And those who are in His presence do not disdain to worship Him, nor do they weary;", "french": " A Lui appartient quiconque est dans les cieux et sur la terre. Et ceux qui se trouvent en Sa présence ne dédaignent pas de L’adorer, et ils ne s’ en lassent pas ;", "german": " Sein ist, wer in den Himmeln und auf der Erde ist. Und die bei Ihm sind, die sind nicht zu stolz, Ihm zu dienen, noch werden sie müde;", "spanish": " A Él pertenece todo lo que hay en los cielos y en la tierra. Y quienes están en Su presencia no desdeñan adorarlo, ni se cansan;", "urdu": " اور جو وجود بھی آسمان میں ہیں اور زمین میں ہیں سب اسی کے ہیں اور جو اس کے پاسہیں وہ اس کی عبادت سے سرتابی نہیں کرتے اور نہ (اس سے) تھکتے ہیں۔"}, {"arabic": " یُسَبِّحُوۡنَ الَّیۡلَ وَ النَّہَارَ لَا یَفۡتُرُوۡنَ ﴿۲۱﴾", "english": " They glorify Him night and day; and they flag not.", "french": " Ils Le glorifient nuit et jour ; et ils ne faiblissent pas.", "german": " sie verherrlichen (Ihn) Nacht und Tag; sie lassen nicht nach.", "spanish": " Lo glorifican día y noche; y no desfallecen.", "urdu": " وہ رات کو بھی اور دن کو بھی تسبیح کرتے ہیں اور وہ اس سے رکتے نہیں۔"}, {"arabic": " اَمِ اتَّخَذُوۡۤا اٰلِہَۃً مِّنَ الۡاَرۡضِ ہُمۡ یُنۡشِرُوۡنَ ﴿۲۲﴾", "english": " Have they taken gods from the earth who raise the dead?", "french": " Ont-ils pris sur la terre des dieux qui ressuscitent les morts ?", "german": " Haben sie sich Götter von der Erde angenommen, die lebendig machen?", "spanish": " ¿Han tomado dioses de la tierra que resuciten a los muertos?", "urdu": " کیا ان لوگوں نے زمین میں سے معبود بنا لیے ہیں؟ اور وہ (مخلوقات) پیدا کرتے ہیں۔"}, {"arabic": " لَوۡ کَانَ فِیۡہِمَاۤ اٰلِہَۃٌ اِلَّا اللّٰہُ لَفَسَدَتَا ۚ فَسُبۡحٰنَ اللّٰہِ رَبِّ الۡعَرۡشِ عَمَّا یَصِفُوۡنَ ﴿۲۳﴾", "english": " If there had been in them (the heavens and the earth) other gods beside Allah, then surely both would have gone to ruin. Glorified then be Allah, the Lord of the Throne, above what they attribute.", "french": " S’il y avait eu dans ces deux, au ciel et sur terre , des dieux autres qu’Allāh, alors sûrement les deux auraient fini dans le chaos. Aussi gloire à Allāh, le Seigneur du Trône, bien au-dessus de ce qu’ils Lui attribuent.", "german": " Gäbe es in ihnen (Himmel und Erde) Götter außer Allah, dann wären wahrlich beide zerrüttet. Gepriesen sei denn Allah, der Herr des Thrones, hoch erhaben über das, was sie aussagen!", "spanish": " Si hubiese habido en ellos ( los cielos y la tierra ) otros ioses distintos a Al-lah, ciertamente ambos, los cielos y la tierra , habrían terminado en el caos. Glorificado sea pues Al-lah, el Señor del Trono, por encima de lo que ellos Le atribuyen.", "urdu": " اگر ان دونوں (یعنی زمین و آسمان) میں اللہ کے سوا اور بھی معبود ہوتے تو یہ دونوں تباہ ہو جاتے۔ پس اللہ جو عرش کا بھی رب ہے تمام نقصوں سے پاک ہے اور ان (باتوں) سے بھی جو وہ کہتے ہیں۔"}, {"arabic": " لَا یُسۡـَٔلُ عَمَّا یَفۡعَلُ وَ ہُمۡ یُسۡـَٔلُوۡنَ ﴿۲۴﴾", "english": " He cannot be questioned as to what He does, but they will be questioned.", "french": " Il ne peut être questionné sur ce qu’Il fait, mais eux seront questionnés.", "german": " Er kann nicht befragt werden nach dem, was Er tut, sie aber werden befragt werden.", "spanish": " A Él no se le puede interrogar sobre lo que hace, pero ellos sí serán interrogados.", "urdu": " جو کچھ وہ کرتا ہے اس کے متعلق وہ کسی کو جواب دہ نہیں ہوتا۔ حالانکہ وہ (لوگ) جواب دہ ہوتے ہیں۔"}, {"arabic": " اَمِ اتَّخَذُوۡا مِنۡ دُوۡنِہٖۤ اٰلِہَۃً ؕ قُلۡ ہَاتُوۡا بُرۡہَانَکُمۡ ۚ ہٰذَا ذِکۡرُ مَنۡ مَّعِیَ وَ ذِکۡرُ مَنۡ قَبۡلِیۡ ؕ بَلۡ اَکۡثَرُہُمۡ لَا یَعۡلَمُوۡنَ ۙ الۡحَقَّ فَہُمۡ مُّعۡرِضُوۡنَ ﴿۲۵﴾", "english": " Have they taken gods beside Him? Say, ‘Bring forth your proof. Here is the Book of those with me, and the Book of those before me.’ Nay, most of them know not the truth, and so they turn away.", "french": " Ont-ils pris des dieux en dehors de Lui ? Dis : « Produisez vos preuves. Ce Coran est un e source d ’honneur pour ceux qui sont avec moi, un e source d ’honneur pour ceux qui m’ont devancé. » Mais la plupart d’entre eux ne savent pas la vérité, et ainsi ils s’ en détournent.", "german": " Haben sie sich Götter angenommen außer Ihm? Sprich: \"Bringt euren Beweis herbei. Dieser (Qur-ân) ist eine Ehre für jene, die mit mir sind, und eine Ehre für die, die vor mir waren.\" Doch die meisten von ihnen kennen die Wahrheit nicht, und so wenden sie sich ab.", "spanish": " ¿Han tomado a dioses aparte de Él? Diles: “Presentad vuestra prueba. Aquí está el Libro de los que están conmigo y el Libro de quienes me precedieron”. ¡No!, la mayoría de ellos desconocen la verdad, y por eso se extravían.", "urdu": " کیا انہوں نے اس کے سوا معبود بنا لئے ہیں؟ تو کہہ دے اپنی دلیل لاٶ۔ یہ (قرآن) تو ان کے لئے بھی جو میرے ساتھ ہیں شرف کا موجب ہے‘ اور جو مجھ سے پہلے گذر چکے ہیں ان کے لئے بھی شرف کا موجب ہے لیکن ان میں سے اکثر حق کو پہچانتے نہیں اس لیے اس سے اعراض کرتے ہیں۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنَا مِنۡ قَبۡلِکَ مِنۡ رَّسُوۡلٍ اِلَّا نُوۡحِیۡۤ اِلَیۡہِ اَنَّہٗ لَاۤ اِلٰہَ اِلَّاۤ اَنَا فَاعۡبُدُوۡنِ ﴿۲۶﴾", "english": " And We sent no Messenger before thee but We revealed to him, saying , ‘There is no God but I; so worship Me alone .’", "french": " Et Nous n’avons envoyé aucun Messager avant toi à qui Nous n’ayons révélé : « Il n’y a de dieu que Moi ; alors adorez-Moi S eul . »", "german": " Und Wir schickten keinen Gesandten vor dir, dem Wir nicht offenbart: \"Es gibt keinen Gott außer Mir; darum dienet nur Mir.\"", "spanish": " Y no enviamos a ningún Mensajero antes de ti al que no le reveláramos, diciéndole : “No hay otro Dios sino Yo; adoradme pues a Mí sólo” .", "urdu": " اور ہم نے تجھ سے پہلے جتنے بھی رسول بھیجے ہیں ہم ان میں سے ہر ایک کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میں ایک ہی خدا ہوں۔ پس (صرف) میری عبادت کرو۔"}, {"arabic": " وَ قَالُوا اتَّخَذَ الرَّحۡمٰنُ وَلَدًا سُبۡحٰنَہٗ ؕ بَلۡ عِبَادٌ مُّکۡرَمُوۡنَ ﴿ۙ۲۷﴾", "english": " And they say, ‘The Gracious God has taken to Himself a son.’ Holy is He. Nay, they are only honoured servants.", "french": " Et ils disent : « Le Dieu Gracieux S’est pris un fils. » Saint est-Il. Non, ce sont des serviteurs honorés.", "german": " Und sie sprechen: \"Der Gnadenreiche hat Sich einen Sohn zugesellt.\" Heilig ist Er! Nein, aber sie sind (nur) geehrte Diener.", "spanish": " Ellos dicen: “El Dios Clemente ha tomado un hijo”. ¡Santo es Él!, ellos no son más que siervos honorables.", "urdu": " اور (یہ لوگ) کہتے ہیں کہ رحمن (خدا) نے بیٹا بنا لیا ہے (ان کی بات درست نہیں) وہ تو ہر کمزوری سے پاک ہے۔ حقیقت یہ ہے کہ (جن کو یہ بیٹا کہتے ہیں) وہ خدا کے کچھ بندے ہیں جن کو خدا کی طرف سے عزت ملی ہے۔"}, {"arabic": " لَا یَسۡبِقُوۡنَہٗ بِالۡقَوۡلِ وَ ہُمۡ بِاَمۡرِہٖ یَعۡمَلُوۡنَ ﴿۲۸﴾", "english": " They speak not before He speaks, and they act only by His command.", "french": " Ils ne parlent pas avant qu’Il ne parle, et ils agissent selon Son commandement.", "german": " Sie sprechen vor Ihm kein Wort, und sie handeln nur nach Seinem Befehl.", "spanish": " Ellos no hablan antes de que lo haga Él, y sólo actúan siguiendo Su Mandato.", "urdu": " وہ خدا کی بات سے ایک لفظ بھی زیادہ نہیں کہتے اور وہ اس کے حکموں پر عمل کرتے ہیں۔"}, {"arabic": " یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ وَ لَا یَشۡفَعُوۡنَ ۙ اِلَّا لِمَنِ ارۡتَضٰی وَ ہُمۡ مِّنۡ خَشۡیَتِہٖ مُشۡفِقُوۡنَ ﴿۲۹﴾", "english": " He knows what is before them and what is behind them, and they intercede not except for him whom He approves, and they act cautiously for fear of Him.", "french": " Il sait ce qui est devant eux et ce qui est derrière eux, et ils n’intercèdent pas sauf pour celui dont Allāh est satisfait, et ils sont constamment en garde contre les péchés par crainte de Lui.", "german": " Er weiß, was vor ihnen und was hinter ihnen ist, und sie legen nicht Fürbitte ein, außer für den, der Ihm genehm ist, und sie zittern in Furcht vor Ihm.", "spanish": " Él sabe lo que hay delante de ellos y tras ellos, y no interceden excepto por aquel a quien Él aprueba, y actúan con precaución por temor a Él.", "urdu": " وہ (خدا) اس کو بھی جانتا ہے جو انہیں آئندہ پیش آنے والا ہے اور جو وہ پیچھے چھوڑ آئے ہیں اور وہ سوائے اس کے جس کے لئے خدا نے یہ بات پسند کی ہو کسی کے لئے شفاعت نہیں کرتے اور وہ اس کے خوف سے لرزتے رہتے ہیں۔"}, {"arabic": " وَ مَنۡ یَّقُلۡ مِنۡہُمۡ اِنِّیۡۤ اِلٰہٌ مِّنۡ دُوۡنِہٖ فَذٰلِکَ نَجۡزِیۡہِ جَہَنَّمَ ؕ کَذٰلِکَ نَجۡزِی الظّٰلِمِیۡنَ ﴿٪۳۰﴾", "english": " And whosoever of them should say, ‘I am a God beside Him,’ him shall We requite with Hell. Thus do We requite the wrongdoers.", "french": " Et quiconque d’entre eux dirait : « Je suis un dieu en dehors de Lui, » celui-là Nous le paierons avec l’Enfer. C’est ainsi que Nous rétribuons les injustes.", "german": " Und wer von ihnen sagen wollte: \"Ich bin ein Gott neben Ihm\", dem würden Wir es mit der Hölle vergelten. Also vergelten Wir den Frevlern.", "spanish": " Mas quienquiera de ellos que diga: “Soy dios además de Él”, será castigado con el Infierno. Así recompensamos a los injustos.", "urdu": " اور جو بھی ان میں سے یہ کہے کہ میں خدا کے سوا معبود ہوں ہم اس کو جہنم میں ڈالیں گے اور ہم ظالموں کو ایسا ہی بدلہ دیا کرتے ہیں۔"}, {"arabic": " اَوَ لَمۡ یَرَ الَّذِیۡنَ کَفَرُوۡۤا اَنَّ السَّمٰوٰتِ وَ الۡاَرۡضَ کَانَتَا رَتۡقًا فَفَتَقۡنٰہُمَا ؕ وَ جَعَلۡنَا مِنَ الۡمَآءِ کُلَّ شَیۡءٍ حَیٍّ ؕ اَفَلَا یُؤۡمِنُوۡنَ ﴿۳۱﴾", "english": " Do not the disbelievers see that the heavens and the earth were a closed-up mass , then We opened them out? And We made from water every living thing. Will they not then believe?", "french": " Les mécréants ne voient-ils pas que les cieux et la terre étaient une masse fermée et qu’ensuite Nous les avons séparés ? Et Nous avons fait chaque chose vivante à partir de l’eau. Ne veulent-ils donc pas croire ?", "german": " Haben die Ungläubigen nicht gesehen, dass die Himmel und die Erde in einem einzigen Stück waren, dann zerteilten Wir sie? Und Wir machten aus Wasser alles Lebendige. Wollen sie denn nicht glauben?", "spanish": " ¿No ven los incrédulos que los cielos y la tierra eran una masa compacta, que posteriormente disgregamos? Nosotros creamos del agua a todo ser vivo. ¿Acaso no creerán?", "urdu": " کیا کفار نے یہ نہیں دیکھا کہ آسمان اور زمین دونوں بند تھے‘ پس ہم نے ان کو کھول دیا اور ہم نے پانی سے ہر زندہ چیز کو زندہ کیا ہے۔ پس کیا وہ ایمان نہیں لاتے؟"}, {"arabic": " وَ جَعَلۡنَا فِی الۡاَرۡضِ رَوَاسِیَ اَنۡ تَمِیۡدَ بِہِمۡ ۪ وَ جَعَلۡنَا فِیۡہَا فِجَاجًا سُبُلًا لَّعَلَّہُمۡ یَہۡتَدُوۡنَ ﴿۳۲﴾", "english": " And We have made in the earth firm mountains lest it should quake with them; and We have made therein wide pathways, that they may be rightly guided.", "french": " Et Nous avons placé sur la terre des montagnes solidement ancrées afin qu’elles fournissent aux hommes leur subsistance, et Nous y avons tracé de larges chemins afin qu’ils puissent être bien orientés.", "german": " Und feste Berge haben Wir in der Erde gemacht, auf dass sie nicht mit ihnen wanke; und breite Straßen schufen Wir auf ihr, damit sie die rechte Richtung befolgen möchten.", "spanish": " Pusimos en la tierra montañas firmes para sostenerles; e hicimos en ellas anchos pasos para que fuesen rectamente guiados.", "urdu": " اور ہم نے زمین میں پہاڑ بنائے تا ایسا نہ ہو کہ وہ (یعنی زمین) ان (یعنی اہل زمین) سمیت شدید زلزلہ میں مبتلا ہو جائے۔ اور ہم نے زمین میں کھلے کھلے راستے بھی بنائے تا کہ یہ لوگ ان کے ذریعہ سے (مختلف مقامات تک) پہنچیں۔"}, {"arabic": " وَ جَعَلۡنَا السَّمَآءَ سَقۡفًا مَّحۡفُوۡظًا ۚۖ وَّ ہُمۡ عَنۡ اٰیٰتِہَا مُعۡرِضُوۡنَ ﴿۳۳﴾", "english": " And We have made the heaven a roof, well protected; yet they turn away from its Signs.", "french": " Et Nous avons fait du ciel un toit sûr ; cependant, ils se détournent de ses Signes.", "german": " Und Wir machten den Himmel zu einem wohlgeschützten Dach; dennoch kehren sie sich ab von seinen Zeichen.", "spanish": " Hemos creado al cielo como dosel protector; y sin embargo se apartan de sus Signos.", "urdu": " اور ہم نے آسمان کو ایک مضبوط چھت (یعنی حفاظت کا ذریعہ) بنایا ہے اور پھر بھی وہ اس کے نشانوں (یعنی آسمان سے ظاہر ہونے والے نشانوں) سے (جو ان کے فائدہ کے لئے ہیں) اعراض کرتے ہیں۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ خَلَقَ الَّیۡلَ وَ النَّہَارَ وَ الشَّمۡسَ وَ الۡقَمَرَ ؕ کُلٌّ فِیۡ فَلَکٍ یَّسۡبَحُوۡنَ ﴿۳۴﴾", "english": " And He it is Who created the night and the day, and the sun and the moon, each gliding along in its orbit.", "french": " Et c’est Lui Qui créa la nuit et le jour, et le soleil et la lune, chacun voguant dans une orbite séparée .", "german": " Und Er ist es, Der die Nacht und den Tag erschuf und die Sonne und den Mond. Sie schweben, ein jedes in (seiner) Sphäre.", "spanish": " Él es Quien creó la noche y el día; el sol y la luna; siguiendo cada uno suavemente su órbita.", "urdu": " اور وہی ہے جس نے رات اور دن کو اور سورج اور چاند کو پیدا کیا ہے یہ سب (آسمانی سیارے) اپنے اپنے محور میں بے روک چل رہے ہیں۔"}, {"arabic": " وَ مَا جَعَلۡنَا لِبَشَرٍ مِّنۡ قَبۡلِکَ الۡخُلۡدَ ؕ اَفَا۠ئِنۡ مِّتَّ فَہُمُ الۡخٰلِدُوۡنَ ﴿۳۵﴾", "english": " We granted not everlasting life to any human being before thee. If then thou shouldst die, shall they live here for ever?", "french": " Nous n’avons accordé la vie éternelle à aucun être humain avant toi. Si donc tu devais mourir, vivront-ils ici-bas éternellement ?", "german": " Wir gewährten keinem Menschenwesen vor dir immerwährendes Leben. Drum, wenn du sterben solltest, können sie immerwährend leben?", "spanish": " Antes de ti no hemos concedido una vida eterna a ningún mortal. Y si luego murieras, ¿acaso habrían de vivir ellos aquí para siempre?", "urdu": " اور ہم نے کسی انسان کو تجھ سے پہلے غیرطبعی عمر نہیں بخشی۔ کیا اگر تو مر جائے تو وہ غیر طبعی عمر تک زندہ رہیں گے۔"}, {"arabic": " کُلُّ نَفۡسٍ ذَآئِقَۃُ الۡمَوۡتِ ؕ وَ نَبۡلُوۡکُمۡ بِالشَّرِّ وَ الۡخَیۡرِ فِتۡنَۃً ؕ وَ اِلَیۡنَا تُرۡجَعُوۡنَ ﴿۳۶﴾", "english": " Every soul shall taste of death; and We prove you with evil and good by way of trial. And to Us shall you be returned.", "french": " Chaque âme goûtera la mort ; et Nous vous testons avec le mal et le bien comme une épreuve. Et c’est à Nous que vous serez ramenés.", "german": " Jedes Lebewesen soll den Tod kosten; und Wir stellen euch auf die Probe mit Bösem und Gutem als eine Prüfung; und zu Uns sollt ihr zurückgebracht werden.", "spanish": " Toda alma probará el gusto de la muerte; y os tentaremos con el mal y el bien a modo de prueba. Pues a Nosotros volveréis.", "urdu": " ہر جان موت چکھنے والی ہے۔ اور ہم تمہاری برے اور اچھے حالات سے آزمائش کریں گے اور آخر ہماری طرف ہی تم کو لوٹا کر لایا جائے گا۔"}, {"arabic": " وَ اِذَا رَاٰکَ الَّذِیۡنَ کَفَرُوۡۤا اِنۡ یَّتَّخِذُوۡنَکَ اِلَّا ہُزُوًا ؕ اَہٰذَا الَّذِیۡ یَذۡکُرُ اٰلِہَتَکُمۡ ۚ وَ ہُمۡ بِذِکۡرِ الرَّحۡمٰنِ ہُمۡ کٰفِرُوۡنَ ﴿۳۷﴾", "english": " And when the disbelievers see thee, they only make a jest of thee. They say : ‘Is this the one who makes an evil mention of your gods?’ While it is they themselves who reject with disdain the mention of the Gracious God .", "french": " Et quand les mécréants te voient, ils ne font que se moquer de toi. Ils disent : « Est-ce celui qui dit du mal de vos dieux ? » Alors que ce sont eux qui nient toute mention du Dieu Gracieux.", "german": " Wenn die Ungläubigen dich sehen, so treiben sie nur Spott mit dir: \"Ist das der, der eurer Götter Erwähnung tut?\", während sie es doch selbst sind, die der Erwähnung des Gnadenreichen ausweichen.", "spanish": " Mas cuando los incrédulos te ven no hacen más que burlarse de ti, y dicen: “¿Es éste quien habla mal de vuestros dioses?”. Cuando son ellos mismos quienes rechazan con desdén la mención del Dios Clemente.", "urdu": " اور جب تجھے کفار دیکھتے ہیں تو تجھ کو صرف ایک حقیر چیز سمجھتے ہیں (اور کہتے ہیں) کیا یہی شخص ہے جو تمہارے معبودوں کی کمزوریاں گناتا ہے۔ حالانکہ وہ خود رحمن (خدا) کے ذکر کا انکار کرتے ہیں۔"}, {"arabic": " خُلِقَ الۡاِنۡسَانُ مِنۡ عَجَلٍ ؕ سَاُورِیۡکُمۡ اٰیٰتِیۡ فَلَا تَسۡتَعۡجِلُوۡنِ ﴿۳۸﴾", "english": " Man is made of haste. I will certainly show you My Signs but ask Me not to hasten.", "french": " L’homme a été créé du levain de l’impatience. Je vous montrerai certainement Mes Signes, mais ne Me demandez pas de Me hâter.", "german": " Der Mensch ist aus Übereilung gemacht. Ich werde euch Meine Zeichen zeigen, aber fordert nicht von Mir, dass ich Mich übereile.", "spanish": " El hombre está hecho de impaciencia. Os mostraré ciertamente Mis Signos pero no me pidáis que Me apresure.", "urdu": " انسان کے اندر جلد بازی کا مادہ رکھا گیا ہے‘ سو (یاد رکھو) میں تم کو اپنے نشان دکھاٶں گا‘ پس تم جلد بازی سے کام نہ لو۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ مَتٰی ہٰذَا الۡوَعۡدُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۳۹﴾", "english": " And they say, ‘When will this promise be fulfilled , if you are truthful?’", "french": " Et ils disent : « Quand cette promesse sera-t-elle accomplie , si vous êtes véridiques ? »", "german": " Und sie sagen: \"Wann wird diese Verheißung (in Erfüllung gehen), wenn ihr wahrhaftig seid?\"", "spanish": " Y dicen: “¿Cuándo se cumplirá esta promesa, si sois veraces?”.", "urdu": " اور یہ (سن کر) وہ کہتے ہیں کہ اگر تم لوگ (یعنی مسلمان) سچے ہو تو یہ وعدہ کب پورا ہوگا؟"}, {"arabic": " لَوۡ یَعۡلَمُ الَّذِیۡنَ کَفَرُوۡا حِیۡنَ لَا یَکُفُّوۡنَ عَنۡ وُّجُوۡہِہِمُ النَّارَ وَ لَا عَنۡ ظُہُوۡرِہِمۡ وَ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿۴۰﴾", "english": " If only the disbelievers knew the time when they will not be able to keep off the fire from their faces nor from their backs, and they will not be helped!", "french": " Si seulement les mécréants étaient au courant du moment où ils ne pourront repousser le feu ni de leur visage ni de leur dos, et où ils ne seront pas secourus !", "german": " Wenn die Ungläubigen nur die Zeit wüssten, wo sie nicht imstande sein werden, das Feuer von ihren Gesichtern oder von ihren Rücken fernzuhalten, und keine Hilfe wird ihnen zuteil!", "spanish": " ¡Si al menos los incrédulos supieran del momento en que no podrán alejar el fuego de sus rostros ni de sus espaldas, y no recibirán ayuda alguna!", "urdu": " اگر کفار اس گھڑی کو جان لیتے جب کہ وہ نہ اپنے مونہوں سے اور نہ اپنی پیٹھوں سے آگ کو ہٹا سکیں گے اور نہ کسی کی طرف سے ان کی مدد کی جائے گی (تو وہ اتنی تعلّی نہ کرتے) ۔"}, {"arabic": " بَلۡ تَاۡتِیۡہِمۡ بَغۡتَۃً فَتَبۡہَتُہُمۡ فَلَا یَسۡتَطِیۡعُوۡنَ رَدَّہَا وَ لَا ہُمۡ یُنۡظَرُوۡنَ ﴿۴۱﴾", "english": " Nay, it will come upon them unawares so that it will utterly confound them; and they will not be able to repel it, nor will they be given respite.", "french": " Non, cela leur surviendra à l’improviste et les confondra complètement ; et ils ne pourront pas le repousser, et aucun répit ne leur sera accordé non plus.", "german": " Nein, es wird über sie kommen unversehens, so dass es sie in Verwirrung stürzt; und sie werden es nicht abwehren können, noch werden sie Aufschub erlangen.", "spanish": " ¡No!, vendrá sobre ellos inopinadamente, por lo que los confundirá totalmente; y no podrán resistirlo ni se les dará respiro.", "urdu": " لیکن (وہ عذاب) ان کے پاس اچانک آئے گا اور ان کو حیران کر دے گا پس وہ اس کو رد ّکرنے کی طاقت نہیں رکھیں گے اور نہ ان کو (کوئی) مہلت دی جائے گی۔"}, {"arabic": " وَ لَقَدِ اسۡتُہۡزِئَ بِرُسُلٍ مِّنۡ قَبۡلِکَ فَحَاقَ بِالَّذِیۡنَ سَخِرُوۡا مِنۡہُمۡ مَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿٪۴۲﴾", "english": " And Messengers have indeed been mocked at before thee, but that whereat they mocked encompassed those of them who scoffed.", "french": " Et en vérité des Messagers avant toi ont été raillés, mais ce dont ils se moquaient a cerné les railleurs d’entre eux.", "german": " Es sind fürwahr schon vor dir Gesandte verspottet worden, dann aber traf jene, die gehöhnt, das, worüber sie spotteten.", "spanish": " Antes de ti los Mensajeros fueron ciertamente escarnecidos, pero aquello de lo que se burlaban rodeó a quienes se mofaron.", "urdu": " اور تجھ سے پہلے جو رسول گذرے ہیں ان سے بھی ہنسی کی گئی تھی‘ لیکن نتیجہ یہ ہوا کہ جنہوں نے ان رسولوں سے ہنسی کی تھی ان کو انہی باتوں نے آکر گھیر لیا جن کے ذریعہ سے وہ نبیوں کی ہنسی اڑاتے تھے۔"}, {"arabic": " قُلۡ مَنۡ یَّکۡلَؤُکُمۡ بِالَّیۡلِ وَ النَّہَارِ مِنَ الرَّحۡمٰنِ ؕ بَلۡ ہُمۡ عَنۡ ذِکۡرِ رَبِّہِمۡ مُّعۡرِضُوۡنَ ﴿۴۳﴾", "english": " Say, ‘Who can protect you by night and by day from the Gracious God ?’ Yet they turn away from the remembrance of their Lord.", "french": " Dis : « Qui peut vous protéger la nuit et le jour contre le châtiment du Dieu Gracieux ? » Néanmoins ils se détournent du souvenir de leur Seigneur.", "german": " Sprich: \"Wer beschützt euch vor dem Gnadenreichen bei Nacht und bei Tag?\" Und doch kehren sie sich ab von der Ermahnung ihres Herrn.", "spanish": " Diles: “¿quién puede protegeros de día y de noche del Dios Clemente?”. Y sin embargo se alejan del recuerdo de su Señor.", "urdu": " تو کہہ دے کہ رات یا دن کے وقت رحمن (خدا) کی گرفت سے تم کو کون بچا سکتا ہے لیکن (حقیقت یہ ہے کہ) وہ اپنے رب کے ذکر سے اعراض کر رہے ہیں۔"}, {"arabic": " اَمۡ لَہُمۡ اٰلِہَۃٌ تَمۡنَعُہُمۡ مِّنۡ دُوۡنِنَا ؕ لَا یَسۡتَطِیۡعُوۡنَ نَصۡرَ اَنۡفُسِہِمۡ وَ لَا ہُمۡ مِّنَّا یُصۡحَبُوۡنَ ﴿۴۴﴾", "english": " Have they any gods that can protect them beside Us? They cannot help themselves, nor can they be befriended by any one against Us.", "french": " Ont-ils des dieux qui peuvent les protéger en dehors de Nous ? Ils ne peuvent s’aider eux-mêmes, non plus qu’ils ne peuvent être pris en amitié par quiconque contre Nous.", "german": " Haben sie etwa Götter, die sie beschützen können vor Uns? Sie vermögen sich selbst nicht zu helfen, noch kann ihnen geholfen werden wider Uns.", "spanish": " ¿Tienen acaso dioses que puedan protegerlos aparte de Nosotros? No pueden ayudarse a sí mismos ni serán protegidos por nadie contra Nosotros.", "urdu": " کیا ان کی تائید میں کوئی (سچے) معبود ہیں جو ان کو ہمارے عذاب سے بچالیں گے؟ وہ (معبود) تو اپنی جانوں کی بھی حفاظت نہیں کر سکتے اور نہ ہمارے مقابلہ میں کوئی ان کا ساتھ دے سکتا ہے۔"}, {"arabic": " بَلۡ مَتَّعۡنَا ہٰۤؤُلَآءِ وَ اٰبَآءَہُمۡ حَتّٰی طَالَ عَلَیۡہِمُ الۡعُمُرُ ؕ اَفَلَا یَرَوۡنَ اَنَّا نَاۡتِی الۡاَرۡضَ نَنۡقُصُہَا مِنۡ اَطۡرَافِہَا ؕ اَفَہُمُ الۡغٰلِبُوۡنَ ﴿۴۵﴾", "english": " Nay, We provided those and their fathers with the good things of this world till life grew long for them. Do they not see that We are visiting the land, reducing it from its outlying borders? Can they even then be victors?", "french": " Non, Nous avons accordé à ceux-là et à leurs pères la jouissance des bénéfices temporaires jusqu’à ce que la vie devint longue pour eux. Ne voient-ils pas que Nous nous avançons sur leur territoire, en le réduisant à partir de ses parties éloignées ? Peuvent-ils malgré cela avoir le dessus ?", "german": " Nein, Wir versorgten diese, und ihre Vorväter während ihres langen Lebens. Sehen sie denn nicht, dass Wir in das Land kommen und es einengen an seinen Enden? Können sie denn obsiegen?", "spanish": " ¡No!, Nosotros les proporcionamos a ellos y a sus padres las cosas buenas de este mundo hasta que se les alargó la vida. ¿Acaso no ven que estamos visitando el país, reduciéndolo de sus fronteras exteriores? ¿Pueden acaso ser ellos los vencedores?", "urdu": " حقیقت یہ ہے کہ ہم نے ان کو بھی اور ان کے باپ دادوں کو بھی بہت سا مال و متاع دے رکھا تھا۔ یہاں تک کہ ان پر ایک لمبا زمانہ گذر گیا۔ پس کیا یہ نہیں دیکھتے کہ ہم ان کے ملک کی طرف بڑھ رہے ہیں اور کناروں کی طرف سے اس کو چھوٹا کرتے جا رہے ہیں۔ تو کیا (اس سے یہی نتیجہ نکلتا ہے کہ) وہ غالب آئیں گے؟"}, {"arabic": " قُلۡ اِنَّمَاۤ اُنۡذِرُکُمۡ بِالۡوَحۡیِ ۫ۖ وَ لَا یَسۡمَعُ الصُّمُّ الدُّعَآءَ اِذَا مَا یُنۡذَرُوۡنَ ﴿۴۶﴾", "english": " Say, ‘I warn you not but according to divine revelation.’ But the deaf cannot hear the call when they are warned.", "french": " Dis : « Je ne vous avertis que selon la révélation divine . » Mais les sourds ne peuvent entendre l’appel lorsqu’ils sont avertis.", "german": " Sprich: \"Ich warne euch nur mit der Offenbarung.\" Jedoch die Tauben hören nicht den Ruf, wenn sie gewarnt werden.", "spanish": " Diles: “sólo os advierto de acuerdo con la revelación divina”. Pero los sordos no pueden oír la llamada cuando se les amonesta.", "urdu": " تو ان سے کہدے کہ میں تو تم کو وحی کے ذریعہ سے ہوشیار کر رہا ہوں اور (خوب سمجھتا ہوں کہ) جب (روحانی) بہروں کو ہوشیار کیا جائے تو وہ آواز نہیں سن سکتے۔"}, {"arabic": " وَ لَئِنۡ مَّسَّتۡہُمۡ نَفۡحَۃٌ مِّنۡ عَذَابِ رَبِّکَ لَیَقُوۡلُنَّ یٰوَیۡلَنَاۤ اِنَّا کُنَّا ظٰلِمِیۡنَ ﴿۴۷﴾", "english": " And if even a breath of thy Lord’s punishment touch them, they will surely cry out, ‘Woe to us! we were indeed wrongdoers.’", "french": " Et si rien qu ’un souffle du châtiment de ton Seigneur les touchait, ils crieraient sûrement : « Malheur à nous ! En vérité nous avons été des injustes. »", "german": " Und wenn sie ein Hauch von der Strafe deines Herrn berührt, dann werden sie sicherlich sprechen: \"O wehe uns, wir waren fürwahr Frevler!\"", "spanish": " Y aunque sólo les llegue un soplo del castigo de tu Señor, ciertamente gritarán: “¡Ay de nosotros! ¡Fuimos ciertamente injustos!”.", "urdu": " اور اگر انکو تیرے رب کے عذاب کی گرمی کا کوئی جھونکا لگ جائے تو وہ ضرور کہیں گے‘ ہم پر افسوس! ہم تو ظلم ہی کرتے رہے۔"}, {"arabic": " وَ نَضَعُ الۡمَوَازِیۡنَ الۡقِسۡطَ لِیَوۡمِ الۡقِیٰمَۃِ فَلَا تُظۡلَمُ نَفۡسٌ شَیۡئًا ؕ وَ اِنۡ کَانَ مِثۡقَالَ حَبَّۃٍ مِّنۡ خَرۡدَلٍ اَتَیۡنَا بِہَا ؕ وَ کَفٰی بِنَا حٰسِبِیۡنَ ﴿۴۸﴾", "english": " And We shall set up accurate scales of justice for the Day of Resurrection so that no soul will be wronged in aught. And even if it were the weight of a grain of mustard seed, We would bring it forth. And sufficient are We as reckoners.", "french": " Et Nous établirons des balances justes au Jour de la Résurrection, pour que nulle âme ne soit lésée en quoi que ce soit. Et même si c’était le poids d’un grain de moutarde, Nous le démontrerions. Et Nous suffisons bien pour tout calculer.", "german": " Und Wir werden (genaue) Waagen der Gerechtigkeit aufstellen für den Tag der Auferstehung, so dass keine Seele in irgendetwas Unrecht erleiden wird. Und wäre es das Gewicht eines Senfkorns, Wir wollen es hervorbringen. Und Wir genügen als Rechner.", "spanish": " Mas prepararemos balanzas exactas de justicia para el Día de la Resurrección, para que ningún alma sea perjudicada en lo más mínimo. Aunque se tratara del peso de un grano de mostaza, lo tendríamos en cuenta. Pues Nos bastamos como contables.", "urdu": " اور ہم قیامت کے دن ایسے تول کے سامان (یعنی پورا تولنے والے سامان) پیدا کریں گے کہ جن کی وجہ سے کسی جان پر ذرا سا بھی ظلم نہیں کیا جائے گا اور اگر ایک رائی کے دانہ کے برابر بھی (کوئی عمل) ہوگا تو ہم (اس کو) موجود کردیں گے اور ہم حساب لینے میں کافی ہیں۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسٰی وَ ہٰرُوۡنَ الۡفُرۡقَانَ وَ ضِیَآءً وَّ ذِکۡرًا لِّلۡمُتَّقِیۡنَ ﴿ۙ۴۹﴾", "english": " And We gave Moses and Aaron the Discrimination and a Light and a Reminder for the righteous,", "french": " Et Nous donnâmes à Moïse et à Aaron le Discernement, et une Lumière et un Rappel pour les vertueux,", "german": " Wir gaben Moses und Aaron das Entscheidende, und Licht und Ermahnung für die Rechtschaffenen,", "spanish": " Dimos a Moisés y Aarón la Discriminación, una Luz y un Recordatorio para los justos.", "urdu": " اور ہم نے موسیٰ اور ہارون کو امتیازی نشان بخشا تھا اور روشنی بخشی تھی۔ اور متقیوں کے لئے ایک یاددہانی کی تعلیم بخشی تھی۔"}, {"arabic": " الَّذِیۡنَ یَخۡشَوۡنَ رَبَّہُمۡ بِالۡغَیۡبِ وَ ہُمۡ مِّنَ السَّاعَۃِ مُشۡفِقُوۡنَ ﴿۵۰﴾", "english": " Those who fear their Lord in secret, and who dread the Hour of Judgment .", "french": " Ceux qui craignent leur Seigneur en secret, et qui redoutent l’Heure du Jugement .", "german": " die ihren Herrn fürchten im verborgenen und vor der \"Stunde\" bangen.", "spanish": " Quienes temen a su Señor en secreto y tiemblan ante la Hora del Juicio.", "urdu": " وہ (متقی) جو اپنے رب سے غیب میں (بھی) ڈرتے ہیں اور جو جزا سزا کے وقت مقرر سے بھی ڈرتے رہتے ہیں۔"}, {"arabic": " وَ ہٰذَا ذِکۡرٌ مُّبٰرَکٌ اَنۡزَلۡنٰہُ ؕ اَفَاَنۡتُمۡ لَہٗ مُنۡکِرُوۡنَ ﴿٪۵۱﴾", "english": " And this is a blessed Reminder that We have sent down; will you then reject it?", "french": " Et ceci est un Rappel béni que Nous avons fait descendre ; voulez-vous donc le rejeter ?", "german": " Dieser (Qur-ân) ist eine Ermahnung, voll des Segens, die Wir hinabgesandt haben: wollt ihr sie nun verwerfen?", "spanish": " Esto es un Recordatorio bendito que hemos revelado; ¿lo vais a rechazar?", "urdu": " اور یہ (قرآن) ایک ایسی یاددہانی کرنے والی کتاب ہے جس میں تمام آسمانی کتابوں کی خوبیاں بہہ کر آگئی ہیں اس کو ہم نے اتارا ہے پس کیا تم ایسی کتاب کے منکر ہو؟"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَاۤ اِبۡرٰہِیۡمَ رُشۡدَہٗ مِنۡ قَبۡلُ وَ کُنَّا بِہٖ عٰلِمِیۡنَ ﴿ۚ۵۲﴾", "english": " And before this We gave Abraham his guidance and We knew him well.", "french": " Et avant ceci Nous avons accordé à Abraham sa direction et Nous le connaissions bien.", "german": " Und vordem gaben Wir Abraham seine Rechtschaffenheit, denn Wir kannten ihn.", "spanish": " Antes de esto dimos a Abraham su guía pues lo conocíamos muy bien.", "urdu": " اور ہم نے اس سے پہلے ابراہیم کو اس کی صلاحیت اور قابلیت عطا کی تھی‘ اور ہم اس کے اندرونہ سے خوب واقف تھے۔"}, {"arabic": " اِذۡ قَالَ لِاَبِیۡہِ وَ قَوۡمِہٖ مَا ہٰذِہِ التَّمَاثِیۡلُ الَّتِیۡۤ اَنۡتُمۡ لَہَا عٰکِفُوۡنَ ﴿۵۳﴾", "english": " When he said to his father and his people, ‘What are these images to which you are so devoted?’", "french": " Lorsqu’il dit à son père et à son peuple : « Quelles sont ces statues auxquelles vous êtes si dévoués ? »", "german": " Da er zu seinem Vater und seinem Volke sprach: \"Was sind das für Bildwerke, denen ihr so ergeben seid?\"", "spanish": " Cuando dijo a su padre y a sus gentes: “¿qué son esas imágenes de las que sois tan devotos?”.", "urdu": " جب اس نے اپنے باپ اور اپنی قوم سے کہا‘ یہ کیا مجسمے ہیں جن کے آگے تم بیٹھے رہتے ہو۔"}, {"arabic": " قَالُوۡا وَجَدۡنَاۤ اٰبَآءَنَا لَہَا عٰبِدِیۡنَ ﴿۵۴﴾", "english": " They replied, ‘We found our fathers worshipping them.’", "french": " Ils dirent : « Nous avons trouvé nos pères adonnés à leur culte. »", "german": " Sie antworteten: \"Wir fanden unsere Väter bei ihrer Verehrung.\"", "spanish": " Ellos respondieron: “encontramos a nuestros padres adorándolas”.", "urdu": " انہوں نے کہا ہم نے اپنے باپ دادوں کودیکھا تھا کہ وہ ان کی عبادت کرتے تھے۔"}, {"arabic": " قَالَ لَقَدۡ کُنۡتُمۡ اَنۡتُمۡ وَ اٰبَآؤُکُمۡ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۵۵﴾", "english": " He said, ‘Indeed, you yourselves as well as your fathers have been in manifest error.’", "french": " Il dit : « En vérité, vous-mêmes ainsi que vos pères avez été dans une erreur manifeste. »", "german": " Er sprach: \"Wahrlich, ihr selbst sowohl wie eure Väter seid in offenbarem Irrtum gewesen.\"", "spanish": " Él dijo: “En verdad, tanto vosotros como vuestros padres habéis estado en error manifiesto”.", "urdu": " اس نے کہا‘ تب تم بھی اور تمہارے باپ دادے بھی ایک کھلی گمراہی میں مبتلا تھے۔"}, {"arabic": " قَالُوۡۤا اَجِئۡتَنَا بِالۡحَقِّ اَمۡ اَنۡتَ مِنَ اللّٰعِبِیۡنَ ﴿۵۶﴾", "english": " They said, ‘Is it really the truth that thou hast brought us, or art thou one of those who jest?’", "french": " Ils dirent : « Est-ce réellement la vérité que tu nous as apportée, ou bien es-tu de ceux qui plaisantent ? »", "german": " Sie sprachen: \"Bringst du uns die Wahrheit, oder gehörst du zu denen, die Scherz treiben?\"", "spanish": " Dijeron: “¿Es realmente la verdad lo que nos has traído, o eres uno de los que se burlan?”.", "urdu": " انہوں نے کہا‘ کیا تو ہمارے پاس ایک حقیقت لیکر آیا ہے یا تو ہم سے مذاق کر رہا ہے۔"}, {"arabic": " قَالَ بَلۡ رَّبُّکُمۡ رَبُّ السَّمٰوٰتِ وَ الۡاَرۡضِ الَّذِیۡ فَطَرَہُنَّ ۫ۖ وَ اَنَا عَلٰی ذٰلِکُمۡ مِّنَ الشّٰہِدِیۡنَ ﴿۵۷﴾", "english": " He replied, ‘Nay, your Lord is the Lord of the heavens and the earth, He Who made them; and I am one of those who bear witness to that.", "french": " Il dit : « Non , mais votre Seigneur est le Seigneur des cieux et de la terre, Celui Qui les a créés ; et je suis un de ceux qui en portent témoignage.", "german": " Er antwortete: \"Nein, euer Herr ist der Herr der Himmel und der Erde, Der sie erschuf; und ich bin einer der davon Zeugenden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=21:57&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=21:57&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic58\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic58\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/21:58' style='text-decoration:underline'>21:58</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(58)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control58\"></i></button> <audio id=\"player58\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ تَاللّٰہِ لَاَکِیۡدَنَّ اَصۡنَامَکُمۡ بَعۡدَ اَنۡ تُوَلُّوۡا مُدۡبِرِیۡنَ ﴿۵۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And, by Allah, I will certainly plan against your idols after you have gone away <em>and </em>turned your backs.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And, by Allah, I will certainly plan against your idols after you have gone away <i>and </i>turned your backs.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور خدا کی قسم! میں ضرور تمہارے بتوں سے کچھ تدبیر کروں گا بعد اس کے کہ تم پیٹھ پھیرتے ہوئے چلے جاؤ گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اس نے کہا‘ خدا کی قسم! جب تم پیٹھ پھیر کر چلے جاٶ گے تو میں تمہارے بتوں کے خلاف ایک پکی تدبیر کروں گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et, par Allāh, je dresserai assurément des plans contre vos idoles quand vous serez partis en <em>nous</em> tournant le dos. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y, por Al-lah, ciertamente maquinaré contra vuestros ídolos después de que os hayáis ido<em> y</em> dado media vuelta”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und, bei Allah, ich will gewisslich gegen eure Götzen verfahren, nachdem ihr kehrend weggegangen seid.\"", "spanish": " Él respondió: “No, vuestro Señor es el Señor de los cielos y la tierra, Aquel que los creó, y yo soy uno de los testigos de ello”;", "urdu": " (ابراہیم نے) کہا حقیقت یہ ہے کہ تمہارا رب آسمانوں کا بھی رب ہے اور زمین کا بھی رب ہے (وہی ہے) جس نے ان کو پیدا کیا ہے اور میں اس بات پر تمہارے سامنے گواہ ہوں۔"}, {"arabic": " فَجَعَلَہُمۡ جُذٰذًا اِلَّا کَبِیۡرًا لَّہُمۡ لَعَلَّہُمۡ اِلَیۡہِ یَرۡجِعُوۡنَ ﴿۵۹﴾", "english": " So he broke them to pieces, all except the chief of them, that they might return to it for enquiry .", "french": " Il les mit donc en pièces, toutes excepté la principale, afin qu’ils puissent se tourner vers elle pour l’enquête .", "german": " So schlug er sie in Stücke, (alle) außer ihrem Obersten, damit sie sich an ihn wenden könnten.", "spanish": " Y los hizo pedazos, a todos excepto a su jefe, para que volvieran a él para preguntar.", "urdu": " پھر اس نے ان (بتوں) کو ٹکڑے ٹکڑے کر دیا سوائے ان میں سے بڑے کے تا کہ وہ (ایک دفعہ پھر) اس کے پاس آئیں۔"}, {"arabic": " قَالُوۡا مَنۡ فَعَلَ ہٰذَا بِاٰلِہَتِنَاۤ اِنَّہٗ لَمِنَ الظّٰلِمِیۡنَ ﴿۶۰﴾", "english": " They said, ‘Who has done this to our gods? Surely, he must be a wrongdoer.’", "french": " Ils dirent : « Qui a fait ceci à nos dieux ? Assurément, ce doit être un injuste. »", "german": " Sie sprachen: \"Wer hat unseren Göttern dies angetan? Er muss fürwahr ein Frevler sein.\"", "spanish": " Dijeron: “¿Quién hizo esto a nuestros dioses?, en verdad debe ser alguien injusto”.", "urdu": " اس پر انہوں نے کہا کہ ہمارے معبودوں سے یہ کام کس نے کیا ہے ایسا کرنے والا یقیناً ظالموں میں سے ہے۔"}, {"arabic": " قَالُوۡا سَمِعۡنَا فَتًی یَّذۡکُرُہُمۡ یُقَالُ لَہٗۤ اِبۡرٰہِیۡمُ ﴿ؕ۶۱﴾", "english": " They said, ‘We heard a young man speak ill of them; he is called Abraham.’", "french": " Ils dirent : « Nous avons entendu un jeune homme en faire mention ; il s’appelle Abraham. »", "german": " Sie sprachen: \"Wir hörten einen Jüngling von ihnen reden; Abraham heißt er.\"", "spanish": " Dijeron: “Hemos oído a un joven hablar mal de ellos; se llama Abraham”.", "urdu": " (تب کچھ دوسرے لوگوں نے) کہا۔ ہم نے ایک نوجوان کو جس کا نام ابراہیم ہے ان کی کمزوریاں بیان کرتے سنا ہے۔"}, {"arabic": " قَالُوۡا فَاۡتُوۡا بِہٖ عَلٰۤی اَعۡیُنِ النَّاسِ لَعَلَّہُمۡ یَشۡہَدُوۡنَ ﴿۶۲﴾", "english": " They said, ‘Then bring him before the eyes of the people, that they may bear witness.’", "french": " Ils dirent : « Alors amenez-le devant les yeux des gens pour qu’ils puissent témoigner. »", "german": " Sie sprachen: \"So bringt ihn vor die Augen des Volkes, damit sie urteilen.\"", "spanish": " Dijeron: “Traedlo a la presencia de la gente, para que sean testigos”.", "urdu": " (تب قوم کے سرداروں نے) کہا (اگر بات یوں ہے تو) اس شخص کو سب لوگوں کے سامنے لاٶ شاید وہ (اس کے متعلق) کوئی فیصلہ کریں۔"}, {"arabic": " قَالُوۡۤا ءَاَنۡتَ فَعَلۡتَ ہٰذَا بِاٰلِہَتِنَا یٰۤـاِبۡرٰہِیۡمُ ﴿ؕ۶۳﴾", "english": " Then they said to Abraham , ‘Is it thou who hast done this to our gods, O Abraham?’", "french": " Ils dirent : « Est-ce toi, ô Abraham, qui as fait ceci à nos dieux ? »", "german": " Sie sprachen: \"Bist du es, der unseren Göttern dies angetan hat, o Abraham?\"", "spanish": " Luego dijeron a Abraham: “¿Eres tú quien ha hecho esto a nuestros dioses, Oh Abraham?”.", "urdu": " (پھر) انہوں نے کہا اے ابراہیم! کیا یہ کام تو نے ہمارے معبودوں سے کیا ہے؟"}, {"arabic": " قَالَ بَلۡ فَعَلَہٗ ٭ۖ کَبِیۡرُہُمۡ ہٰذَا فَسۡـَٔلُوۡہُمۡ اِنۡ کَانُوۡا یَنۡطِقُوۡنَ ﴿۶۴﴾", "english": " He replied, ‘Aye, somebody has surely done this. Here is their chief. But ask them if they can speak.’", "french": " Il dit : « Eh bien, quelqu’un l’a fait. Voici le plus grand suspect parmi eux. Demandez-leur donc, si toutefois ils sont capables de parler. »", "german": " Er antwortete: \"Irgendjemand hat es getan. Ihr Oberster ist hier. Fragt sie doch, wenn sie reden können.\"", "spanish": " Él respondió: “En verdad, alguien lo ha hecho. Aquí está su jefe. Preguntadles pues, si es que pueden hablar”.", "urdu": " (ابراہیم نے) کہا کہ (آخر) کسی کرنے والے نے تو یہ کام ضرور کیا ہے۔ یہ سب سے بڑا بت سامنے کھڑا ہے اگر وہ بول سکتے ہوں تو ان سے (یعنی اس بت سے بھی اور دوسرے بتوں سے بھی) پوچھ کر دیکھو۔"}, {"arabic": " فَرَجَعُوۡۤا اِلٰۤی اَنۡفُسِہِمۡ فَقَالُوۡۤا اِنَّکُمۡ اَنۡتُمُ الظّٰلِمُوۡنَ ﴿ۙ۶۵﴾", "english": " Then they turned towards one another and said, ‘You yourselves are surely in the wrong.’", "french": " Alors ils retournèrent auprès de leurs semblables et dirent : « Vous êtes vous-mêmes assurément des injustes ! »", "german": " Da wandten sie sich zueinander und sprachen: \"Ihr selber seid wahrhaftig im Unrecht.\"", "spanish": " Entonces se volvieron unos a otros y dijeron: “En verdad, vosotros mismos estáis en el error”.", "urdu": " اس پر وہ اپنے سرداروں کی طرف متوجہ ہوئے اور انہوں نے کہا۔ سچی بات تو یہی ہے کہ ظالم تم ہی ہو۔"}, {"arabic": " ثُمَّ نُکِسُوۡا عَلٰی رُءُوۡسِہِمۡ ۚ لَقَدۡ عَلِمۡتَ مَا ہٰۤؤُلَآءِ یَنۡطِقُوۡنَ ﴿۶۶﴾", "english": " And their heads were made to hang low for shame and they said , ‘Certainly thou knowest well that these do not speak.’", "french": " Et ils furent obligés de baisser leur tête de honte et de dire à Abraham : « Tu sais parfaitement bien que celles-ci ne parlent pas. »", "german": " Und ihre Köpfe mussten sie hängen lassen in bitterer Scham: \"Du weißt recht wohl, dass diese nicht reden.\"", "spanish": " Y se hizo que sus cabezas se inclinaran de vergüenza y dijeron: “Ciertamente sabes muy bien que éstos no hablan”.", "urdu": " اور وہ لوگ اپنے سروں کے بل گرائے گئے (یعنی لاجواب کیے گئے) اور انہوں نے کہا کہ تو جانتا ہے کہ یہ تو بولا نہیں کرتے۔"}, {"arabic": " قَالَ اَفَتَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ مَا لَا یَنۡفَعُکُمۡ شَیۡئًا وَّ لَا یَضُرُّکُمۡ ﴿ؕ۶۷﴾", "english": " He said, ‘Do you then worship instead of Allah that which cannot profit you at all, nor harm you?", "french": " Il dit : « Adorez-vous donc à la place d’Allāh ce qui ne peut aucunement vous profiter, ni vous nuire ?", "german": " Er sprach: \"Verehrt ihr denn statt Allah das, was euch nicht den geringsten Nutzen bringen noch euch schaden kann?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=21:67&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=21:67&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic68\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic68\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/21:68' style='text-decoration:underline'>21:68</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(68)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control68\"></i></button> <audio id=\"player68\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اُفٍّ لَّکُمۡ وَ لِمَا تَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۶۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Fie on you and on that which you worship instead of Allah! Will you not then understand?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Fie on you and on that which you worship instead of Allah! Can you not understand?’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">تُف ہے تم پر اور اس پر جس کی تم اللہ کے سوا عبادت کرتے ہو۔ پس کیا تم عقل نہیں کرتے؟</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(ہم) تم پر افسوس (کرتے ہیں) اور اس پر بھی جس کی تم اللہ کے سوا عبادت کرتے ہو‘ کیا تم عقل سے کام نہیں لیتے؟ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Fi de vous et de ce que vous adorez à la place d’Allāh ! Ne comprendrez-vous donc pas ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡Vergüenza de vosotros y de lo que adoráis en lugar de Al-lah! ¿es que no entenderéis?</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Pfui über euch und über das, was ihr statt Allah anbetet! Wollt ihr denn nicht begreifen?\"", "spanish": " Dijo: “¿Adoráis pues en lugar de Al-lah a lo que no puede beneficiaros en absoluto ni perjudicaros?”.", "urdu": " (ابراہیم نے) کہا تو کیا تم اللہ کے سوا ایسی شے کی پرستش کرتے ہو جو نہ تمہیں نفع دیتی ہے‘ نہ نقصان پہنچاتی ہے۔"}, {"arabic": " قَالُوۡا حَرِّقُوۡہُ وَ انۡصُرُوۡۤا اٰلِہَتَکُمۡ اِنۡ کُنۡتُمۡ فٰعِلِیۡنَ ﴿۶۹﴾", "english": " They said, ‘Burn him and help your gods, if at all you mean to do anything .’", "french": " Ils dirent : « Brûlez-le et aidez vos dieux, si vous voulez vraiment faire quelque chose . »", "german": " Sie sprachen: \"Verbrennt ihn und helft euren Göttern, wenn ihr etwas tun wollt.\"", "spanish": " Dijeron: “Quemadlo y ayudad a vuestros dioses si es que pretendéis hacer algo”.", "urdu": " (اس پر وہ غصے میں آکر) کہنے لگے۔ اس شخص کو جلا دو اور اپنے معبودوں کی مدد کرو‘ اگر تم نے کچھ کرنے کا ارادہ کیا ہے۔"}, {"arabic": " قُلۡنَا یٰنَارُ کُوۡنِیۡ بَرۡدًا وَّ سَلٰمًا عَلٰۤی اِبۡرٰہِیۡمَ ﴿ۙ۷۰﴾", "english": " We said, ‘O fire, be thou cold and a means of safety for Abraham!’", "french": " Nous avons dit : « Deviens tout froid, ô feu, et sois une source de paix pour Abraham ! »", "german": " Wir sprachen: \"O Feuer, sei kühl und ohne Harm für Abraham!\"", "spanish": " Dijimos: “¡Oh fuego, enfríate y sé una fuente de paz para Abraham!”.", "urdu": " تب ہم نے کہا‘ اے آگ! تو ابراہیم کے لئے ٹھنڈی بھی ہو جا اور اس کے لئے سلامتی کا باعث بھی بن جا۔"}, {"arabic": " وَ اَرَادُوۡا بِہٖ کَیۡدًا فَجَعَلۡنٰہُمُ الۡاَخۡسَرِیۡنَ ﴿ۚ۷۱﴾", "english": " And they had sought to do evil to him, but We made them the worst losers.", "french": " Et ils voulaient faire un plan contre lui, mais Nous avions fait que ce soit eux les plus grands perdants.", "german": " Und sie strebten, ihm Böses zu tun, allein Wir machten sie zu den größten Verlierern.", "spanish": " Pues habían intentado perjudicarle, pero Nosotros los convertimos en los peores perdedores.", "urdu": " اور انہوں نے اس سے کچھ برا سلوک کرنا چاہا مگر ہم نے ان کو ناکام بنا دیا۔"}, {"arabic": " وَ نَجَّیۡنٰہُ وَ لُوۡطًا اِلَی الۡاَرۡضِ الَّتِیۡ بٰرَکۡنَا فِیۡہَا لِلۡعٰلَمِیۡنَ ﴿۷۲﴾", "english": " And We saved him and Lot and brought them to the land which We blessed for the peoples.", "french": " Et Nous le sauvâmes ainsi que Lot vers une terre que Nous avions bénie pour les peuples.", "german": " Und Wir retteten ihn und Lot nach dem Land, das Wir für die Welten gesegnet hatten.", "spanish": " Y los salvamos a él y a Lot, llevándolos al país que bendijimos para los pueblos.", "urdu": " اور ہم نے اسے بھی اور لوط کو بھی اس زمین کی طرف نجات دی جس میں ہم نے تمام جہانوں کے لیے برکتیں رکھی تھیں۔"}, {"arabic": " وَ وَہَبۡنَا لَہٗۤ اِسۡحٰقَ ؕ وَ یَعۡقُوۡبَ نَافِلَۃً ؕ وَ کُلًّا جَعَلۡنَا صٰلِحِیۡنَ ﴿۷۳﴾", "english": " And We bestowed upon him Isaac, and as a grandson, Jacob, and We made all of them righteous.", "french": " Et Nous lui donnâmes Isaac, et comme petit-fils, Jacob, et Nous les fîmes des gens justes.", "german": " Und Wir schenkten ihm Isaak und als Sohnessohn Jakob, und Wir machten sie alle rechtschaffen.", "spanish": " Le concedimos a Isaac y como nieto a Jacob, y los hicimos que todos ellos fueran justos.", "urdu": " اور ہم نے اسے اسحاق بھی بخشا اور یعقوب بھی بطور پوتے کے (دیا) اور ہم نے سب کو نیک بنایا۔"}, {"arabic": " وَ جَعَلۡنٰہُمۡ اَئِمَّۃً یَّہۡدُوۡنَ بِاَمۡرِنَا وَ اَوۡحَیۡنَاۤ اِلَیۡہِمۡ فِعۡلَ الۡخَیۡرٰتِ وَ اِقَامَ الصَّلٰوۃِ وَ اِیۡتَآءَ الزَّکٰوۃِ ۚ وَ کَانُوۡا لَنَا عٰبِدِیۡنَ ﴿ۚۙ۷۴﴾", "english": " And We made them leaders who guided people by Our command, and We sent revelation to them enjoining the doing of good works, and the observing of Prayer, and the giving of alms. And they were worshippers of Us alone .", "french": " Et Nous fîmes d’eux des chefs qui guidèrent les hommes d’après Notre commandement, et Nous leur envoyâmes la révélation enjoignant l’accomplissement de bonnes œuvres, et l’observance de la Prière et l’acquittement de la Zakāte. Et ils n’adoraient que Nous Seul .", "german": " Und Wir machten sie zu Führern, die (die Menschen) leiteten nach Unserem Geheiß, und Wir sandten ihnen Offenbarung, Gutes zu tun, das Gebet zu verrichten und Almosen zu geben. Und sie verehrten Uns allein.", "spanish": " Los convertimos en jefes que guiaron a las gentes iguiendo Nuestra orden, y les enviamos la revelación que ordenaba la ejecución de buenas obras, el cumplimiento de la Oración y la entrega de limosnas. Y sólo Nos adoraron a nosotros.", "urdu": " اور ہم نے ان کو (لوگوں کا) امام بنایا۔ وہ ہمارے حکم سے ان کو ہدایت دیتے تھے اور ہم نے ان کی طرف نیک کام کرنے اور نماز قائم کرنے اور زکو ۃ دینے کی وحی کی اور وہ سب ہمارے عبادت گذار بندے تھے۔"}, {"arabic": " وَ لُوۡطًا اٰتَیۡنٰہُ حُکۡمًا وَّ عِلۡمًا وَّ نَجَّیۡنٰہُ مِنَ الۡقَرۡیَۃِ الَّتِیۡ کَانَتۡ تَّعۡمَلُ الۡخَبٰٓئِثَ ؕ اِنَّہُمۡ کَانُوۡا قَوۡمَ سَوۡءٍ فٰسِقِیۡنَ ﴿ۙ۷۵﴾", "english": " And to Lot We gave wisdom and knowledge. And We saved him from the city which practised abominations. They were indeed a wicked and rebellious people.", "french": " Et à Lot Nous accordâmes la sagesse et le savoir. Et Nous le délivrâmes de la ville qui commettait des abominations. Ils étaient en vérité un peuple impie et rebelle.", "german": " Und Lot gaben Wir Weisheit und Wissen. Und Wir retteten ihn aus der Stadt, die Schändlichkeiten beging. Sie waren fürwahr ein ruchloses Volk und Empörer.", "spanish": " A Lot le dimos sabiduría y conocimiento. Lo salvamos de la ciudad ue practicaba obscenidades. Eran en verdad un pueblo perverso y rebelde.", "urdu": " اور (ہم نے اسے) لوط (بھی بخشا) جسے ہم نے حکم بھی عطا کیا اور علم بھی۔ اور اس کو اس بستی سے نجات دی جو کہ نہایت گندے کام کرتی تھی وہ (یعنی لوط کے شہر کے رہنے والے) ایک بہت بری قوم یعنی نافرمان تھے۔"}, {"arabic": " وَ اَدۡخَلۡنٰہُ فِیۡ رَحۡمَتِنَا ؕ اِنَّہٗ مِنَ الصّٰلِحِیۡنَ ﴿٪۷۶﴾", "english": " And We admitted him to Our mercy; surely he was one of the righteous.", "french": " Et Nous l’admîmes en Notre miséricorde ; assurément il était du nombre des justes.", "german": " Und Wir ließen ihn eingehen in Unsere Barmherzigkeit; denn er war einer der Rechtschaffenen.", "spanish": " Y lo admitimos a Nuestra misericordia; en verdad era uno de los justos.", "urdu": " اور ہم نے اس (یعنی لوط) کو اپنی رحمت میں داخل کیا وہ ہمارے نیک بندوں میں سے تھا۔"}, {"arabic": " وَ نُوۡحًا اِذۡ نَادٰی مِنۡ قَبۡلُ فَاسۡتَجَبۡنَا لَہٗ فَنَجَّیۡنٰہُ وَ اَہۡلَہٗ مِنَ الۡکَرۡبِ الۡعَظِیۡمِ ﴿ۚ۷۷﴾", "english": " And remember Noah when he cried to Us aforetime, and We heard his prayer and delivered him and his family from the great distress.", "french": " Et souviens-toi de Noé, quand il Nous supplia avant cela et Nous entendîmes sa prière et le sauvâmes ainsi que sa famille, de l'immense affliction.", "german": " Und (gedenke) Noahs, da er vordem (zu Uns) rief. Wir erhörten ihn und retteten ihn und seine Angehörigen aus der großen Drangsal.", "spanish": " Acordaos de Noé, cuando clamó a Nosotros hace tiempo, y escuchamos su oración y lo libramos a él y a su familia de la gran catástrofe.", "urdu": " اور (یاد کر) نوح کو جب اس نے (یعنی ابراہیم کے واقعہ) سے پہلے (ہم کو) پکارا۔ اور ہم نے اس کی دعا سنی۔ پس ہم نے اس کو بھی اور اس کے اہل کو بھی ایک بڑی گھبراہٹ سے نجات دی۔"}, {"arabic": " وَ نَصَرۡنٰہُ مِنَ الۡقَوۡمِ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا ؕ اِنَّہُمۡ کَانُوۡا قَوۡمَ سَوۡءٍ فَاَغۡرَقۡنٰہُمۡ اَجۡمَعِیۡنَ ﴿۷۸﴾", "english": " And We helped him against the people who rejected Our Signs. They were surely a wicked people; so We drowned them all.", "french": " Et Nous l’aidâmes contre le peuple qui avait rejeté Nos Signes. Ils étaient assurément un peuple impie ; Nous les noyâmes donc tous.", "german": " Und Wir halfen ihm wider das Volk, das Unsere Zeichen verwarf. Sie waren fürwahr ein ruchloses Volk; so ertränkten Wir sie alle.", "spanish": " Lo ayudamos contra el pueblo que rechazó Nuestros Signos. Eran en verdad un pueblo perverso; por eso los ahogamos a todos.", "urdu": " اور ہم نے اس کی اس قوم کے مقابلہ میں مدد کی جس نے ہماری نشانیوں کو جھٹلایا تھا۔ وہ بہت بری قوم تھی پس ہم نے ان سب کو غرق کر دیا۔"}, {"arabic": " وَ دَاوٗدَ وَ سُلَیۡمٰنَ اِذۡ یَحۡکُمٰنِ فِی الۡحَرۡثِ اِذۡ نَفَشَتۡ فِیۡہِ غَنَمُ الۡقَوۡمِ ۚ وَ کُنَّا لِحُکۡمِہِمۡ شٰہِدِیۡنَ ﴿٭ۙ۷۹﴾", "english": " And remember David and Solomon when they exercised their respective judgements concerning the crop when the sheep of certain people strayed therein by night ; and We were witness to their judgment.", "french": " Et souviens-toi de David et de Salomon lorsqu’ils exercèrent leur jugement respectif au sujet d’un champ cultivé quand les moutons des gens y étaient allés paître la nuit , et Nous fûmes témoin de leur jugement.", "german": " Und (gedenke) Davids und Salomos, da sie über den Acker richteten, worin die Schafe eines Volkes sich zur Nachtzeit verliefen und weideten; und Wir waren Zeugen für ihren Spruch.", "spanish": " Y acordaos de David y Salomón, cuando ejercieron sus juicios respectivos en relación con el campo cultivado, cuando as ovejas de algunas personas se extraviaron por la noche en él ; y fuimos testigos de su juicio.", "urdu": " اور (یاد کر) داٶد کو بھی اور سلیمان کو بھی جبکہ وہ دونوں ایک کھیتی کے جھگڑے میں فیصلہ کر رہے تھے۔ اس وقت جبکہ ایک قوم کے عامی لوگ اس کو کھا گئے تھے (یعنی تباہ کر گئے تھے) اور ہم ان کے فیصلہ کے گواہ تھے۔"}, {"arabic": " فَفَہَّمۡنٰہَا سُلَیۡمٰنَ ۚ وَ کُلًّا اٰتَیۡنَا حُکۡمًا وَّ عِلۡمًا ۫ وَّ سَخَّرۡنَا مَعَ دَاوٗدَ الۡجِبَالَ یُسَبِّحۡنَ وَ الطَّیۡرَ ؕ وَ کُنَّا فٰعِلِیۡنَ ﴿۸۰﴾", "english": " We gave Solomon the right understanding of the matter and to each of them gave We wisdom and knowledge. And We subjected the mountains and the birds to celebrate God’s praises with David. And it is We Who do all such things .", "french": " Nous donnâmes à Salomon une pleine intelligence de l’affaire , et à chacun d’eux Nous donnâmes sagesse et savoir. Et Nous assujettîmes les montagnes et les oiseaux pour célébrer avec David les louanges d’Allāh . Et c’est Nous Qui faisons toutes les choses de ce genre .", "german": " Wir gaben Salomo volle Einsicht in die Sache, und jedem (von ihnen) gaben Wir Weisheit und Wissen. Und Wir machten die Berge und die Vögel dienstbar, mit David zusammen (Gottes) Preis zu verkünden und Wir konnten das tun.", "spanish": " Dimos a Salomón un entendimiento correcto del tema y a cada uno de ellos le dimos sabiduría y conocimiento. Y sometimos a las ontañas y a los pájaros para que celebraran con David las alabanzas de Dios . Somos Nosotros Quienes hacemos todas estas cosas.", "urdu": " ہم نے اصل معاملہ سلیمان کو سمجھا دیا۔ اور سب کو ہی ہم نے حکم اور علم عطا فرمایا تھا اور ہم نے داٶد کے ساتھ اہل جبال کو بھی اور پرندوں کو بھی کام پر لگا دیا تھا وہ سب خدا کی تسبیح کرتے تھے اور ہم یہ سب کچھ کرنے پر قادر تھے۔"}, {"arabic": " وَ عَلَّمۡنٰہُ صَنۡعَۃَ لَبُوۡسٍ لَّکُمۡ لِتُحۡصِنَکُمۡ مِّنۡۢ بَاۡسِکُمۡ ۚ فَہَلۡ اَنۡتُمۡ شٰکِرُوۡنَ ﴿۸۱﴾", "english": " And We taught him the making of coats of mail for you, that they might protect you from each other’s violence. Will you then be thankful?", "french": " Et Nous lui apprîmes à faire pour vous les cottes de mailles, afin qu’elles vous protègent contre la violence les uns des autres. Serez-vous donc reconnaissants ?", "german": " Und Wir lehrten ihn das Verfertigen von Panzerhemden für euch, dass sie euch schützen möchten in euren Kriegen. Wollt ihr denn nicht dankbar sein?", "spanish": " Le enseñamos la fabricación para vosotros de cotas de malla, a fin de que os protejáis de la violencia de los demás. ¿No seréis pues agradecidos?", "urdu": " اور ہم نے اس کو ایک لباس کا بنانا سکھایا تھا تا کہ وہ تمہاری جان لڑائی میں بچائے۔ پس کیا تم شکر گذار بنو گے؟"}, {"arabic": " وَ لِسُلَیۡمٰنَ الرِّیۡحَ عَاصِفَۃً تَجۡرِیۡ بِاَمۡرِہٖۤ اِلَی الۡاَرۡضِ الَّتِیۡ بٰرَکۡنَا فِیۡہَا ؕ وَ کُنَّا بِکُلِّ شَیۡءٍ عٰلِمِیۡنَ ﴿۸۲﴾", "english": " And We subjected to Solomon the violent wind. It blew, at his bidding, toward the land which We had blessed. And We have knowledge of all things.", "french": " Et Nous soumîmes à Salomon le vent violent. Il souffla selon sa demande vers la terre que Nous avions bénie. Et Nous avons connaissance de toutes choses.", "german": " Und Salomo den Sturmwind, der in seinem Auftrage nach dem Lande blies, das Wir gesegnet hatten. Und Wir haben Kenntnis von allen Dingen.", "spanish": " Sometimos a Salomón el viento huracanado. Sopló, a su orden, hacia el país que habíamos bendecido. Pues tenemos conocimiento de todas las cosas.", "urdu": " اور ہم نے سلیمان کے لئے تیز ہوا کو بھی مسخر کر چھوڑا تھا۔ جو اس کے حکم کے مطابق چلتی تھی۔ اس زمین کی طرف جس میں ہم نے برکت رکھی تھی اور ہم سب کچھ جانتے ہیں۔"}, {"arabic": " وَ مِنَ الشَّیٰطِیۡنِ مَنۡ یَّغُوۡصُوۡنَ لَہٗ وَ یَعۡمَلُوۡنَ عَمَلًا دُوۡنَ ذٰلِکَ ۚ وَ کُنَّا لَہُمۡ حٰفِظِیۡنَ ﴿ۙ۸۳﴾", "english": " And We subjected to him deep divers who dived for him, and did other work beside that; and it was We Who guarded them.", "french": " Et Nous lui soumîmes des plongeurs de fond qui plongeaient pour lui, et qui faisaient d’autres tâches encore ; et c’était Nous Qui les protégions.", "german": " Und Teufel, die für ihn tauchten und dazu noch andere Werke verrichteten; und Wir Selbst beaufsichtigten sie.", "spanish": " Y sometimos a él buceadores en aguas profundas que bucearon por él y realizaron además otros trabajos; y fuimos Nosotros Quienes los protegimos.", "urdu": " اور کچھ سرکش لوگ ایسے تھے جو اس کے لئے سمندروں میں غوطے لگاتے تھے اور اس کے سوا بھی اور کام کرتے تھے اور ہم ان کے لئے نگرانی کا کام کرتے تھے۔"}, {"arabic": " وَ اَیُّوۡبَ اِذۡ نَادٰی رَبَّہٗۤ اَنِّیۡ مَسَّنِیَ الضُّرُّ وَ اَنۡتَ اَرۡحَمُ الرّٰحِمِیۡنَ ﴿ۚۖ۸۴﴾", "english": " And remember Job when he cried to his Lord, saying , ‘Affliction has touched me, and Thou art the Most Merciful of all who show mercy.’", "french": " Et souviens-toi de Job lorsqu’il supplia son Seigneur, en disant : « Le malheur m’a frappé, et Tu es le plus Miséricordieux de tous ceux qui font miséricorde. »", "german": " Und (gedenke) Hiobs, da er zu seinem Herrn rief: \"Unheil hat mich geschlagen, und Du bist der Barmherzigste aller Barmherzigen.\"", "spanish": " Acordaos de Job cuando clamó a su Señor, diciendo: “Me ha azotado la adversidad y Tú eres el Sumo Misericordioso entre todos los que muestran misericordia”.", "urdu": " اور (تو) ایوب کو (بھی یاد کر) جب اس نے اپنے رب کو پکار کر کہا کہ میری حالت یہ ہے کہ مجھے تکلیف نے آپکڑا ہے اور اے خدا! تو تو سب رحم کرنے والوں سے زیادہ رحم کرنے والا ہے۔"}, {"arabic": " فَاسۡتَجَبۡنَا لَہٗ فَکَشَفۡنَا مَا بِہٖ مِنۡ ضُرٍّ وَّ اٰتَیۡنٰہُ اَہۡلَہٗ وَ مِثۡلَہُمۡ مَّعَہُمۡ رَحۡمَۃً مِّنۡ عِنۡدِنَا وَ ذِکۡرٰی لِلۡعٰبِدِیۡنَ ﴿۸۵﴾", "english": " So We heard his prayer and removed the distress from which he suffered, and We gave him his family and the like thereof with them, as a mercy from Us, and as a reminder for the worshippers.", "french": " Alors Nous entendîmes sa prière, et Nous enlevâmes l’affliction dont il souffrait, et Nous lui rendîmes sa famille, et avec eux encore autant, comme miséricorde de Notre part, et comme un rappel pour les adorateurs.", "german": " Da erhörten Wir ihn und nahmen sein Unheil hinweg und Wir gaben ihm seine Familie (wieder) und noch einmal so viele dazu, als Barmherzigkeit von Uns und als Ermahnung für die Verehrenden.", "spanish": " Oímos pues su Oración, lo libramos del mal que sufría, y le devolvimos su familia y otro tanto con ella, como misericordia Nuestra, y como advertencia para los adoradores.", "urdu": " پس ہم نے اس کی دعا سنی اور جو تکلیف اس کو پہنچی ہوئی تھی اس کو دور کر دیا اور اس کو اس کے اہل (وعیال) بھی دئے اور ان کے سوا اپنی طرف سے رحم کرتے ہوئے اور بھی دئے اور ہم نے اس واقعہ کو عبادت گذاروں کے لئے ایک نصیحت کا موجب بنایا ہے۔"}, {"arabic": " وَ اِسۡمٰعِیۡلَ وَ اِدۡرِیۡسَ وَ ذَاالۡکِفۡلِ ؕ کُلٌّ مِّنَ الصّٰبِرِیۡنَ ﴿ۚۖ۸۶﴾", "english": " And remember Ishmael, and Idris, and Dha’l-Kifl. All were of the steadfast.", "french": " Et souviens-toi d’ lsmaël, et d’ ldrīs et de Dhul-Kifl. Tous étaient du nombre des endurants.", "german": " Und (gedenke) Ismaels und Idris´ und Dhul-Kifls. Sie alle zählten zu den Standhaften.", "spanish": " Y acordaos de Ismael, Idris y Dhu´l Kifl. Todos se contaron entre los perseverantes.", "urdu": " اور اسماعیل کو بھی (یاد کر) اور ادریس کو بھی اور ذوالکفل کو بھی۔ یہ سب کے سب صبر کرنے والے تھے۔"}, {"arabic": " وَ اَدۡخَلۡنٰہُمۡ فِیۡ رَحۡمَتِنَا ؕ اِنَّہُمۡ مِّنَ الصّٰلِحِیۡنَ ﴿۸۷﴾", "english": " And We admitted them to Our mercy. Surely, they were of the righteous.", "french": " Et Nous les admîmes en Notre miséricorde. Assurément, ils étaient du nombre des justes.", "german": " Wir ließen sie eingehen in Unsere Barmherzigkeit, denn sie gehörten zu den Rechtschaffenen.", "spanish": " Los admitimos a Nuestra Misericordia. En verdad, se encontraban entre los justos.", "urdu": " اور ہم نے ان سب کو اپنی رحمت میں داخل کیا تھا اور وہ سب نیکو کار تھے۔"}, {"arabic": " وَ ذَاالنُّوۡنِ اِذۡ ذَّہَبَ مُغَاضِبًا فَظَنَّ اَنۡ لَّنۡ نَّقۡدِرَ عَلَیۡہِ فَنَادٰی فِی الظُّلُمٰتِ اَنۡ لَّاۤ اِلٰہَ اِلَّاۤ اَنۡتَ سُبۡحٰنَکَ ٭ۖ اِنِّیۡ کُنۡتُ مِنَ الظّٰلِمِیۡنَ ﴿ۚۖ۸۸﴾", "english": " And remember Dha’l-Nun, when he went away in anger, and he thought that We would never cause him distress and he cried out in depths of darkness, saying , ‘There is no God but Thou, Holy art Thou. I have indeed been of the wrongdoers.’", "french": " Et souviens-toi de Dhun-N ū n, lorsqu’il s’en alla avec colère, et il croyait que Nous n’allions jamais être sévère à son égard. Alors, des profondeurs des ténèbres, il poussa le cri : « Il n’y a de dieu que Toi ; Saint es-Tu. J’ai été vraiment du nombre des injustes. »", "german": " Und (gedenke) Dhul-Nûns (Jonas), da er im Zorn hinwegging und überzeugt war, dass Wir ihn nie in Betrübnis bringen würden, und er rief in der dichten Finsternis: \"Es gibt keinen Gott außer Dir. Heilig bist Du! Ich bin fürwahr einer der Frevler gewesen.\"", "spanish": " Y acuérdate de Dhu´l-Nun, cuando se apartó encolerizado ensando que no caeríamos duramente sobre él, y cuando gritó desde lo más profundo de las tinieblas diciendo: “No hay Dios sino Tú, Santo eres Tú. He sido en verdad de los injustos”.", "urdu": " اور ذوالنون (یعنی یونس کو بھی یاد کر) جب وہ غصہ کی حالت میں چلا گیا اور دل میں پریقین تھا کہ ہم اس کو تنگ نہیں کریں گے۔ پس مصائب میں اس نے ہم کو پکارا (اور کہا) کہ تیرے سوا کوئی معبود نہیں تو پاک ہے۔ میں یقیناً ظلم کرنے والوں میں سے تھا۔"}, {"arabic": " فَاسۡتَجَبۡنَا لَہٗ ۙ وَ نَجَّیۡنٰہُ مِنَ الۡغَمِّ ؕ وَ کَذٰلِکَ نُــۨۡجِی الۡمُؤۡمِنِیۡنَ ﴿۸۹﴾", "english": " So We heard his prayer and delivered him from the distress. And thus do We deliver the believers.", "french": " Aussi Nous entendîmes sa prière, et Nous le sauvâmes de sa détresse. Et c’est ainsi que Nous délivrons les croyants.", "german": " Da erhörten Wir ihn und retteten ihn aus der Trübsal; also retten Wir die Gläubigen.", "spanish": " Oímos pues su oración y lo libramos de la angustia. Así salvamos a los creyentes.", "urdu": " پس ہم نے اس کی دعا کو سنا اور غم سے اسے نجات دی اور ہم اسی طرح مومنوں کو نجات دیا کرتے ہیں۔"}, {"arabic": " وَ زَکَرِیَّاۤ اِذۡ نَادٰی رَبَّہٗ رَبِّ لَا تَذَرۡنِیۡ فَرۡدًا وَّ اَنۡتَ خَیۡرُ الۡوٰرِثِیۡنَ ﴿ۚۖ۹۰﴾", "english": " And remember Zachariah when he cried to his Lord, saying , ‘My Lord, leave me not childless, and Thou art the Best of inheritors.’", "french": " Et souviens-toi de Zacharie ; lorsqu’il supplia son Seigneur, en disant : « Mon Seigneur, ne me laisse pas seul sans enfant , et Tu es le Meilleur des héritiers. »", "german": " Und (gedenke) Zacharias´, da er zu seinem Herrn rief: \"Mein Herr, lasse mich nicht einsam, und Du bist der Beste der Erben.\"", "spanish": " Y acuérdate de Zacarías, cuando clamó a su Señor, diciendo: “Señor mío, no me dejes sin hijo, pues Tú eres el Mejor de los herederos”.", "urdu": " اور زکریا کو بھی (یاد کر) جب اس نے اپنے رب کو پکارا تھا اور کہا تھا کہ اے میرے رب مجھے اکیلا نہ چھوڑ۔ اور تو وارث ہونے والوں میں سب سے بہتر ہے۔"}, {"arabic": " فَاسۡتَجَبۡنَا لَہٗ ۫ وَ وَہَبۡنَا لَہٗ یَحۡیٰی وَ اَصۡلَحۡنَا لَہٗ زَوۡجَہٗ ؕاِنَّہُمۡ کَانُوۡا یُسٰرِعُوۡنَ فِی الۡخَیۡرٰتِ وَ یَدۡعُوۡنَنَا رَغَبًا وَّ رَہَبًا ؕوَ کَانُوۡا لَنَا خٰشِعِیۡنَ ﴿۹۱﴾", "english": " So We heard his prayer and bestowed upon him John and cured his wife for him. They used to vie with one another in good works and they called on Us in hope and in fear, and they humbled themselves before Us.", "french": " Aussi Nous entendîmes sa prière et Nous lui accordâmes Jean-Baptiste, et Nous guérîmes sa femme pour lui. Assurément, ils se hâtaient à qui mieux mieux à faire de bonnes œuvres, et ils Nous invoquaient dans l’espoir et la crainte, et ils étaient humbles devant Nous.", "german": " Da erhörten Wir ihn und schenkten ihm Johannes und heilten ihm sein Weib. Sie pflegten miteinander zu wetteifern in guten Taten und sie riefen Uns an in Hoffnung und in Furcht und waren demütig vor Uns.", "spanish": " Oímos pues su oración y le concedimos a Juan y curamos a su mujer para él. Solían emularse mutuamente en las buenas acciones y nos invocaron con esperanza y temor, humillándose ante Nosotros.", "urdu": " اور ہم نے اس کی دعا کو سنا اور اس کو یحییٰ عطا کیا اور اس کی بیوی کو اس کی خاطر تندرست کر دیا۔ وہ سب لوگ نیکیوں میں جلدی کرتے تھے اور ہم کو محبت اور خوف سے پکارتے تھے اور ہماری خاطر عجز کی زندگی بسر کرتے تھے۔"}, {"arabic": " وَ الَّتِیۡۤ اَحۡصَنَتۡ فَرۡجَہَا فَنَفَخۡنَا فِیۡہَا مِنۡ رُّوۡحِنَا وَ جَعَلۡنٰہَا وَ ابۡنَہَاۤ اٰیَۃً لِّلۡعٰلَمِیۡنَ ﴿۹۲﴾", "english": " And remember her who preserved her chastity; so We breathed into her of Our word and We made her and her son a Sign for peoples.", "french": " Et souviens-toi de celle qui veilla sur sa chasteté ; aussi Nous avons insufflé en elle de Notre parole, et Nous avons fait d’elle et de son fils, un Signe pour les peuples.", "german": " Und die ihre Keuschheit wahrte – Wir hauchten ihr von Unserem Geist ein und machten sie und ihren Sohn zu einem Zeichen für die Welt.", "spanish": " Y acuérdate de aquella que guardó su castidad; por eso la bendijimos con Nuestra revelación y la hicimos a ella y a su hijo un Signo para los pueblos.", "urdu": " اور اس عورت کو بھی (یاد کر) جس نے اپنے ناموس کی حفاظت کی پس ہم نے اس پر اپنا کچھ کلام نازل کیا اور اس کو اور اس کے بیٹے کو دنیا کے لئے ایک نشان بنایا۔"}, {"arabic": " اِنَّ ہٰذِہٖۤ اُمَّتُکُمۡ اُمَّۃً وَّاحِدَۃً ۫ۖ وَّ اَنَا رَبُّکُمۡ فَاعۡبُدُوۡنِ ﴿۹۳﴾", "english": " Verily, this is your people — one people; and I am your Lord, so worship Me.", "french": " En vérité, celle-ci est votre communauté, une seule communauté ; et Je suis votre Seigneur ; adorez-Moi donc.", "german": " Diese eure Gemeinde ist die einige Gemeinde; und Ich bin euer Herr, darum dienet Mir.", "spanish": " En verdad, éste es vuestro pueblo: un pueblo; y Yo soy vuestro Señor, adoradme pues.", "urdu": " یہ تمہاری امت ایک ہی امت ہے۔ اور میں تمہارا رب ہوں۔ پس تم میری ہی عبادت کرو۔"}, {"arabic": " وَ تَقَطَّعُوۡۤا اَمۡرَہُمۡ بَیۡنَہُمۡ ؕ کُلٌّ اِلَیۡنَا رٰجِعُوۡنَ ﴿٪۹۴﴾", "english": " But they have become divided among themselves in their affair; and all will return to Us.", "french": " Mais ils se sont divisés entre eux dans leur affaire ; et ils retourneront tous auprès de Nous.", "german": " Sie aber sind untereinander zerbrochen; alle werden sie zu Uns zurückkehren.", "spanish": " Pero ellos se han dividido mutuamente en su asunto; mas todos volverán a Nosotros.", "urdu": " اور انہوں (یعنی انبیاء کے مخالفوں) نے اپنے دین کو ٹکڑے ٹکڑے (کرکے اپنے مناسب حال ٹکڑے کو اختیار) کر لیا ہے (حالانکہ) وہ سب ہماری طرف لوٹائے جانے والے ہیں۔"}, {"arabic": " فَمَنۡ یَّعۡمَلۡ مِنَ الصّٰلِحٰتِ وَ ہُوَ مُؤۡمِنٌ فَلَا کُفۡرَانَ لِسَعۡیِہٖ ۚ وَ اِنَّا لَہٗ کٰتِبُوۡنَ ﴿۹۵﴾", "english": " So whoever does good works and is a believer, his effort will not be disregarded and We shall surely record it.", "french": " Aussi, quiconque accomplit de bonnes œuvres et est croyant, ses efforts ne resteront pas non appréciés, et Nous les enregistrerons certainement en sa faveur.", "german": " Wer also gute Werke tut und gläubig ist, dessen Bemühen wird nicht unbelohnt bleiben. Wir werden es gewisslich verzeichnen.", "spanish": " Por ello quien haga buenas obras y sea creyente, su esfuerzo no se perderá, pues Nosotros lo anotaremos.", "urdu": " پس جو کوئی مناسب حال عمل کرے گا اور ساتھ ہی مومن بھی ہوگا‘ تو اس کی کوشش کو رد ّنہ کیا جائے گا اور ہم اس کے نیک اعمال کو لکھ رکھیں گے۔"}, {"arabic": " وَ حَرٰمٌ عَلٰی قَرۡیَۃٍ اَہۡلَکۡنٰہَاۤ اَنَّہُمۡ لَا یَرۡجِعُوۡنَ ﴿۹۶﴾", "english": " And it is an inviolable law for a township which We have destroyed that they shall not return.", "french": " Et c’est un décret invariable pour toute ville que Nous avons détruite, que ses habitants ne retourneront pas à cette vie.", "german": " Und es ist ein unwiderruflicher Bann für eine Stadt, die Wir zerstört, dass sie nicht wiederkehren sollen,", "spanish": " Y es una ley inviolable que una ciudad que hemos destruido no resurja.", "urdu": " اور ہر ایک بستی جسے ہم نے ہلاک کیا ہے اس کے لئے یہ فیصلہ کر دیا گیا ہے کہ اس کے بسنے والے لوٹ کر اس دنیا میں نہیں آئیں گے۔"}, {"arabic": " حَتّٰۤی اِذَا فُتِحَتۡ یَاۡجُوۡجُ وَ مَاۡجُوۡجُ وَ ہُمۡ مِّنۡ کُلِّ حَدَبٍ یَّنۡسِلُوۡنَ ﴿۹۷﴾", "english": " It shall be so even when Gog and Magog are let loose and they shall hasten forth from every height.", "french": " Il en sera ainsi même quand Gog et Magog seront lâchés, et qu’ils se précipiteront de toutes les hauteurs,", "german": " bis dann, wenn Gog und Magog freigelassen werden, sie von allen Höhen herbeieilen.", "spanish": " Y así será aun cuando Gog y Magog queden libres y se precipiten desde todas las alturas.", "urdu": " یہاں تک کہ جب یاجوج اور ماجوج کے لئے دروازہ کھول دیا جائے گا اور وہ ہر پہاڑی اور ہر سمندر کی لہر سے پھلانگتے ہوئے دنیا میں پھیل جائیں گے۔"}, {"arabic": " وَ اقۡتَرَبَ الۡوَعۡدُ الۡحَقُّ فَاِذَا ہِیَ شَاخِصَۃٌ اَبۡصَارُ الَّذِیۡنَ کَفَرُوۡا ؕ یٰوَیۡلَنَا قَدۡ کُنَّا فِیۡ غَفۡلَۃٍ مِّنۡ ہٰذَا بَلۡ کُنَّا ظٰلِمِیۡنَ ﴿۹۸﴾", "english": " And the true promise draws nigh; then behold, the eyes of those who disbelieve will fixedly stare and they will say , ‘Alas for us! we were indeed heedless of this; nay, we were wrongdoers!’", "french": " Et la vraie promesse approche ; et alors les yeux de ceux qui ne croient pas regarderont fixement, et ils diront : « Hélas pour nous ! Vraiment nous y avions été inattentifs ; bien plus, nous étions des injustes ! »", "german": " Und die wahre Verheißung naht; dann siehe, es werden die Augen derer, die ungläubig waren, starr blicken: \"O wehe uns, wir waren in der Tat uneingedenk dessen; ja, wir waren Frevler!\"", "spanish": " Mas la promesa verdadera se acerca; mirad, pues, que los ojos de quienes no creen mirarán fijamente y dirán: “¡Ay de nosotros! fuimos en verdad descuidados respecto de ello; ¡No!, fuimos inicuos”.", "urdu": " اور (خدا کا) سچا وعدہ قریب آجائے گا تو اس وقت کافروں کی آنکھیں پھٹی کی پھٹی رہ جائیں گی اور وہ کہیں گے۔ ہم پر افسوس! ہم تو اس دن کے متعلق سخت غفلت میں پڑے رہے بلکہ ہم لوگ تو ظالم تھے۔"}, {"arabic": " اِنَّکُمۡ وَ مَا تَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ حَصَبُ جَہَنَّمَ ؕ اَنۡتُمۡ لَہَا وٰرِدُوۡنَ ﴿۹۹﴾", "english": " ‘Surely, you and that which you worship beside Allah are the fuel of Hell. To it shall you all come.’", "french": " « Assurément, vous, et ce que vous adorez en dehors d’Allāh, vous serez le combustible de l’Enfer. Vous y descendrez tous. »", "german": " Wahrlich, ihr und das, was ihr anbetet statt Allah, Brennstoff der Hölle ist´s. Dahin werdet ihr kommen müssen.", "spanish": " “En verdad, vosotros y lo que adoráis en lugar de Al-lah sois el combustible del Infierno. A él iréis todos ”.", "urdu": " (اس وقت کہا جائے گا کہ) تم بھی اور جن چیزوں کی تم اللہ کے سوا پرستش کرتے تھے سب کی سب جہنم کا ایندھن بنیں گی تم سب اس میں داخل ہوگے۔"}, {"arabic": " لَوۡ کَانَ ہٰۤؤُلَآءِ اٰلِہَۃً مَّا وَرَدُوۡہَا ؕ وَ کُلٌّ فِیۡہَا خٰلِدُوۡنَ ﴿۱۰۰﴾", "english": " If these had been gods, they would not have come to it; and all will abide therein.", "french": " Si ceux-là avaient été des dieux, ils n’y seraient pas descendus ; et tous y demeureront pendant longtemps .", "german": " Wären diese Götter gewesen, sie wären nicht dahin gekommen; doch sie müssen alle darin bleiben.", "spanish": " Si hubiesen sido dioses, no habrían llegado a él; mas todos morarán en él.", "urdu": " اگر یہ (مصنوعی خدا جن کو تم خدا قرار دیتے ہو) واقعہ میں خدا ہوتے تو یہ لوگ کیوں جہنم میں پڑتے اور یہ سب تو مدتوں اس میں پڑے رہیں گے۔"}, {"arabic": " لَہُمۡ فِیۡہَا زَفِیۡرٌ وَّ ہُمۡ فِیۡہَا لَا یَسۡمَعُوۡنَ ﴿۱۰۱﴾", "english": " Therein, groaning will be their lot and they will not hear therein anything else .", "french": " Là, leur sort sera les gémissements, et ils n’y entendront rien d’autre .", "german": " Ihr Los darin wird Stöhnen sein, und darin werden sie nicht hören.", "spanish": " Allí el gemido será su suerte y no oirán ninguna otra cosa.", "urdu": " وہ اس میں چیخیں گے اور وہ اس میں (سمجھانے والوں میں سے کسی کی) بات نہیں سنیں گے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ سَبَقَتۡ لَہُمۡ مِّنَّا الۡحُسۡنٰۤی ۙ اُولٰٓئِکَ عَنۡہَا مُبۡعَدُوۡنَ ﴿۱۰۲﴾ۙ", "english": " But as for those for whom the promise of a good reward has already gone forth from Us, these will be removed far from it.", "french": " Mais quant à ceux pour qui la promesse d’ une belle récompense a déjà été décrétée de Nous, ceux-là seront emmenés loin de là.", "german": " Die aber, an welche (die Verheißung) eines herrlichen Lohns schon vordem von Uns ergangen ist, diese werden von ihr (der Hölle) weit entfernt sein.", "spanish": " En cuanto a quienes han recibido ya la promesa de una buena recompensa Nuestra, éstos serán alejados de él.", "urdu": " یقیناً وہ لوگ جن کے متعلق ہماری طرف سے نیک سلوک کا وعدہ ہو چکا ہے وہ اس دوزخ سے دور رکھے جائیں گے۔"}, {"arabic": " لَا یَسۡمَعُوۡنَ حَسِیۡسَہَا ۚ وَ ہُمۡ فِیۡ مَا اشۡتَہَتۡ اَنۡفُسُہُمۡ خٰلِدُوۡنَ ﴿۱۰۳﴾ۚ", "english": " They will not hear the slightest sound thereof; and they shall abide in that which their souls desire.", "french": " Ils n’en entendront pas le moindre son ; et ils resteront éternellement dans ce que leur âme désire.", "german": " Sie werden nicht den leisesten Laut davon hören, während sie in dem verweilen, was ihre Seelen begehren.", "spanish": " No oirán el más ligero sonido suyo; y morarán en lo que sus almas desean.", "urdu": " وہ اس کی آواز تک نہیں سنیں گے اور وہ اس (حالت) میں جسے ان کے دل چاہتے ہیں ہمیشہ رہیں گے۔"}, {"arabic": " لَا یَحۡزُنُہُمُ الۡفَزَعُ الۡاَکۡبَرُ وَ تَتَلَقّٰہُمُ الۡمَلٰٓئِکَۃُ ؕ ہٰذَا یَوۡمُکُمُ الَّذِیۡ کُنۡتُمۡ تُوۡعَدُوۡنَ ﴿۱۰۴﴾", "english": " The Great Terror will not grieve them, and the angels will meet them, saying , ‘This is your day which you were promised.’", "french": " La Grande Terreur ne les désolera pas, et les anges les rencontreront en disant : « Ceci est votre jour, qui vous avait été promis. »", "german": " Der große Schrecken wird sie nicht betrüben, und die Engel werden ihnen entgegenkommen: \"Das ist euer Tag, der euch verheißen ward.\"", "spanish": " El Gran Terror no los afligirá, y los ángeles los recibirán diciendo: “Éste es el día vuestro que se os prometió”.", "urdu": " بڑی پریشانی کا وقت بھی ان کو غمگین نہیں کرے گا اور فرشتے ان سے ملیں گے اور کہیں گے یہ وہ تمہارا دن ہے جس کا تم سے وعدہ کیا گیا تھا۔"}, {"arabic": " یَوۡمَ نَطۡوِی السَّمَآءَ کَطَیِّ السِّجِلِّ لِلۡکُتُبِ ؕ کَمَا بَدَاۡنَاۤ اَوَّلَ خَلۡقٍ نُّعِیۡدُہٗ ؕ وَعۡدًا عَلَیۡنَا ؕ اِنَّا کُنَّا فٰعِلِیۡنَ ﴿۱۰۵﴾", "english": " Remember the day when We shall roll up the heavens like the rolling up of written scrolls by a scribe. As We began the first creation, so shall We repeat it — a promise binding upon Us; We shall certainly perform it.", "french": " Le jour où Nous enroulerons les cieux comme on enroule les rouleaux écrits par un scribe. Comme Nous avons commencé la première création, ainsi Nous la répéterons – une promesse qui Nous engage ; en vérité Nous l ’exécuterons.", "german": " An dem Tage, da Wir die Himmel zusammenrollen werden, wie die Schriftrollen zusammengerollt werden. Wie Wir die erste Schöpfung begannen, (so) werden Wir sie erneuern – bindend für Uns ist die Verheißung; wahrlich, Wir werden (sie) erfüllen.", "spanish": " Acuérdate del día en que enrollaremos los cielos como un escriba enrolla los rollos escritos. Al igual que empezamos la primera creación, la repetiremos; una promesa que nos obliga: en verdad la cumpliremos.", "urdu": " جس دن ہم آسمان کو اس طرح لپیٹ دیں گے جس طرح بہیاں تحریر کو لپیٹ لیتی ہیں۔ جس طرح ہم نے تمہاری پیدائش کو پہلی دفعہ شروع کیا تھا اسی طرح پھر اس کو دوہرائیں گے یہ ہم نے اپنے اوپر لازم کر رکھا ہے۔ ہم ایسا ہی کرنے کا ارادہ رکھتے ہیں۔"}, {"arabic": " وَ لَقَدۡ کَتَبۡنَا فِی الزَّبُوۡرِ مِنۡۢ بَعۡدِ الذِّکۡرِ اَنَّ الۡاَرۡضَ یَرِثُہَا عِبَادِیَ الصّٰلِحُوۡنَ ﴿۱۰۶﴾", "english": " And already have We written in the Book of David , after the exhortation, that My righteous servants shall inherit the land.", "french": " Et déjà Nous avons écrit dans les Psaumes de David , après l’exhortation, que Mes serviteurs justes hériteront de cette terre.", "german": " Und bereits haben Wir in dem Buche (Davids), nach der Ermahnung, geschrieben, dass Meine rechtschaffenen Diener das Land erben sollen.", "spanish": " Pues hemos escrito ya en los Salmos de David, después de la exhortación, que Mis siervos justos heredarán la tierra.", "urdu": " اور ہم نے زبور میں کچھ نصیحتیں کرنے کے بعد یہ لکھ چھوڑا ہے کہ ارض (مقدس) کے وارث میرے نیک بندے ہوں گے۔"}, {"arabic": " اِنَّ فِیۡ ہٰذَا لَبَلٰغًا لِّقَوۡمٍ عٰبِدِیۡنَ ﴿۱۰۷﴾ؕ", "english": " Herein, surely, is a message for people who worship God .", "french": " Il se trouve assurément en ceci un message important pour les gens qui font l’adoration d’Allāh .", "german": " Hierin ist wahrlich eine Botschaft für ein Volk, das (Gott) dient.", "spanish": " Aquí hay en verdad un mensaje significativo para las gentes que adoran a Dios.", "urdu": " اس (مضمون) میں ایک پیغام ہے اس قوم کے لئے جو عبادت گذار ہے۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنٰکَ اِلَّا رَحۡمَۃً لِّلۡعٰلَمِیۡنَ ﴿۱۰۸﴾", "english": " And We have sent thee not but as a mercy for all peoples.", "french": " Nous ne t’avons envoyé que comme une miséricorde pour tous les peuples.", "german": " Wir entsandten dich nur als eine Barmherzigkeit für alle Welten.", "spanish": " Pues no te hemos enviado sino como misericordia para todos los pueblos.", "urdu": " اور ہم نے تجھے دنیا کے لئے صرف رحمت بنا کر بھیجا ہے۔"}, {"arabic": " قُلۡ اِنَّمَا یُوۡحٰۤی اِلَیَّ اَنَّمَاۤ اِلٰـہُکُمۡ اِلٰہٌ وَّاحِدٌ ۚ فَہَلۡ اَنۡتُمۡ مُّسۡلِمُوۡنَ ﴿۱۰۹﴾", "english": " Say, ‘Surely it has been revealed to me that your God is but One God. Will you then submit?’", "french": " Dis : « Il m’est assurément révélé que votre Dieu est un Dieu Unique. Voulez-vous donc vous soumettre ? »", "german": " Sprich: \"Mir ward lediglich offenbart, dass euer Gott nur der Einige Gott ist. Wollt ihr denn nicht annehmen?\"", "spanish": " Diles: “En verdad se me ha revelado que vuestro Dios no es sino el Dios Único. ¿No os someteréis?”.", "urdu": " تو کہدے کہ مجھ پر تو صرف یہ وحی ہوتی ہے کہ تمہارا خدا ایک ہے۔ پس کیا تم اس بات کو مانو گے (کہ نہیں؟)"}, {"arabic": " فَاِنۡ تَوَلَّوۡا فَقُلۡ اٰذَنۡتُکُمۡ عَلٰی سَوَآءٍ ؕ وَ اِنۡ اَدۡرِیۡۤ اَقَرِیۡبٌ اَمۡ بَعِیۡدٌ مَّا تُوۡعَدُوۡنَ ﴿۱۱۰﴾", "english": " But if they turn back, say, ‘I have warned you all alike and I know not whether that which you are promised is near or distant.", "french": " Mais s’ils s’ en détournent, alors dis : « Je vous ai fait l’annonce à tous pareillement, et je ne sais pas si ce qui vous est promis est proche ou éloigné.", "german": "", "spanish": " Mas si te dan la espalda, diles: “Os he advertido, a todos por igual; y no sé si aquello que se os ha prometido está cercano o lejano”.", "urdu": " پس اگر وہ پیٹھ پھیر لیں تو تو ان سے کہہ دے کہ میں نے تم (میں سے مومن و کافر) کو برابر خبر دے دی ہے اورمیں نہیں جانتا کہ وہ امر جس کا تم سے وعدہ کیا گیا تھا قریب ہے یا بعید۔"}, {"arabic": " اِنَّہٗ یَعۡلَمُ الۡجَہۡرَ مِنَ الۡقَوۡلِ وَ یَعۡلَمُ مَا تَکۡتُمُوۡنَ ﴿۱۱۱﴾", "english": " ‘Verily, He knows what is open in speech, and He knows that which you conceal.", "french": " En vérité, Il sait ce qui est une déclaration ouverte, et Il sait ce que vous cachez.", "german": " Wahrlich, Er kennt, was offen ist in der Rede, und Er weiß, was ihr verheimlicht.", "spanish": " “En verdad, Él sabe lo que se dice abiertamente y sabe lo que ocultáis”.", "urdu": " خدا ظاہر بات کو بھی جانتا ہے اور جو تم چھپاتے ہو اسے بھی جانتا ہے۔"}, {"arabic": " وَ اِنۡ اَدۡرِیۡ لَعَلَّہٗ فِتۡنَۃٌ لَّکُمۡ وَ مَتَاعٌ اِلٰی حِیۡنٍ ﴿۱۱۲﴾", "english": " ‘And I know not but that it may be a trial for you, and only an enjoyment for a while.’", "french": " Et je ne sais pas ; cela pourrait être une épreuve pour vous, et rien qu’ une jouissance temporaire. »", "german": "", "spanish": " “Y sólo sé que puede ser una prueba para vosotros y sólo un goce momentáneo”.", "urdu": " اور میں نہیں جانتا کہ وہ (بات جو اوپر بیان ہوئی ہے) شاید تمہارے لئے ایک آزمائش ہے اور (اس سے) ایک عرصہ تک تمہیں فائدہ پہنچانا مدنظر ہے (یا ہمیشہ ہمیش کے لئے) ۔"}], "Surah": 21}