{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséri­cordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یَسۡـَٔلُوۡنَکَ عَنِ الۡاَنۡفَالِ ؕ قُلِ الۡاَنۡفَالُ لِلّٰہِ وَ الرَّسُوۡلِ ۚ فَاتَّقُوا اللّٰہَ وَ اَصۡلِحُوۡا ذَاتَ بَیۡنِکُمۡ ۪ وَ اَطِیۡعُوا اللّٰہَ وَ رَسُوۡلَہٗۤ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۲﴾", "english": " They Ask thee concerning the spoils of war. Say, ‘The spoils belong to Allah and the Messenger. So fear Allah, and set things right among yourselves, and obey Allah and His Messenger, if you are believers.’", "french": " Ils t’interrogent à propos du butin. Dis : « Le butin de guerre appartient à Allāh et au Messager. Craignez donc Allāh, et maintenez l’entente entre vous ; et obéissez à Allāh et à Son Messager, si vous êtes croyants. »", "german": " Sie befragen dich über die Beute. Sprich: \"Die Beute gehört Allah und dem Gesandten. Drum fürchtet Allah und ordnet die Dinge in Eintracht unter euch und gehorchet Allah und Seinem Gesandten, wenn ihr Gläubige seid.\"", "spanish": " Te preguntan sobre el botín de guerra . Diles: “El botín pertenece a Al-lah y al Mensajero. Temed pues a Al-lah, arreglad bien las cosas entre vosotros, y obedeced a Al-lah y a Su Mensajero, si sois creyentes.", "urdu": " (اے رسول)! لوگ تجھ سے اموال غنیمت کے متعلق سوال کرتے ہیں تو (ان سے) کہہ دے کہ اموال غنیمت اللہ اور اس کے رسول کے ہیں پس اللہ کا تقویٰ اختیار کرو اور آپس میں اصلاح کی کوشش کرو اور اگر تم مومن ہو تو اللہ اور اس کے رسول کی اطاعت کرو۔"}, {"arabic": " اِنَّمَا الۡمُؤۡمِنُوۡنَ الَّذِیۡنَ اِذَا ذُکِرَ اللّٰہُ وَجِلَتۡ قُلُوۡبُہُمۡ وَ اِذَا تُلِیَتۡ عَلَیۡہِمۡ اٰیٰتُہٗ زَادَتۡہُمۡ اِیۡمَانًا وَّ عَلٰی رَبِّہِمۡ یَتَوَکَّلُوۡنَ ۚ﴿ۖ۳﴾", "english": " True believers are only those whose hearts tremble when the name of Allah is mentioned, and when His Signs are recited to them they increase their faith, and who put their trust in their Lord,", "french": " Seuls sont de vrais croyants ceux dont le cœur tremble lorsque le nom d’ Allāh est mentionné ; et lorsque Ses Signes leur sont récités, cela augmente leur foi ; et qui se fient totalement à leur Seigneur.", "german": " Nur die sind Gläubige, deren Herzen erbeben, wenn Allah genannt wird, und die, wenn ihnen Seine Zeichen vorgetragen werden, dadurch zunehmen an Glauben und auf ihren Herrn vertrauen;", "spanish": " Sólo son verdaderos creyentes aquellos cuyos corazones se estremecen cuando se menciona el nombre de Al-lah, que aumentan su fe cuando se les recitan Sus Signos y ponen su confianza en su Señor.", "urdu": " مومن تو صرف وہی ہیں کہ جب (ان کے سامنے) اللہ کا ذکر کیا جائے تو ان کے دل ڈر جائیں اور جب ان کے سامنے اس کی آیات پڑھی جائیں تو وہ ان کے ایمان کو بڑھا دیں۔ نیز (مومن وہ ہیں) جو اپنے رب پر توکل کرتے ہیں۔"}, {"arabic": " الَّذِیۡنَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ مِمَّا رَزَقۡنٰہُمۡ یُنۡفِقُوۡنَ ؕ﴿۴﴾", "english": " Who observe Prayer and spend out of that which We have provided for them.", "french": " Qui observent la Prière, et dépensent de ces dons et richesses que Nous leur avons accordés.", "german": " die das Gebet verrichten und spenden von dem, was Wir ihnen gegeben haben.", "spanish": " Quienes cumplen la Oración y gastan de lo que les hemos proporcionado.", "urdu": " (اسی طرح حقیقی مومن وہ ہیں) جو نمازوں کو (شرائط کے مطابق) ادا کرتے ہیں۔ اور جو (کچھ) ہم نے ان کو دیا ہے اس میں سے خرچ کرتے ہیں۔"}, {"arabic": " اُولٰٓئِکَ ہُمُ الۡمُؤۡمِنُوۡنَ حَقًّا ؕ لَہُمۡ دَرَجٰتٌ عِنۡدَ رَبِّہِمۡ وَ مَغۡفِرَۃٌ وَّ رِزۡقٌ کَرِیۡمٌ ۚ﴿۵﴾", "english": " These it is who are true believers. They have grades of rank with their Lord, as well as forgiveness and an honourable provision.", "french": " Ceux-là sont les vrais croyants. Ils ont des catégories par rangs auprès de leur Seigneur ainsi que le pardon", "german": " Das sind die wahren Gläubigen. Sie haben Rangstufen bei ihrem Herrn und Vergebung und eine ehrenvolle Versorgung.", "spanish": " Éstos son los verdaderos creyentes. Tienen grados elevados ante su Señor, así como el perdón y una generosa provisión.", "urdu": " یہ (مذکورہ بالا صفات رکھنے والے) ہی سچے مومن ہیں ان کے رب کے پاس ان کے لئے (بڑے بڑے) مدارج اور بخشش کا سامان اور معزز رزق ہے۔"}, {"arabic": " کَمَاۤ اَخۡرَجَکَ رَبُّکَ مِنۡۢ بَیۡتِکَ بِالۡحَقِّ ۪ وَ اِنَّ فَرِیۡقًا مِّنَ الۡمُؤۡمِنِیۡنَ لَکٰرِہُوۡنَ ۙ﴿۶﴾", "english": " As it was thy Lord Who rightfully brought thee forth from thy house, while a party of the believers were averse, therefore He helped thee against thy enemy.", "french": " Leur foi est aussi réelle tout comme ton Seigneur t’a fait sortir de ta maison pour une bonne cause alors qu’un groupe de croyants y répugnait.", "german": " Dies, weil dein Herr dich nicht ohne Grund aus deinem Hause führte, indes ein Teil der Gläubigen abgeneigt war.", "spanish": " Ya que fue tu Señor quien, legítimamente, te hizo salir de u casa aunque una parte de los creyentes se mostraba contraria, así Él te ayudó contra tu enemigo.", "urdu": " یہ (انعام ان پر) اس وجہ سے (ہوگا) کہ تجھ کو تیرے رب نے تیرے گھر سے ایک خاص مقصد کے ماتحت نکالا ہے اور مومنوں میں سے ایک فریق اسے بہت ہی ناپسند کرتا تھا۔"}, {"arabic": " یُجَادِلُوۡنَکَ فِی الۡحَقِّ بَعۡدَ مَا تَبَیَّنَ کَاَنَّمَا یُسَاقُوۡنَ اِلَی الۡمَوۡتِ وَ ہُمۡ یَنۡظُرُوۡنَ ؕ﴿۷﴾", "english": " They dispute with thee concerning the truth after it has become manifest, as though they are being driven to death while they actually see it .", "french": " Ils discutent avec toi sur la vérité après qu’elle soit devenue manifeste, comme si on les poussait vers la mort, alors qu’ils la voient.", "german": " Sie streiten mit dir über die Wahrheit, nachdem sie doch deutlich kund geworden, als ob sie in den Tod getrieben würden und (ihn) vor Augen hätten.", "spanish": " Ellos disputan contigo sobre la verdad después de que se ha hecho vidente, como si fuesen arrastrados a la muerte mientras realmente la ven.", "urdu": " وہ تجھ سے حق ظاہر ہونے کے بعد اس طرح بحث کرتے ہیں گویا (اسلام کی دعوت سے) ان کو موت کی طرف دھکیلا جا رہا ہے اور (یوں معلوم ہوتا ہے کہ) وہ (اس موت کو آنکھوں سے) دیکھ رہے ہیں۔"}, {"arabic": " وَ اِذۡ یَعِدُکُمُ اللّٰہُ اِحۡدَی الطَّآئِفَتَیۡنِ اَنَّہَا لَکُمۡ وَ تَوَدُّوۡنَ اَنَّ غَیۡرَ ذَاتِ الشَّوۡکَۃِ تَکُوۡنُ لَکُمۡ وَ یُرِیۡدُ اللّٰہُ اَنۡ یُّحِقَّ الۡحَقَّ بِکَلِمٰتِہٖ وَ یَقۡطَعَ دَابِرَ الۡکٰفِرِیۡنَ ۙ﴿۸﴾", "english": " And remember the time when Allah promised you one of the two parties‡ that it should be yours, and you wished that the one without sting should be yours, but Allah desired to establish the truth by His words and to cut off the root of the disbelievers,", "french": " Et souvenez-vous quand Allāh vous a promis que l’un des deux groupes serait pour vous, et que vous vouliez que ce fût le groupe sans armes ; mais Allāh a désiré établir la Vérité par Ses paroles et couper les racines des mécréants,", "german": " Und (gedenket der Zeit) da Allah euch eine der beiden Scharen verhieß, dass sie euer sein sollte, und ihr wünschtet, die ohne Stachel möchte euer werden, Allah aber wünschte die Wahrheit an den Tag zu bringen durch Seine Worte und die Wurzel der Ungläubigen abzuschneiden,", "spanish": " Y acordaos de cuando Al-lah os prometió que uno de los dos grupos sería vuestro, y vosotros deseabais que lo fuera el que no tenía peligro, pero Al-lah deseó demostrar la verdad con sus palabras y exterminar de raíz a los incrédulos.", "urdu": " اور (اس وقت کو یاد کرو) جبکہ اللہ تم سے دو گروہوں میں سے ایک کا وعدہ کرتا تھا کہ وہ تم کو دیا جائے گا اور تم چاہتے تھے کہ وہ گروہ جس کے پاس ہتھیار نہیں ہیں تم کو ملے اور اللہ چاہتا تھا کہ وہ حق کو اپنے احکام کے ذریعہ سے پورا کردے اور کافروں کی جڑ کاٹ دے۔"}, {"arabic": " لِیُحِقَّ الۡحَقَّ وَ یُبۡطِلَ الۡبَاطِلَ وَ لَوۡ کَرِہَ الۡمُجۡرِمُوۡنَ ۚ﴿۹﴾", "english": " That He might establish the truth and bring to naught that which is false, although the guilty might dislike it.", "french": " Afin qu’Il pût établir la Vérité et anéantir ce qui est faux, en dépit de la répugnance des coupables.", "german": " auf dass Er die Wahrheit an den Tag brächte und zunichte machte das Falsche, ob die Sünder es gleich ungern litten.", "spanish": " Para establecer la verdad y reducir a la nada lo que es falso, aunque no les agrade a los culpables.", "urdu": " تا کہ وہ اس طرح حق کو قائم کر دے اور باطل کو تباہ کر دے خواہ مجرم اسے ناپسند ہی کیوں نہ کرتے ہوں۔"}, {"arabic": " اِذۡ تَسۡتَغِیۡثُوۡنَ رَبَّکُمۡ فَاسۡتَجَابَ لَکُمۡ اَنِّیۡ مُمِدُّکُمۡ بِاَلۡفٍ مِّنَ الۡمَلٰٓئِکَۃِ مُرۡدِفِیۡنَ ﴿۱۰﴾", "english": " When you implored the assistance of your Lord, and He answered you, saying , ‘I will assist you with a thousand of the angels, following one another.’", "french": " Quand vous avez imploré l’aide de votre Seigneur, et qu’Il vous a répondu en disant : « Assurément, Je vous soutiendrai avec un millier d’anges se suivant rangs sur rangs. »", "german": " Da ihr um Hilfe schriet zu eurem Herrn, und Er gab euch die Antwort: \"Ich will euch beistehen mit tausend Engeln, einer hinter dem anderen.\"", "spanish": " Cuando implorasteis la ayuda de vuestro Señor, y Él os respondió, diciendo: “Os ayudaré con mil ángeles, uno tras otro”.", "urdu": " (اور اس وقت کو بھی یاد کرو) جبکہ تم اپنے رب سے التجائیں کرتے تھے۔ اس پر تمہارے رب نے تمہاری دعاٶں کو سنا (اور کہا کہ) میں تمہاری مدد ہزاروں فرشتوں سے کروں گا جن کا لشکر کے بعد لشکر بڑھ رہا ہوگا۔"}, {"arabic": " وَ مَا جَعَلَہُ اللّٰہُ اِلَّا بُشۡرٰی وَ لِتَطۡمَئِنَّ بِہٖ قُلُوۡبُکُمۡ ۚ وَ مَا النَّصۡرُ اِلَّا مِنۡ عِنۡدِ اللّٰہِ ؕ اِنَّ اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿٪۱۱﴾", "english": " And Allah made it only as glad tidings, and that your hearts might thereby be set at rest. But help comes from Allah alone; surely, Allah is Mighty, Wise.", "french": " Et Allāh ne fit cela que comme une bonne nouvelle, et afin que vos cœurs soient ainsi tranquillisés. Mais c’est d’Allāh Seul que vient le secours ; assurément, Allāh est Puissant et Sage.", "german": " Allah tat dies nur als frohe Botschaft, auf dass eure Herzen sich dadurch beruhigten. Jedoch Hilfe kommt von Allah allein; wahrlich, Allah ist allmächtig, allweise.", "spanish": " Y Al-lah no hizo esto sino como una buena nueva, para que vuestros corazones se calmaran con ella. Pero la ayuda sólo procede de Al-lah; en verdad, Al-lah es Poderoso, Sabio.", "urdu": " اور اللہ نے اس خبر کو محض ایک بشارت کے طور پر نازل کیا تھا تا کہ اس کے ذریعہ سے تمہارے دل مطمئن ہو جائیں اور مدد صرف اللہ کے پاس سے آتی ہے (فرشتے تو محض ایک علامت ہیں) اللہ یقیناً بہت غالب (اور) حکمت والا ہے۔"}, {"arabic": " اِذۡ یُغَشِّیۡکُمُ النُّعَاسَ اَمَنَۃً مِّنۡہُ وَ یُنَزِّلُ عَلَیۡکُمۡ مِّنَ السَّمَآءِ مَآءً لِّیُطَہِّرَکُمۡ بِہٖ وَ یُذۡہِبَ عَنۡکُمۡ رِجۡزَ الشَّیۡطٰنِ وَ لِیَرۡبِطَ عَلٰی قُلُوۡبِکُمۡ وَ یُثَبِّتَ بِہِ الۡاَقۡدَامَ ﴿ؕ۱۲﴾", "english": " When He caused sleep to come upon you as a sign of security from Him, and He sent down water upon you from the clouds, that thereby He might purify you, and remove from you the filth of Satan, and that He might strengthen your hearts and make your steps firm therewith.", "french": " Quand Il a fait le sommeil s’emparer de vous, comme signe de sécurité de Sa part, et Il a fait descendre sur vous de l’eau des nuages, afin que par là, Il pût vous purifier et vous enlever la souillure de Satan, et afin qu’Il pût fortifier vos cœurs et affermir vos pas.", "german": " Da Er Schlaf euch einhüllen ließ – Sicherheit von Ihm; und Er sandte Wasser auf euch nieder aus den Wolken, dass Er euch damit reinige und Satans Befleckung von euch hinwegnehme, auf dass Er eure Herzen stärke und [eure] Schritte damit festige.", "spanish": " Cuando hizo que os llegara el sueño como signo de seguridad Suyo, y os envió agua desde las nubes, para purificaros, y eliminar de vosotros la inmundicia de Satanás, y fortalecer vuestros corazones, y hacer vuestros pasos firmes con todo ello.", "urdu": " (یہ نشان اس وقت ظاہر ہوا) جبکہ خدا (اپنی طرف سے) امن اور تسکین کی خوشخبری دینے کے لئے تم پر اونگھ نازل کر رہا تھا اور تم پر بادلوں سے پانی اتار رہا تھا تا کہ اس کے ذریعہ سے تمہیں پاک کردے اور شیطان کی گندگی (یعنی اس کے خوف) کو تم سے دور کر دے اور تا کہ تمہارے دلوں کو مضبوط کرے اور اس (بارش) کے ذریعہ سے تمہارے قدموں کو مضبوط کردے۔"}, {"arabic": " اِذۡ یُوۡحِیۡ رَبُّکَ اِلَی الۡمَلٰٓئِکَۃِ اَنِّیۡ مَعَکُمۡ فَثَبِّتُوا الَّذِیۡنَ اٰمَنُوۡا ؕ سَاُلۡقِیۡ فِیۡ قُلُوۡبِ الَّذِیۡنَ کَفَرُوا الرُّعۡبَ فَاضۡرِبُوۡا فَوۡقَ الۡاَعۡنَاقِ وَ اضۡرِبُوۡا مِنۡہُمۡ کُلَّ بَنَانٍ ﴿ؕ۱۳﴾", "english": " When thy Lord revealed to the angels, saying , ‘I am with you; so give firmness to those who believe. I will cast terror into the hearts of those who disbelieve. Smite, then, the upper parts of their necks, and smite off all finger-tips.’", "french": " Quand ton Seigneur révéla aux anges : « Je suis avec vous ; aussi affermissez ceux qui croient. Je jetterai l’épouvante dans le cœur de ceux qui refusent de croire. Frappez-les donc en haut du cou et frappez-leur les extrémités des doigts. »", "german": " Da dein Herr den Engeln offenbarte: \"Ich bin mit euch; so festiget denn die Gläubigen. In die Herzen der Ungläubigen werde Ich Schrecken werfen. Treffet (sie) oberhalb des Nackens und schlagt ihnen die Fingerspitzen ab!\"", "spanish": " Cuando tu Señor reveló a los ángeles lo siguiente: “Estoy con vosotros; dad firmeza a quienes creen. Yo infundiré el terror en los corazones de los incrédulos. Golpeadles, pues, en la parte superior de sus cuellos, y golpeadles en las yemas de los dedos”.", "urdu": " (یہ وہ وقت تھا) جب تیرا رب ملائکہ کو بھی وحی کر رہا تھا کہ میں تمہارے ساتھ ہوں پس مومنوں کو ثابت قدم بناٶ۔ میں کفار کے دلوں میں رعب ڈالوں گا۔ پس (اے مومنو)! تم ان کی گردنوں پر حملے کرتے جاٶ اور ان کی پورپور پر ضربیں لگاتے جاٶ۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمۡ شَآقُّوا اللّٰہَ وَ رَسُوۡلَہٗ ۚ وَ مَنۡ یُّشَاقِقِ اللّٰہَ وَ رَسُوۡلَہٗ فَاِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ﴿۱۴﴾", "english": " That is because they have opposed Allah and His Messenger. And whoso opposes Allah and His Messenger, then Allah is surely severe in retribution.", "french": " La raison en est qu’ils se sont opposés à Allāh et à Son Messager. Et envers ceux qui s’opposent à Allāh et à Son Messager, Allāh est en vérité sévère en rétribution.", "german": " Dies, weil sie Allah Trotz boten und Seinem Gesandten. Wer aber Allah und Seinem Gesandten Trotz bietet – wahrlich, Allah ist streng im Strafen.", "spanish": " Esto es por haberse opuesto a Al-lah y a Su Mensajero. Pues para quien se opone a Al-lah y a Su Mensajero, Al-lah es ciertamente severo en Su castigo.", "urdu": " یہ اس لئے ہوگا کہ انہوں نے اللہ اور اس کے رسول کی مخالفت کی ہے اور جو کوئی اللہ اور اس کے رسول کی مخالفت کرتا ہے (اسے سمجھ لینا چاہیئے کہ) اللہ بڑی سخت سزا دینے والا ہے۔"}, {"arabic": " ذٰلِکُمۡ فَذُوۡقُوۡہُ وَ اَنَّ لِلۡکٰفِرِیۡنَ عَذَابَ النَّارِ ﴿۱۵﴾", "english": " That is your punishment , taste it then; and know that for disbelievers there is the punishment of the Fire.", "french": " Voilà votre châtiment, goûtez-le donc ! Et souvenez-vous que pour les mécréants, il y a le châtiment du Feu.", "german": " Dies – kostet es denn; und (wisset) dass für die Ungläubigen die Feuerspein bestimmt ist.", "spanish": " Ése es vuestro castigo, probadlo, pues; y sabed que, para los incrédulos, está el castigo del Fuego.", "urdu": " (اے لوگو)! (سنو! اللہ کی سزا) ایسی ہی ہوتی ہے پس اسے چکھو اور (یاد رکھو کہ) کافروں کو یقیناً آگ کا عذاب پہنچنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا لَقِیۡتُمُ الَّذِیۡنَ کَفَرُوۡا زَحۡفًا فَلَا تُوَلُّوۡہُمُ الۡاَدۡبَارَ ﴿ۚ۱۶﴾", "english": " O ye who believe! when you meet those who disbelieve, advancing in force, turn not your backs to them.", "french": " Ô vous qui croyez ! Quand vous rencon­trez les mécréants s’avançant en force, ne leur tournez pas le dos.", "german": " O die ihr glaubt, wenn ihr auf die Ungläubigen stoßt, die im Heerzug vorrücken, so kehrt ihnen nicht den Rücken.", "spanish": " ¡Oh vosotros, los que creéis! Cuando encontréis a los incrédulos que avanzan con fuerza, no les volváis la espalda.", "urdu": " اے مومنو! جب تم کفار سے ایک لشکر کی صورت میں ملو‘ تو کبھی ان کو پیٹھ نہ دکھایا کرو۔"}, {"arabic": " وَ مَنۡ یُّوَلِّہِمۡ یَوۡمَئِذٍ دُبُرَہٗۤ اِلَّا مُتَحَرِّفًا لِّقِتَالٍ اَوۡ مُتَحَیِّزًا اِلٰی فِئَۃٍ فَقَدۡ بَآءَ بِغَضَبٍ مِّنَ اللّٰہِ وَ مَاۡوٰٮہُ جَہَنَّمُ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۱۷﴾", "english": " And whoso turns his back to them on such a day, unless manoeuvring for battle or turning to join another company, he indeed draws upon himself the wrath of Allah, and Hell shall be his abode. And an evil resort it is.", "french": " Et celui qui, en un tel jour, leur tournera le dos, à moins que ce ne soit pour une manœuvre de combat ou pour rejoindre une autre com­pagnie, s’attire en vérité le courroux d’Allāh ; et son habitation sera l’Enfer. Et quelle mauvaise destination !", "german": " Und wer ihnen an solch einem Tage den Rücken kehrt, es sei denn, er schwenke ab zur Schlacht oder zum Anschluss an einen Trupp, der lädt fürwahr Allahs Zorn auf sich, und seine Herberge soll die Hölle sein. Schlimm ist die Bestimmung!", "spanish": " Pues quien les vuelva la espalda en ese día, salvo que esté maniobrando para la batalla o vuelva para unirse a otro grupo, atraerá hacia sí la ira de Al-lah y el Infierno será su morada. ¡Qué mal lugar de descanso es!", "urdu": " اور جو کوئی ایسے موقعہ پر پیٹھ دکھائے گا سوائے اس کے کہ لڑائی کے لئے جگہ بدل رہا ہو یا کسی (مسلمان) گروہ کی طرف (اس کی مدد کے لئے) جا رہا ہو‘ تو وہ اللہ کا غضب لے کر لوٹے گا اور اس کا ٹھکانا جہنم ہوگا اور رہنے کے لحاظ سے وہ جگہ بہت بری ہے۔"}, {"arabic": " فَلَمۡ تَقۡتُلُوۡہُمۡ وَلٰکِنَّ اللّٰہَ قَتَلَہُمۡ ۪ وَ مَا رَمَیۡتَ اِذۡ رَمَیۡتَ وَ لٰکِنَّ اللّٰہَ رَمٰی ۚ وَ لِیُبۡلِیَ الۡمُؤۡمِنِیۡنَ مِنۡہُ بَلَآءً حَسَنًا ؕ اِنَّ اللّٰہَ سَمِیۡعٌ عَلِیۡمٌ ﴿۱۸﴾", "english": " So you killed them not, but it was Allah Who killed them. And thou threwest not when thou didst throw, but it was Allah Who threw, that He might overthrow the disbelievers and that He might confer on the believers a great favour from Himself. Surely, Allah is All-Hearing, All-Knowing.", "french": " Aussi, ce n’était pas vous qui les avez tués, mais c’est Allāh Qui les a tués. Et ce n’était pas toi qui lanças quand tu lanças la poignée de graviers , mais ce fut Allāh Qui lança, afin qu’Il pût accorder aux croyants une épreuve de Sa part - une excellente épreuve. Assurément, Allāh entend tout et sait tout.", "german": " Nicht ihr habt sie erschlagen, sondern Allah erschlug sie. Und du warfest nicht, als du warfest, sondern Allah warf, und dass Er den Gläubigen eine große Gnade von Sich Selbst bezeige. Wahrlich, Allah ist allhörend, allwissend.", "spanish": " Así pues, vosotros no los matasteis, sino que fue Al-lah quien los mató. Y no fuiste tú el que tirabas cuando tiraste algo, sino que fue Al-lah quien tiró, para vencer a los incrédulos y dar a los creyentes una prueba –una prueba bondadosa- de Sí mismo. En verdad, Al-lah es quien todo lo oye, el Omnisciente.", "urdu": " پس (یاد رکھو کہ) ان (کافروں) کو تم نے نہیں مارا تھا بلکہ ان کو اللہ نے مارا تھا۔ اور جب تو نے پتھر پھینکے تھے تو تو نے نہیں پھینکے تھے بلکہ اللہ نے پھینکے تھے جس کا نتیجہ یہ ہوا کہ اس کے ذریعہ سے مومنوں پر ایک بڑا احسان کیا اور اللہ یقیناً بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " ذٰلِکُمۡ وَ اَنَّ اللّٰہَ مُوۡہِنُ کَیۡدِ الۡکٰفِرِیۡنَ ﴿۱۹﴾", "english": " That is what happened ; and know that Allah is He Who weakens the design of the disbelievers.", "french": " Voilà donc ce qui arriva, et sachez qu’Allāh affaiblira les desseins des mécréants.", "german": " Dies – und (wisset) dass Allah den Anschlag der Ungläubigen kraftlos machen wird.", "spanish": " Esto es lo que sucedió; y sabed que Al-lah es quien debilita la estrategia de los incrédulos.", "urdu": " یہ (امر) اسی طرح ہوگا (جس طرح ہم نے کہا تھا) اور اللہ یقیناً کافروں کی تدبیر کو کمزور کرنے والا ہے۔"}, {"arabic": " اِنۡ تَسۡتَفۡتِحُوۡا فَقَدۡ جَآءَکُمُ الۡفَتۡحُ ۚ وَ اِنۡ تَنۡتَہُوۡا فَہُوَ خَیۡرٌ لَّکُمۡ ۚ وَ اِنۡ تَعُوۡدُوۡا نَعُدۡ ۚ وَ لَنۡ تُغۡنِیَ عَنۡکُمۡ فِئَتُکُمۡ شَیۡئًا وَّ لَوۡ کَثُرَتۡ ۙ وَ اَنَّ اللّٰہَ مَعَ الۡمُؤۡمِنِیۡنَ ﴿٪۲۰﴾", "english": " If you sought a judgment, then judgment has indeed come to you. And if you desist, it will be better for you; but if you return to hostility , We too will return. And your party shall be of no avail at all to you, however numerous it be, and know that Allah is with the believers.", "french": " Si vous , ô croyants cherchiez une victoire alors la victoire vous est sûrement parvenue. Et ô mécréants , si vous renoncez, cela vaudra mieux pour vous ; mais si vous revenez aux hostilités, Nous aussi, Nous y reviendrons. Et votre faction ne vous sera d’aucune utilité, aussi importante soit-elle ; et sachez qu’Allāh est avec les croyants.", "german": " Suchtet ihr Entscheidung, dann ist Entscheidung schon zu euch gekommen. Und wenn ihr absteht, so ist es besser für euch; kehrt ihr jedoch (zur Feindseligkeit) zurück werden auch Wir zurückkehren, und eure Schar soll euch ganz und gar nichts frommen so zahlreich sie auch sein mag, denn (wisset) dass Allah mit den Gläubigen ist.", "spanish": " Si buscabais un juicio, la sentencia os ha llegado ciertamente. Y i desistís, será mejor para vosotros; pero si volvéis a la lucha volveremos también y de nada os servirá vuestro ejército por numeroso que sea, pues sabed que Al-lah está con los creyentes.", "urdu": " (اے کفار مکہ)! اگر تم فتح کا نشان مانگتے تھے تو لو تمہارے پاس فتح آگئی اور اگراب بھی تم باز آجاٶ تو یقیناً یہ تمہارے لئے اچھا ہوگا اور اگر تم (شرارت کی طرف) لوٹو تو ہم بھی (سزا کی طرف) لوٹیں گے اور تمہارا جتھا خواہ وہ کتنا ہی مضبوط ہو ہرگز تمہیں کوئی فائدہ نہیں دے گا اور اللہ یقیناً مومنوں کے ساتھ ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَطِیۡعُوا اللّٰہَ وَ رَسُوۡلَہٗ وَ لَا تَوَلَّوۡا عَنۡہُ وَ اَنۡتُمۡ تَسۡمَعُوۡنَ ﴿ۚۖ۲۱﴾", "english": " O ye who believe! obey Allah and His Messenger, and do not turn away from him while you hear him speak .", "french": " Ô vous qui croyez ! Obéissez à Allāh et à Son Messager et ne vous détournez pas de lui pendant que vous entendez ses ordres.", "german": " O die ihr glaubt, gehorchet Allah und Seinem Gesandten, und wendet euch nicht von ihm ab, während ihr zuhört.", "spanish": " ¡Oh vosotros, los que creéis! Obedeced a Al-lah y a Su Mensajero, y no os apartéis de él mientras le oigáis hablar.", "urdu": " اے مومنو! اللہ اور اس کے رسول کی اطاعت کرو‘ اور ان میں سے کسی سے منہ نہ پھیرو‘ اس حالت میں کہ تم (اس کا حکم) سن رہے ہو۔"}, {"arabic": " وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ قَالُوۡا سَمِعۡنَا وَ ہُمۡ لَا یَسۡمَعُوۡنَ ﴿۲۲﴾", "english": " And be not like those who say, ‘We hear,’ but they hear not.", "french": " Et ne soyez pas comme ceux qui disent « Nous entendons » mais ils n’entendent pas.", "german": " Und seid nicht wie jene, die sprechen: \"Wir hören\", und doch hören sie nicht.", "spanish": " Y no seáis como quienes dicen: “escuchamos”, pero no escuchan.", "urdu": " اور ان لوگوں کی طرح مت بنو جنہوں نے یہ کہا تھا کہ ہم سنتے ہیں‘ مگر وہ سنتے نہیں۔"}, {"arabic": " اِنَّ شَرَّ الدَّوَآبِّ عِنۡدَ اللّٰہِ الصُّمُّ الۡبُکۡمُ الَّذِیۡنَ لَا یَعۡقِلُوۡنَ ﴿۲۳﴾", "english": " Surely, the worst of beasts in the sight of Allah are the deaf and the dumb, who have no sense.", "french": " Assurément, aux yeux d’Allāh, de toutes les bêtes, les pires sont les sourdes et les muettes, qui ne comprennent pas.", "german": " Die schlimmsten Tiere vor Allah sind die, die Taub und Stumm sind und die nicht begreifen.", "spanish": " En verdad, a los ojos de Al-lah, las peores bestias son los sordos y los mudos, que no entenderán.", "urdu": " اللہ کے نزدیک حیوانات سے بھی بدتر وہ لوگ ہیں جو بہرے اور گونگے ہیں جو کچھ بھی عقل نہیں رکھتے۔"}, {"arabic": " وَ لَوۡ عَلِمَ اللّٰہُ فِیۡہِمۡ خَیۡرًا لَّاَسۡمَعَہُمۡ ؕ وَ لَوۡ اَسۡمَعَہُمۡ لَتَوَلَّوۡا وَّ ہُمۡ مُّعۡرِضُوۡنَ ﴿۲۴﴾", "english": " And if Allah had known any good in them, He would certainly have made them hear. And if He now makes them hear, they will turn away, in aversion.", "french": " Et si Allāh avait connu quelque bien en eux, Il les aurait certainement fait entendre. Et si maintenant Il les fait entendre, ils se détourne­ront avec aversion.", "german": " Und hätte Allah etwas Gutes in ihnen gekannt, Er hätte sie gewiss hörend gemacht. Und wenn Er sie hörend macht, so werden sie sich wegwenden in Widerwillen.", "spanish": " Y si Al-lah hubiese reconocido algo bueno en ellos, en verdad les habría hecho oír. Mas si Él les hace oír ahora, se apartarán con aversión.", "urdu": " اور اگر اللہ ان (کفار) میں کوئی بھی خیر دیکھتا تو ان کو (قرآن) سنا دیتا اور اگر ان کو (موجودہ حالت میں قرآن) سنا دیتا تب بھی وہ پیٹھ پھیر دیتے اور (قرآن سے) روگردانی اختیار کرتے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اسۡتَجِیۡبُوۡا لِلّٰہِ وَ لِلرَّسُوۡلِ اِذَا دَعَاکُمۡ لِمَا یُحۡیِیۡکُمۡ ۚ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ یَحُوۡلُ بَیۡنَ الۡمَرۡءِ وَ قَلۡبِہٖ وَ اَنَّہٗۤ اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۲۵﴾", "english": " O ye who believe! respond to Allah, and the Messenger when he calls you that he may give you life, and know that Allah comes in between a man and his heart, and that He it is unto Whom you shall be gathered.", "french": " Ô vous qui croyez ! Répondez à l’appel d’Allāh et du Messager lorsqu’il vous appelle afin qu’il vous donne la vie ; et sachez bien qu’Allāh S’interpose entre l’esprit de l’homme et son cœur, et que c’est auprès de Lui que vous serez rassemblés.", "german": " O die ihr glaubt, antwortet Allah und dem Gesandten, wenn er euch ruft, auf dass er euch Leben gebe, und wisset, dass Allah zwischen einen Menschen und sein Herz tritt, und dass zu Ihm ihr werdet versammelt werden.", "spanish": " ¡Oh vosotros, los que creéis! responded a Al-lah y al Mensajero cuando él os llama para daros la vida, y sabed que Al-lah está más cerca del hombre que su propio corazón, y que junto a Él seréis reunidos.", "urdu": " اے مومنو! اللہ اور اس کے رسول کی بات سنو جب کہ وہ تمہیں زندہ کرنے کے لئے پکارے اور جان لو کہ اللہ انسان اور اس کے دل میں حائل ہے اور یہ کہ تم اسی کی طرف زندہ کرکے لوٹائے جاٶ گے۔"}, {"arabic": " وَ اتَّقُوۡا فِتۡنَۃً لَّا تُصِیۡبَنَّ الَّذِیۡنَ ظَلَمُوۡا مِنۡکُمۡ خَآصَّۃً ۚ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ﴿۲۶﴾", "english": " And beware of an affliction which will not smite exclusively those among you who have done wrong. And know that Allah is severe in requiting.", "french": " Et gardez-vous d’une affliction qui, sans aucun doute, n’atteindra pas exclusivement ceux d’entre vous qui auront fait le mal. Et sachez qu’Allāh est sévère en rétribution.", "german": " Und hütet euch vor einer Drangsal, die gewiss nicht bloß die unter euch treffen wird, die Unrecht getan haben. Und wisset, dass Allah streng im Strafen ist.", "spanish": " Mas estad atentos ante una aflicción que no golpeará exclusivamente a aquellos de vosotros que han obrado mal. Y sabed que Al-lah es severo en el castigo.", "urdu": " اور اس فتنہ سے ڈرتے رہو جو کہ تم میں سے صرف ظالموں کو نہیں پہنچے گا اور یاد رکھو کہ اللہ کا عذاب یقیناً سخت ہوتا ہے۔"}, {"arabic": " وَ اذۡکُرُوۡۤا اِذۡ اَنۡتُمۡ قَلِیۡلٌ مُّسۡتَضۡعَفُوۡنَ فِی الۡاَرۡضِ تَخَافُوۡنَ اَنۡ یَّتَخَطَّفَکُمُ النَّاسُ فَاٰوٰٮکُمۡ وَ اَیَّدَکُمۡ بِنَصۡرِہٖ وَ رَزَقَکُمۡ مِّنَ الطَّیِّبٰتِ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۲۷﴾", "english": " And remember the time when you were few and deemed weak in the land, and were in fear lest people should snatch you away, but He sheltered you and strengthened you with His help, and provided you with good things that you might be thankful.", "french": " Et souvenez-vous quand vous étiez peu nombreux et considérés comme faibles sur la terre et que vous craigniez que des hommes ne vous enlèvent ; mais Il vous abrita et vous fortifia de Son aide, et vous approvisionna en de bonnes choses, afin que vous fussiez reconnaissants.", "german": " Und denket daran, wie ihr wenige wart, galtet für schwach im Land, schwebtet in Furcht, dass die Leute euch hinwegraffen könnten; Er aber schirmte euch und stärkte euch durch Seine Hilfe und versorgte euch mit guten Dingen, auf dass ihr dankbar sein möchtet.", "spanish": " Y acordaos de cuando erais muy pocos y considerados débiles en la tierra, y temíais que las gentes os exterminaran, pero Él os protegió y fortaleció con Su ayuda, y os proporcionó cosas buenas para que fueseis agradecidos.", "urdu": " اور یاد کرو جب کہ تم تھوڑے تھے اور زمین میں کمزور سمجھے جاتے تھے اور ڈرتے تھے کہ لوگ تم کو اچک کر نہ لے جائیں۔ پھر باوجود اس کے اس نے تم کو (مدینہ میں) جگہ دی اور اپنی مدد سے تمہاری تائید کی اور پاک چیزوں سے تمہیں رزق بخشا تا کہ تم شکر کرو۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَخُوۡنُوا اللّٰہَ وَ الرَّسُوۡلَ وَ تَخُوۡنُوۡۤا اَمٰنٰتِکُمۡ وَ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۲۸﴾", "english": " O ye who believe! prove not false to Allah and the Messenger, nor prove false to your trusts knowingly.", "french": " Ô vous qui croyez ! Ne trahissez pas Allāh et le Messager, alors que vous trahissez si souvent vos charges et vous le savez.", "german": " O die ihr glaubt, handelt nicht untreu gegen Allah und den Gesandten, noch seid wissentlich untreu in eurer Treuhandschaft.", "spanish": " ¡Oh, vosotros los que creéis! no traicionéis a Al-lah y al Mensajero, cuando a menudo traicionáis vuestros compromisos a sabiendas.", "urdu": " اے مومنو! اللہ اور اس کے رسول کی خیانت نہ کرو اور نہ اپنی امانتوں کی خیانت کرو‘ اس حالت میں کہ تم جانتے بوجھتے ہو۔"}, {"arabic": " وَ اعۡلَمُوۡۤا اَنَّمَاۤ اَمۡوَالُکُمۡ وَ اَوۡلَادُکُمۡ فِتۡنَۃٌ ۙ وَّ اَنَّ اللّٰہَ عِنۡدَہٗۤ اَجۡرٌ عَظِیۡمٌ ﴿٪۲۹﴾", "english": " And know that your possessions and your children are but a trial and that it is Allah with Whom is a great reward.", "french": " Et sachez que vos biens et vos enfants ne sont qu’une épreuve ; et que c’est auprès d’Allāh que se trouve une très grande récompense.", "german": " Und wisset, dass euer Gut und eure Kinder nur eine Versuchung sind und dass bei Allah großer Lohn ist.", "spanish": " Mas sabed que vuestras riquezas y vuestros hijos no son más que una prueba y que en Al-lah es donde tenéis una gran recompensa.", "urdu": " اور یاد رکھو کہ تمہارے مال اور تمہاری اولادیں صرف ایک فتنہ ہیں اور یہ کہ اللہ وہ ذات ہے جس کے پاس بڑا اجر ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنۡ تَتَّقُوا اللّٰہَ یَجۡعَلۡ لَّکُمۡ فُرۡقَانًا وَّ یُکَفِّرۡ عَنۡکُمۡ سَیِّاٰتِکُمۡ وَ یَغۡفِرۡ لَکُمۡ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿۳۰﴾", "english": " O ye who believe! if you fear Allah, He will grant you a distinction and will remove your evils from you and will forgive you; and Allah is Lord of great bounty.", "french": " Ô vous qui croyez ! Si vous craignez Allāh, Il vous accordera une distinction et vous enlèvera vos méfaits, et vous pardonnera ; et Allāh est le Seigneur de la grande munificence.", "german": " O die ihr glaubt, wenn ihr Allah fürchtet, wird Er euch eine Auszeichnung gewähren und eure Übel von euch nehmen und euch vergeben; und Allah ist voll großer Huld.", "spanish": " ¡Oh, vosotros, los que creéis! si teméis a Al-lah, Él os concederá una distinción, os librará de vuestros males y os perdonará; pues Al-lah es Señor de gran magnificencia.", "urdu": " اے مومنو! اگر تم اللہ کا تقویٰ اختیار کرو گے تو وہ تمہارے لئے ایک بڑے امتیاز کا سامان پیدا کردے گا اور تمہاری کمزوریوں کو دور کر دے گا اور تمہیں بخش دے گا اور اللہ بڑے فضل والا ہے۔"}, {"arabic": " وَ اِذۡ یَمۡکُرُ بِکَ الَّذِیۡنَ کَفَرُوۡا لِیُثۡبِتُوۡکَ اَوۡ یَقۡتُلُوۡکَ اَوۡ یُخۡرِجُوۡکَ ؕ وَ یَمۡکُرُوۡنَ وَ یَمۡکُرُ اللّٰہُ ؕ وَ اللّٰہُ خَیۡرُ الۡمٰکِرِیۡنَ ﴿۳۱﴾", "english": " And remember the time when the disbelievers plotted against thee that they might imprison thee or kill thee or expel thee. And they planned and Allah also planned, and Allah is the Best of planners.", "french": " Et souviens-toi quand les mécréants complotaient contre toi pour t'emprisonner, ou te tuer, ou te chasser. Ils conçurent leurs plans mais Allāh aussi conçut Son plan et Allāh est le Meilleur de ceux qui conçoivent des plans .", "german": " Und (gedenke der Zeit) da die Ungläubigen Ränke schmiedeten wider dich, dass sie dich gefangen nähmen oder dich ermordeten oder dich vertrieben. Sie planten, auch Allah plante, und Allah ist der beste Plänemacher.", "spanish": " Y acordaos de cuando los incrédulos tramaron contra ti para hacerte prisionero, matarte o expulsarte. Pero ellos hicieron planes y Al-lah también hizo un plan, y Al-lah es el Mejor de los que planifican.", "urdu": " اور (اے رسول اس وقت کو یاد کر) جب کہ کفار تیرے متعلق تدبیریں کر رہے تھے‘ تا کہ تجھے (ایک جگہ) محصور کر دیں یا تجھ کو قتل کر دیں‘ یا تجھ کو نکال دیں اور وہ بھی تدبیریں کر رہے تھے اور اللہ بھی تدبیریں کر رہا تھا اور اللہ تدبیر کرنے والوں میں سے سب سے بہتر تدبیر کرنے والا ہے۔"}, {"arabic": " وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیٰتُنَا قَالُوۡا قَدۡ سَمِعۡنَا لَوۡ نَشَآءُ لَقُلۡنَا مِثۡلَ ہٰذَاۤ ۙ اِنۡ ہٰذَاۤ اِلَّاۤ اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿۳۲﴾", "english": " And when Our verses are recited to them, they say, ‘We have heard. If we wished we could certainly utter the like of this. This is nothing but mere tales of the ancients.’", "french": " Et quand Nos versets leur sont récités, ils disent : « Nous avons entendu. Si nous le voulions, nous pourrions assurément prononcer des paroles semblables. Ce ne sont que des fables des anciens. »", "german": " Wenn ihnen Unsere Verse vorgetragen werden, sagen sie: \"Wir haben gehört. Wollten wir es, wir könnten gewiss selbst Derartiges äußern, denn das sind ja Fabeln der Alten.\"", "spanish": " Cuando se les recitan nuestros versículos dicen: “Hemos oído. Si quisiéramos, podríamos ciertamente decir cosas similares. Éstos no son más que simples cuentos de los antiguos”.", "urdu": " اور جب ان کے سامنے ہماری آیتیں پڑھ کر سنائی جاتی ہیں تو وہ کہتے ہیں‘ (بس بس) ہم نے تمہاری بات سن لی اگر ہم چاہیں تو ہم بھی اس قسم کا کلام بنا (کر پیش کر) سکتے ہیں۔ یہ (قرآن) تو صرف پہلوں کی باتیں ہیں۔"}, {"arabic": " وَ اِذۡ قَالُوا اللّٰہُمَّ اِنۡ کَانَ ہٰذَا ہُوَ الۡحَقَّ مِنۡ عِنۡدِکَ فَاَمۡطِرۡ عَلَیۡنَا حِجَارَۃً مِّنَ السَّمَآءِ اَوِ ائۡتِنَا بِعَذَابٍ اَلِیۡمٍ ﴿۳۳﴾", "english": " And remember the time when they said, ‘O Allah, if this be indeed the truth from Thee, then rain down upon us stones from heaven or bring down upon us a grievous punishment.’", "french": " Et souviens-toi quand ils dirent : « Ô Allāh, si cela est vraiment la vérité de Ta part, fais tomber du ciel sur nous une pluie de pierres ou fais venir sur nous un châtiment douloureux. »", "german": " Und (gedenke der Zeit) da sie sprachen: \"O Allah, wenn dies wirklich die Wahrheit von Dir ist, dann lass Steine vom Himmel auf uns niederregnen oder bringe eine schmerzliche Strafe auf uns herab.\"", "spanish": " Y acordaos de cuando dijeron: “Oh Al-lah, si ésta es ciertamente la verdad procedente de Ti, haz que lluevan sobre nosotros piedras desde el cielo o mándanos un doloroso castigo”.", "urdu": " اور (یاد کر) جب انہوں نے کہا‘ اے اللہ! اگر تیری طرف سے یہی (دین) حق ہے تو ہم پر آسمان سے پتھر برسا‘ یا ہمیں کوئی اور دکھ سے بھرا ہوا عذاب دے۔"}, {"arabic": " وَ مَا کَانَ اللّٰہُ لِیُعَذِّبَہُمۡ وَ اَنۡتَ فِیۡہِمۡ ؕ وَ مَا کَانَ اللّٰہُ مُعَذِّبَہُمۡ وَ ہُمۡ یَسۡتَغۡفِرُوۡنَ ﴿۳۴﴾", "english": " But Allah would not punish them while thou wast among them, and Allah would not punish them while they sought forgiveness.", "french": " Mais Allāh n’est pas Tel qu’Il les châtie alors que tu es présent parmi eux, et Allāh n’est pas Tel qu’Il les châtie pendant qu’ils recher­chent le pardon.", "german": " Allah aber wollte sie nicht strafen, solange du unter ihnen warst, noch wollte Allah sie strafen, während sie Vergebung suchten.", "spanish": " Pero Al-lah no los castigaría mientras tú estuvieras entre ellos, ni Al-lah los castigaría mientras imploraran perdón.", "urdu": " لیکن اللہ انہیں اس حالت میں عذاب نہیں دے سکتا تھا جب کہ تو ان میں تھا اور نہ اللہ ان کو ایسی حالت میں عذاب دے سکتا تھا جبکہ وہ استغفار کر رہے ہوں۔"}, {"arabic": " وَ مَا لَہُمۡ اَلَّا یُعَذِّبَہُمُ اللّٰہُ وَ ہُمۡ یَصُدُّوۡنَ عَنِ الۡمَسۡجِدِ الۡحَرَامِ وَ مَا کَانُوۡۤا اَوۡلِیَآءَہٗ ؕ اِنۡ اَوۡلِیَآؤُہٗۤ اِلَّا الۡمُتَّقُوۡنَ وَ لٰکِنَّ اَکۡثَرَہُمۡ لَا یَعۡلَمُوۡنَ ﴿۳۵﴾", "english": " And what excuse have they now that Allah should not punish them, when they hinder men from the Sacred Mosque, and they are not its true guardians? Its true guardians are only those who are righteous, but most of them know not.", "french": " Et quelle excuse ont-ils maintenant pour qu’Allāh ne les châtie pas, alors qu’ils em­pêchent les gens de se rendre à la Sainte Mosquée, et qu’ils n’en sont pas les vrais gardiens ? Ses vrais gardiens sont seulement ceux qui agissent avec droiture, mais la plupart d’entre eux l’ ignorent.", "german": " Allein welche Entschuldigung haben sie (nun), dass Allah sie nicht strafe, wenn sie (andere) bei der Heiligen Moschee behindern, und sie sind doch nicht ihre Beschützer? Ihre Beschützer sind nur die Gottesfürchtigen, jedoch die meisten von ihnen wissen es nicht.", "spanish": " Mas ¿qué excusa tienen ahora para que Al-lah no los castigue, si impiden a los hombres la entrada en la Mezquita agrada y no son sus verdaderos guardianes? Sus verdaderos guardianes son únicamente los justos, pero la mayoría de ellos no lo sabe.", "urdu": " اور ان کو کیا (مقام حاصل) ہے جس کی وجہ سے باوجود اس کے کہ وہ عزت والی مسجد (یعنی خانہ کعبہ) سے (لوگوں کو) روکتے ہیں۔ اللہ ان کو عذاب نہیں دے گا اور وہ درحقیقت اس کے متولی نہیں اس کے (حقیقی) متولی تو صرف متقی ہیں‘ لیکن ان (کفار) میں سے اکثر اس بات کو جانتے نہیں۔"}, {"arabic": " وَ مَا کَانَ صَلَاتُہُمۡ عِنۡدَ الۡبَیۡتِ اِلَّا مُکَآءً وَّ تَصۡدِیَۃً ؕ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ تَکۡفُرُوۡنَ ﴿۳۶﴾", "english": " And their prayer at the House is nothing but whistling and clapping of hands. ‘Taste then the punishment because you disbelieved.’", "french": " Et leurs prières à la Maison Sacrée ne sont que sifflements et battements de mains. « Goûtez donc le châtiment à cause de votre mécréance. »", "german": " Und ihr Gebet vor dem Haus (Kaaba) ist nichts anderes als Pfeifen und Händeklatschen. \"Kostet denn die Strafe, weil ihr ungläubig wart.\"", "spanish": " Y su Oración en la Casa Sagrada no consiste más que en silbidos y aplausos. “Probad el castigo por haber sido incrédulos”.", "urdu": " اور خانہ کعبہ کے پاس ان کی نماز سوائے سیٹیاں اور تالیاں بجانے کے اور ہے کیا۔ پس (اے بے دینو)! اپنے کفر کی وجہ سے عذاب کو چکھو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ لِیَصُدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ ؕ فَسَیُنۡفِقُوۡنَہَا ثُمَّ تَکُوۡنُ عَلَیۡہِمۡ حَسۡرَۃً ثُمَّ یُغۡلَبُوۡنَ ۬ؕ وَ الَّذِیۡنَ کَفَرُوۡۤا اِلٰی جَہَنَّمَ یُحۡشَرُوۡنَ ﴿ۙ۳۷﴾", "english": " Surely, those who disbelieve spend their wealth to turn men away from the way of Allah. They will surely continue to spend it; but then shall it become a source of regret for them, and then shall they be overcome. And the disbelievers shall be gathered unto Hell;", "french": " Assurément, les mécréants dépensent leurs biens pour empêcher les gens de suivre la voie d’Allāh. Ils continueront certainement à les dépenser, mais cela ne leur rapportera que lamentations et pleurs au vu de leur échec total, et alors seront-ils carrément vaincus. Et les mécréants seront rassemblés en Enfer ;", "german": " Die Ungläubigen geben ihr Gut weg, um von Allahs Weg abzuhalten. Sie werden wahrlich fortfahren, es wegzugeben; dann aber wird es ihnen zur Reue gereichen, und dann werden sie überwältigt werden. Und die Ungläubigen – zur Hölle sollen sie versammelt werden.", "spanish": " En verdad, los incrédulos emplean su riqueza en apartar a la gente del camino de Al-lah. Ciertamente continuarán gastándola; pero después o les producirá mas que en llantos y lamentos ante su completo fracaso , y entonces serán rotundamente vencidos. Y los incrédulos serán reunidos en el Infierno;", "urdu": " جنہوں نے کفر کیا ہے وہ یقیناً اپنے مال اللہ کے راستہ سے لوگوں کو روکنے کے لئے خرچ کرتے ہیں۔ وہ اسی طرح ان مالوں کو خرچ کرتے جائیں گے پھر آخر (یہ خرچ) ان کے لئے حسرت کا موجب بن جائے گا اور وہ مغلوب کر دیئے جائیں گے اور جن لوگوں نے کفر کیا ہے ان کو اکٹھا کرکے جہنم کی طرف لے جایا جائے گا۔"}, {"arabic": " لِیَمِیۡزَ اللّٰہُ الۡخَبِیۡثَ مِنَ الطَّیِّبِ وَ یَجۡعَلَ الۡخَبِیۡثَ بَعۡضَہٗ عَلٰی بَعۡضٍ فَیَرۡکُمَہٗ جَمِیۡعًا فَیَجۡعَلَہٗ فِیۡ جَہَنَّمَ ؕ اُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿٪۳۸﴾", "english": " That Allah may separate the bad from the good, and put the bad, one upon another, and heap them up all together, and then cast them into Hell. These indeed are the losers.", "french": " Afin qu’Allāh puisse séparer les mau­vais des bons et mettre les mauvais les uns sur les autres, et les entasser tous ensemble, et puis les jeter dans l’Enfer. Ceux-là sont les perdants !", "german": " Damit Allah die Bösen von den Guten trenne und die Bösen einen zum anderen und sie alle zusammen zu einem Haufen tue (und) sie dann in die Hölle schleudere. Diese sind fürwahr Verlorene.", "spanish": " Para que Al-lah separe a los malos de los buenos, ponga los malos unos sobre otros, apilándolos todos juntos y los arroje después al Infierno. Éstos son en verdad los perdedores.", "urdu": " تا کہ اللہ خبیث کو طیب سے ممتاز کر دے اور خبیث چیزوں کے بعض حصوں کو بعض کے اوپر رکھ دے‘ پھر سب کو ایک ڈھیر کی صورت میں بنا دے اور پھر اس (سارے ڈھیر) کو جہنم میں جھونک دے۔ (سنو) یہی (لوگ) گھاٹا پانے والے ہیں۔"}, {"arabic": " قُلۡ لِّلَّذِیۡنَ کَفَرُوۡۤا اِنۡ یَّنۡتَہُوۡا یُغۡفَرۡ لَہُمۡ مَّا قَدۡ سَلَفَ ۚ وَ اِنۡ یَّعُوۡدُوۡا فَقَدۡ مَضَتۡ سُنَّتُ الۡاَوَّلِیۡنَ ﴿۳۹﴾", "english": " Say to those who disbelieve, if they desist, that which is past will be forgiven them; and if they return thereto , then verily, the example of the former peoples has already gone before them .", "french": " Dis aux mécréants, que s’ils renoncent à leur méchanceté, ce qui est passé leur sera pardonné ; et que s’ils y retournent, alors en vérité, l’exemple des anciens peuples est déjà devant eux.", "german": " Sprich zu denen, die ungläubig sind: Wenn sie abstehen, dann wird ihnen das Vergangene verziehen; kehren sie aber zurück, dann, wahrlich, ist das Beispiel der Früheren schon dagewesen.", "spanish": " Diles a los incrédulos, si desisten, que lo pasado se les erdonará; pero si vuelven a ello , entonces, en verdad, tienen ante ellos el ejemplo de los pueblos que les precedieron.", "urdu": " تو کافروں سے کہہ دے کہ اگر وہ باز آجائیں ‘ تو جو (قصور) ان سے پہلے ہو چکا ہے انہیں معاف کر دیا جائے گا اور اگر وہ پھر (انہی کرتوتوں کی طرف) لوٹیں گے تو پہلے لوگوں کی (جو) سنت گزر چکی ہے (وہی) ان سے معاملہ ہوگا۔"}, {"arabic": " وَ قَاتِلُوۡہُمۡ حَتّٰی لَا تَکُوۡنَ فِتۡنَۃٌ وَّ یَکُوۡنَ الدِّیۡنُ کُلُّہٗ لِلّٰہِ ۚ فَاِنِ انۡتَہَوۡا فَاِنَّ اللّٰہَ بِمَا یَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۴۰﴾", "english": " And fight them until there is no persecution and religion is wholly for Allah. But if they desist, then surely Allah is Watchful of what they do.", "french": " Et combattez-les jusqu’à ce que toute persécution cesse et que la religion ne soit que pour Allāh totalement. Mais s’ils renoncent à leur animosité, alors assurément Allāh surveille leurs actions de près.", "german": " Und kämpfet wider sie, bis keine Verfolgung mehr ist und aller Glaube auf Allah gerichtet ist. Stehen sie jedoch ab, dann, wahrlich, sieht Allah sehr wohl, was sie tun.", "spanish": " Y combatidlos hasta que cese la persecución y la religión sea totalmente para Al-lah. Pero si desisten, sepan que en verdad Al-lah vigila todo lo que hacen.", "urdu": " اور ان (کفار) سے لڑتے جاٶ۔ یہاں تک کہ جبر کا نام و نشان باقی نہ رہے اور دین سب کا سب اللہ ہی کے لئے ہو جائے اور اگر وہ رک جائیں تو اللہ یقیناً ان کے اعمال کو دیکھتا ہے۔"}, {"arabic": " وَ اِنۡ تَوَلَّوۡا فَاعۡلَمُوۡۤا اَنَّ اللّٰہَ مَوۡلٰٮکُمۡ ؕ نِعۡمَ الۡمَوۡلٰی وَ نِعۡمَ النَّصِیۡرُ ﴿۴۱﴾", "english": " And if they turn their backs, then know that Allah is your Protector. What an excellent Protector and what an excellent Helper!", "french": " Et s’ils tournent le dos à cette proposition alors sachez bien qu’Allāh est votre Protec­teur. Quel Excellent Protecteur et Quel Excellent Aide !", "german": " Und wenn sie den Rücken kehren, dann wisset, dass Allah euer Beschützer ist; welch ausgezeichneter Beschützer und welch ausgezeichneter Helfer!", "spanish": " Si vuelven la espalda, sabed que Al-lah es vuestro Protector. ¡Qué magnífico Protector y qué magnífico Defensor!", "urdu": " اور اگر وہ پیٹھ پھیر لیں تو جان لو کہ اللہ یقیناً تمہارا حامی ہے۔ وہ بہترین حامی اور بہترین مددگار ہے۔"}, {"arabic": " وَ اعۡلَمُوۡۤا اَنَّمَا غَنِمۡتُمۡ مِّنۡ شَیۡءٍ فَاَنَّ لِلّٰہِ خُمُسَہٗ وَ لِلرَّسُوۡلِ وَ لِذِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ ابۡنِ السَّبِیۡلِ ۙ اِنۡ کُنۡتُمۡ اٰمَنۡتُمۡ بِاللّٰہِ وَ مَاۤ اَنۡزَلۡنَا عَلٰی عَبۡدِنَا یَوۡمَ الۡفُرۡقَانِ یَوۡمَ الۡتَقَی الۡجَمۡعٰنِ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۴۲﴾", "english": " And know that whatever you take as spoils in war , a fifth thereof shall go to Allah and to the Messenger and to the kindred and orphans and the needy and the wayfarer, if you believe in Allah and in what We sent down to Our servant on the Day of Distinction — the day when the two armies met — and Allah has the power to do all things.", "french": " Et sachez bien que de tout ce que vous prenez comme butin de guerre, le cinquième reviendra à Allāh et au Messager, et aux parents proches, et aux orphelins, et aux nécessiteux et aux voyageurs, si vous croyez en Allāh et à ce que Nous avons fait descendre sur Notre servi­teur le Jour de la Distinction, le jour où les deux armées se rencontrèrent ; et Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Und wisset, was immer ihr (im Kriege) gewinnen möget, es gehört ein Fünftel davon Allah und dem Gesandten und der Verwandtschaft und den Waisen und den Bedürftigen und dem Wanderer, wenn ihr an Allah glaubt und an das, was Wir niedersandten zu Unserem Diener am Tage der Unterscheidung – dem Tage, an dem die beiden Heere zusammentrafen –, und Allah hat Macht über alle Dinge.", "spanish": " Y sabed que de cualquier cosa que toméis como botín en la guerra, la quinta parte pertenecerá a Al-lah, al Mensajero, a los parientes y a los huérfanos, a los necesitados y a los viajeros, si creéis en Al-lah y en lo que revelamos a Nuestro siervo el Día de la Distinción, -el día en que se enfrentaron los dos ejércitos– pues Al-lah tiene el poder para hacer todas las cosas.", "urdu": " اور جان لو کہ جو کچھ بھی تم کو غنیمت میں ملے اس میں سے اللہ اور اس کے رسول کے لئے اور (رسول سے) قرب رکھنے والوں کے لئے اور یتیموں اور مسکینوں کے لئے اور مسافروں کے لئے پانچواں حصہ ہے۔ اگر تم اللہ پر ایمان لاتے ہو اور اس پر بھی جو ہم نے اپنے بندہ پر حق و باطل میں فیصلہ کر دینے والے دن میں نازل کیا تھا جس دن کہ دونوں لشکر جمع ہوئے تھے (تو اس پر عمل کرو) اور اللہ ہر ایک چیز پر قادر ہے۔"}, {"arabic": " اِذۡ اَنۡتُمۡ بِالۡعُدۡوَۃِ الدُّنۡیَا وَ ہُمۡ بِالۡعُدۡوَۃِ الۡقُصۡوٰی وَ الرَّکۡبُ اَسۡفَلَ مِنۡکُمۡ ؕ وَ لَوۡ تَوَاعَدۡتُّمۡ لَاخۡتَلَفۡتُمۡ فِی الۡمِیۡعٰدِ ۙ وَ لٰکِنۡ لِّیَقۡضِیَ اللّٰہُ اَمۡرًا کَانَ مَفۡعُوۡلًا ۬ۙ لِّیَہۡلِکَ مَنۡ ہَلَکَ عَنۡۢ بَیِّنَۃٍ وَّ یَحۡیٰی مَنۡ حَیَّ عَنۡۢ بَیِّنَۃٍ ؕ وَ اِنَّ اللّٰہَ لَسَمِیۡعٌ عَلِیۡمٌ ﴿ۙ۴۳﴾", "english": " When you were on the nearer bank of the valley , and they were on the farther bank, and the caravan was below you. And if you had to make a mutual appointment, you would have certainly differed with regard to the appointment. But the encounter was brought about that Allah might accomplish the thing that was decreed; so that he who had already perished through a clear Sign might perish, and he who had already come to life through a clear Sign might live. And certainly Allah is All-Hearing, All-Knowing.", "french": " Quand vous étiez sur le côté le plus proche de la vallée et qu’ils se trouvaient sur le côté le plus éloigné, et la caravane était plus bas. Et si vous, les deux parties belligérantes , aviez eu à fixer l’heure de la rencontre, vous ne seriez pas tombé d’accord sur l’heure pour convenir à vos propres intérêts. Mais il avait été destiné qu’Allāh allait décider de l’heure pour accomplir ce qui avait été déjà décrété, afin que périssent ceux qui sont condamnés, par des justifications évidentes, à périr, et que survivent ceux qui méritent de survivre, sur la base des justifications évidentes. Et, en vérité, Allāh entend tout et sait tout.", "german": " Als ihr auf dieser Seite (des Tales) waret und sie auf jener Seite, und die Karawane war tiefer als ihr. Und hättet ihr etwas verabreden wollen, ihr wäret uneins gewesen über den Zeitpunkt. Doch (das Treffen wurde herbeigeführt) damit Allah die Sache herbeiführe, die geschehen sollte; und damit, wer da (bereits) umgekommen war durch ein deutliches Zeichen, umkomme, und wer da (bereits) zum Leben gekommen war durch ein deutliches Zeichen, lebe. Wahrlich, Allah ist allhörend, allwissend.", "spanish": " Cuando estabais en la ladera más próxima del valle , y ellos en la más alejada, con la caravana debajo de vosotros. Si vosotros, las dos partes beligerantes , tuvieseis que decidir l momento del encuentro, habríais disputado en cuanto al tiempo para favorecer vuestros propios intereses . Pero estaba destinado que Al-lah decidiera el momento, para cumplir lo que estaba decretado; para que perecieran los condenados a perecer con justificación clara y sobrevivieran los que merecían sobrevivir con el apoyo de una justificación manifiesta. Pues en verdad Al-lah es quien todo lo oye, el Omnisciente.", "urdu": " (اس دن) جبکہ تم (میدان جنگ کے) ورلے کنارہ پر تھے اور وہ (کافر) پرلے کنارہ پر تھے اور قافلہ تم سے نیچے کی طرف تھا اور اگر تم ان سے وعدہ بھی کرتے تو تم (جنگ کے) وقت کے بارہ میں ان سے اختلاف کرتے لیکن (خدا نے تم کو جمع کر دیا) تا کہ وہ اس بات کو پورا کر دے جس کے کرنے کا اس نے فیصلہ کر دیا تھا (اور یہ نشان اس لئے بھی دکھایا گیا) تا کہ وہ جو دلیل کے ذریعہ سے ہلاک ہو چکا ہے ہلاک ہو جائے اور جودلیل کے ذریعہ سے زندہ ہو چکا ہے زندہ ہو جائے اور اللہ یقیناً بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " اِذۡ یُرِیۡکَہُمُ اللّٰہُ فِیۡ مَنَامِکَ قَلِیۡلًا ؕ وَ لَوۡ اَرٰٮکَہُمۡ کَثِیۡرًا لَّفَشِلۡتُمۡ وَ لَتَنَازَعۡتُمۡ فِی الۡاَمۡرِ وَ لٰکِنَّ اللّٰہَ سَلَّمَ ؕ اِنَّہٗ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۴۴﴾", "english": " When Allah showed them to thee in thy dream as few; and if He had shown them to thee as many, you would have surely faltered and would have disagreed with one another about the matter; but Allah saved you . Surely, He has full knowledge of what is in your breasts.", "french": " Quand Allāh te les avait montrés en songe, comme peu nombreux ; et s’Il te les avait montrés nombreux, vous auriez assurément flanché et vous n’auriez pas été d’accord sur l’affaire ; mais Allāh vous a sauvés. Assurément Il sait très bien ce qui est dans les cœurs.", "german": " Als Allah sie dir in deinem Traume zeigte als wenige; und hätte Er sie dir als viele gezeigt, ihr wäret sicherlich kleinmütig gewesen und hättet über die Sache gehadert; Allah aber bewahrte (euch davor); wahrlich, Er kennt wohl, was in den Herzen ist.", "spanish": " Cuando Al-lah, en tu sueño, te los hizo ver como poco numerosos; ya que si te los hubiera mostrado en gran número, ciertamente habríais vacilado y estado mutuamente en desacuerdo sobre la cuestión; pero Al-lah os salvó. En verdad, Él conoce perfectamente lo que hay en vuestros corazones.", "urdu": " (یہ واقعہ اس وقت کا ہے) جبکہ اللہ نے تیری خواب میں تجھے انہیں کم کرکے دکھایا تھا اور اگر تجھے وہ (کفار) بڑی تعداد میں دکھائے جاتے تو تم ضرور کمزوری دکھاتے اور اس معاملہ میں (یعنی لڑائی کے بارہ میں) آپس میں جھگڑتے (کہ لڑائی کی جائے یا نہ) لیکن اللہ نے (تم کو) محفوظ رکھا۔ وہ دلوں تک کی باتوں کو خوب جانتا ہے۔"}, {"arabic": " وَ اِذۡ یُرِیۡکُمُوۡہُمۡ اِذِ الۡتَقَیۡتُمۡ فِیۡۤ اَعۡیُنِکُمۡ قَلِیۡلًا وَّ یُقَلِّلُکُمۡ فِیۡۤ اَعۡیُنِہِمۡ لِیَقۡضِیَ اللّٰہُ اَمۡرًا کَانَ مَفۡعُوۡلًا ؕ وَ اِلَی اللّٰہِ تُرۡجَعُ الۡاُمُوۡرُ ﴿٪۴۵﴾", "english": " And when at the time of your encounter He made them appear to you as few in your eyes, and made you appear as few in their eyes, that Allah might bring about the thing that was decreed. And to Allah are all affairs referred for final decision.", "french": " Et souviens-toi quand au moment de la rencontre, Il vous les avait montrés peu nombreux à vos yeux, et vous a fait paraître peu nombreux à leurs yeux, afin qu’Allāh puisse accomplir ce qui avait été décrété. Et c’est à Allāh que seront ramenées toutes les affaires pour Sa décision.", "german": " Und als, zur Zeit eures Treffens, Er sie in euren Augen als wenige erscheinen ließ und euch in ihren Augen als wenige erscheinen ließ, auf dass Allah die Sache herbeiführe, die geschehen sollte. Und zu Allah werden alle Sachen zurückgebracht.", "spanish": " Y acordaos del momento de vuestro enfrentamiento, cuando Él hizo que aparecieran como pocos ante vuestros ojos, y a vosotros como pocos ante los ojos de ellos, para que Al-lah cumpliese lo que estaba ecretado. Y a Al-lah se someten todos los asuntos para su decisión final .", "urdu": " اور (یاد کرو) جبکہ وہ ان (کفار) کو تمہاری نظر میں لڑائی کے وقت کمزور دکھاتا تھا اور تم کو ان کی نظر میں کمزور دکھاتا تھا۔ تا کہ اللہ وہ بات پوری کر دے جس کا وہ فیصلہ کر چکا ہے اور اللہ ہی کی طرف سب باتیں لوٹائی جائیں گی۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا لَقِیۡتُمۡ فِئَۃً فَاثۡبُتُوۡا وَ اذۡکُرُوا اللّٰہَ کَثِیۡرًا لَّعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿ۚ۴۶﴾", "english": " O ye who believe! when you encounter an army, remain firm, and remember Allah much that you may prosper.", "french": " Ô vous qui croyez ! Quand vous vous trouverez en face d’une armée, restez fermes, et souvenez-vous d’Allāh beaucoup, afin de pros­pérer.", "german": " O die ihr glaubt, wenn ihr auf ein Heer trefft, so bleibt fest und seid Allahs eifrig eingedenk, auf dass ihr Erfolg habt.", "spanish": " ¡Oh vosotros, los que creéis! cuando encontréis un ejército, permaneced firmes, y acordaos mucho de Al-lah para que triunféis.", "urdu": " اے مومنو! جب تم (کافروں کی) کسی فوج کے مقابل پر آٶ تو قدم جمائے رکھو اور اللہ کو بہت یاد کیا کرو تا کہ تم کامیاب ہو جاٶ۔"}, {"arabic": " وَ اَطِیۡعُوا اللّٰہَ وَ رَسُوۡلَہٗ وَ لَا تَنَازَعُوۡا فَتَفۡشَلُوۡا وَ تَذۡہَبَ رِیۡحُکُمۡ وَ اصۡبِرُوۡا ؕ اِنَّ اللّٰہَ مَعَ الصّٰبِرِیۡنَ ﴿ۚ۴۷﴾", "english": " And obey Allah and His Messenger and dispute not with one another, lest you falter and your power depart from you . And be steadfast; surely, Allah is with the steadfast.", "french": " Et obéissez à Allāh et à Son Messager et ne vous disputez pas entre vous afin de ne pas flancher et perdre votre force. Et soyez constants ; sûrement, Allāh est avec les cons­tants.", "german": " Und gehorchet Allah und Seinem Gesandten und hadert nicht miteinander, damit ihr nicht kleinmütig werdet und euch die Kraft nicht verlasse. Seid standhaft; wahrlich, Allah ist mit den Standhaften.", "spanish": " Y obedeced a Al-lah y a Su Mensajero y no disputéis mutuamente, no sea que flaqueéis y perdáis el poder. Sed perseverantes; pues en verdad, Al-lah está con los perseverantes.", "urdu": " اور اللہ اور اس کے رسول کی اطاعت کرتے رہا کرو اور آپس میں اختلاف نہ کیا کرو (اگر ایسا کرو گے) تو دل چھوڑ بیٹھو گے اور تمہاری طاقت جاتی رہے گی‘ اور صبر کرتے رہو اللہ یقیناً صبر کرنے والوں کے ساتھ ہے۔"}, {"arabic": " وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ خَرَجُوۡا مِنۡ دِیَارِہِمۡ بَطَرًا وَّ رِئَآءَ النَّاسِ وَ یَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ وَ اللّٰہُ بِمَا یَعۡمَلُوۡنَ مُحِیۡطٌ ﴿۴۸﴾", "english": " And be not like those who came forth from their homes boastfully, and to be seen of men, and who turn men away from the path of Allah, and Allah encompasses all that they do.", "french": " Et ne soyez pas comme ceux qui sortirent de leurs demeures en se vantant de leurs prouesses et pour être vus des gens, et qui empêchent les gens de suivre la voie d’Allāh, et Allāh cerne tout ce qu’ils font.", "german": " Seid nicht wie jene, die prahlerisch und um von den Leuten gesehen zu werden aus ihren Wohnstätten auszogen, und die abwendig machen von Allahs Weg. Allah umschließt alles, was sie tun.", "spanish": " No seáis como los que salieron de sus casas jactándose de sus obras, exhibiéndolas a la gente y evitando que la gente alcanzara el camino de Al-lah, pues Al-lah abarca todo lo que hacen.", "urdu": " اوران لوگوں کی طرح مت بنو جو اپنے گھروں سے لوگوں کو (اپنی بہادری اور دینی غیرت) دکھانے کے لئے تکبر کرتے ہوئے نکلے۔ اور جو اللہ کے راستہ سے (لوگوں کو) روکتے ہیں۔ اللہ ایسے لوگوں کے اعمال کو تباہ کرنے کا فیصلہ کر چکا ہے۔"}, {"arabic": " وَ اِذۡ زَیَّنَ لَہُمُ الشَّیۡطٰنُ اَعۡمَالَہُمۡ وَ قَالَ لَا غَالِبَ لَکُمُ الۡیَوۡمَ مِنَ النَّاسِ وَ اِنِّیۡ جَارٌ لَّکُمۡ ۚ فَلَمَّا تَرَآءَتِ الۡفِئَتٰنِ نَکَصَ عَلٰی عَقِبَیۡہِ وَ قَالَ اِنِّیۡ بَرِیۡٓءٌ مِّنۡکُمۡ اِنِّیۡۤ اَرٰی مَا لَا تَرَوۡنَ اِنِّیۡۤ اَخَافُ اللّٰہَ ؕ وَ اللّٰہُ شَدِیۡدُ الۡعِقَابِ ﴿٪۴۹﴾", "english": " And when Satan made their deeds seem fair to them and said, ‘None among men shall prevail against you this day, and I am your protector.’ But when the two armies came in sight of each other, he turned on his heels, and said, ‘Surely, I have nothing to do with you; surely, I see what you see not. Surely, I fear Allah; and Allah is severe in punishing.’", "french": " Et quand quelqu’un mû par l’esprit de Satan fit leurs actions paraître belles à leurs yeux et dit : « Aujourd’hui aucun homme ne l ’emportera sur vous ; et certainement je suis votre protecteur. » Mais lorsque les deux armées furent en vue l’une de l’autre, il tourna les talons et dit : « Je n’ai rien à faire avec vous ; assurément, je vois ce que vous ne voyez pas. Assurément, je crains Allāh et Allāh est sévère en rétribution. »", "german": " Und als Satan ihnen ihre Werke wohlgefällig erscheinen ließ und sprach: \"Keiner unter den Menschen soll heute etwas wider euch vermögen, und ich bin eure Stütze.\" Als dann aber die beiden Heerscharen einander ansichtig wurden, da wandte er sich rückwärts auf seinen Fersen und sprach: \"Ich habe nichts mit euch zu schaffen; ich sehe, was ihr nicht seht. Ich fürchte Allah; und Allah ist streng im Strafen.\"", "spanish": " Y de cuando Satanás les hizo que sus obras les parecieran justas ante sus ojos, y les dijo: “ninguno de entre los hombres os vencerá en este día, ya que yo soy vuestro protector”. Mas cuando los dos ejércitos se vieron mutuamente, volvió sobre sus talones y dijo: “en verdad, no tengo nada que ver con vosotros; yo veo lo que vosotros no veis. Ciertamente temo a Al-lah; y Al-lah es severo en el castigo”.", "urdu": " اور (یاد کرو) جب شیطان نے کافروں کو ان کے اعمال اچھے کرکے دکھائے اور کہا کہ کہ آج لوگوں میں سے کوئی تم پر غالب نہیں آسکتا اور میں تمہاری پشت پناہ ہوں۔ پھر جب دونوں لشکر آمنے سامنے ہوئے تو وہ اپنی ایڑیوں کے بل پھر گیا اور اس نے کہا میں تم سے بیزار ہوں۔ میں وہ کچھ دیکھتا ہوں جو تم نہیں دیکھتے میں اللہ سے ڈرتا ہوں اور اللہ کا عذاب سخت ہوتا ہے۔"}, {"arabic": " اِذۡ یَقُوۡلُ الۡمُنٰفِقُوۡنَ وَ الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ غَرَّہٰۤؤُ لَآءِ دِیۡنُہُمۡ ؕ وَ مَنۡ یَّتَوَکَّلۡ عَلَی اللّٰہِ فَاِنَّ اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿۵۰﴾", "english": " When the hypocrites and those in whose hearts is a disease said, ‘Their religion has deluded these men .’ And whoso puts his trust in Allah, then surely, Allah is Mighty, Wise.", "french": " Quand les hypocrites et ceux qui ont une maladie au cœur dirent : « Leur religion a trompé ceux-là. » Et quiconque met sa con­fiance en Allāh, alors Allāh assurément est Puissant, Sage.", "german": " Als die Heuchler und diejenigen, in deren Herzen Krankheit ist, sprachen: \"Ihr Glaube hat diese da hochmütig gemacht.\" Wer aber auf Allah vertraut – siehe, Allah ist allmächtig, allweise.", "spanish": " Cuando los hipócritas y los de corazón enfermo dijeron: “su religión ha ofuscado a estos hombres” . Pero quien pone su confianza en Al-lah, verá que en verdad Al-lah es Poderoso, Sabio.", "urdu": " نیز (یاد کرو) جب منافق اور جن کے دلوں میں مرض تھی کہتے تھے کہ ان مسلمانوں کو ان کے دین نے مغرور کر دیا ہے۔ حالانکہ جو اللہ پر توکل کرتا ہے وہ دیکھ لیتا ہے کہ اللہ بڑا غالب (اور) بڑی حکمت والا ہے۔"}, {"arabic": " وَ لَوۡ تَرٰۤی اِذۡ یَتَوَفَّی الَّذِیۡنَ کَفَرُوا ۙ الۡمَلٰٓئِکَۃُ یَضۡرِبُوۡنَ وُجُوۡہَہُمۡ وَ اَدۡبَارَہُمۡ ۚ وَ ذُوۡقُوۡا عَذَابَ الۡحَرِیۡقِ ﴿۵۱﴾", "english": " And if thou couldst see, when the angels take away the souls of those who disbelieve, smiting their faces and their backs, saying : ‘Taste ye the punishment of burning!", "french": " Et si tu pouvais voir quand les anges emportent l’âme des mécréants, leur frappant le visage et le dos, en disant : « Goûtez le châtiment de la Fournaise de l’Enfer. »", "german": " Könntest du nur sehen, wie die Engel die Seelen der Ungläubigen hinwegnehmen, ihnen Gesicht und Rücken schlagen und (sprechen): \"Kostet die Strafe des Verbrennens!</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=8:51&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=8:51&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic52\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic52\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/8:52' style='text-decoration:underline'>8:52</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(52)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control52\"></i></button> <audio id=\"player52\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ذٰلِکَ بِمَا قَدَّمَتۡ اَیۡدِیۡکُمۡ وَ اَنَّ اللّٰہَ لَیۡسَ بِظَلَّامٍ لِّلۡعَبِیۡدِ ﴿ۙ۵۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘That is because of that which your hands have sent on before<I> yourselves</I>, and <em>know </em>that Allah is not at all unjust to <em>His </em>servants.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘This<sup class='ref'>[<a class='ref' data-id='ref_8_52_1131' href='#'>1131</a>]</sup> <i>torment </i>is because of that which your hands have sent on before and <i>know </i>that <sup class='ref'>[<a class='ref' data-id='ref_8_52_e' href='#'>e</a>]</sup>Allah is not at all unjust to <i>His </i>servants.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_8_52_1131'>1131</span><span class='collapsible plus' data-id='ref_8_52_e'>e</span></div> <div><a name='1131'></a><div class='reference' data-id='ref_8_52_1131' style='display:none'> <p><b>1131.</b> <i>Dhalika </i>refers to the punishment spoken of in the preceding verse. (<a href='javascript:void(0)' data-id='ref_8_52_1131' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_8_52_e' style='display:none'> <p><b>e.</b> <a href='/quran/3:183' target=_blank>3:183</a>; <a href='/quran/22:11' target=_blank>22:11</a>; <a href='/quran/41:47' target=_blank>41:47</a>. (<a href='javascript:void(0)' data-id='ref_8_52_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہ اُس کی وجہ سے ہے جو تمہارے (اپنے ہی) ہاتھوں نے آگے بھیجا جبکہ اللہ ہرگز ایسا نہیں کہ اپنے بندوں پر ادنیٰ سا بھی ظلم کرنے والا ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یہ (عذاب) تمہارے ہاتھوں کی گزشتہ کرتوتوں کا نتیجہ ہے اور (سمجھ لو کہ) اللہ اپنے بندوں پر ذرا سا بھی ظلم نہیں کرتا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">C’est pour ce que vos mains ont envoyé devant <em>vous-mêmes</em> et <em>sachez</em> qu’Allāh n’est nullement injuste envers <em>Ses</em> serviteurs. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Esto es por lo que vuestras manos hicieron anteriormente, pues <em>sabed que</em> Al-lah no es en absoluto injusto con Sus siervos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dies um dessentwillen, was eure Hände (euch) vorausgesandt haben; und (wisset) dass Allah niemals ungerecht ist gegen die Diener.\"", "spanish": " Ojalá pudieras ver cuando los ángeles se llevan las almas de los ncrédulos, golpeándolos en los rostros y en las espaldas, diciendo: “¡Probad el castigo del fuego!”.", "urdu": " کاش کہ تو اس وقت کا تصور کرے جب ملائکہ کافروں کی روح قبض کرتے ہیں۔ اور ان کے مونہوں اور پیٹھوں پر ضربیں لگاتے جاتے ہیں اور (یہ کہتے جاتے ہیں کہ) ایک جلنے والا عذاب چکھو۔"}, {"arabic": " کَدَاۡبِ اٰلِ فِرۡعَوۡنَ ۙ وَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ کَفَرُوۡا بِاٰیٰتِ اللّٰہِ فَاَخَذَہُمُ اللّٰہُ بِذُنُوۡبِہِمۡ ؕ اِنَّ اللّٰہَ قَوِیٌّ شَدِیۡدُ الۡعِقَابِ ﴿۵۳﴾", "english": " Their case is like the case of the people of Pharaoh and those before them: they disbelieved in the Signs of Allah; so Allah punished them for their sins. Surely, Allah is Powerful and severe in punishing.", "french": " Votre situation sera pareille à celle du peuple de Pharaon et de leurs devanciers ; ils n’avaient pas cru aux Signes d’Allāh ; Allāh les a donc punis pour leurs péchés. Assurément Allāh est Très-Fort et est Sévère en rétribution.", "german": " Wie die Leute Pharaos und die vor ihnen waren: Sie glaubten nicht an die Zeichen Allahs; darum strafte sie Allah für ihre Sünden. Wahrlich, Allah ist allmächtig, streng im Strafen.", "spanish": " Su ejemplo es como el del pueblo del Faraón y los que los precedieron: no creyeron en los Signos de Al-lah. Así pues, Al-lah los castigó por sus pecados. En verdad, Al-lah es Poderoso y Severo en el castigo.", "urdu": " فرعون کی قوم کے طریق کے مطابق اور ان لوگوں کے (طریق کے مطابق) جو ان سے پہلے گزرے ہیں (تمہارا حشر ہوگا) ان سب نے اللہ کی آیتوں کا انکار کیا تھا۔ اس لئے اللہ نے ان کے گناہوں کے سبب سے ان کو پکڑ لیا۔ اللہ یقیناً بڑی طاقت والا (اور) سخت سزا دینے والا ہے۔"}, {"arabic": " ذٰلِکَ بِاَنَّ اللّٰہَ لَمۡ یَکُ مُغَیِّرًا نِّعۡمَۃً اَنۡعَمَہَا عَلٰی قَوۡمٍ حَتّٰی یُغَیِّرُوۡا مَا بِاَنۡفُسِہِمۡ ۙ وَ اَنَّ اللّٰہَ سَمِیۡعٌ عَلِیۡمٌ ﴿ۙ۵۴﴾", "english": " This is because Allah would never change a favour that He has conferred upon a people until they change their own condition, and know that Allah is All-Hearing, All-Knowing.", "french": " C’est parce qu’Allāh ne change jamais une grâce lorsqu’Il l’a accordée à un peuple, avant que ce peuple n’ait changé l’état de son âme, et sachez qu’Allāh entend tout et sait tout.", "german": " Dies, weil Allah niemals eine Gnade ändern würde, die Er einem Volke gewährt hat, es sei denn, dass es seinen eigenen Seelenzustand ändere, und weil Allah allhörend, allwissend ist.", "spanish": " Esto es porque Al-lah nunca cambiaría una gracia concedida a un pueblo mientras no cambiaran su propia condición, pues sabed que Al-lah es Quien todo lo oye, el Omnisciente.", "urdu": " یہ (اس لئے ہوگا) کہ اللہ جب کبھی کسی قوم پر کوئی نعمت نازل کرتا ہے تو اس نعمت کو بدلتا نہیں‘ جب تک کہ وہ قوم اپنے دل کی حالت کو نہ بدل دے اور اللہ یقیناً بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " کَدَاۡبِ اٰلِ فِرۡعَوۡنَ ۙ وَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ کَذَّبُوۡا بِاٰیٰتِ رَبِّہِمۡ فَاَہۡلَکۡنٰہُمۡ بِذُنُوۡبِہِمۡ وَ اَغۡرَقۡنَاۤ اٰلَ فِرۡعَوۡنَ ۚ وَ کُلٌّ کَانُوۡا ظٰلِمِیۡنَ ﴿۵۵﴾", "english": " Their case is like the case of the people of Pharaoh and those before them: they rejected the Signs of their Lord, so We destroyed them for their sins. And We drowned the people of Pharaoh, for they were all wrongdoers.", "french": " Leur cas est comme celui du peuple de Pharaon et de ses devanciers ; ils ont rejeté les Signes de leur Seigneur. Nous les avons donc anéantis pour leurs péchés. Et Nous avons noyé le peuple de Pharaon, car ils étaient tous trans­gresseurs.", "german": " Wie die Leute Pharaos und die vor ihnen waren: Sie verwarfen die Zeichen ihres Herrn, darum tilgten Wir sie aus um ihrer Sünden willen, und Wir ertränkten die Leute Pharaos; sie waren alle Frevler.", "spanish": " Su ejemplo es como el del pueblo del Faraón y los que los precedieron: rechazaron los Signos de su Señor, por lo que los destruimos por sus pecados. Y ahogamos a las gentes del Faraón porque todos eran transgresores.", "urdu": " (اے منکرو! تمہارا حال بھی) فرعون کی قوم اور ان سے پہلے لوگوں کی طرح (ہوگا) جنہوں نے اپنے رب کی آیات کا انکار کیا تھا۔ تب ہم نے ان کو ان کے گناہوں کے سبب سے ہلاک کر دیا۔ (اور ان کے انعامات اس لئے چھین لئے گئے کہ انہوں نے خدا سے منہ پھیر لیا) اور ہم نے فرعون کی قوم کو غرق کر دیا تھا اور وہ سب ظالم تھے۔"}, {"arabic": " اِنَّ شَرَّ الدَّوَآبِّ عِنۡدَ اللّٰہِ الَّذِیۡنَ کَفَرُوۡا فَہُمۡ لَا یُؤۡمِنُوۡنَ ﴿ۖۚ۵۶﴾", "english": " Surely, the worst of beasts in the sight of Allah are those who are ungrateful. So they will not believe,", "french": " Assurément, les pires créatures au regard d’Allāh sont les ingrats. Aussi, ils ne croiront pas,", "german": " Wahrlich, die schlimmsten Tiere vor Allah sind jene, die undankbar sind. Darum wollen sie nicht glauben –", "spanish": " En verdad, ante Al-lah, las peores de las criaturas son los ingratos, y no creerán.", "urdu": " اللہ کے نزدیک وہ (لوگ) جانوروں سے بھی بدتر ہیں جنہوں نے (خدا کی آیتوں کا) انکار کیااور وہ ایمان نہیں لاتے۔"}, {"arabic": " اَلَّذِیۡنَ عٰہَدۡتَّ مِنۡہُمۡ ثُمَّ یَنۡقُضُوۡنَ عَہۡدَہُمۡ فِیۡ کُلِّ مَرَّۃٍ وَّ ہُمۡ لَا یَتَّقُوۡنَ ﴿۵۷﴾", "english": " Those with whom thou didst make a covenant; then they break their covenant every time, and they do not fear God.", "french": " Ceux avec qui tu as fait un pacte ; puis chaque fois ils violent leur pacte sans aucune crainte .", "german": " jene, mit denen du einen Bund schlossest; dann brechen sie jedesmal ihren Bund, und sie fürchten Gott nicht.", "spanish": " Aquellos con quienes cerraste un pacto. En cada ocasión rompen su pacto; y no temen a Dios.", "urdu": " وہ لوگ جن سے تو نے عہد کیا مگر وہ ہر دفعہ اپنا عہد توڑ دیتے ہیں اور (خدا کا) تقویٰ اختیار نہیں کرتے۔"}, {"arabic": " فَاِمَّا تَثۡقَفَنَّہُمۡ فِی الۡحَرۡبِ فَشَرِّدۡ بِہِمۡ مَّنۡ خَلۡفَہُمۡ لَعَلَّہُمۡ یَذَّکَّرُوۡنَ ﴿۵۸﴾", "english": " So, if thou catchest them in war, then by routing them strike fear in those that are behind them, that they may be admonished.", "french": " Et si tu les rencontres à la guerre, fais en sorte que, par la panique provoquée chez eux par votre charge , ceux qui sont derrière eux se dispersent eux aussi , afin qu’ils soient avertis.", "german": " Darum, wenn du sie im Kriege anpackst, jage mit ihrem (Los) denen Furcht ein, die hinter ihnen sind, auf dass sie ermahnt seien.", "spanish": " Por eso, si los apresas en la guerra, infunde con su derrota el temor en los que están tras ellos, para que sean advertidos.", "urdu": " پس اگر تو لڑائی میں ان پر قابو پالے تو ان کے ذریعہ سے جو ان کے پیچھے (اور لشکر) ہیں ان کو بھی بھگا دے تا کہ وہ نصیحت حاصل کریں۔"}, {"arabic": " وَ اِمَّا تَخَافَنَّ مِنۡ قَوۡمٍ خِیَانَۃً فَانۡۢبِذۡ اِلَیۡہِمۡ عَلٰی سَوَآءٍ ؕ اِنَّ اللّٰہَ لَا یُحِبُّ الۡخَآئِنِیۡنَ ﴿٪۵۹﴾", "english": " And if thou fearest treachery from a people, throw back to them their covenant with equity. Surely, Allah loves not the treacherous.", "french": " Et si tu crains la perfidie de la part d’un peuple, rejette-lui son pacte avec équité ; assuré­ment, Allāh n’aime pas les perfides.", "german": " Und wenn du von einem Volke Verräterei fürchtest, so verwirf (den Vertrag) gegenseitig. Wahrlich, Allah liebt nicht die Verräter.", "spanish": " Y si temes la traición de un pueblo, devuélveles su pacto con equidad. En verdad, Al-lah no ama a los traidores.", "urdu": " اور اگر تو کسی قوم سے عہد شکنی کا ڈر رکھتا ہو تو تو اس طرح ان کا عہد ختم کر دے جس سے وہ سمجھ لیں کہ اب تم دونوں (فریق اپنی پابندیوں سے) آزاد ہو۔ اللہ خیانت کرنے والوں کو پسند نہیں کرتا۔"}, {"arabic": " وَ لَا یَحۡسَبَنَّ الَّذِیۡنَ کَفَرُوۡا سَبَقُوۡا ؕ اِنَّہُمۡ لَا یُعۡجِزُوۡنَ ﴿۶۰﴾", "english": " And let not those who disbelieve think that they have outstripped Us . Surely, they cannot frustrate God’s purpose.", "french": " Et que les mécréants ne pensent pas qu’ils peuvent l’emporter sur Nous. En vérité, ils ne peuvent pas contrecarrer les desseins d’Allāh.", "german": " Lass nicht die Ungläubigen wähnen, sie hätten (Uns) übertroffen. Wahrlich, sie können nicht obsiegen.", "spanish": " Y que los incrédulos no piensen que Nos han vencido. En verdad, no pueden vencer el designio de Dios.", "urdu": " اور کافر کبھی یہ خیال نہ کریں کہ وہ (اپنی دھوکا بازیوں کے ذریعہ سے) آگے بڑھ گئے ہیں وہ کبھی (بھی مومنوں کو) بے بس نہیں بنا سکتے۔"}, {"arabic": " وَ اَعِدُّوۡا لَہُمۡ مَّا اسۡتَطَعۡتُمۡ مِّنۡ قُوَّۃٍ وَّ مِنۡ رِّبَاطِ الۡخَیۡلِ تُرۡہِبُوۡنَ بِہٖ عَدُوَّ اللّٰہِ وَ عَدُوَّکُمۡ وَ اٰخَرِیۡنَ مِنۡ دُوۡنِہِمۡ ۚ لَا تَعۡلَمُوۡنَہُمۡ ۚ اَللّٰہُ یَعۡلَمُہُمۡ ؕ وَ مَا تُنۡفِقُوۡا مِنۡ شَیۡءٍ فِیۡ سَبِیۡلِ اللّٰہِ یُوَفَّ اِلَیۡکُمۡ وَ اَنۡتُمۡ لَا تُظۡلَمُوۡنَ ﴿۶۱﴾", "english": " And make ready for them whatever you can of armed force and of mounted pickets at the frontier, whereby you may frighten the enemy of Allah and your enemy and others besides them whom you know not, but Allah knows them. And whatever you spend in the way of Allah, it shall be repaid to you in full and you shall not be wronged.", "french": " Et préparez contre eux à la frontière toutes les forces et tous les détachements d’hommes à cheval que vous pourrez, afin que par ce moyen, vous puissiez épouvanter l’en­nemi d’Allāh et votre ennemi et encore bien d’autres que vous ne connaissez pas, mais Allāh les connaît. Et quoi que vous dépenserez pour la cause d’Allāh vous sera intégralement remboursé, et vous ne serez pas lésés.", "german": " Und rüstet wider sie, was ihr nur vermögt an Streitkräften und berittenen Grenzwachen, damit in Schrecken zu setzen Allahs Feind und euren Feind und außer ihnen andere, die ihr nicht kennt; Allah kennt sie. Und was ihr auch aufwendet für Allahs Sache, es wird euch voll zurückgezahlt werden, und es soll euch kein Unrecht geschehen.", "spanish": " Mas preparad contra ellos cuanto podáis de fuerza armada y de piquetes de caballería en la frontera, para que asustéis al enemigo de Al-lah y enemigo vuestro, y a los demás que están tras ellos y a quienes desconocéis, pero que son conocidos de Al-lah. Pues todo lo que gastéis por la causa de Al-lah os será reembolsado del todo y no seréis perjudicados.", "urdu": " اور (اے مسلمانو! چاہیے کہ) تم ان (لڑنے والوں) کے لئے جس حد تک ممکن ہو‘ اپنی طاقتیں جمع کرو (ملکی انتظام کے ذریعہ سے بھی) اور سرحدوں پر چھاٶنیاں بنانے کے ذریعہ سے بھی ان (چھاٶنیوں) کے ذریعہ تم اللہ کے دشمنوں اور اپنے دشمنوں کو ڈراتے ہو۔ اور ان کے سوا اور (دشمنوں) کو بھی جو ان (سرحدی دشمنوں) کے پرے ہیں تم ان کو نہیں جانتے لیکن اللہ ان کو جانتا ہے اور تم جو کچھ بھی اللہ کے راستہ میں خرچ کرو گے وہ تم کو اس کا پورا پورا اجر دے گا اور تم سے بے انصافی کا معاملہ نہیں کیا جائے گا۔"}, {"arabic": " وَ اِنۡ جَنَحُوۡا لِلسَّلۡمِ فَاجۡنَحۡ لَہَا وَ تَوَکَّلۡ عَلَی اللّٰہِ ؕ اِنَّہٗ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۶۲﴾", "english": " And if they incline towards peace, incline thou also towards it, and put thy trust in Allah. Surely, it is He Who is All-Hearing, All-Knowing.", "french": " Et s’ils penchent vers la paix, penche vers elle toi aussi , et mets ta confiance en Allāh ; assurément Il est Celui Qui entend tout, Qui sait tout.", "german": " Sind sie jedoch zum Frieden geneigt, so sei auch du ihm geneigt und vertraue auf Allah. Wahrlich, Er ist der Allhörende, der Allwissende.", "spanish": " Pero si se inclinan hacia la paz, inclínate tú también hacia ella y deposita tu confianza en Al-lah. En verdad, Él es Quien todo lo oye, el Omnisciente.", "urdu": " اور (اگر تمہاری تیاریوں کو دیکھ کر) وہ (کافر) صلح کی طرف مائل ہوں تو (اے رسول)! تو بھی صلح کی طرف مائل ہو اور اللہ پر توکل کر۔ اللہ یقیناً بہت دعائیں سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ اِنۡ یُّرِیۡدُوۡۤا اَنۡ یَّخۡدَعُوۡکَ فَاِنَّ حَسۡبَکَ اللّٰہُ ؕ ہُوَ الَّذِیۡۤ اَیَّدَکَ بِنَصۡرِہٖ وَ بِالۡمُؤۡمِنِیۡنَ ﴿ۙ۶۳﴾", "english": " And if they intend to deceive thee, then surely Allah is sufficient for thee. He it is Who has strengthened thee with His help and with the believers;", "french": " Et s’ils cherchent à te tromper, alors assurément, Allāh te suffit. C’est Lui Qui t’a fortifié avec Son aide et avec celle des croyants.", "german": " Wenn sie dich aber hintergehen wollen, so ist Allah fürwahr deine Genüge. Er hat dich gestärkt mit Seiner Hilfe und mit den Gläubigen.", "spanish": " Pero si pretenden engañarte, en verdad Al-lah te basta. Él es Quien te ha fortalecido con Su ayuda y con los creyentes;", "urdu": " اور اگر وہ اس بات کا ارادہ رکھتے ہوں کہ بعد میں تجھے دھوکا دیں تو (یاد رکھ کہ) اللہ تیرے لئے یقیناً کافی ہے وہی ہے جس نے تجھ کو مومنوں کے ذریعہ اور اپنی مدد کے ذریعہ مضبوط کیا۔"}, {"arabic": " وَ اَلَّفَ بَیۡنَ قُلُوۡبِہِمۡ ؕ لَوۡ اَنۡفَقۡتَ مَا فِی الۡاَرۡضِ جَمِیۡعًا مَّاۤ اَلَّفۡتَ بَیۡنَ قُلُوۡبِہِمۡ وَ لٰکِنَّ اللّٰہَ اَلَّفَ بَیۡنَہُمۡ ؕ اِنَّہٗ عَزِیۡزٌ حَکِیۡمٌ ﴿۶۴﴾", "english": " And He has put affection between their hearts. If thou hadst expended all that is in the earth, thou couldst not have put affection between their hearts, but Allah has put affection between them. Surely, He is Mighty, Wise.", "french": " Et Il a uni leurs coeurs dans l’affection. Si tu avais dépensé tout ce qu’il y a sur la terre, tu n’aurais pu unir leurs cœurs dans l’affection, mais c’est Allāh Qui les a unis dans l’affection entre eux. Il est, assurément, Puissant et Sage.", "german": " Und Er hat Liebe in ihre Herzen gelegt. Hättest du auch alles aufgewandt, was auf Erden ist, du hättest doch nicht Liebe in ihre Herzen zu legen vermocht, Allah aber hat Liebe in sie gelegt. Wahrlich, Er ist allmächtig, allweise.", "spanish": " Pues Él ha puesto el afecto entre sus corazones. Si hubieses gastado todo lo que hay en la tierra, no hubieras podido poner afecto entre sus corazones, pero Al-lah lo ha puesto entre ellos. En verdad, Él es Poderoso, Sabio.", "urdu": " اور ان کے دلوں کو آپس میں باندھ دیا (یہاں تک کہ صحابہ تیرے پسینہ کی جگہ اپنا خون بہانے کے لئے تیار ہو گئے) اگر تو جو کچھ بھی زمین میں ہے ان پر خرچ کر دیتا تو بھی ان کے دلوں کو اس طرح باندھ نہیں سکتا تھا۔ لیکن اللہ نے ان میں باہمی محبت (اور تیرے ساتھ بھی محبت) قائم کر دی وہ یقیناً غالب (اور) بڑی حکمت والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ حَسۡبُکَ اللّٰہُ وَ مَنِ اتَّبَعَکَ مِنَ الۡمُؤۡمِنِیۡنَ ﴿٪۶۵﴾", "english": " O Prophet, Allah is sufficient for thee and for those who follow thee of the believers.", "french": " Ô Prophète, Allāh te Suffit, ainsi qu’à ceux des croyants qui te suivent.", "german": " O Prophet, Allah ist deine Genüge und derer unter den Gläubigen, die dir folgen.", "spanish": " ¡Oh, Profeta! Al-lah es suficiente para ti y para quienes te siguen de entre los creyentes.", "urdu": " اے نبی! اللہ اور وہ مومن جو تیرے تابع ہو گئے ہیں تیرے لئے کافی ہیں (جو مخالف ہیں ان کی پروا نہ کر) ۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ حَرِّضِ الۡمُؤۡمِنِیۡنَ عَلَی الۡقِتَالِ ؕ اِنۡ یَّکُنۡ مِّنۡکُمۡ عِشۡرُوۡنَ صٰبِرُوۡنَ یَغۡلِبُوۡا مِائَتَیۡنِ ۚ وَ اِنۡ یَّکُنۡ مِّنۡکُمۡ مِّائَۃٌ یَّغۡلِبُوۡۤا اَلۡفًا مِّنَ الَّذِیۡنَ کَفَرُوۡا بِاَنَّہُمۡ قَوۡمٌ لَّا یَفۡقَہُوۡنَ ﴿۶۶﴾", "english": " O Prophet, urge the believers to fight. If there be of you twenty who are steadfast, they shall overcome two hundred; and if there be a hundred of you, they shall overcome a thousand of those who disbelieve, because they are a people who do not understand.", "french": " Ô Prophète, exhorte les croyants à combattre. S’il s’en trouve vingt parmi vous qui sont constants, ils triompheront de deux cents ; et s’il y en a cent d’entre vous, ils vaincront mille mécréants, parce que ce sont des gens qui ne comprennent pas.", "german": " O Prophet, feuere die Gläubigen zum Kampf an. Sind auch nur zwanzig Standhafte unter euch, sie sollen zweihundert überwinden; und sind hundert unter euch, sie sollen tausend überwinden von denen, die ungläubig sind, weil das ein Volk ist, das nicht versteht.", "spanish": " ¡Oh, Profeta! apremia a los creyentes al combate. Si hubiese veinte de vosotros perseverantes, podrían vencer a doscientos; si hubiese cien de vosotros, vencerían a un millar de los incrédulos, porque son gente que no entienden.", "urdu": " اے نبی! مومنوں کو (کافروں سے) لڑنے کی باربار زور سے تحریک کرتا رہ اگر تم میں سے بیس(۲۰) ثابت قدم رہنے والے (مومن) ہوں گے تو وہ دو سو (کافروں) پر غالب آجائیں گے اور اگر سو (ثابت قدم رہنے والے مومن) ہوں گے تو وہ ایک ہزار کافروں پر غالب آجائیں گے کیونکہ وہ ایسی قوم ہیں جو سمجھتے نہیں (جبکہ مومن سمجھ بوجھ کر اپنے ایمان پر قائم ہیں) ۔"}, {"arabic": " اَلۡـٰٔنَ خَفَّفَ اللّٰہُ عَنۡکُمۡ وَ عَلِمَ اَنَّ فِیۡکُمۡ ضَعۡفًا ؕ فَاِنۡ یَّکُنۡ مِّنۡکُمۡ مِّائَۃٌ صَابِرَۃٌ یَّغۡلِبُوۡا مِائَتَیۡنِ ۚ وَ اِنۡ یَّکُنۡ مِّنۡکُمۡ اَلۡفٌ یَّغۡلِبُوۡۤا اَلۡفَیۡنِ بِاِذۡنِ اللّٰہِ ؕ وَ اللّٰہُ مَعَ الصّٰبِرِیۡنَ ﴿۶۷﴾", "english": " For the present Allah has lightened your burden, for He knows that there is weakness in you. So, if there be a hundred of you who are steadfast, they shall overcome two hundred; and if there be a thousand of you, they shall overcome two thousand by the command of Allah. And Allah is with those who are steadfast.", "french": " Pour le moment, Allāh a allégé votre fardeau, car Il sait qu’il y a de la faiblesse en vous. Alors, s’il y a parmi vous cent qui sont constants, ils triompheront de deux cents ; et s’il y en a mille d’entre vous, ils vaincront deux mille par l’ordre d’Allāh. Et Allāh est avec les constants.", "german": " Jetzt aber hat Allah euch eure Bürde erleichtert, denn Er weiß, dass in euch Schwachheit ist. Wenn also unter euch hundert Standhafte sind, so sollen sie zweihundert überwinden; und wenn tausend unter euch sind, so sollen sie zweitausend überwinden nach Allahs Gebot. Und Allah ist mit den Standhaften.", "spanish": " Ahora Al-lah ha aligerado vuestra carga, pues Él sabe que hay debilidad en vosotros. Así, si hubiese entre vosotros un centenar de perseverantes, vencerían a dos centenares; y si hubiese un millar de vosotros, vencerían a dos millares por mandato de Al-lah. Y Al-lah está con quienes son perseverantes.", "urdu": " ابھی اللہ نے تم سے بوجھ کو ہلکا کر دیا ہے اور جان لیا ہے کہ تم میں ابھی کچھ کمزوری ہے (یعنی سب مومن انتہائی درجہ کے مومن نہیں ہوچکے) پس چاہیے کہ اگر تم میں سے سو ثابت قدم رہنے والے (مومن) ہوں تو دو سو (کافروں) پر غالب آجائیں اور اگر تم میں سے ہزار ثابت قدم رہنے والے مومن ہوں تو دو ہزار (کافروں) پر اللہ کے حکم سے غالب آجائیں اور اللہ ثابت قدم رہنے والے لوگوں کے ساتھ ہے۔"}, {"arabic": " مَا کَانَ لِنَبِیٍّ اَنۡ یَّکُوۡنَ لَہٗۤ اَسۡرٰی حَتّٰی یُثۡخِنَ فِی الۡاَرۡضِ ؕ تُرِیۡدُوۡنَ عَرَضَ الدُّنۡیَا ٭ۖ وَ اللّٰہُ یُرِیۡدُ الۡاٰخِرَۃَ ؕ وَ اللّٰہُ عَزِیۡزٌ حَکِیۡمٌ ﴿۶۸﴾", "english": " It does not behove a Prophet that he should have captives until he engages in regular fighting in the land. You desire the goods of the world, while Allah desires for you the Hereafter. And Allah is Mighty, Wise.", "french": " Il ne sied pas à un Prophète qu’il ait des captifs avant qu’il n’ait pris part à une bataille régulière dans le pays. Si vous prenez des captifs en dehors du combat régulier, vous serez consi­dérés comme désirant les biens d’ici-bas, tandis qu’Allāh désire pour vous l’au-delà ; et Allāh est Puissant et Sage.", "german": " Einem Propheten geziemt es nicht, Gefangene zu machen, ehe er sich auf kriegerischen Kampf einlassen muss im Land. Ihr wollt die Güter dieser Welt, Allah aber will (für euch) das Jenseits. Und Allah ist allmächtig, allweise.", "spanish": " No corresponde a un Profeta tener prisioneros mientras no haya iniciado una batalla regular en el país. Vosotros deseáis los bienes del mundo, mientras que Al-lah desea para vosotros el Más Allá. Pues Al-lah es Poderoso, Sabio.", "urdu": " کسی نبی کی یہ شان نہیں کہ وہ قیدی بنائے۔ جب تک کہ وہ ملک میں خون ریزی نہ کرلے۔ (اگر تم بغیر باقاعدہ جنگ کے قیدی پکڑو۔تو) تم دنیوی اموال کے طالب قرار پاٶ گے۔ حالانکہ اللہ تمہارے لئے آخرت کی نعمتیں چاہتا ہے اللہ بڑا غالب (اور) بڑی حکمتوں والا ہے۔"}, {"arabic": " لَوۡ لَا کِتٰبٌ مِّنَ اللّٰہِ سَبَقَ لَمَسَّکُمۡ فِیۡمَاۤ اَخَذۡتُمۡ عَذَابٌ عَظِیۡمٌ ﴿۶۹﴾", "english": " Had there not been a decree from Allah which had gone before, great distress would have surely overtaken you in connection with that which you took.", "french": " Si un décret d’Allāh n’avait pas déjà été émis, certainement une très grande punition vous aurait atteints pour ce que vous avez pris.", "german": " Wäre nicht eine Verordnung von Allah schon da gewesen, so hätte euch gewiss eine schwere Drangsal getroffen um dessentwillen, was ihr genommen.", "spanish": " Si no hubiera habido un decreto de Al-lah dictado previamente, en erdad os habría acaecido una gran desgracia en relación con lo que tomasteis.", "urdu": " (اور) اگر اللہ کی طرف سے ایک حکم صریح پہلے سے نہ گزر چکا ہوتا تو جو کچھ تم نے (قیدیوں کا) فدیہ لیا تھا اس کی وجہ سے تم کو بڑا عذاب پہنچتا۔"}, {"arabic": " فَکُلُوۡا مِمَّا غَنِمۡتُمۡ حَلٰلًا طَیِّبًا ۫ۖ وَّ اتَّقُوا اللّٰہَ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿٪۷۰﴾", "english": " So eat of that which you have won in war as lawful and good, and fear Allah. Surely, Allah is Most Forgiving, Merciful.", "french": " Mangez donc ce qui est licite et bon de ce que vous avez gagné comme butin ; et craignez Allāh. En vérité, Allāh est Très-Pardonnant, Miséricordieux.", "german": " So esset von dem, was ihr (im Krieg) gewonnen habt, wie erlaubt und gut, und fürchtet Allah. Wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Comed pues de lo que habéis ganado en la guerra como lícito y bueno, y temed a Al-lah. En verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " پس (چونکہ فدیہ کے جواز کا حکم پہلے سے اتر چکا ہے) جو کچھ تم کو غنیمت میں سے ملے اور (وہ الٰہی حکم کے ماتحت) حلال اور طیب ہو اسے کھاٶ اور اللہ کا تقویٰ اختیار کرو۔ اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ قُلۡ لِّمَنۡ فِیۡۤ اَیۡدِیۡکُمۡ مِّنَ الۡاَسۡرٰۤی ۙ اِنۡ یَّعۡلَمِ اللّٰہُ فِیۡ قُلُوۡبِکُمۡ خَیۡرًا یُّؤۡتِکُمۡ خَیۡرًا مِّمَّاۤ اُخِذَ مِنۡکُمۡ وَ یَغۡفِرۡ لَکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۷۱﴾", "english": " O Prophet, say to the captives who are in your hands, ‘If Allah knows any good in your hearts, He will give you better than that which has been taken from you, and will forgive you. And Allah is Most Forgiving, Merciful.’", "french": " Ô Prophète, dis aux captifs qui sont entre vos mains : « Si Allāh connaît quelque chose de bon dans votre cœur, Il vous accor­dera quelque chose de mieux que ce qui vous a été enlevé et Il vous pardonnera. Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " O Prophet, sprich zu den Gefangenen in euren Händen: \"Wenn Allah Gutes in euren Herzen erkennt, dann wird Er euch Besseres geben als das, was euch genommen wurde, und wird euch vergeben. Denn Allah ist allvergebend, barmherzig.\"", "spanish": " ¡Oh, Profeta! di a los cautivos que tenéis en vuestro poder: “si Al-lah descubriera bondad en vuestros corazones, os daría algo mejor de lo que os ha tomado, y os perdonaría. Pues Al-lah es el Sumo Indulgente, Misericordioso”.", "urdu": " اے نبی! جو لوگ تمہارے ہاتھوں میں (جنگی) قیدیوں کی حیثیت میں ہیں ان سے کہہ دے کہ اگر اللہ تمہارے دلوں میں نیکی دیکھے گا تو جو کچھ تم سے (تاوان جنگ کے طور پر) لیا گیا ہے اس سے بہتر تم کو دے دے گا اور (علاوہ ازیں) تمہارے گناہ بھی معاف کر دے گا اور اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ اِنۡ یُّرِیۡدُوۡا خِیَانَتَکَ فَقَدۡ خَانُوا اللّٰہَ مِنۡ قَبۡلُ فَاَمۡکَنَ مِنۡہُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۷۲﴾", "english": " And if they intend to deal treacherously with thee, they have already dealt treacherously with Allah before, but He gave thee power over them. And Allah is All- Knowing, Wise.", "french": " Et s’ils projettent de trahir ta confiance, ils ont déjà trahi la confiance d’Allāh avant ceci . Il les rendit donc impuissants. Et Allāh est Omniscient, Sage.", "german": " Wenn sie aber Verrat an dir üben wollen, so haben sie schon zuvor an Allah Verrat geübt. Er aber gab (dir) Macht über sie; und Allah ist allwissend, allweise.", "spanish": " Y si intentan traicionar tu confianza, ya traicionaron antes la confianza de Al-lah, pero Él les dejó indefensos. Pues Al-lah es Omnisciente, Sabio.", "urdu": " اور اگر وہ (آزاد ہونے پر) تجھ سے خیانت کرنے کا ارادہ کریں تو اس سے پہلے وہ اللہ سے بھی خیانت کر چکے ہیں پھر بھی اس نے ان کو تمہارے قبضہ میں دے دیا اور اللہ بہت جاننے والا (اور) بڑی حکمت والا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ ہَاجَرُوۡا وَ جٰہَدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ فِیۡ سَبِیۡلِ اللّٰہِ وَ الَّذِیۡنَ اٰوَوۡا وَّ نَصَرُوۡۤا اُولٰٓئِکَ بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ؕ وَ الَّذِیۡنَ اٰمَنُوۡا وَ لَمۡ یُہَاجِرُوۡا مَا لَکُمۡ مِّنۡ وَّلَایَتِہِمۡ مِّنۡ شَیۡءٍ حَتّٰی یُہَاجِرُوۡا ۚ وَ اِنِ اسۡتَنۡصَرُوۡکُمۡ فِی الدِّیۡنِ فَعَلَیۡکُمُ النَّصۡرُ اِلَّا عَلٰی قَوۡمٍۭ بَیۡنَکُمۡ وَ بَیۡنَہُمۡ مِّیۡثَاقٌ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۷۳﴾", "english": " Surely, those who have believed and fled from their homes and striven with their property and their persons for the cause of Allah, and those who have given them shelter and help — these are friends one of another. But as for those who have believed but have not left their homes, you are not at all responsible for their protection until they leave their homes. But if they seek your help in the matter of religion, then it is your duty to help them, except against a people between whom and yourselves there is a treaty. And Allah sees what you do.", "french": " Assurément, ceux qui ont cru et qui ont abandonné leurs demeures, et qui, avec leurs biens et leurs personnes ont lutté dans la cause d’Allāh, et ceux qui les ont abrités et aidés – ceux-là sont amis les uns des autres. Mais ceux qui ont cru mais n’ont pas quitté leurs maisons, vous n’êtes nullement responsables de leur protection jusqu’à ce qu’ils quittent leurs demeures. Mais s’ils recherchent votre aide en matière de religion, alors il vous incombe de les soutenir, sauf contre un peuple entre lequel et vous existe un traité. Et Allāh voit bien tout ce que vous faites.", "german": " Wahrlich, die geglaubt haben und ausgewandert sind und mit ihrem Gut und ihrem Blut gestritten haben für Allahs Sache und jene, die (ihnen) Herberge und Hilfe gaben – diese sind einander freund. Die aber glaubten, jedoch nicht ausgewandert sind, für deren Schutz seid ihr keineswegs verantwortlich, ehe sie auswandern. Suchen sie aber eure Hilfe für den Glauben, dann ist Helfen eure Pflicht, außer gegen ein Volk, mit dem ihr ein Bündnis habt. Allah sieht euer Tun.", "spanish": " En verdad quienes han creído y han abandonado sus hogares, luchando on sus bienes y sus personas por la causa de Al-lah, y quienes les han prestado cobijo y ayuda: éstos son, en verdad, mutuamente amigos. Mas de quienes han creído pero no han dejado sus casas, no eres en absoluto responsable de su protección mientras no abandonen sus hogares. Pero si buscan tu ayuda en materias de religión, es tu deber ayudarles, excepto contra un pueblo con el que tengáis una alianza. Pues Al-lah ve lo que hacéis.", "urdu": " وہ لوگ جو کہ ایمان لائے ہیں اور جنہوں نے ہجرت کی ہے اور اللہ کے راستہ میں اپنی جانوں اور مالوں کے ذریعہ سے جہاد کیا ہے اور جنہوں نے (ہجرت کرنے والوں کو اپنے گھروں میں) جگہ دی ہے اور (ان کی) مدد کی ہے ان میں سے بعض بعض کے دلی دوست ہیں اور وہ لوگ جو ایمان لائے ہیں اور انہوں نے ہجرت نہیں کی ان سے دلی دوستی کرنا تمہارا کام نہیں جب تک کہ وہ ہجرت نہ کریں اور اگر وہ تم سے دین کے بارہ میں مدد مانگیں تو تم پر ان کی مدد کرنا فرض ہے مگر اس قوم کے خلاف نہیں کہ جن کے اور تمہارے درمیان کوئی عہد ہو اور اللہ تمہارے اعمال کو دیکھ رہا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡا بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ؕ اِلَّا تَفۡعَلُوۡہُ تَکُنۡ فِتۡنَۃٌ فِی الۡاَرۡضِ وَ فَسَادٌ کَبِیۡرٌ ﴿ؕ۷۴﴾", "english": " And those who disbelieve — they are friends one of another. If you do it not, there will be mischief in the land and great disorder.", "french": " Et ceux qui ne croient pas, ils sont amis les uns des autres. Si vous ne faites pas ce qui vous est ordonné, il y aura des troubles et de graves désordres dans le pays.", "german": " Und die Ungläubigen – (auch) sie sind einander freund. Wenn ihr das nicht tut, wird Unheil im Lande entstehen und gewaltige Unordnung.", "spanish": " Y quienes no creen: son también mutuamente amigos. Si no lo hacéis, habrá perturbaciones en el país y un gran desorden.", "urdu": " اور جن لوگوں نے کفر کیا ہے وہ آپس میں ایک دوسرے کے دوست ہیں اگر تم وہی کچھ نہ کرو جس کا ہم نے حکم دیا ہے تو زمین میں بڑا فساد اور فتنہ پیدا ہو جائے گا۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ ہَاجَرُوۡا وَ جٰہَدُوۡا فِیۡ سَبِیۡلِ اللّٰہِ وَ الَّذِیۡنَ اٰوَوۡا وَّ نَصَرُوۡۤا اُولٰٓئِکَ ہُمُ الۡمُؤۡمِنُوۡنَ حَقًّا ؕ لَہُمۡ مَّغۡفِرَۃٌ وَّ رِزۡقٌ کَرِیۡمٌ ﴿۷۵﴾", "english": " And those who have believed and left their homes and striven for the cause of Allah, and those who have given them shelter and help — these indeed are true believers. For them is forgiveness and an honourable provision.", "french": " Et ceux qui ont cru et ont aban­donné leurs demeures et ont lutté dans la cause d’Allāh, et ceux qui les ont abrités et aidés, ceux-là assurément sont de vrais croyants. A eux le pardon et une provision honorable.", "german": " Die nun geglaubt haben und ausgewandert sind und gestritten haben für Allahs Sache, und jene, die (ihnen) Herberge und Hilfe gaben – diese sind in der Tat wahre Gläubige. Ihnen wird Vergebung und eine ehrenvolle Versorgung.", "spanish": " En cuanto a quienes han creído y han dejado sus casas, luchando por la causa de Al-lah, y aquellos que les han dado protección y ayuda: éstos son en verdad los verdaderos creyentes. Para ellos será el perdón y una generosa provisión.", "urdu": " اور وہ لوگ جو ایمان لائے ہیں اور جنہوں نے ہجرت کی ہے اور جنہوں نے اللہ کے راستہ میں جہاد کیا ہے اور جنہوں نے (ہجرت کرنے والوں کو) اپنے گھروں میں جگہ دی ہے اور (ان کی) مدد کی ہے وہی سچے مومن ہیں ان کو گناہوں کی معافی بھی حاصل ہوگی‘ اور معزز رزق ملے گا۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا مِنۡۢ بَعۡدُ وَ ہَاجَرُوۡا وَ جٰہَدُوۡا مَعَکُمۡ فَاُولٰٓئِکَ مِنۡکُمۡ ؕ وَ اُولُوا الۡاَرۡحَامِ بَعۡضُہُمۡ اَوۡلٰی بِبَعۡضٍ فِیۡ کِتٰبِ اللّٰہِ ؕ اِنَّ اللّٰہَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿٪۷۶﴾", "english": " And those who have believed since then and left their homes and striven for the cause of Allah along with you — these are of you; and as to blood relations, they are nearer one to another in the Book of Allah. Surely, Allah knows all things well.", "french": " Et ceux qui ont cru plus tard, qui ont quitté leurs maisons et qui ont combattu dans la cause d’Allāh avec vous – ceux-là sont des vôtres. Et les parents par le sang, ceux-ci, selon le Livre d’Allāh, sont les plus proches les uns des autres. En vérité, Allāh connaît très bien toutes les choses.", "german": " Und die, welche hernach glauben und auswandern und streiten werden (für Allahs Sache) an eurer Seite – sie gehören zu euch; und (unter) Blutsverwandten stehen sich die einen näher als die anderen im Buche Allahs. Wahrlich, Allah weiß alle Dinge wohl.", "spanish": " Mas quienes han creído desde entonces, y han abandonado sus casas, luchando por la causa de Al-lah junto con vosotros: éstos son de los vuestros; y en cuanto a los parientes de sangre, están más cercanos entre sí, en el Libro de Al-lah. En verdad, Al-lah conoce perfectamente todas las cosas.", "urdu": " اور جو لوگ (موجودہ وقت) کے بعد ایمان لائیں گے اور ہجرت بھی کریں گے اور تمہارے ساتھ مل کر جہاد کریں گے وہ بھی تمہاری جماعت میں سے سمجھے جائیں گے اور بعض رحمی رشتہ دار بعض کی نسبت اللہ کی کتاب کی رو سے زیادہ قریبی ہوتے ہیں۔ اللہ ہر چیز کو خوب جانتا ہے۔"}], "Surah": 8}