{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَّخِذُوۡا عَدُوِّیۡ وَ عَدُوَّکُمۡ اَوۡلِیَآءَ تُلۡقُوۡنَ اِلَیۡہِمۡ بِالۡمَوَدَّۃِ وَ قَدۡ کَفَرُوۡا بِمَا جَآءَکُمۡ مِّنَ الۡحَقِّ ۚ یُخۡرِجُوۡنَ الرَّسُوۡلَ وَ اِیَّاکُمۡ اَنۡ تُؤۡمِنُوۡا بِاللّٰہِ رَبِّکُمۡ ؕ اِنۡ کُنۡتُمۡ خَرَجۡتُمۡ جِہَادًا فِیۡ سَبِیۡلِیۡ وَ ابۡتِغَآءَ مَرۡضَاتِیۡ ٭ۖ تُسِرُّوۡنَ اِلَیۡہِمۡ بِالۡمَوَدَّۃِ ٭ۖ وَ اَنَا اَعۡلَمُ بِمَاۤ اَخۡفَیۡتُمۡ وَ مَاۤ اَعۡلَنۡتُمۡ ؕ وَ مَنۡ یَّفۡعَلۡہُ مِنۡکُمۡ فَقَدۡ ضَلَّ سَوَآءَ السَّبِیۡلِ ﴿۲﴾", "english": " O ye who believe! take not My enemy and your enemy for friends, offering them love, while they disbelieve in the truth which has come to you and drive out the Messenger and yourselves from your homes merely because you believe in Allah, your Lord. If you go forth, to strive in My cause and seek My pleasure, take them not for friends , sending them messages of love in secret, while I know best what you conceal and what you reveal. And whoever of you does so, has, surely, lost the right path.", "french": " Ô vous qui croyez ! ne prenez pas Mon ennemi et votre ennemi comme amis, leur offrant de l’affection, alors qu’ils ne croient pas à la vérité qui vous est venue ; ils expulsent le Messager ainsi que vous-mêmes de vos habitations, simplement parce que vous croyez en Allāh, votre Seigneur. Si vous sortez pour lutter pour Ma cause et rechercher Mon plaisir, ne les prenez pas comme amis , leur faisant parvenir en cachette des messages d’amitié, alors que Je sais le mieux ce que vous dissimulez et ce que vous révélez. Et quiconque d’entre vous fait cela, s’est sûrement égaré du droit chemin.", "german": " O die ihr glaubt, nehmt euch nicht Meinen Feind und euren Feind zu Freunden, ihnen Liebe erbietend, da sie doch die Wahrheit leugnen, die zu euch gekommen ist, und den Gesandten und euch selbst austreiben, weil ihr an Allah, euren Herrn, glaubt. Wenn ihr ausgezogen seid zum Kampf für Meine Sache und im Trachten nach Meinem Wohlgefallen, sendet ihr ihnen insgeheim Botschaften der Liebe, wenn Ich doch am besten weiß, was ihr verhehlt und was ihr offenbart. Und wer unter euch das tut, der ist sicherlich abgeirrt vom geraden Weg.", "spanish": " ¡Oh vosotros, los creyentes! No toméis por amigos a Mis enemigos y a los vuestros, demostrándoles afecto, mientras no crean en la verdad que os ha llegado y expulsen de vuestras casas al Mensajero y a vosotros simplemente porque creéis en Al-lah, vuestro Señor. Si partís y os esforzáis en Mi causa y buscáis Mi grado, no los toméis por amigos, enviándoles mensajes de amor en secreto, pues Yo sé perfectamente lo que ocultáis y lo que reveláis. Y cualquiera de vosotros que lo haga, en verdad ha perdido el camino recto.", "urdu": " اے مومنو! میرے اور اپنے دشمنوں کو گہرا دوست نہ بنایا کرو۔ تم تو ان کی طرف محبت کے پیغام بھیجتے ہو‘ حالانکہ وہ اس حق کے منکر ہیں جو تمہاری طرف آیا ہے وہ تم کو بھی اور رسول کو بھی صرف اس لئے کہ تم سب اللہ پر جو تمہارا رب ہے‘ ایمان لائے ہو لڑنے کے لئے (گھروں سے) نکالتے ہیں۔ اگر تم میرے رستہ میں کوشش کرنے‘ اور میری رضا جوئی کے لئے نکلو‘ تو تم میں سے بعض چوری چوری ان کی طرف محبت کا پیغام بھیجتے ہیں اور میں خوب جانتا ہوں اس کو جو تم چھپاتے ہو اور جو ظاہر کرتے ہو۔ اور جو کوئی تم میں سے ایسا کام کرے وہ سمجھ لے کہ وہ سیدھے رستہ سے بھٹک گیا۔"}, {"arabic": " اِنۡ یَّثۡقَفُوۡکُمۡ یَکُوۡنُوۡا لَکُمۡ اَعۡدَآءً وَّ یَبۡسُطُوۡۤا اِلَیۡکُمۡ اَیۡدِیَہُمۡ وَ اَلۡسِنَتَہُمۡ بِالسُّوۡٓءِ وَ وَدُّوۡا لَوۡ تَکۡفُرُوۡنَ ؕ﴿۳﴾", "english": " If they get the upper hand of you, they show themselves to be your active enemies, and will stretch forth their hands and their tongues towards you with evil intent ; and they ardently desire that you should become disbelievers.", "french": " Ce n’est que s’ils l’emportent sur vous, qu’ils se comporteront ouvertement envers vous en ennemis, et ils tendront vers vous leurs mains et leur langue pour vous faire du mal ; et ils désirent ardemment que vous deveniez mécréants.", "german": " Wenn sie die Oberhand über euch gewinnen, dann werden sie sich gegen euch als Feinde betragen und ihre Hände und ihre Zungen zum Bösen gegen euch ausstrecken; und sie wünschen inständig, dass ihr ungläubig würdet.", "spanish": " Sólo si ganan la supremacía sobre vosotros, se mostrarán como vuestros enemigos declarados , y extenderán sus manos y lenguas contra vosotros con malvada intención; pues desean ardientemente que os hagáis incrédulos.", "urdu": " اگر وہ تم پر قابو پالیں تو تم جان لو گے کہ وہ تمہارے دشمن ہیں اور تمہاری تباہی کے لئے اپنے ہاتھ اور زبانیں چلا چلا کر کوشش کر رہے ہیں اور ان کی خواہش یہ رہتی ہے کہ تم کافر ہو جاٶ۔"}, {"arabic": " لَنۡ تَنۡفَعَکُمۡ اَرۡحَامُکُمۡ وَ لَاۤ اَوۡلَادُکُمۡ ۚۛ یَوۡمَ الۡقِیٰمَۃِ ۚۛ یَفۡصِلُ بَیۡنَکُمۡ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۴﴾", "english": " Neither your ties of kindred nor your children will avail you aught on the Day of Resurrection. He will decide between you. And Allah sees all that you do.", "french": " Ni vos liens de parenté ni vos enfants ne vous seront d’aucun profit au Jour de la Résurrection. Il jugera entre vous. Et Allāh voit bien tout ce que vous faites.", "german": " Weder eure Bande der Blutsverwandtschaft noch eure Kinder werden euch am Tage der Auferstehung im geringsten nützen. Er wird zwischen euch entscheiden. Und Allah sieht alles, was ihr tut.", "spanish": " Ni vuestros parientes ni vuestros hijos os servirán de nada en el Día de la Resurrección. Él decidirá entre vosotros, pues Al-lah ve todo lo que hacéis.", "urdu": " تم کو نہ تو تمہارے رحمی رشتے اور نہ اولادیں قیامت کے دن نفع پہنچا سکتی ہیں۔ اس دن خدا ہی فیصلہ کرے گا اور اللہ تمہارے اعمال کو اچھی طرح دیکھ رہا ہے۔"}, {"arabic": " قَدۡ کَانَتۡ لَکُمۡ اُسۡوَۃٌ حَسَنَۃٌ فِیۡۤ اِبۡرٰہِیۡمَ وَ الَّذِیۡنَ مَعَہٗ ۚ اِذۡ قَالُوۡا لِقَوۡمِہِمۡ اِنَّا بُرَءٰٓؤُا مِنۡکُمۡ وَ مِمَّا تَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ ۫ کَفَرۡنَا بِکُمۡ وَ بَدَا بَیۡنَنَا وَ بَیۡنَکُمُ الۡعَدَاوَۃُ وَ الۡبَغۡضَآءُ اَبَدًا حَتّٰی تُؤۡمِنُوۡا بِاللّٰہِ وَحۡدَہٗۤ اِلَّا قَوۡلَ اِبۡرٰہِیۡمَ لِاَبِیۡہِ لَاَسۡتَغۡفِرَنَّ لَکَ وَ مَاۤ اَمۡلِکُ لَکَ مِنَ اللّٰہِ مِنۡ شَیۡءٍ ؕ رَبَّنَا عَلَیۡکَ تَوَکَّلۡنَا وَ اِلَیۡکَ اَنَبۡنَا وَ اِلَیۡکَ الۡمَصِیۡرُ ﴿۵﴾", "english": " There is a good model for you in Abraham and those with him, when they said to their people, ‘We have nothing to do with you and with that which you worship beside Allah. We disbelieve all that you believe . There has arisen enmity and hatred between us and you for ever, until you believe in Allah alone’ — with the exception of this saying of Abraham to his father, ‘I will surely ask forgiveness for thee, though I have no power to prevail upon Allah in favour of thee.’ They prayed to God saying , ‘Our Lord, in Thee do we put our trust and to Thee do we turn repentant , and towards Thee is the final return.", "french": " Il y a pour vous un excellent modèle en Abraham et ceux qui étaient avec lui, lorsqu’ils dirent à leur peuple : « Nous n’avons rien à faire avec vous, ni avec ce que vous adorez en dehors d’Allāh. Nous vous renions. L'inimitié et la haine sont devenues manifestes entre nous et vous pour toujours, jusqu’à ce que vous croyiez en Allāh Seul » – sauf qu’Abraham dit à son père : « Je demanderai assurément pardon pour toi, quoique je n’aie aucun pouvoir de prévaloir en ta faveur auprès d’Allāh. » « Notre Seigneur, c’est en Toi que nous plaçons notre confiance, et c’est vers Toi que nous nous tournons repentants , et vers Toi qu’est la destination finale .", "german": " Ihr habt bereits ein vortreffliches Beispiel an Abraham und denen mit ihm, da sie zu ihrem Volke sprachen: \"Wir haben nichts mit euch zu schaffen noch mit dem, was ihr statt Allah anbetet. Wir verwerfen euch. Und zwischen uns und euch ist offenbar für immer Feindschaft und Hass entstanden, bis ihr an Allah glaubt und an Ihn allein\" – abgesehen von Abrahams Wort zu seinem Vater: \"Ich will gewiss für dich um Verzeihung bitten, obwohl ich nicht die Macht habe, bei Allah für dich etwas auszurichten.\" (Sie beteten:) \"Unser Herr, in Dich setzen wir unser Vertrauen und zu Dir kehren wir reuig um, und zu Dir ist zuletzt die Einkehr.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=60:5&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=60:5&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic6\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic6\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/60:6' style='text-decoration:underline'>60:6</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(6)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control6\"></i></button> <audio id=\"player6\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَۃً لِّلَّذِیۡنَ کَفَرُوۡا وَ اغۡفِرۡ لَنَا رَبَّنَا ۚ اِنَّکَ اَنۡتَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۶﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Our Lord, make us not a trial for those who disbelieve, and forgive us, our Lord; for Thou alone art the Mighty, the Wise.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Our Lord, make us not a <sup class='ref'>[<a class='ref' data-id='ref_60_6_b' href='#'>b</a>]</sup>trial for those who disbelieve, and forgive us, our Lord; for, Thou alone art the Mighty, the Wise.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_60_6_b'>b</span></div> <div><div class='reference' data-id='ref_60_6_b' style='display:none'> <p><b>b.</b> <a href='/quran/10:86' target=_blank>10:86</a>. (<a href='javascript:void(0)' data-id='ref_60_6_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اے ہمارے ربّ! ہمیں ان لوگوں کےلئے ابتلا نہ بنا جنہوں نے کفر کیا اور اے ہمارے ربّ! ہمیں بخش دے یقیناً تو کامل غلبہ والا (اور) صاحبِ حکمت ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اے ہمارے رب! ہمیں کافروں کے لئے ٹھوکر کا موجب نہ بنا‘ اور ہمارا قصور معاف کر۔ اے ہمارے رب! تو بہت غالب (اور) حکمت والا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Notre Seigneur, ne fais pas de nous une épreuve pour ceux qui ne croient pas, et pardonne-nous, notre Seigneur ; car Toi Seul es le Puissant, le Sage. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Señor Nuestro, no nos conviertas en prueba para los que no creen, y perdónanos, Señor Nuestro; pues sólo Tú eres el Poderoso, el Sabio”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Unser Herr, mache uns nicht zum Stein des Anstoßes für die Ungläubigen, und vergib uns, unser Herr, denn Du, und Du allein, bist der Allmächtige, der Allweise.\"", "spanish": " Tenéis un buen ejemplo en Abraham y en los que estaban con él, cuando dijeron a su pueblo: “No tenemos nada que ver con vosotros ni on lo que adoráis en vez de Al-lah. No creemos en nada de lo que creéis . La enemistad y el odio se levantará entre nosotros y vosotros para siempre, mientras no creáis exclusivamente en Al-lah”, -con la excepción de lo que dijo Abraham a su padre: “En verdad, pediré el perdón para ti, aunque no tengo poder para convencer a Al-lah a tu favor-. Y oraron a Dios diciendo: “Señor Nuestro, n Ti volvemos arrepentidos, pues hacia Ti será el retorno final”.", "urdu": " ابراہیم اور اس کے ساتھیوں میں تمہارے لئے ایک اچھا نمونہ موجود ہے جبکہ انہوں نے اپنی قوم سے کہا کہ ہم تم سے اور اللہ کے سوا تمہارے معبودوں سے کلی طور پر بیزار ہیں۔ ہم تمہاری باتوں کا انکار کرتے ہیں اور ہمارے اور تمہارے درمیان عداوت اور بغض اس وقت تک کے لئے ظاہر ہو گیا ہے کہ تم خدا پر ایمان لاٶ۔ ہاں ہم ابراہیم کے وعدہ کو جو اس نے اپنے باپ سے کیا تھا مستثنی کرتے ہیں‘ وہ یہ تھا کہ میں تیرے لئے استغفار کروں گا۔ لیکن اللہ کے مقابلہ میں تیری کسی قسم کی مدد پر میں قادر نہیں‘ (اور ابراہیم نے یہ بھی کہا کہ) اے ہمارے رب! ہم تجھ پر توکل کرتے ہیں اور تیری طرف جھکتے ہیں اور تیری طرف ہی ہم کو لوٹ کر جانا ہے۔"}, {"arabic": " لَقَدۡ کَانَ لَکُمۡ فِیۡہِمۡ اُسۡوَۃٌ حَسَنَۃٌ لِّمَنۡ کَانَ یَرۡجُوا اللّٰہَ وَ الۡیَوۡمَ الۡاٰخِرَ ؕ وَ مَنۡ یَّتَوَلَّ فَاِنَّ اللّٰہَ ہُوَ الۡغَنِیُّ الۡحَمِیۡدُ ٪﴿۷﴾", "english": " Surely, there is a good example in them for you — for all who have hope in Allah and the Last Day. And whosoever turns away — truly, Allah is Self-Sufficient, Worthy of all praise.", "french": " Assurément, il y a en eux un excellent exemple pour vous – pour tous ceux qui espèrent en Allāh et au Jour Dernier. Et quiconque se détourne – en vérité, Allāh est Celui Qui Se suffit à Lui-Même, le Digne de louange.", "german": " Wahrlich, ihr habt an ihnen ein vortreffliches Beispiel (und so) ein jeder, der Allah fürchtet und den Jüngsten Tag. Und wer sich abwendet – fürwahr, Allah ist der Sich Selbst Genügende, der Preiswürdige.", "spanish": " En verdad, hay en ellos un hermoso ejemplo para vosotros -para todos los que mantienen esperanzas en Al-lah y en el Último Día-. Y quien se aparte sepa que, en verdad, Al-lah es Autosuficiente, merecedor de toda alabanza.", "urdu": " ان لوگوں میں تمہارے لئے ایک بڑا اچھا نمونہ ہے یعنی ہر اس شخص کے لئے جو اللہ اور یوم آخر کو دیکھنے کی امید رکھتا ہے اور جو کوئی پیٹھ پھیر لے وہ یاد رکھے کہ اللہ بالکل بے نیاز ہے (اور) بڑی تعریفوں کا مستحق ہے۔"}, {"arabic": " عَسَی اللّٰہُ اَنۡ یَّجۡعَلَ بَیۡنَکُمۡ وَ بَیۡنَ الَّذِیۡنَ عَادَیۡتُمۡ مِّنۡہُمۡ مَّوَدَّۃً ؕ وَ اللّٰہُ قَدِیۡرٌ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۸﴾", "english": " It may be that Allah will bring about love between you and those of them with whom you are now at enmity; and Allah is All-Powerful; and Allah is Most Forgiving, Merciful.", "french": " Il se peut qu’Allāh mette de l’affection entre vous et ceux d’entre eux avec qui vous êtes maintenant en inimitié, et Allāh est Tout-Puissant ; et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Vielleicht wird Allah Liebe setzen zwischen euch und denen unter ihnen, mit denen ihr in Feindschaft lebt; denn Allah ist allmächtig und Allah ist allverzeihend, barmherzig.", "spanish": " Es posible que Al-lah haga surgir el amor entre vosotros y aquellos con los que ahora estáis enemistados; pues Al-lah es Todopoderoso; y Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " قریب ہے کہ اللہ تمہارے اور ان لوگوں کے درمیان جو کافروں میں سے تمہارے دشمن ہیں محبت پیدا کر دے اور اللہ اس پر قادر ہے اور اللہ بڑا بخشنے والا (اور) بے انتہا رحم کرنے والا ہے۔"}, {"arabic": " لَا یَنۡہٰٮکُمُ اللّٰہُ عَنِ الَّذِیۡنَ لَمۡ یُقَاتِلُوۡکُمۡ فِی الدِّیۡنِ وَ لَمۡ یُخۡرِجُوۡکُمۡ مِّنۡ دِیَارِکُمۡ اَنۡ تَبَرُّوۡہُمۡ وَ تُقۡسِطُوۡۤا اِلَیۡہِمۡ ؕ اِنَّ اللّٰہَ یُحِبُّ الۡمُقۡسِطِیۡنَ ﴿۹﴾", "english": " Allah forbids you not, respecting those who have not fought against you on account of your religion, and who have not driven you forth from your homes, that you be kind to them and act equitably towards them; surely Allah loves those who are equitable.", "french": " A l’égard de ceux qui ne se sont pas battus contre vous à cause de votre religion, et qui ne vous ont pas chassés de vos habitations, Allāh ne vous interdit pas d’être bienveillants, et d’agir équitablement envers eux. Assurément Allāh aime ceux qui sont équitables.", "german": " Allah verbietet euch nicht, gegen jene, die euch nicht bekämpft haben des Glaubens wegen und euch nicht aus euren Heimstätten vertrieben haben, gütig zu sein und billig mit ihnen zu verfahren; Allah liebt die Billigkeit Zeigenden.", "spanish": " Respecto a quienes no han luchado contra vosotros en razón de vuestra religión y no os han expulsado de vuestras casas, Al-lah no os prohíbe que seáis amables con ellos y que actuéis equitativamente con ellos; en verdad, Al-lah ama a los que hacen justicia.", "urdu": " اللہ تم کو ان لوگوں سے نیکی کرنے اور عدل کا معاملہ کرنے سے نہیں روکتا جو تم سے دینی اختلاف کی وجہ سے نہیں لڑے اور جنہوں نے تم کو تمہارے گھروں سے نہیں نکالا۔ اللہ انصاف کرنے والوں کو پسند کرتا ہے۔"}, {"arabic": " اِنَّمَا یَنۡہٰٮکُمُ اللّٰہُ عَنِ الَّذِیۡنَ قٰتَلُوۡکُمۡ فِی الدِّیۡنِ وَ اَخۡرَجُوۡکُمۡ مِّنۡ دِیَارِکُمۡ وَ ظٰہَرُوۡا عَلٰۤی اِخۡرَاجِکُمۡ اَنۡ تَوَلَّوۡہُمۡ ۚ وَ مَنۡ یَّتَوَلَّہُمۡ فَاُولٰٓئِکَ ہُمُ الظّٰلِمُوۡنَ ﴿۱۰﴾", "english": " Allah only forbids you, respecting those who have fought against you on account of your religion, and have driven you out of your homes, and have helped others in driving you out, that you make friends of them, and whosoever makes friends of them — it is these that are the transgressors.", "french": " Allāh vous interdit seulement, à l’égard de ceux qui se sont battus contre vous à cause de votre religion, et qui vous ont chassés de vos habitations, et qui ont aidé à votre expulsion, de vous lier d’amitié avec eux, et quiconque se lie d’amitié avec eux – ce sont ceux-là qui sont les injustes.", "german": " Allah verbietet euch nur, mit denen, die euch bekämpft haben des Glaubens wegen und euch aus euren Heimstätten vertrieben und (anderen) geholfen haben, euch zu vertreiben, Freundschaft zu machen. Und wer mit ihnen Freundschaft macht – das sind die Missetäter.", "spanish": " Al-lah sólo os prohíbe, respecto a los que han luchado contra vosotros en razón de vuestra religión y os han expulsado de vuestras casas, y han ayudado a otros a expulsaros, que hagáis amistad con ellos, pues quien se haga amigo de ellos sepa que se contaría entre los transgresores.", "urdu": " اللہ تم کو صرف ان لوگوں سے (دوستی کرنے سے) روکتا ہے جنہوں نے تم سے دینی اختلاف کی وجہ سے جنگ کی اور جنہوں نے تم کو گھروں سے نکالا یا تمہارے نکالنے پر تمہارے دوسرے دشمنوں کی مدد کی اور جو لوگ بھی ایسے لوگوں سے دوستی کریں وہ ظالم ہیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا جَآءَکُمُ الۡمُؤۡمِنٰتُ مُہٰجِرٰتٍ فَامۡتَحِنُوۡہُنَّ ؕ اَللّٰہُ اَعۡلَمُ بِاِیۡمَانِہِنَّ ۚ فَاِنۡ عَلِمۡتُمُوۡہُنَّ مُؤۡمِنٰتٍ فَلَا تَرۡجِعُوۡہُنَّ اِلَی الۡکُفَّارِ ؕ لَا ہُنَّ حِلٌّ لَّہُمۡ وَ لَا ہُمۡ یَحِلُّوۡنَ لَہُنَّ ؕ وَ اٰتُوۡہُمۡ مَّاۤ اَنۡفَقُوۡا ؕ وَ لَا جُنَاحَ عَلَیۡکُمۡ اَنۡ تَنۡکِحُوۡہُنَّ اِذَاۤ اٰتَیۡتُمُوۡہُنَّ اُجُوۡرَہُنَّ ؕ وَ لَا تُمۡسِکُوۡا بِعِصَمِ الۡکَوَافِرِ وَ سۡـَٔلُوۡا مَاۤ اَنۡفَقۡتُمۡ وَ لۡیَسۡـَٔلُوۡا مَاۤ اَنۡفَقُوۡا ؕ ذٰلِکُمۡ حُکۡمُ اللّٰہِ ؕ یَحۡکُمُ بَیۡنَکُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۱۱﴾", "english": " O ye who believe! when believing women come to you as Refugees, examine them. Allah knows best their faith. Then, if you find them true believers, send them not back to the disbelievers. These women are not lawful for them, nor are they lawful for these women . But give their disbelieving husbands what they have spent on them . And it is no sin for you to marry them, when you have given them their dowries. And hold not to your matrimonial ties with the disbelieving women; but demand the return of that which you have spent; and let the disbelievers demand that which they have spent. That is the judgment of Allah. He judges between you. And Allah is All-Knowing, Wise.", "french": " Ô vous qui croyez ! lorsque des croyantes viennent à vous comme réfugiées, mettez-les à l’épreuve. Allāh connaît le mieux leur foi. Si alors vous les trouvez de vraies croyantes, ne les renvoyez pas aux mécréants. Ces femmes ne sont pas licites pour eux, et eux – les mécréants – ne sont pas licites non plus pour elles. Mais payez à leurs maris mécréants ce qu’ils auront dépensé pour elles . Et ce n’est pas un pêché de votre part de les épouser, lorsque vous leur aurez donné leur dot. Et ne conservez pas vos liens conjugaux avec les mécréantes, mais réclamez le remboursement de ce que vous aurez dépensé, et que les mécréants réclament ce qu’ils auront dépensé. C’est là le jugement d’Allāh. Il juge entre vous. Et Allāh est Omniscient, Sage.", "german": " O die ihr glaubt, wenn gläubige Frauen als Flüchtlinge zu euch kommen, so prüfet sie. Allah weiß am besten, wie es um ihren Glauben bestellt ist. Wenn ihr sie dann gläubig findet, so schicket sie nicht zu den Ungläubigen zurück. Diese Frauen sind ihnen nicht erlaubt, noch sind sie diesen Frauen erlaubt. Jedoch zahlet (ihren ungläubigen Ehemännern) das zurück, was sie (für sie) ausgegeben haben. Und es ist keine Sünde für euch, sie zu heiraten, wenn ihr ihnen ihre Mitgift gegeben habt. Und haltet nicht am Eheband mit den ungläubigen Frauen fest, sondern verlangt das zurück, was ihr (für sie) ausgegeben habt, und lasst (die Ungläubigen) zurückverlangen, was sie (für sie) ausgegeben haben. Das ist Allahs Gebot. Er richtet zwischen euch. Und Allah ist allwissend, allweise.", "spanish": " ¡Oh vosotros, los creyentes! Cuando mujeres creyentes acudan a vosotros como refugiadas, indagadlas. Al-lah conoce muy bien su fe. Si entonces las encontráis verdaderamente creyentes, no las restituyáis a los incrédulos. Estas mujeres no son lícitas ara ellos, ni ellos lo son para ellas . Pero devolved a sus maridos incrédulos lo que hayan gastado en ellas. Y no será pecado para vosotros tomarlas en atrimonio, cuando les hayáis dado su dote. Y no mantengáis vuestros lazos conyugales con las mujeres incrédulas, sino edid la devolución de lo que hayáis gastado; y dejad que los incrédulos pidan lo que han gastado. Éste es el juicio de Al-lah. Él juzga entre vosotros. Pues Al-lah es Omnisciente, Sabio.", "urdu": " اے مومنو! جب تمہارے پاس مومن عورتیں ہجرت کرکے آئیں‘ تو ان کو اچھی طرح آزما لیا کرو۔ اللہ ان کے ایمان کو خوب جانتا ہے لیکن اگر تم بھی جان لو کہ وہ مومن عورتیں ہیں تو ان کو کافروں کی طرف مت لوٹاٶ۔ نہ وہ ان (کافروں) کے لئے جائز ہیں اور نہ وہ (کافر) ان (عورتوں) کے لئے جائز ہیں اور چاہیے کہ کفار نے جو ان (عورتوں کے نکاح) پر خرچ کیا ہو وہ ان کو واپس کر دو۔ اور (جب تم ان عورتوں کو کفار سے فارغ کروالو تو) ان کے معاوضے (یعنی مہر) ادا کرنے کی صورت میں اگر تم ان سے شادی کر لو تو تم پر کوئی اعتراض نہیں۔ اور کافر عورتوں کے ننگ و ناموس کو قبضہ میں نہ رکھو اور جو کچھ تم نے ان پر خرچ کیا ہے (اگر وہ بھاگ کر کفار کی طرف چلی جائیں تو) کفار سے مانگو۔ اور (اگر کفار کی بیویاں مسلمان ہو کر مسلمانوں سے آملیں تو) جو کچھ انہوں نے (اپنے نکاحوں پر) خرچ کیا ہے مسلمانوں سے مانگیں۔ یہ تمہیں اللہ کا ارشاد ہے۔ وہ تمہارے درمیان فیصلہ کرتا ہے اور اللہ جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ اِنۡ فَاتَکُمۡ شَیۡءٌ مِّنۡ اَزۡوَاجِکُمۡ اِلَی الۡکُفَّارِ فَعَاقَبۡتُمۡ فَاٰتُوا الَّذِیۡنَ ذَہَبَتۡ اَزۡوَاجُہُمۡ مِّثۡلَ مَاۤ اَنۡفَقُوۡا ؕ وَ اتَّقُوا اللّٰہَ الَّذِیۡۤ اَنۡتُمۡ بِہٖ مُؤۡمِنُوۡنَ ﴿۱۲﴾", "english": " And if any of your wives goes away from you to the disbelievers, then when you retaliate and get some spoils from the disbelievers , give to those believers whose wives have gone away the like of that which they had spent on their wives . And fear Allah in Whom you believe.", "french": " Et si l’une de vos femmes vous quitte pour les mécréants, alors, lorsque vous vous usez de représailles et que vous obtenez du butin des mécréants , donnez à ces croyants dont les femmes sont parties l’équivalent de ce qu’ils avaient dépensé pour leurs femmes . Et craignez Allāh en Qui vous croyez.", "german": " Und wenn irgendwelche von euren Frauen von euch zu den Ungläubigen fortgehen, dann gebt, wenn ihr (bei den Ungläubigen) Beute machet, jenen (Gläubigen), deren Frauen fortgegangen sind, das gleiche von dem, was sie (für ihre Frauen) ausgegeben hatten. Und fürchtet Allah, an Den ihr glaubt.", "spanish": " Y si cualquiera de vuestras esposas se marcha y se va con los ncrédulos, entonces, cuando os desquitéis y obtengáis algún botín de los incrédulos, entregad a los reyentes cuyas esposas se marcharon, lo mismo que emplearon en sus esposas y temed a Al-lah en Quien creéis.", "urdu": " اور اگر تمہاری بیویوں میں سے کوئی بھاگ کر کافروں کے پاس چلی جائے اور اس کے بعد تمہارے ہاتھ میں بھی کوئی کافر عورت (جنگی قیدی کے طور پر) آئے تو تم ان لوگوں کو جن کی بیویاں بھاگ کر کافروں سے جا ملی ہیں ان کے اصل خرچ کے برابر جو انہوں نے اپنے نکاحوں پر کیا تھا ادا کر دو اور اللہ کا تقویٰ اختیار کرو۔ جس پر تم ایمان لاتے ہو۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ اِذَا جَآءَکَ الۡمُؤۡمِنٰتُ یُبَایِعۡنَکَ عَلٰۤی اَنۡ لَّا یُشۡرِکۡنَ بِاللّٰہِ شَیۡئًا وَّ لَا یَسۡرِقۡنَ وَ لَا یَزۡنِیۡنَ وَ لَا یَقۡتُلۡنَ اَوۡلَادَہُنَّ وَ لَا یَاۡتِیۡنَ بِبُہۡتَانٍ یَّفۡتَرِیۡنَہٗ بَیۡنَ اَیۡدِیۡہِنَّ وَ اَرۡجُلِہِنَّ وَ لَا یَعۡصِیۡنَکَ فِیۡ مَعۡرُوۡفٍ فَبَایِعۡہُنَّ وَ اسۡتَغۡفِرۡ لَہُنَّ اللّٰہَ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۳﴾", "english": " O Prophet! when believing women come to thee, taking the oath of allegiance at thy hands that they will not associate anything with Allah, and that they will not steal, and will not commit adultery, nor kill their children, nor bring forth a scandalous charge which they themselves have deliberately forged, nor disobey thee in what is right, then accept their allegiance and ask Allah to forgive them. Verily, Allah is Most Forgiving, Merciful.", "french": " Ô Prophète ! lorsque des croyantes viennent te prêter serment d’allégeance qu’elles n’associeront rien à Allāh, et qu’elles ne voleront pas, et ne commettront pas l’adultère, ni ne tueront leurs enfants, ni ne porteront de calomnie qu’elles auront elles mêmes inventée délibérément, ni ne te désobéiront en ce qui est juste, alors accepte leur allégeance et demande à Allāh de leur pardonner. En vérité, Allāh est Très-Pardonnant, Miséricordieux.", "german": " O Prophet! wenn gläubige Frauen zu dir kommen und dir den Treueid leisten, dass sie Allah nichts zur Seite stellen werden und dass sie weder stehlen noch Ehebruch begehen noch ihre Kinder töten noch eine Verleumdung vorbringen werden, die sie selbst wissentlich ersonnen, noch dir ungehorsam sein werden in dem, was recht ist, dann nimm ihren Treueid an und bitte Allah um Vergebung für sie. Wahrlich, Allah ist allvergebend, barmherzig.", "spanish": " ¡Oh, Profeta! Cuando las mujeres creyentes se presenten ante ti, jurando lealtad en tus manos de que no asociarán nada a Al-lah, y que no robarán, no cometerán adulterio, no matarán a sus hijos, no presentarán una acusación escandalosa que hayan inventado deliberadamente ellas mismas, ni te desobedecerán en lo que es justo, acepta su compromiso y pide a Al-lah que les perdone. En verdad Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اے نبی! جب تیرے پاس عورتیں مسلمان ہو کر آئیں اور بیعت کرنے کی خواہش کریں‘ اس شرط پر کہ وہ اللہ کا شریک کسی کو نہیں قرار دیں گی اور نہ ہی چوری کریں گی اور نہ ہی زنا کریں گی۔ اور نہ ہی اولاد کو قتل کریں گی اور نہ ہی کوئی جھوٹا بہتان کسی پر باندھیں گی۔ اور نیک باتوں میں تیری نافرمانی نہیں کریں گی۔ تو ان کی بیعت لے لیا کر‘ اور ان کے لئے استغفار کیا کر۔ اللہ بہت بخشنے والا (اور) بے حد رحم کرنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَوَلَّوۡا قَوۡمًا غَضِبَ اللّٰہُ عَلَیۡہِمۡ قَدۡ یَئِسُوۡا مِنَ الۡاٰخِرَۃِ کَمَا یَئِسَ الۡکُفَّارُ مِنۡ اَصۡحٰبِ الۡقُبُوۡرِ ﴿٪۱۴﴾", "english": " O ye who believe! make not friends of a people with whom Allah is wroth; they have indeed despaired of the Hereafter just as have the disbelievers despaired of those who are in the graves.", "french": " Ô vous qui croyez ! ne vous liez pas d’amitié avec un peuple contre qui Allāh est courroucé ; ils ont en effet désespéré de l’au-delà, comme les mécréants ont désespéré de ceux qui sont dans les tombes.", "german": " O die ihr glaubt, schließt nicht Freundschaft mit einem Volke, dem Allah zürnt; denn sie sind völlig am Jenseits verzweifelt, gerade so, wie die Ungläubigen an denen verzweifelt sind, die in den Gräbern sind.", "spanish": " ¡Oh vosotros, los creyentes! no hagáis amistad con un pueblo con el que Al-lah está encolerizado; en verdad han desesperado del Más Allá al igual que los incrédulos desesperaron de quienes están en las tumbas.", "urdu": " اے مومنو! کسی ایسی قوم سے دوستی نہ کرو‘ جس پر خدا ناراض ہے۔ وہ لوگ اخروی زندگی سے ایسے مایوس ہو گئے ہیں جس طرح کافر قبروں میں پڑے ہوئے لوگوں سے مایوس ہو گئے ہیں۔"}], "Surah": 60}