{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " حٰمٓ ۚ﴿ۛ۲﴾", "english": " Ha Mim.", "french": " Ḥā Mīm (Le Très-Louable, le Seigneur de l’Honneur).", "german": " Hâ Mîm.", "spanish": " Ha Mim.", "urdu": " حمید و مجید (خدا کی طرف سے یہ سورۃ نازل ہوئی ہے) ۔"}, {"arabic": " وَ الۡکِتٰبِ الۡمُبِیۡنِ ۙ﴿ۛ۳﴾", "english": " By this perspicuous Book,", "french": " Par ce Livre explicite,", "german": " Bei dem deutlichen Buch,", "spanish": " Por medio de este Libro lúcido,", "urdu": " ہم اس کتاب کی قسم کھاتے ہیں (یعنی اسے بطور شہادت کے پیش کرتے ہیں) جو اپنے مضمون کو کھول کر بیان کرنے والی ہے۔"}, {"arabic": " اِنَّا جَعَلۡنٰہُ قُرۡءٰنًا عَرَبِیًّا لَّعَلَّکُمۡ تَعۡقِلُوۡنَ ۚ﴿۴﴾", "english": " We have made it a Qur’an in clear, eloquent language that you may understand.", "french": " Nous l’avons fait un Coran un Livre à être récité très souvent en arabe dans une langue claire et éloquente , afin que vous puissiez comprendre.", "german": " Wir haben es zu einem Qur-ân in fehlerloser Sprache gemacht, auf dass ihr verstehen möchtet.", "spanish": " Hemos hecho un Corán en idioma claro y elocuente para que entendáis.", "urdu": " ہم نے اس کتاب کو قرآن بنایا ہے (اور قرآن بھی) ایسا جو عربی ہے تا کہ تم سمجھو۔"}, {"arabic": " وَ اِنَّہٗ فِیۡۤ اُمِّ الۡکِتٰبِ لَدَیۡنَا لَعَلِیٌّ حَکِیۡمٌ ؕ﴿۵﴾", "english": " And surely, it is safe with Us in the Mother of the Book, exalted and full of wisdom.", "french": " Et assurément il est en sécurité avec Nous dans la Mère du Livre, sublime et pleine de sagesse.", "german": " Wahrlich, er ist bei Uns, in der Mutter der Schrift, erhaben, voll der Weisheit.", "spanish": " En verdad está a salvo con Nosotros en la Madre del Libro, exaltado, lleno de sabiduría.", "urdu": " اور وہ (یعنی قرآن) ام الکتاب میں ہے اور ہمارے نزدیک بڑی شان والا (اور) بڑی حکمتوں والا ہے۔"}, {"arabic": " اَفَنَضۡرِبُ عَنۡکُمُ الذِّکۡرَ صَفۡحًا اَنۡ کُنۡتُمۡ قَوۡمًا مُّسۡرِفِیۡنَ ﴿۶﴾", "english": " Shall We then take away the Reminder from you, neglecting you because you are an extravagant people?", "french": " Devrons-Nous donc vous dispenser du Rappel parce que vous êtes un peuple extravagant ?", "german": " Sollen Wir da die Ermahnung von euch abwenden, weil ihr ein zügelloses Volk seid?", "spanish": " ¿Acaso hemos de retiraros el Recordatorio, olvidándoos por ser un pueblo extravagante?", "urdu": " کیا ہم تمہارے سامنے ذکر (یعنی کتاب) کا بیان کرنا صرف اس لئے چھوڑ دیں کہ تم حد سے بڑھی ہوئی قوم ہو۔"}, {"arabic": " وَ کَمۡ اَرۡسَلۡنَا مِنۡ نَّبِیٍّ فِی الۡاَوَّلِیۡنَ ﴿۷﴾", "english": " And how many a Prophet did We send among the earlier peoples!", "french": " Et que de Prophètes n’avons-Nous envoyés parmi les peuples antérieurs !", "german": " Wie so manchen Propheten entsandten Wir unter die früheren Völker!", "spanish": " ¡Cuántos profetas enviamos entre los pueblos antiguos!", "urdu": " اور ہم نے پہلی قوموں میں بہت سے نبی بھیجے ہیں۔"}, {"arabic": " وَ مَا یَاۡتِیۡہِمۡ مِّنۡ نَّبِیٍّ اِلَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿۸﴾", "english": " But there never came to them a Prophet but they mocked at him.", "french": " Mais jamais un Prophète n’est venu vers eux sans qu’ils ne se soient moqués de lui.", "german": " Und nie kam ein Prophet zu ihnen, den sie nicht verspottet hätten.", "spanish": " Mas nunca les llegó un profeta sin que se burlaran de él.", "urdu": " اور ان کے پاس کوئی نبی نہ آتا تھا کہ وہ اس سے ہنسی نہ کرتے ہوں (پھر بھی ہم نے ان کی طرف وحی نازل کی) ۔"}, {"arabic": " فَاَہۡلَکۡنَاۤ اَشَدَّ مِنۡہُمۡ بَطۡشًا وَّ مَضٰی مَثَلُ الۡاَوَّلِیۡنَ ﴿۹﴾", "english": " And We destroyed those who were stronger in power than these, and the example of the earlier peoples has gone before.", "french": " Et Nous avons anéanti ceux qui avaient la poigne plus forte que ceux-ci, et l’exemple des peuples antérieurs est déjà passé.", "german": " Darum vertilgten Wir, die stärker an Macht waren als diese, und das Beispiel der Früheren ist zuvor ergangen.", "spanish": " Destruimos a quienes eran más poderosos en el control que éstos, y el ejemplo de los pueblos antiguos ha quedado patente.", "urdu": " اور ہم نے ان سے زیادہ طاقتور لوگوں کو (انکار کی وجہ سے) ہلاک کر دیا تھا (پھر ان کو ہلاک کرنے میں کیا دِقت ہے) اور ان لوگوں کے سامنے پہلے لوگوں کے حالات گذر ہی چکے ہیں۔"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ مَّنۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ لَیَقُوۡلُنَّ خَلَقَہُنَّ الۡعَزِیۡزُ الۡعَلِیۡمُ ﴿ۙ۱۰﴾", "english": " And if thou ask them, ‘Who created the heavens and the earth?’, they will surely say, ‘The Mighty, the All-Knowing God created them.’", "french": " Et si tu leur demandes : « Qui a créé les cieux et la terre ? » Ils répondront assurément : « Le Dieu -Puissant, l’Omniscient les a créés. »", "german": " Und wenn du sie fragst: \"Wer schuf die Himmel und die Erde?\", werden sie sicherlich sagen: \"Der Allmächtige, der Allwissende hat sie erschaffen.\"", "spanish": " Mas si les preguntas: “¿Quién creó los cielos y la tierra?” responderán ciertamente: “El Dios Poderoso, el Omnisciente los creó”.", "urdu": " اور اگر تو اُن سے پوچھے کہ آسمانوں اور زمین کو کس نے پیدا کیا ہے تو وہ کہیں گے غالب (اور) بہت علم رکھنے والی ہستی نے ان کو پیدا کیا ہے۔"}, {"arabic": " الَّذِیۡ جَعَلَ لَکُمُ الۡاَرۡضَ مَہۡدًا وَّ جَعَلَ لَکُمۡ فِیۡہَا سُبُلًا لَّعَلَّکُمۡ تَہۡتَدُوۡنَ ﴿ۚ۱۱﴾", "english": " He , Who has made the earth for you a cradle, and has made pathways, for you therein, that you may follow the right way;", "french": " Celui Qui a fait pour vous de la terre un berceau, et Qui y a fait pour vous des chemins afin que vous puissiez bien vous orienter ;", "german": " (Er) Der die Erde für euch gemacht hat zu einer Wiege und Straßen für euch gemacht hat darauf, dass ihr dem rechten Wege folgen möget;", "spanish": " Aquel que ha hecho para vosotros de la tierra una cuna, y ha creado los caminos en ella para que podáis seguir el camino recto;", "urdu": " اس (ہستی) نے جس نے زمین کو تمہارے لئے بچھونا بنایا اور اس میں تمہارے لئے راستے بنائے ہیں تا کہ تم ہدایت پاٶ۔"}, {"arabic": " وَ الَّذِیۡ نَزَّلَ مِنَ السَّمَآءِ مَآءًۢ بِقَدَرٍ ۚ فَاَنۡشَرۡنَا بِہٖ بَلۡدَۃً مَّیۡتًا ۚ کَذٰلِکَ تُخۡرَجُوۡنَ ﴿۱۲﴾", "english": " And Who sends down water from the sky in proper measure, and We thereby quicken a dead land; — even so will you be raised; —", "french": " Et Qui fait descendre du ciel avec mesure l’eau par laquelle Nous ranimons une terre morte ; c’est ainsi que vous serez ressuscités ;", "german": " und Der Wasser herniedersendet vom Himmel nach Maß, durch das Wir ein totes Land zum Leben erwecken – ebenso sollt auch ihr auferweckt werden –;", "spanish": " Quien envía el agua desde el cielo en la medida justa, dando así nueva vida a una tierra muerta –así seréis resucitados-.", "urdu": " اور اسی نے بادل سے ایک اندازہ کے مطابق پانی اتارا ہے پھر اس کے ذریعہ سے ایک مردہ زمین کو زندہ کر دیا ہے اسی طرح تم بھی (زندہ کرکے) نکالے جاٶ گے۔"}, {"arabic": " وَ الَّذِیۡ خَلَقَ الۡاَزۡوَاجَ کُلَّہَا وَ جَعَلَ لَکُمۡ مِّنَ الۡفُلۡکِ وَ الۡاَنۡعَامِ مَا تَرۡکَبُوۡنَ ﴿ۙ۱۳﴾", "english": " And Who has created all the pairs, and has made for you ships and cattle whereon you ride,", "french": " Et Qui a créé toutes les choses par paires, et Qui a fait, à votre avantage, des navires et des bestiaux, sur lesquels vous montez,", "german": " und Der alle Arten paarweise erschaffen hat und für euch Schiffe gemacht hat und Tiere, auf denen ihr reitet,", "spanish": " Ha creado todo en parejas y creó para vosotros los buques y el ganado en el que podéis montar,", "urdu": " اور اسی نے تمہارے لئے ہر قسم کے جوڑے پیدا کیے ہیں اور اسی طرح چوپائے پیدا کیے ہیں اور کشتیاں بنائی ہیں جن پر تم سوار ہوتے ہو۔"}, {"arabic": " لِتَسۡتَوٗا عَلٰی ظُہُوۡرِہٖ ثُمَّ تَذۡکُرُوۡا نِعۡمَۃَ رَبِّکُمۡ اِذَا اسۡتَوَیۡتُمۡ عَلَیۡہِ وَ تَقُوۡلُوۡا سُبۡحٰنَ الَّذِیۡ سَخَّرَ لَنَا ہٰذَا وَ مَا کُنَّا لَہٗ مُقۡرِنِیۡنَ ﴿ۙ۱۴﴾", "english": " That you may sit firmly upon their backs, and then, when you are firmly seated thereon, you may remember the favour of your Lord, and say, ‘Holy is He Who has subjected this to us, and we had not the strength to subdue it ourselves .", "french": " Afin que vous puissiez vous asseoir fermement sur leur dos, et ensuite, lorsque vous y êtes fermement assis, que vous puissiez vous souvenir de la faveur de votre Seigneur, et dire : « Saint est-Il, Qui nous a assujetti ceci, et par nous-mêmes nous n’avions pas la force de le maîtriser.", "german": " so dass ihr fest auf ihren Rücken sitzen (und) dann, wenn ihr euch fest auf sie gesetzt habt, der Gnade eures Herrn eingedenk sein möget, und sprechet: \"Preis Ihm, Der uns dies dienstbar gemacht hat, und wir (selbst) hätten es nicht meistern können.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:14&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:14&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic15\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic15\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:15' style='text-decoration:underline'>43:15</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(15)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control15\"></i></button> <audio id=\"player15\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِنَّاۤ اِلٰی رَبِّنَا لَمُنۡقَلِبُوۡنَ ﴿۱۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And to our Lord surely shall we return.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And to our Lord, surely, shall we return.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور یقینا ہم اپنے ربّ کی طرف لوٹ کر جانے والے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور ہم یقیناً ایک دن اپنے رب کی طرف لوٹ کر جانے والے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et c’est auprès de notre Seigneur que nous devons assurément retourner. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“A nuestro Señor ciertamente retornaremos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und zu unserem Herrn müssen wir sicherlich zurückkehren.\"", "spanish": " Para que os asentéis firmemente en sus lomos y entonces, una vez firmemente sentados en ellos, recordéis el favor de vuestro Señor y digáis: “Santo es Quien nos sometió todo esto, ya que nosotros no podríamos arrearlos por nuestra cuenta”.", "urdu": " جب تم اچھی طرح ان پر بیٹھ جاٶ‘ تو پھر اپنے رب کی نعمت کو یاد کرو اور یہ کہو کہ پاک ہے وہ خدا جس نے ہم کو ان پر قبضہ بخشا ہے حالانکہ ہم اپنے زور سے ان کو اپنے تابع فرمان نہیں بنا سکتے تھے۔"}, {"arabic": " وَ جَعَلُوۡا لَہٗ مِنۡ عِبَادِہٖ جُزۡءًا ؕ اِنَّ الۡاِنۡسَانَ لَکَفُوۡرٌ مُّبِیۡنٌ ﴿ؕ٪۱۶﴾", "english": " And a portion of His servants they assert to be His children . Indeed man is clearly ungrateful.", "french": " Et ils prétendent que certains de Ses serviteurs sont des composants de Son Être . En vérité, l’homme est manifestement ingrat.", "german": " Und aus Seinen Dienern machen sie einen Teil Seiner Selbst. Der Mensch ist wahrlich offenkundig undankbar.", "spanish": " Sin embargo afirman que algunos de Sus siervos son parte de El . En verdad, el hombre es claramente desagradecido.", "urdu": " (مگر حال یہ ہے کہ) انہوں نے اس (خدا) کے لئے اس کے بندوں میں سے ایک حصہ (یعنی بیٹیاں) تجویز کر رکھا ہے انسان یقیناً کھلا کھلا ناشکر گذار ہے۔"}, {"arabic": " اَمِ اتَّخَذَ مِمَّا یَخۡلُقُ بَنٰتٍ وَّ اَصۡفٰکُمۡ بِالۡبَنِیۡنَ ﴿۱۷﴾", "english": " Has He taken daughters from what He has created, and honoured you with sons?", "french": " S’est-Il attribué des filles de parmi ce qu’Il a créé, et vous a-t-Il honorés avec des fils ?", "german": " Hat Er etwa Töchter genommen von dem, was Er erschafft, und euch mit Söhnen ausgezeichnet?", "spanish": " ¿Acaso Él ha tomado hijas de lo que ha creado y os ha honrado con hijos?", "urdu": " (ان سے پوچھو تو سہی کہ) کیا اس نے اپنی مخلوق میں سے اپنے لئے تو بیٹیاں بنا لیں اور تم کو بیٹوں سے فضیلت دی؟"}, {"arabic": " وَ اِذَا بُشِّرَ اَحَدُہُمۡ بِمَا ضَرَبَ لِلرَّحۡمٰنِ مَثَلًا ظَلَّ وَجۡہُہٗ مُسۡوَدًّا وَّ ہُوَ کَظِیۡمٌ ﴿۱۸﴾", "english": " Yet when tidings are given to one of them of that the like of which he ascribes to the Gracious God , his face becomes darkened and he is choked with grief.", "french": " Cependant, lorsqu’on annonce à l’un d’entre eux la nouvelle de ce qu’il attribue au Dieu Gracieux, son visage s’assombrit, et il suffoque de chagrin.", "german": " Und doch, wenn ihrer einem Kunde gegeben wird von dem, was er dem Gnadenreichen zuschreibt, so wird sein Gesicht schwarz und er erstickt vor Gram.", "spanish": " No obstante, cuando a uno de ellos se le comunica que ha recibido aquello cuya semejanza atribuye al Dios Clemente, su rostro se ensombrece y se sofoca con una angustia interior.", "urdu": " اور جب ان میں سے کسی کو اس چیز کی خبر دی جاتی ہے جس کو وہ رحمن (خدا) کی طرف منسوب کرتا ہے تو اس کا منہ کالا ہو جاتا ہے اور وہ غصہ سے بھر جاتا ہے۔"}, {"arabic": " اَوَ مَنۡ یُّنَشَّؤُا فِی الۡحِلۡیَۃِ وَ ہُوَ فِی الۡخِصَامِ غَیۡرُ مُبِیۡنٍ ﴿۱۹﴾", "english": " Do you ascribe to God one who is reared among ornaments, and who is not clear in disputation?", "french": " Quoi ? Vous attribuez à Allāh une quelconque soi-disant divinité élevée parmi les ornements, et qui ne peut s’exprimer avec clarté dans la discussion.", "german": " Etwa wer im Glanz aufgezogen wird und nicht beredt ist im Wortstreit?", "spanish": " ¿Atribuís acaso a Dios alguien criado entre ornamentos, que no es claro en la discusión?", "urdu": " کیا وہ جو زیورات میں پلتی ہے اور جھگڑے میں اپنا مافی الضمیر ٹھیک طرح ادا نہیں کر سکتی (وہ خدا کے حصہ میں آتی ہے اور غالب رہنے والا مرد انسان کے حصہ میں) ۔"}, {"arabic": " وَ جَعَلُوا الۡمَلٰٓئِکَۃَ الَّذِیۡنَ ہُمۡ عِبٰدُ الرَّحۡمٰنِ اِنَاثًا ؕ اَشَہِدُوۡا خَلۡقَہُمۡ ؕ سَتُکۡتَبُ شَہَادَتُہُمۡ وَ یُسۡـَٔلُوۡنَ ﴿۲۰﴾", "english": " And they describe the angels, who are the servants of the Gracious God , as females. Did they witness their creation? Then their testimony will be recorded, and they shall be questioned.", "french": " Et ils décrivent les anges, qui sont les serviteurs du Dieu Gracieux, comme des femelles. Ont-ils été témoins de leur création ? ! Alors leur témoignage sera inscrit, et ils seront interrogés.", "german": " Und sie machen die Engel, die des Gnadenreichen Diener sind, zu weiblichen Wesen. Waren sie etwa Zeugen ihrer Erschaffung? Ihr Zeugnis wird aufgezeichnet, und sie werden befragt werden.", "spanish": " Y describen a los ángeles, que son siervos del Dios Clemente, como hembras. ¿Fueron acaso testigos de su creación? Entonces será registrado su testimonio y serán interrogados.", "urdu": " اور انہوں نے ملائکہ کو جو رحمن (خدا) کے بندے ہیں عورتیں قرار دے دیا ہے کیا وہ ان کی پیدائش کے وقت موجود تھے؟ اگر یہ بات ہے تو ضرور ان کی شہادت لکھی جائے گی اور ان سے (قیامت کے دن) اس بارہ میں سوال کیا جائے گا۔"}, {"arabic": " وَ قَالُوۡا لَوۡ شَآءَ الرَّحۡمٰنُ مَا عَبَدۡنٰہُمۡ ؕ مَا لَہُمۡ بِذٰلِکَ مِنۡ عِلۡمٍ ٭ اِنۡ ہُمۡ اِلَّا یَخۡرُصُوۡنَ ﴿ؕ۲۱﴾", "english": " And they say, ‘If the Gracious God had so willed, we should not have worshipped them.’ They have no knowledge whatsoever of that. They do nothing but conjecture.", "french": " Et ils disent : « Si le Dieu Gracieux l’avait voulu, nous ne les aurions pas adorés. » Ils n’en savent absolument rien. Ils ne se livrent qu’à des conjectures.", "german": " Und sie sprechen: \"Hätte der Gnadenreiche es gewollt, wir würden sie nicht verehrt haben.\" Sie haben keinerlei Kenntnis hiervon; sie vermuten nur.", "spanish": " Mas dicen: “Si el Dios Clemente así lo hubiese querido, no los habríamos adorado”. No tienen conocimiento alguno de ello. No hacen más que conjeturas.", "urdu": " اور وہ کہتے ہیں اگر رحمن (خدا) چاہتا تو ہم اس کے سوا دوسرے معبودوں کی پرستش نہ کرتے۔ یہ بات وہ محض ڈھکونسلے سے کہتے ہیں اس کا انہیں حقیقی علم ہرگز حاصل نہیں۔"}, {"arabic": " اَمۡ اٰتَیۡنٰہُمۡ کِتٰبًا مِّنۡ قَبۡلِہٖ فَہُمۡ بِہٖ مُسۡتَمۡسِکُوۡنَ ﴿۲۲﴾", "english": " Have We given them a Scripture before this, so that they are holding fast to it?", "french": " Leur avons-Nous accordé, avant celle-ci, une Ecriture à laquelle ils tiendraient donc fermement ?", "german": " Haben Wir ihnen ein Buch gegeben vor diesem (Qur-ân), an dem sie festhalten?", "spanish": " ¿Les hemos dado acaso una Escritura antes de ésta, para que se aferren a ella?", "urdu": " کیا ہم نے ان کو اس (قرآن) سے پہلے کوئی ایسی کتاب دی ہے (جس میں یہ بات لکھی ہے) کہ وہ اس کے ذریعہ سے دلیل پکڑ رہے ہیں۔"}, {"arabic": " بَلۡ قَالُوۡۤا اِنَّا وَجَدۡنَاۤ اٰبَآءَنَا عَلٰۤی اُمَّۃٍ وَّ اِنَّا عَلٰۤی اٰثٰرِہِمۡ مُّہۡتَدُوۡنَ ﴿۲۳﴾", "english": " Nay, they say, ‘We found our fathers following a certain course, and we are guided by their footsteps.’", "french": " Non – mais ils disent : « Nous avons trouvé nos pères suivant une certaine voie, et nous nous guidons sur leurs pas. »", "german": " Nein, sie sprechen: \"Wir fanden unsere Väter auf einem Weg und wir lassen uns durch ihre Fußstapfen leiten.\"", "spanish": " No. Dicen: “Hallamos que nuestros antecesores seguían un cierto camino, y nos guiamos por sus pasos”.", "urdu": " ایسا نہیں‘ بلکہ حقیقت یہ ہے کہ وہ لوگ اس بات پر مصر ہیں کہ ہم نے اپنے باپ دادوں کو ایک طریقہ پر پایا تھا اور ہم انہی کے نقش قدم پر چلتے جائیں گے۔"}, {"arabic": " وَ کَذٰلِکَ مَاۤ اَرۡسَلۡنَا مِنۡ قَبۡلِکَ فِیۡ قَرۡیَۃٍ مِّنۡ نَّذِیۡرٍ اِلَّا قَالَ مُتۡرَفُوۡہَاۤ ۙ اِنَّا وَجَدۡنَاۤ اٰبَآءَنَا عَلٰۤی اُمَّۃٍ وَّ اِنَّا عَلٰۤی اٰثٰرِہِمۡ مُّقۡتَدُوۡنَ ﴿۲۴﴾", "english": " And thus has it always been that We never sent any Warner before thee to any township but the evil leaders thereof said: ‘We found our fathers following a certain course, and we are following in their footsteps.’", "french": " Et c’est ainsi que cela a toujours été , que Nous n’avons jamais envoyé avant toi un Avertisseur à une ville quelconque, sans que ses gens opulents ne disent : « Nous avons trouvé nos pères suivant une certaine voie, et nous suivons leurs pas. »", "german": " Und ebenso sandten Wir keinen Warner vor dir in irgendeine Stadt, ohne dass die Reichen darin gesprochen hätten: \"Wir fanden unsere Väter auf einem Weg, und wir treten in ihre Fußstapfen.\"", "spanish": " Y así ha ocurrido siempre que nunca hemos enviado Amonestador alguno antes de ti a ninguna ciudad sin que sus moradores rósperos dijeran: “Encontramos a nuestros antecesores siguiendo un determinado camino, y seguimos sus pasos”.", "urdu": " اور (اے رسول)! تجھ سے پہلے ہم نے کسی بستی میں بھی رسول نہیں بھیجا کہ انہی کی طرح اس کے مالداروں نے یہ نہ کہہ دیا ہو کہ ہم نے اپنے باپ دادوں کو ایک طریقہ پر پایا تھا‘ اور ہم انہی کے نقش قدم پر چلیں گے۔"}, {"arabic": " قٰلَ اَوَ لَوۡ جِئۡتُکُمۡ بِاَہۡدٰی مِمَّا وَجَدۡتُّمۡ عَلَیۡہِ اٰبَآءَکُمۡ ؕ قَالُوۡۤا اِنَّا بِمَاۤ اُرۡسِلۡتُمۡ بِہٖ کٰفِرُوۡنَ ﴿۲۵﴾", "english": " Their Warner said: ‘What! even though I bring you a better guidance than that which you found your fathers following?’ They said: ‘Certainly we disbelieve in that which you are sent with.’", "french": " Celui qui les avertissait dit : « Comment ! Même si je vous apporte une meilleure direction que celle sur laquelle vous avez trouvé vos pères ? » Ils dirent : « En vérité, nous ne croyons pas à ce avec quoi vous êtes envoyés. »", "german": " (Ihr Warner) sprach: \"Wie! auch wenn ich euch eine bessere Führung bringe als die, bei deren Befolgung ihr eure Väter fandet?\" Sie sprachen: \"Wir leugnen das, womit ihr gesandt seid.\"", "spanish": " Su Amonestador dijo: “¡Cómo! ¿Aunque os traiga una guía mejor de la que encontráis que seguían vuestros padres?”. Respondieron: “Ciertamente no creemos en aquello con lo que has sido enviado”.", "urdu": " (اس پر ہر رسول نے) جواب دیا کہ کیا اگر میں تمہارے پاس اس سے بہتر تعلیم لے آٶں جس پر تم نے اپنے باپ دادوں کو پایا تھا (تب بھی تم اس پر مصر رہو گے؟) تو انہوں نے جواب دیا کہ جس تعلیم کے ساتھ تم کو بھیجا گیا ہے‘ ہم اس کے منکر ہیں!"}, {"arabic": " فَانۡتَقَمۡنَا مِنۡہُمۡ فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ الۡمُکَذِّبِیۡنَ ﴿٪۲۶﴾", "english": " So We punished them. Behold then what was the end of those who rejected the Prophets !", "french": " Alors Nous les rétribuâmes dûment. Vois donc quelle a été la fin de ceux qui rejetèrent les Prophètes !", "german": " Also vergalten Wir ihnen. Sieh nun, wie das Ende der Leugner war!", "spanish": " Por ello les exigimos retribución. ¡Mirad, pues, cuál fue el fin de quienes rechazaron a los profetas!", "urdu": " اور ہم نے ان سے بدلہ لیا۔ پس دیکھ لے کہ جھٹلانے والوں کا انجام کیا ہوا۔"}, {"arabic": " وَ اِذۡ قَالَ اِبۡرٰہِیۡمُ لِاَبِیۡہِ وَ قَوۡمِہٖۤ اِنَّنِیۡ بَرَآءٌ مِّمَّا تَعۡبُدُوۡنَ ﴿ۙ۲۷﴾", "english": " And remember when Abraham said to his father and his people: ‘I positively disown what you worship,", "french": " Et souvenez-vous quand Abraham dit à son père et à son peuple : « En vérité, je désavoue tout ce que vous adorez,", "german": " Und (gedenke der Zeit) da Abraham zu seinem Vater und seinem Volke sprach: \"Ich sage mich los von dem, was ihr anbetet</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:27&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:27&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic28\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic28\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:28' style='text-decoration:underline'>43:28</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(28)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control28\"></i></button> <audio id=\"player28\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِلَّا الَّذِیۡ فَطَرَنِیۡ فَاِنَّہٗ سَیَہۡدِیۡنِ ﴿۲۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Except Him Who created me, and He will surely guide me.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Except Him Who created me, and He will, surely, guide me.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">مگر وہ جس نے مجھے پیدا کیا سو وہی ہے جو مجھے ضرور ہدایت دے گا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور (یاد کرو) جب ابراہیم نے اپنے باپ سے اور اپنی قوم سے کہا تھا کہ جن (ہستیوں کی تم عبادت کرتے ہو‘ میں ان سے سوائے اس (خدا) کے جس نے مجھے پیدا کیا ہے بیزار ہوں‘ اور وہ مجھے یقیناً ہدایت دے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Excepté Celui Qui m’a créé, car assurément Il me guidera. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Excepto a Aquel que me creó, pues Él ciertamente me guiará”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">statt Dessen, Der mich erschuf; denn Er wird mich richtig führen.\"", "spanish": " Acordaos de cuando Abraham dijo a su padre y a su pueblo: “Rechazo categóricamente lo que adoráis,", "urdu": " اور (یاد کرو) جب ابراہیم نے اپنے باپ سے اور اپنی قوم سے کہا تھا کہ جن (ہستیوں کی تم عبادت کرتے ہو‘ میں ان سے سوائے اس (خدا) کے جس نے مجھے پیدا کیا ہے بیزار ہوں‘ اور وہ مجھے یقیناً ہدایت دے گا۔"}, {"arabic": " وَ جَعَلَہَا کَلِمَۃًۢ بَاقِیَۃً فِیۡ عَقِبِہٖ لَعَلَّہُمۡ یَرۡجِعُوۡنَ ﴿۲۹﴾", "english": " And He made it a byword to last among his posterity, that they might turn to God .", "french": " Et Il en fit une parole durable parmi sa postérité, afin qu’ils se tournent vers Allāh Lui -Même .", "german": " Und er machte es zu einem bleibenden Wort unter seiner Nachkommenschaft, auf dass sie sich bekehren möchten.", "spanish": " Y lo convirtió en palabra que perduró entre su posteridad, para que volvieran a Dios.", "urdu": " اور ابراہیم نے اس تعلیم کو اپنی نسل میں ایک مستقل یادگار چھوڑا تا کہ وہ (شرک سے) باز آجائیں۔"}, {"arabic": " بَلۡ مَتَّعۡتُ ہٰۤؤُلَآءِ وَ اٰبَآءَہُمۡ حَتّٰی جَآءَہُمُ الۡحَقُّ وَ رَسُوۡلٌ مُّبِیۡنٌ ﴿۳۰﴾", "english": " Nay, but I allowed them and their fathers temporary enjoyment until there came to them the truth and a Messenger who makes his Message clear.", "french": " Non , mais J’ai accordé à ceux-ci et à leurs ancêtres la jouissance temporaire, jusqu’à ce que vinssent à eux la vérité et un Messager qui explique son Message clairement.", "german": " Nein, aber Ich ließ sie und ihre Väter in Fülle leben, bis die Wahrheit zu ihnen kam und ein beredter Gesandter.", "spanish": " No, pero les permití, a ellos y a sus padres, un gozo temporal hasta que les llegó la verdad y un Mensajero que expone bien claro su Mensaje.", "urdu": " حقیقت یہ ہے کہ میں نے ان لوگوں کو اور ان کے باپ دادوں کو دنیوی فائدہ پہنچایا یہاں تک کہ ان کے پاس حق بھی اور کھول کر بیان کرنے والا رسول بھی آگیا۔"}, {"arabic": " وَ لَمَّا جَآءَہُمُ الۡحَقُّ قَالُوۡا ہٰذَا سِحۡرٌ وَّ اِنَّا بِہٖ کٰفِرُوۡنَ ﴿۳۱﴾", "english": " But when the truth came to them they said, ‘This is magic, and we do reject it.’", "french": " Mais lorsque la vérité leur vint, ils dirent : « Ceci est de la magie, et nous la rejetons. »", "german": " Doch als die Wahrheit zu ihnen kam, da sprachen sie: \"Das ist Zauberei, und wir verwerfen sie.\"", "spanish": " Mas cuando les llegó la verdad, dijeron: “Esto es magia y ciertamente la rechazamos”.", "urdu": " اور جب ان کے پاس حق آگیا تو انہوں نے کہا یہ تو محض دلفریب باتیں ہیں اور ہم اس کے منکر ہیں۔"}, {"arabic": " وَ قَالُوۡا لَوۡ لَا نُزِّلَ ہٰذَا الۡقُرۡاٰنُ عَلٰی رَجُلٍ مِّنَ الۡقَرۡیَتَیۡنِ عَظِیۡمٍ ﴿۳۲﴾", "english": " And they say, ‘Why has not this Qur’an been sent to some great man of the two towns?’", "french": " Et ils disent : « Pourquoi ce Coran n’a-t-il pas été révélé à un grand homme des deux villes ? »", "german": " Und sie sprechen: \"Warum ist dieser Qur-ân nicht einem angesehenen Mann aus den beiden Städten herabgesandt worden?\"", "spanish": " Dicen: “¿Por qué este Corán no ha sido enviado a algún hombre grande de las dos ciudades?”.", "urdu": " اور یہ بھی اعتراض کیا کہ یہ قرآن دونوں بڑے بڑے شہروں میں سے کسی بڑے آدمی پر کیوں نازل نہیں ہوا؟"}, {"arabic": " اَہُمۡ یَقۡسِمُوۡنَ رَحۡمَتَ رَبِّکَ ؕ نَحۡنُ قَسَمۡنَا بَیۡنَہُمۡ مَّعِیۡشَتَہُمۡ فِی الۡحَیٰوۃِ الدُّنۡیَا وَ رَفَعۡنَا بَعۡضَہُمۡ فَوۡقَ بَعۡضٍ دَرَجٰتٍ لِّیَتَّخِذَ بَعۡضُہُمۡ بَعۡضًا سُخۡرِیًّا ؕ وَ رَحۡمَتُ رَبِّکَ خَیۡرٌ مِّمَّا یَجۡمَعُوۡنَ ﴿۳۳﴾", "english": " Is it they who would distribute the mercy of thy Lord? It is We Who distribute among them their livelihood in the present life, and We exalt some of them above others in degrees of rank , so that some of them may make others subservient to themselves . And the mercy of thy Lord is better than that which they amass.", "french": " Est-ce eux qui distribuent la miséricorde de ton Seigneur ? C’est Nous Qui distribuons parmi eux leur subsistance dans la vie de ce monde, et Nous en élevons certains au-dessus d’autres par degrés de rang afin que les uns asservissent les autres. Et la miséricorde de ton Seigneur vaut mieux que ce qu’ils amassent.", "german": " Sind sie es, die die Barmherzigkeit deines Herrn zu verteilen haben? Wir Selbst verteilen unter ihnen ihren Unterhalt im irdischen Leben, und Wir erhöhen einige von ihnen über die anderen in den Rängen, auf dass die einen die anderen in Pflicht nehmen mögen. Und die Barmherzigkeit deines Herrn ist besser als das, was sie aufhäufen.", "spanish": " ¿Son acaso ellos quienes distribuyen las mercedes de tu Señor? Somos Nosotros quienes distribuimos entre ellos su sustento en la existencia presente y exaltamos a algunos de ellos sobre otros en grados de importancia, aunque ¡ay! sólo para que algunos subyuguen a los demás. Mas la misericordia de tu Señor es mejor que cuanto atesoran.", "urdu": " کیا وہ تیرے رب کی رحمت کو تقسیم کرتے ہیں؟ (یہ کس طرح ہو سکتا ہے؟) ہم نے ان کے درمیان دنیوی زندگی سے تعلق رکھنے والے ان کی معیشت کے سامان تقسیم کیے ہیں اور ان میں سے بعض کو بعض پر فوقیت دی ہے جس کے نتیجہ میں ان میں سے بعض (بڑے) بعض (چھوٹوں) کو حقیر سمجھنے لگتے ہیں اور تیرے رب کی رحمت اس سب مال و متاع سے جو وہ جمع کرتے ہیں اچھی ہے۔"}, {"arabic": " وَ لَوۡ لَاۤ اَنۡ یَّکُوۡنَ النَّاسُ اُمَّۃً وَّاحِدَۃً لَّجَعَلۡنَا لِمَنۡ یَّکۡفُرُ بِالرَّحۡمٰنِ لِبُیُوۡتِہِمۡ سُقُفًا مِّنۡ فِضَّۃٍ وَّ مَعَارِجَ عَلَیۡہَا یَظۡہَرُوۡنَ ﴿ۙ۳۴﴾", "english": " And were it not that mankind would have all become one type of people, We would have given to those who disbelieve in the Gracious God , roofs of silver for their houses, and silver stairways by which they could go up;", "french": " Et n’était-ce le fait que toute l’humanité serait devenue un seul type de personnes, Nous aurions donné à ceux qui refusent de croire en le Dieu Gracieux, des toits en argent pour leurs maisons, et des escaliers en argent par lesquels ils auraient pu monter ;", "german": " Und wenn nicht wäre, dass alle Menschen zu einer einzigen Gemeinde geworden wären, hätten Wir denen, die nicht an den Gnadenreichen glauben, Dächer von Silber für ihre Häuser gegeben und Treppen, um hinaufzusteigen,", "spanish": " De no ser porque la humanidad se habría convertido en un solo tipo de personas, habríamos concedido a quienes no creen en el Dios Clemente, techos de plata para sus casas y escaleras de plata por las que pudieran ascender;", "urdu": " اور اگر یہ خوف نہ ہوتا کہ سب کے سب ایک ہی طریقہ کے ہو جائیں گے‘ تو ہم رحمن (خدا) کا کفر کرنے والے لوگوں کی چھتوں اور سیڑھیوں کو جن پر وہ چڑھتے چاندی کا بنا دیتے۔"}, {"arabic": " وَ لِبُیُوۡتِہِمۡ اَبۡوَابًا وَّ سُرُرًا عَلَیۡہَا یَتَّکِـُٔوۡنَ ﴿ۙ۳۵﴾", "english": " And doors of silver to their houses, and couches of silver , on which they could recline,", "french": " Et des portes en argent à leurs maisons, et des canapés en argent sur lesquels ils s’accouderaient sur des coussins,", "german": " und Türen zu ihren Häusern und Ruhebetten, darauf zu liegen,", "spanish": " Puertas de plata para sus casas y lechos de plata en los que se reclinasen,", "urdu": " اور اُن کے گھروں کے دروازوں کو بھی (چاندی کا بنا دیتے) اور (اسی طرح) وہ چھپرکھٹ جن پر وہ تکیے لگاتے ہیں (ان کو بھی چاندی کا بنا دیتے) ۔"}, {"arabic": " وَ زُخۡرُفًا ؕ وَ اِنۡ کُلُّ ذٰلِکَ لَمَّا مَتَاعُ الۡحَیٰوۃِ الدُّنۡیَا ؕ وَ الۡاٰخِرَۃُ عِنۡدَ رَبِّکَ لِلۡمُتَّقِیۡنَ ﴿٪۳۶﴾", "english": " And other articles of embellishment. But all that is nothing but a temporary provision of the present life. And the Hereafter with thy Lord is for the righteous.", "french": " Et même en or. Mais tout cela n’est rien d’autre qu’une provision temporaire de la vie de ce monde. Et l’au-delà auprès de ton Seigneur est pour les pieux.", "german": " sogar aus Gold. Doch all das ist nichts als eine Versorgung für dieses Leben. Und das Jenseits bei deinem Herrn ist für die Rechtschaffenen.", "spanish": " Y otros objetos de ornamentación. Pero eso no es nada mas ue una provisión temporal de la vida presente. Y el bienestar del Más Allá con tu Señor es para los justos.", "urdu": " بلکہ سونے کا بنا دیتے‘ لیکن یہ سب کچھ ورلی زندگی کا سامان ہے اور آخرت (کا آرام) تیرے رب کے فیصلہ کے مطابق متقیوں کے لئے مخصوص ہے۔"}, {"arabic": " وَ مَنۡ یَّعۡشُ عَنۡ ذِکۡرِ الرَّحۡمٰنِ نُقَیِّضۡ لَہٗ شَیۡطٰنًا فَہُوَ لَہٗ قَرِیۡنٌ ﴿۳۷﴾", "english": " And he who turns away from the remembrance of the Gracious God , We appoint for him a satan, who becomes his companion.", "french": " Et celui qui se détourne du souvenir du Dieu Gracieux, Nous lui désignons un satan, qui devient son compagnon.", "german": " Wer sich vom Gedenken des Gnadenreichen abwendet, für den bestimmen Wir einen Teufel, der sein Gefährte werden soll.", "spanish": " A quien se aparta del recuerdo del Dios Clemente, le asignamos un demonio, que se convierte en su compañero.", "urdu": " اور جو کوئی رحمن (خدا) کے ذکر سے منہ موڑ لیتا ہے ہم اس پر ایک شیطانی خصلت وجود کو مستولی کر دیتے ہیں اور وہ اس کا ہر وقت کا ساتھی ہو جاتا ہے۔"}, {"arabic": " وَ اِنَّہُمۡ لَیَصُدُّوۡنَہُمۡ عَنِ السَّبِیۡلِ وَ یَحۡسَبُوۡنَ اَنَّہُمۡ مُّہۡتَدُوۡنَ ﴿۳۸﴾", "english": " And surely they hinder them from the way of God , but they think that they are rightly guided;", "french": " Et assurément ils les empêchent de suivre la voie d’Allāh , mais ils croient être bien guidés ;", "german": " Und fürwahr, sie machen sie abwendig von dem Weg, jedoch sie denken, sie seien rechtgeleitet,", "spanish": " En verdad, les apartan del camino de Dios, pero piensan que están rectamente guiados;", "urdu": " اور وہ (شیاطین) ان کو کامل (اور سچے) راستہ سے روکتے رہتے ہیں۔ مگر باوجود اس کے وہ گمان کرتے ہیں کہ وہ سچے راستہ پر چل رہے ہیں۔"}, {"arabic": " حَتّٰۤی اِذَا جَآءَنَا قَالَ یٰلَیۡتَ بَیۡنِیۡ وَ بَیۡنَکَ بُعۡدَ الۡمَشۡرِقَیۡنِ فَبِئۡسَ الۡقَرِیۡنُ ﴿۳۹﴾", "english": " Till, when such a one comes to Us, he says to his companion , ‘Would that between me and thee were the distance of the East and the West!’ What an evil companion is he!", "french": " Jusqu’à ce que, quand un tel vient à Nous, il dit à son compagnon : « Hélas ! Que je voudrais qu’entre moi et toi il y ait la distance des antipodes ! » Quel mauvais compagnon il est !", "german": " bis zuletzt, wenn ein solcher zu Uns kommt, er zu (seinem Gefährten) spricht: \"O wäre doch zwischen mir und dir die Entfernung des Ostens und des Westens!\" Was für ein schlimmer Gefährte ist er doch!", "spanish": " Hasta que, al llegar uno de ellos a Nosotros, dice a su compañero: “¡Ojalá que tú y yo estuviéramos distanciados en las antípodas!”. ¡Qué mal compañero es!", "urdu": " مگر (یہ اسی وقت تک ہوتا ہے جب تک ایسا انسان زندہ رہتا ہے) جب وہ ہمارے پاس آجاتا ہے تو (ساری غلط فہمیاں دور ہوجاتی ہیں اور وہ)کہنے لگتا ہے اے کاش! مجھ میں اور (اے شیطان) تجھ میں مشرق و مغرب کا بعد ہوتا۔ پس (خود انسان کی شہادت سے ثابت ہو گیا کہ) وہ (شیطان) بہت برا ساتھی ہے۔"}, {"arabic": " وَ لَنۡ یَّنۡفَعَکُمُ الۡیَوۡمَ اِذۡ ظَّلَمۡتُمۡ اَنَّکُمۡ فِی الۡعَذَابِ مُشۡتَرِکُوۡنَ ﴿۴۰﴾", "english": " ‘And the fact that you are partners in punishment will not profit you this day for you have acted wrongfully.’", "french": " « Puisque vous avez agi injustement, le fait que vous soyez associés dans le châtiment aujourd’hui ne vous profitera point pour atténuer votre souffrance . »", "german": " Dass ihr Gefährten seid in der Strafe, soll euch an diesem Tag nichts nützen, denn ihr habt gefrevelt.", "spanish": " “Habiendo transgredido como lo habéis hecho, vuestra unión en el castigo no os servirá de nada en este día ”.", "urdu": " اور (ہم اس دن انسانوں سے کہیں گے کہ) جب تم ظلم کر چکے ہو تو یہ بات کہ تم اور تمہارے بہکانے والے عذاب میں شریک ہو تم کو کوئی نفع نہیں پہنچا سکتی۔"}, {"arabic": " اَفَاَنۡتَ تُسۡمِعُ الصُّمَّ اَوۡ تَہۡدِی الۡعُمۡیَ وَ مَنۡ کَانَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۴۱﴾", "english": " Canst thou, then, make the deaf hear, or guide the blind and him who is in manifest error?", "french": " Es-tu donc capable de faire entendre le sourd, ou de diriger l’aveugle, ou encore celui qui est dans une erreur manifeste ?", "german": " Kannst du etwa die Tauben hörend machen oder die Blinden leiten oder den, der in offenkundigem Irrtum ist?", "spanish": " ¿Puedes, pues, hacer que el sordo oiga o guiar al ciego y a quien está en error evidente?", "urdu": " کیا تو بہرے کو سنا سکتا ہے اور اندھے کو راستہ دکھا سکتا ہے اور اسی طرح جو کھلی گمراہی میں مبتلا ہو (اس کو راستہ دکھا سکتا ہے) ۔"}, {"arabic": " فَاِمَّا نَذۡہَبَنَّ بِکَ فَاِنَّا مِنۡہُمۡ مُّنۡتَقِمُوۡنَ ﴿ۙ۴۲﴾", "english": " And if We take thee away, We shall surely exact retribution from them,", "french": " Et si Nous t’enlevons, alors Nous tirerons assurément vengeance d’eux,", "german": " Und sollten Wir dich hinwegnehmen, Wir werden sicherlich an ihnen Vergeltung üben.", "spanish": " Mas si te lleváramos, les exigiremos ciertamente su retribución,", "urdu": " پس اگر ہم تجھ کو اس دنیا سے لے بھی جائیں (یعنی وفات دے دیں) تو بھی ہم ان سے بدلہ ضرور لیں گے۔"}, {"arabic": " اَوۡ نُرِیَنَّکَ الَّذِیۡ وَعَدۡنٰہُمۡ فَاِنَّا عَلَیۡہِمۡ مُّقۡتَدِرُوۡنَ ﴿۴۳﴾", "english": " Or We shall show thee that which We have promised them; for surely We have complete power over them.", "french": " Ou Nous te ferons voir ce que Nous leur avons promis ; car assurément, Nous avons le pouvoir absolu sur eux.", "german": " Oder Wir werden dir zeigen, was Wir ihnen angedroht haben; denn Wir haben völlige Macht über sie.", "spanish": " O te mostraremos lo que les hemos prometido; pues en verdad tenemos poder completo sobre ellos.", "urdu": " یا ہم تجھے وہ چیز دکھا دیں گے جس کا ہم نے ان سے وعدہ کیا ہے (یاد رکھیں) ہم ان پر پوری طرح تصرف رکھتے ہیں۔"}, {"arabic": " فَاسۡتَمۡسِکۡ بِالَّذِیۡۤ اُوۡحِیَ اِلَیۡکَ ۚ اِنَّکَ عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۴۴﴾", "english": " So hold thou fast to that which has been revealed to thee; for thou art on the right path.", "french": " Tiens donc fermement à ce qui t’a été révélé ; car tu es sur un chemin droit.", "german": " Drum halte fest an dem, was dir offenbart worden, denn du bist auf dem geraden Weg.", "spanish": " Persevera, pues, en lo que te ha sido revelado; pues estás en el camino recto.", "urdu": " اور تو اس کلام کو جو تیری طرف وحی کیا گیا ہے مضبوطی سے پکڑ لے کیونکہ تو سیدھے راستہ پر ہے۔"}, {"arabic": " وَ اِنَّہٗ لَذِکۡرٌ لَّکَ وَ لِقَوۡمِکَ ۚ وَ سَوۡفَ تُسۡـَٔلُوۡنَ ﴿۴۵﴾", "english": " And, truly, it is a source of eminence for thee and for thy people; and you will be inquired about.", "french": " Et, en vérité, c’est un Rappel pour toi et pour ton peuple ; et vous serez appelés à rendre compte.", "german": " Und es ist wahrlich eine Ehre für dich und für dein Volk, und ihr werdet bald gefragt werden.", "spanish": " Pues, en verdad, es un recordatorio para ti y para tu pueblo; y seréis llamados a dar cuenta.", "urdu": " اور یہ (کلام) تیرے لئے بھی شرف اور عزت کا موجب ہے اور تیری قوم کے لئے بھی‘ اور تم سے ضرور تمہارے اعمال کے متعلق سوال کیا جائے گا۔"}, {"arabic": " وَ سۡـَٔلۡ مَنۡ اَرۡسَلۡنَا مِنۡ قَبۡلِکَ مِنۡ رُّسُلِنَاۤ اَجَعَلۡنَا مِنۡ دُوۡنِ الرَّحۡمٰنِ اٰلِـہَۃً یُّعۡبَدُوۡنَ ﴿٪۴۶﴾", "english": " And ask those of Our Messengers whom We sent before thee, ‘Did We appoint any deities beside the Gracious God , to be worshipped?’", "french": " Et demande à ceux de Nos Messagers que Nous avons envoyés avant toi : « Avions-Nous désigné d’autres déités en dehors du Dieu Gracieux, pour être adorées ? »", "german": " Und frage jene Unserer Gesandten, die Wir vor dir entsandt haben: \"Bestimmten Wir etwa Götter, außer dem Gnadenreichen, die verehrt wurden?\"", "spanish": " Pregunta a aquellos de Nuestros Mensajeros a quienes enviamos antes que a ti: “¿Nombramos acaso a deidad alguna aparte del Dios Clemente para ser adorada?”.", "urdu": " اور جن رسولوں کو ہم نے تجھ سے پہلے بھیجا‘ ان سے پوچھ کیا ہم نے رحمن (خدا) کے سوا اور معبودوں کا بھی (اپنی کتابوں میں) ذکر کیا تھا؟ جن کی عبادت کی جاتی تھی۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا مُوۡسٰی بِاٰیٰتِنَاۤ اِلٰی فِرۡعَوۡنَ وَ مَلَا۠ئِہٖ فَقَالَ اِنِّیۡ رَسُوۡلُ رَبِّ الۡعٰلَمِیۡنَ ﴿۴۷﴾", "english": " And We did send Moses with Our Signs to Pharaoh and his chiefs, and he said, ‘I am truly a Messenger of the Lord of the worlds.’", "french": " Et Nous avons certainement envoyé Moïse avec Nos Signes à Pharaon et ses chefs, et il dit : « Je suis en vérité le Messager du Seigneur des mondes. »", "german": " Wir sandten Moses mit Unseren Zeichen zu Pharao und seinen Häuptern; da sprach er: \"Ich bin ein Gesandter vom Herrn der Welten.\"", "spanish": " Y enviamos a Moisés con Nuestros Signos al Faraón y a sus jefes, y dijo: “En verdad soy Mensajero del Señor de los mundos”.", "urdu": " اور ہم نے موسیٰ کو اپنے نشان دے کر فرعون اور اس کے درباریوں کی طرف بھیجا تھا اور اس نے (ان کے پاس جاکر) کہا تھا کہ میں سب جہانوں کے رب کی طرف سے رسول ہو کر آیا ہوں۔"}, {"arabic": " فَلَمَّا جَآءَہُمۡ بِاٰیٰتِنَاۤ اِذَا ہُمۡ مِّنۡہَا یَضۡحَکُوۡنَ ﴿۴۸﴾", "english": " But when he came to them with Our Signs, lo! they laughed at them.", "french": " Mais lorsqu’il vint à eux avec Nos Signes, voilà qu’ils s’en moquèrent !", "german": " Doch als er zu ihnen kam mit Unseren Zeichen, siehe, da lachten sie über sie.", "spanish": " Pero cuando llegó a ellos con Nuestros Signos, ¡he aquí que se rieron de ellos!", "urdu": " پھر جب وہ ان کے پاس ہمارے نشان لے کر آیا تو وہ سنتے ہی اس پر ہنسی کرنے لگ گئے۔"}, {"arabic": " وَ مَا نُرِیۡہِمۡ مِّنۡ اٰیَۃٍ اِلَّا ہِیَ اَکۡبَرُ مِنۡ اُخۡتِہَا ۫ وَ اَخَذۡنٰہُمۡ بِالۡعَذَابِ لَعَلَّہُمۡ یَرۡجِعُوۡنَ ﴿۴۹﴾", "english": " And We showed them no Sign but it was greater than its preceding sister, and We seized them with punishment, that they might turn to Us .", "french": " Et Nous ne leur fîmes voir aucun Signe qui ne fût plus grand que son précédent, et Nous les saisîmes par le châtiment afin qu’ils se tournent vers Nous.", "german": " Und Wir zeigten ihnen nicht ein Zeichen, das nicht größer gewesen wäre als sein Vorgänger, und Wir erfassten sie mit Strafe, auf dass sie sich bekehren möchten.", "spanish": " No les mostramos ningún Signo que no fuese mayor que el que lo precedió, y les enviamos el castigo, para que volvieran a Nosotros.", "urdu": " اور ہم ان کو جو نشان بھی دکھاتے تھے وہ اپنے سے پہلے نشان سے بڑا ہوتا تھا اور ہم نے ان کو عذاب میں مبتلا کر دیا تھا تا کہ وہ (اپنی بداعمالیوں سے) لوٹ جائیں۔"}, {"arabic": " وَ قَالُوۡا یٰۤاَیُّہَ السّٰحِرُ ادۡعُ لَنَا رَبَّکَ بِمَا عَہِدَ عِنۡدَکَ ۚ اِنَّنَا لَمُہۡتَدُوۡنَ ﴿۵۰﴾", "english": " And they said, ‘O thou magician, pray for us to thy Lord, according to the covenant He has made with thee: for, then we will surely accept guidance.’", "french": " Et ils dirent : « Ô toi magicien, prie ton Seigneur pour nous, suivant le pacte qu’Il a fait avec toi ; car alors nous accepterons sûrement la direction. »", "german": " Aber sie sprachen: \"O du Zauberer, bete für uns zu deinem Herrn, gemäß dem, was Er dir verheißen, denn wir werden dann rechtgeleitet sein.\"", "spanish": " Mas respondieron: “¡Mago! Ruega por nosotros, a tu Señor, según el pacto que ha establecido contigo; entonces ciertamente aceptaremos la guía”.", "urdu": " باوجود اس کے وہ یہی کہتے جاتے تھے کہ اے جادوگر! اپنے رب کے سامنے ہمارے حق میں ان تمام وعدوں کا واسطہ دے کر دعا کر جو (وعدے) اس نے تجھ سے کیے ہیں (اگر عذاب ٹل گیا) تو ہم ضرور ہدایت پا جائیں گے۔"}, {"arabic": " فَلَمَّا کَشَفۡنَا عَنۡہُمُ الۡعَذَابَ اِذَا ہُمۡ یَنۡکُثُوۡنَ ﴿۵۱﴾", "english": " But when We removed the punishment from them, behold! they broke their word.", "french": " Mais lorsque Nous leur enlevâmes le châtiment, voilà qu’ils rompirent leur engagement !", "german": " Doch als Wir die Strafe von ihnen nahmen, siehe, da brachen sie das Wort.", "spanish": " Pero cuando les retiramos el castigo ¡he aquí que rompieron su palabra!", "urdu": " پھر جب ہم نے ان سے عذاب ٹلا دیا تو وہ فوراً عہد شکنی کرنے لگ گئے۔"}, {"arabic": " وَ نَادٰی فِرۡعَوۡنُ فِیۡ قَوۡمِہٖ قَالَ یٰقَوۡمِ اَلَیۡسَ لِیۡ مُلۡکُ مِصۡرَ وَ ہٰذِہِ الۡاَنۡہٰرُ تَجۡرِیۡ مِنۡ تَحۡتِیۡ ۚ اَفَلَا تُبۡصِرُوۡنَ ﴿ؕ۵۲﴾", "english": " And Pharaoh proclaimed among his people, saying , ‘O my people! does not the kingdom of Egypt belong to me and these streams flowing under me? Do you not then see?", "french": " Et Pharaon fit proclamer parmi son peuple, il dit : « Ô mon peuple, le royaume d’Egypte ne m’appartient-il pas, ainsi que ces rivières coulant sous mon contrôle ? Ne voyez-vous donc pas ?", "german": " Und Pharao verkündete unter seinem Volk: \"O mein Volk, sind nicht mein das Königreich von Ägypten und diese Ströme, die unter mir fließen? Könnt ihr denn nicht sehen?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:52&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:52&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic53\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic53\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:53' style='text-decoration:underline'>43:53</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(53)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control53\"></i></button> <audio id=\"player53\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَمۡ اَنَا خَیۡرٌ مِّنۡ ہٰذَا الَّذِیۡ ہُوَ مَہِیۡنٌ ۬ۙ وَّ لَا یَکَادُ یُبِیۡنُ ﴿۵۳﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Nay, I am better than this <em>fellow</em> who is despicable and can scarcely express <em>himself </em>clearly.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Nay, I am better than this despicable fellow who can scarcely express <i>himself </i>clearly. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">حقیقت یہ ہے کہ میں اس شخص سے بہتر ہوں جو بالکل بے حیثیت ہے اور اظہارِبیان کی بھی طاقت نہیں رکھتا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا میں اس شخص سے جو ذلیل ہے اور کھول کر بات بھی نہیں کر سکتا اچھا ہوں (یا وہ اچھا ہے؟) </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Non</em> mais, en vérité je suis meilleur que cet <em>individu</em> qui est digne de mépris, et n’est guère capable de s’exprimer distinctement.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“No. Soy mejor que este <em>ser</em> despreciable que apenas puede expresarse con claridad”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Bin ich nicht besser als dieser da, der verächtlich ist und sich kaum verständlich ausdrücken kann?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:53&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:53&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic54\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic54\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:54' style='text-decoration:underline'>43:54</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(54)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control54\"></i></button> <audio id=\"player54\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَلَوۡ لَاۤ اُلۡقِیَ عَلَیۡہِ اَسۡوِرَۃٌ مِّنۡ ذَہَبٍ اَوۡ جَآءَ مَعَہُ الۡمَلٰٓئِکَۃُ مُقۡتَرِنِیۡنَ ﴿۵۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And why have not bracelets of gold been bestowed on him, or angels accompanied him in serried ranks?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And why have not bracelets of gold been bestowed on him, or <sup class='ref'>[<a class='ref' data-id='ref_43_54_c' href='#'>c</a>]</sup>angels accompanied him in serried ranks?’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_43_54_c'>c</span></div> <div><div class='reference' data-id='ref_43_54_c' style='display:none'> <p><b>c.</b> <a href='/quran/6:9' target=_blank>6:9</a>; <a href='/quran/11:13' target=_blank>11:13</a>; <a href='/quran/25:8' target=_blank>25:8</a>. (<a href='javascript:void(0)' data-id='ref_43_54_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس کیوں نہ اس پر سونے کے کنگن اُتارے گئے یا فرشتے اس کے ساتھ گروہ در گروہ آئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(سو اگر وہ اچھا ہے) تو اس پر سونے کے کڑے کیوں نہیں نازل ہوئے۔ یا اس کے ساتھ فرشتے کیوں نہیں آئے جو اس کے ارد گرد (اس کی حفاظت کے لئے) جمع ہوں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et pourquoi donc des bracelets d’or ne lui ont-ils pas été accordés, ou des anges ne l’ont-ils pas accompagné en rangs serrés ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Por qué no se le han concedido pulseras de oro, o ángeles que lo acompañen en filas apretadas?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Warum sind ihm dann nicht Armbänder von Gold angelegt worden oder Engel mit ihm im Geleite gekommen?\"", "spanish": " El Faraón publicó una proclama entre su pueblo, diciendo : “¡Pueblo mío! ¿Acaso no me pertenecen el reino de Egipto y estos ríos que corren a mis pies? ¿Es que no lo veis?", "urdu": " اور فرعون نے اپنی قوم میں یہ اعلان کیا۔ کہ اے میری قوم! کیا مصر کی حکومت میرے قبضہ میں نہیں؟ اور یہ دریا (دیکھو) میرے تصرف کے ماتحت چل رہے ہیں۔ کیا تم دیکھتے نہیں؟"}, {"arabic": " فَاسۡتَخَفَّ قَوۡمَہٗ فَاَطَاعُوۡہُ ؕ اِنَّہُمۡ کَانُوۡا قَوۡمًا فٰسِقِیۡنَ ﴿۵۵﴾", "english": " Thus did he make light of his people, and they obeyed him. Indeed they were a wicked people.", "french": " C’est ainsi qu’il fit peu de cas de son peuple, et ils lui obéirent. En vérité c’était un peuple pervers.", "german": " So verleitete er sein Volk zur Narrheit, und sie gehorchten ihm. Sie waren ein unbotmäßiges Volk.", "spanish": " Así encendió a su pueblo y ellos le obedecieron. Ciertamente eran un pueblo malvado.", "urdu": " سو اس طرح اس نے اپنی قوم کو بہکا دیا اور انہوں نے اس کی بات مان لی۔ وہ لوگ عہد خداوندی توڑنے والے تھے۔"}, {"arabic": " فَلَمَّاۤ اٰسَفُوۡنَا انۡتَقَمۡنَا مِنۡہُمۡ فَاَغۡرَقۡنٰہُمۡ اَجۡمَعِیۡنَ ﴿ۙ۵۶﴾", "english": " So, when they excited Our anger, We exacted retribution from them, and drowned them all.", "french": " Alors, lorsqu’ils Nous courroucèrent, Nous tirâmes vengeance d’eux, et Nous les noyâmes tous.", "german": " Drum nahmen Wir Vergeltung an ihnen, als sie Uns erzürnten, und ertränkten sie allesamt.", "spanish": " De ese modo, cuando despertaron Nuestra cólera, les impusimos su justa retribución y les ahogamos a todos.", "urdu": " پھر جب انہوں نے ہم کو غصہ دلایا تو ہم نے ان سے بدلہ لیا اور ان سب کو غرق کر دیا۔"}, {"arabic": " فَجَعَلۡنٰہُمۡ سَلَفًا وَّ مَثَلًا لِّلۡاٰخِرِیۡنَ ﴿٪۵۷﴾", "english": " And We made them a precedent, and an example for the coming generations.", "french": " Et Nous fîmes d’eux un précédent, et un exemple pour les générations à venir.", "german": " Und Wir machten sie zum Vergangenen und zu einem Exempel für die Kommenden.", "spanish": " Y los convertimos en precedente y ejemplo para las generaciones futuras.", "urdu": " اور ہم نے ان کو (ایک گذرا ہوا) افسانہ بنا دیا۔ نیز بعد میں آنے والوں کے لئے ایک عبرت کا ذریعہ (بھی) بنا دیا۔"}, {"arabic": " وَ لَمَّا ضُرِبَ ابۡنُ مَرۡیَمَ مَثَلًا اِذَا قَوۡمُکَ مِنۡہُ یَصِدُّوۡنَ ﴿۵۸﴾", "english": " And when the son of Mary is mentioned as an instance, lo! thy people raise a clamour thereat;", "french": " Et lorsque le fils de Marie est cité en exemple, voilà que ton peuple pousse des clameurs à ce sujet ;", "german": " Wenn immer die Rede von dem Sohn der Maria ist, siehe, dann bricht dein Volk darüber in Geschrei aus;", "spanish": " Cuando el hijo de María es mencionado como parábola, he ahí que tu pueblo levanta un clamor por ello;", "urdu": " اور جب بھی ابن مریم کو مثال کے طور پر پیش کیا جاتا ہے تو تیری قوم اس (بات) پر شور مچانے لگتی ہے۔"}, {"arabic": " وَ قَالُوۡۤاءَ اٰلِہَتُنَا خَیۡرٌ اَمۡ ہُوَ ؕ مَا ضَرَبُوۡہُ لَکَ اِلَّا جَدَلًا ؕ بَلۡ ہُمۡ قَوۡمٌ خَصِمُوۡنَ ﴿۵۹﴾", "english": " And they say, ‘Are our gods better, or he?’ They mention not this to thee but for the sake of disputation. Nay, but they are a contentious people.", "french": " Et ils disent : « Nos dieux sont-ils meilleurs ou lui ? » Ils ne te mentionnent ceci que pour le plaisir de discuter. Non mais, c’est un peuple querelleur.", "german": " und sie sagen: \"Sind unsere Götter besser oder er?\" Sie erwähnen das vor dir nur aus Widerspruchsgeist. Nein, aber sie sind ein streitsüchtiges Volk.", "spanish": " Dicen: “¿Quiénes son mejores, nuestros dioses o él?”. No te mencionan este tema salvo para discutir. No, no son más que un pueblo pendenciero”.", "urdu": " اور یہ بھی کہنے لگ جاتی ہے کہ کیا ہمارے معبود اچھے ہیں یا وہ (یعنی عیسیٰ) اچھا ہے۔ وہ یہ بات تیرے سامنے صرف جھگڑے کی غرض سے کرتے ہیں حقیقت یہ ہے کہ اس قوم میں حق کے خلاف بحثیں کرنے کی عادت ہے۔"}, {"arabic": " اِنۡ ہُوَ اِلَّا عَبۡدٌ اَنۡعَمۡنَا عَلَیۡہِ وَ جَعَلۡنٰہُ مَثَلًا لِّبَنِیۡۤ اِسۡرَآءِیۡلَ ﴿ؕ۶۰﴾", "english": " He was only Our servant on whom We bestowed Our favour, and We made him an example for the children of Israel.", "french": " Il n’était rien d’autre qu’un serviteur à qui Nous avions accordé Notre faveur, et Nous avions fait de lui un exemple pour les Enfants d’Israël.", "german": " Er war nur ein Diener, dem Wir Gnade erwiesen, und Wir machten ihn zu einem Beispiel für die Kinder Israels.", "spanish": " Él no fue más que Nuestro siervo a quien otorgamos Nuestro favor, y le convertimos en ejemplo para los hijos de Israel.", "urdu": " وہ (یعنی عیسیٰ) تو صرف ایک بندہ تھا جس پر ہم نے انعام کیا تھا اور اس کو بنی اسرائیل کے لئے بطور عبرت کے بنایا تھا۔"}, {"arabic": " وَ لَوۡ نَشَآءُ لَجَعَلۡنَا مِنۡکُمۡ مَّلٰٓئِکَۃً فِی الۡاَرۡضِ یَخۡلُفُوۡنَ ﴿۶۱﴾", "english": " And if We so willed, We could make from among you angels in the earth to be successors therein .", "french": " Et si Nous le voulions, Nous pourrions faire de parmi vous des anges sur la terre, pour y être des successeurs.", "german": " Und wenn Wir es wollten, Wir könnten aus euren Reihen Engel hervorgehen lassen, (euch) zu ersetzen auf Erden.", "spanish": " Mas si lo hubiésemos querido, habríamos creado de entre vosotros ángeles en la tierra para ser los sucesores en ella .", "urdu": " اور اگر ہم چاہتے تو تم میں سے بھی بعض کو ملائکہ بنا دیتے جو زمین میں تمہاری جگہ آباد ہوتے۔"}, {"arabic": " وَ اِنَّہٗ لَعِلۡمٌ لِّلسَّاعَۃِ فَلَا تَمۡتَرُنَّ بِہَا وَ اتَّبِعُوۡنِ ؕ ہٰذَا صِرَاطٌ مُّسۡتَقِیۡمٌ ﴿۶۲﴾", "english": " But verily, he was a sign of the Hour. So have no doubt about it, but follow me. This is the right path.", "french": " Mais en vérité, il est un signe de l’Heure. Ne soyez donc pas dans le doute à ce sujet, mais suivez-moi. Ceci est un chemin droit.", "german": " Doch wahrlich, er (der Qur-ân) ist Wissen über die \"Stunde\". So bezweifelt sie nicht, sondern folget mir. Das ist der gerade Weg.", "spanish": " Mas en verdad él es un signo de la Hora. No dudéis, pues, de ello, sino seguidme. Éste es el camino recto.", "urdu": " اور وہ (یعنی قرآن) آخری گھڑی کا علم بخشتا ہے پس تم ساعت کے متعلق شبہ نہ کرو اور (اے لوگو) تم میری اتباع کرو‘ یہی سیدھا راستہ ہے۔"}, {"arabic": " وَ لَا یَصُدَّنَّکُمُ الشَّیۡطٰنُ ۚ اِنَّہٗ لَکُمۡ عَدُوٌّ مُّبِیۡنٌ ﴿۶۳﴾", "english": " And let not Satan hinder you. Surely, he is to you an open enemy.", "french": " Et que Satan ne vous empêche pas de suivre le droit chemin . Assurément, il est pour vous un ennemi déclaré.", "german": " Und lasst Satan euch nicht abwendig machen. Gewiss, er ist euch ein offenkundiger Feind.", "spanish": " No dejéis que Satanás os estorbe. En verdad, él es vuestro enemigo declarado.", "urdu": " حق سے دور ہو جانے والا شخص تم کو سیدھے راستے سے روکے نہیں۔ وہ تمہارا کھلا کھلا دشمن ہے۔"}, {"arabic": " وَ لَمَّا جَآءَ عِیۡسٰی بِالۡبَیِّنٰتِ قَالَ قَدۡ جِئۡتُکُمۡ بِالۡحِکۡمَۃِ وَ لِاُبَیِّنَ لَکُمۡ بَعۡضَ الَّذِیۡ تَخۡتَلِفُوۡنَ فِیۡہِ ۚ فَاتَّقُوا اللّٰہَ وَ اَطِیۡعُوۡنِ ﴿۶۴﴾", "english": " And when Jesus came with clear proofs, he said, ‘Truly I am come to you with wisdom, and to make clear to you some of that about which you differ. So fear Allah and obey me.", "french": " Et lorsque Jésus vint avec des preuves manifestes, il dit : « En vérité, je suis venu à vous avec la sagesse, et pour vous éclairer sur certaines de ces choses sur lesquelles vous êtes en désaccord. Craignez donc Allāh et obéissez-moi.", "german": " Wenn Jesus mit klaren Beweisen kommen wird, wird er sprechen: \"Wahrlich, ich komme zu euch mit der Weisheit und um euch etwas von dem zu verdeutlichen, worüber ihr uneinig seid. So fürchtet Allah und gehorchet mir.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:64&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:64&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic65\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic65\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:65' style='text-decoration:underline'>43:65</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(65)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control65\"></i></button> <audio id=\"player65\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّ اللّٰہَ ہُوَ رَبِّیۡ وَ رَبُّکُمۡ فَاعۡبُدُوۡہُ ؕ ہٰذَا صِرَاطٌ مُّسۡتَقِیۡمٌ ﴿۶۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Verily Allah — He is my Lord and your Lord. So worship Him. This is the right path.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Verily, <sup class='ref'>[<a class='ref' data-id='ref_43_65_a' href='#'>a</a>]</sup>Allah—He is my Lord and your Lord. So worship Him. This is the right path.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_43_65_a'>a</span></div> <div><div class='reference' data-id='ref_43_65_a' style='display:none'> <p><b>a.</b> <a href='/quran/3:52' target=_blank>3:52</a>; <a href='/quran/19:37' target=_blank>19:37</a>. (<a href='javascript:void(0)' data-id='ref_43_65_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً اللہ ہی ہے جو میرا بھی ربّ ہے اور تمہارا بھی ربّ ہے۔ پس اس کی عبادت کرو۔ یہ سیدھا راستہ ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اللہ ہی میرا بھی اور تمہارا بھی رب ہے۔ پس اس کی عبادت کرو۔ یہی سیدھا راستہ ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« En vérité Allāh – Il est mon Seigneur et votre Seigneur. Alors adorez-Le ; ceci est un chemin droit. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“En verdad, Al-lah es mi Señor y vuestro Señor. Adoradle pues. Éste es el camino recto”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Allah allein ist mein Herr und euer Herr. Drum dienet Ihm. Das ist der gerade Weg.\"", "spanish": " Y cuando Jesús vino con pruebas claras, dijo: “En verdad vengo a vosotros con la sabiduría y para aclararos algo de aquello sobre lo que disputáis. Temed, pues, a Al-lah y obedecedme.", "urdu": " اور جب عیسیٰ (بعثت ثانیہ میں) نشانات کے ساتھ آئے گا‘ تو وہ کہے گا کہ میں تمہارے پاس حکمت کی باتوں کے ساتھ آیا ہوں اور اس لئے آیا ہوں تا کہ تمہیں بعض وہ باتیں سمجھا دوں جن میں تم اختلاف کرتے ہو۔ پس اللہ کا تقویٰ اختیار کرو اور میری اطاعت کرو۔"}, {"arabic": " فَاخۡتَلَفَ الۡاَحۡزَابُ مِنۡۢ بَیۡنِہِمۡ ۚ فَوَیۡلٌ لِّلَّذِیۡنَ ظَلَمُوۡا مِنۡ عَذَابِ یَوۡمٍ اَلِیۡمٍ ﴿۶۶﴾", "english": " But the parties differed among themselves. So woe to the wrongdoers because of the punishment of a grievous day.", "french": " Mais les groupes tombèrent en désaccord entre eux-mêmes. Alors malheur aux injustes à cause du châtiment d’un jour douloureux !", "german": " Doch werden die Parteien unter ihnen in Zwietracht verfallen. Drum wehe den Frevlern ob der Strafe eines schmerzlichen Tages!", "spanish": " Mas los grupos discutieron entre sí. ¡Ay de los inicuos por el castigo del día doloroso!", "urdu": " سو یہ سن کر اس کے مخالف گروہ آپس میں مختلف باتیں کرنے لگ گئے پس جن لوگوں نے ظلم کیا ایک تکلیف دہ وقت کے عذاب کے ذریعہ سے ان کے لئے ہلاکت مقرر ہے۔"}, {"arabic": " ہَلۡ یَنۡظُرُوۡنَ اِلَّا السَّاعَۃَ اَنۡ تَاۡتِیَہُمۡ بَغۡتَۃً وَّ ہُمۡ لَا یَشۡعُرُوۡنَ ﴿۶۷﴾", "english": " They wait not but for the Hour to come suddenly upon them, while they perceive it not.", "french": " Attendent-ils seulement que l’Heure les surprenne sans qu’ils ne s’ en aperçoivent ?", "german": " Sie warten nur darauf, dass die \"Stunde\" plötzlich über sie komme, dieweil sie´s nicht merken.", "spanish": " Sólo esperan que la Hora llegue de improviso sobre ellos, cuando menos la perciban.", "urdu": " وہ فقط قیامت کا انتظار کر رہے ہیں جس کے لئے اچانک آنا مقدر ہے۔ مگر وہ اسے سمجھتے نہیں۔"}, {"arabic": " اَلۡاَخِلَّآءُ یَوۡمَئِذٍۭ بَعۡضُہُمۡ لِبَعۡضٍ عَدُوٌّ اِلَّا الۡمُتَّقِیۡنَ ﴿ؕ٪۶۸﴾", "english": " Friends on that day will be foes to each other, except the righteous.", "french": " Les amis, ce jour-là, seront des ennemis les uns des autres, sauf les pieux.", "german": " Freunde werden an jenem Tage einer des anderen Feind sein, außer den Rechtschaffenen.", "spanish": " En ese día, los amigos se volverán enemigos, salvo los justos.", "urdu": " بہت سے دوست اس دن آپس میں ایک دوسرے کے دشمن ہوں گے سوائے متقیوں کے۔"}, {"arabic": " یٰعِبَادِ لَا خَوۡفٌ عَلَیۡکُمُ الۡیَوۡمَ وَ لَاۤ اَنۡتُمۡ تَحۡزَنُوۡنَ ﴿ۚ۶۹﴾", "english": " ‘O My servants, there is no fear for you this day, nor shall you grieve;", "french": " « Ô Mes serviteurs, aucune crainte pour vous ce jour-là, et vous ne serez point affligés ;", "german": " „O Meine Diener, keine Furcht soll auf euch sein an diesem Tage, noch sollt ihr trauern,", "spanish": " “¡Siervos míos! No habrá temor para vosotros en ese día, ni os afligiréis”;", "urdu": " (کہ ان سے خدا کہے گا) اے میرے بندو! آج تمہیں کسی خوف کا سامنا نہیں اور نہ کسی پچھلی غلطی کے غم میں تم مبتلا ہو سکتے ہو۔"}, {"arabic": " اَلَّذِیۡنَ اٰمَنُوۡا بِاٰیٰتِنَا وَ کَانُوۡا مُسۡلِمِیۡنَ ﴿ۚ۷۰﴾", "english": " ‘ You who believed in Our Signs and submitted,", "french": " Ceux qui avaient cru à Nos Signes et qui s’étaient soumis,", "german": " (ihr,) die an Unsere Zeichen glaubtet und euch ergabt,", "spanish": " “Los que creísteis en Nuestros Signos y os sometisteis”.", "urdu": " (یہ انعام پانے والے وہ لوگ ہوں گے) جو ہماری آیتوں پر ایمان لائے تھے اور جنہوں نے فرمانبرداری کی سی زندگی بسر کی تھی۔"}, {"arabic": " اُدۡخُلُوا الۡجَنَّۃَ اَنۡتُمۡ وَ اَزۡوَاجُکُمۡ تُحۡبَرُوۡنَ ﴿۷۱﴾", "english": " ‘Enter ye the Garden, you and your wives, honoured and happy.’", "french": " Vous et vos épouses, entrez dans le Jardin où vous serez honorés et rendus heureux. »", "german": " tretet ein in den Garten, ihr und eure Gefährten, geehrt, glückselig!\" –</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:71&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:71&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic72\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic72\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:72' style='text-decoration:underline'>43:72</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(72)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control72\"></i></button> <audio id=\"player72\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">یُطَافُ عَلَیۡہِمۡ بِصِحَافٍ مِّنۡ ذَہَبٍ وَّ اَکۡوَابٍ ۚ وَ فِیۡہَا مَا تَشۡتَہِیۡہِ الۡاَنۡفُسُ وَ تَلَذُّ الۡاَعۡیُنُ ۚ وَ اَنۡتُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿ۚ۷۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">To them will be passed round dishes of gold and cups, and therein will be all that the souls desire and <I>in which </I>the eyes delight. ‘And therein will you abide.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> There will be passed round to them <sup class='ref'>[<a class='ref' data-id='ref_43_72_f' href='#'>f</a>]</sup>dishes of gold and cups, and therein will be all that the souls desire and <i>in which </i>the eyes delight. And therein you will dwell for ever. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_43_72_f'>f</span></div> <div><div class='reference' data-id='ref_43_72_f' style='display:none'> <p><b>f.</b> <a href='/quran/56:19' target=_blank>56:19</a>; <a href='/quran/76:16' target=_blank>76:16</a>. (<a href='javascript:void(0)' data-id='ref_43_72_f' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">ان پر سونے کے تھالوں اور آبگینوں کے دور چلائے جائیں گے اور اس میں ان کے لئے وہ سب کچھ ہوگا جس کی ان کے دل خواہش کریں گے اور جس سے آنکھیں لذت پائیں گی اور تم اس میں ہمیشہ رہنے والے ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ان کے پاس سونے کے طشت اور کوزے باربار لائے جائیں گے اور اس (جنت) میں جو کچھ دل چاہے گا اور آنکھیں پسند کریں گی موجود ہوگا اور (کہا جائے گا کہ) تم اس میں ہمیشہ رہتے چلے جاٶ گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">On fera circuler parmi eux des plats en or et des gobelets, et il s’y trouvera<em> tout</em> ce que désirent les âmes, et <em>tout</em> ce dont se délectent les yeux. « Et vous y demeurerez éternellement.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Se harán pasar entre ellos fuentes y copas de oro, y allí habrá todo lo que desean las almas y <em>en lo</em> que se deleitan los ojos. “Y allí moraréis”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Schüsseln von Gold und Becher werden unter ihnen kreisen, und darin wird alles sein, was die Seelen begehren und (woran) die Augen sich ergötzen – \"und ewig sollt ihr darinnen weilen.", "spanish": " “Entrad en el jardín, vosotros y vuestras esposas seréis enaltecidos y se os hará felices”.", "urdu": " (اللہ ان سے کہے گا) تم بھی اور تمہارے ساتھی بھی خوشیاں مناتے ہوئے جنت میں داخل ہو جاٶ۔"}, {"arabic": " وَ تِلۡکَ الۡجَنَّۃُ الَّتِیۡۤ اُوۡرِثۡتُمُوۡہَا بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۷۳﴾", "english": " ‘And this is the Garden to which you have been made heirs because of what you have been doing.", "french": " Et tel est le Jardin dont vous avez été faits héritiers à cause de ce que vous faisiez.", "german": " Das ist der Garten, zu dessen Erben ihr berufen wurdet um dessentwillen, was ihr zu tun pflegtet.", "spanish": " “Éste es el Jardín del que habéis sido nombrados herederos por vuestras acciones”.", "urdu": " اور یہ وہ جنت ہوگی جس کا تم کو تمہارے اعمال کے سبب سے وارث بنایا جائے گا۔"}, {"arabic": " لَکُمۡ فِیۡہَا فَاکِہَۃٌ کَثِیۡرَۃٌ مِّنۡہَا تَاۡکُلُوۡنَ ﴿۷۴﴾", "english": " ‘Therein for you is fruit in abundance, which you will eat.’", "french": " Il s’y trouve pour vous des fruits en abondance, dont vous mangerez. »", "german": " Darinnen sind Früchte für euch in Menge, von denen ihr essen könnt.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:74&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:74&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic75\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic75\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:75' style='text-decoration:underline'>43:75</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(75)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control75\"></i></button> <audio id=\"player75\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّ الۡمُجۡرِمِیۡنَ فِیۡ عَذَابِ جَہَنَّمَ خٰلِدُوۡنَ ﴿ۚۖ۷۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">The guilty will certainly abide in the punishment of Hell.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_43_75_b' href='#'>b</a>]</sup>The guilty will, certainly, abide in the punishment of Hell. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_43_75_b'>b</span></div> <div><div class='reference' data-id='ref_43_75_b' style='display:none'> <p><b>b.</b> <a href='/quran/20:75' target=_blank>20:75</a>. (<a href='javascript:void(0)' data-id='ref_43_75_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً جرم کرنے والے جہنم کے عذاب میں لمبا عرصہ رہنے والے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">مجرم یقیناً جہنم کے عذاب میں مدتوں مبتلا رہیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Les coupables assurément demeureront<em> longtemps</em> dans le châtiment de l’Enfer.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Los culpables morarán ciertamente en el castigo del Infierno.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Die Schuldigen werden in der Strafe der Hölle bleiben.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:75&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:75&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic76\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic76\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:76' style='text-decoration:underline'>43:76</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(76)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control76\"></i></button> <audio id=\"player76\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَا یُفَتَّرُ عَنۡہُمۡ وَ ہُمۡ فِیۡہِ مُبۡلِسُوۡنَ ﴿ۚ۷۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">It will not be mitigated to them, and they will be seized therein with despair.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_43_76_c' href='#'>c</a>]</sup>It will not be lightened for them, and they will be seized therein with despair. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_43_76_c'>c</span></div> <div><div class='reference' data-id='ref_43_76_c' style='display:none'> <p><b>c.</b> <a href='/quran/2:87' target=_blank>2:87</a>; <a href='/quran/40:50' target=_blank>40:50</a>, <a href='/quran/40:51' target=_blank>51</a>. (<a href='javascript:void(0)' data-id='ref_43_76_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">وہ (عذاب) ان سے کم نہیں کیا جائے گا اور وہ اس میں مایوس پڑے ہوں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ان کے عذاب میں وقفہ نہیں ڈالا جائے گا اور وہ اس میں مایوس ہو جائیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il ne sera pas mitigé pour eux, et ils y seront saisis de désespoir.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">No les será suavizado, y sobre ellos caerá la desesperación.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Sie wird für sie nicht gemildert werden, und sie werden in ihr von Verzweiflung erfasst werden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:76&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:76&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic77\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic77\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:77' style='text-decoration:underline'>43:77</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(77)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control77\"></i></button> <audio id=\"player77\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَا ظَلَمۡنٰہُمۡ وَ لٰکِنۡ کَانُوۡا ہُمُ الظّٰلِمِیۡنَ ﴿۷۷﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And We wronged them not, but it was they themselves who were the wrongdoers.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And We wronged them not, but it was they themselves who were the wrongdoers. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ہم نے ان پر ظلم نہیں کیا بلکہ وہ خود ہی ظلم کرنے والے تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور ہم نے ان پر ظلم نہیں کیا لیکن وہ خود اپنی جانوں پر ظلم کر رہے تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et Nous ne les avons pas traités injustement, mais ce sont eux-mêmes qui ont été les injustes.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">No fuimos Nosotros Quienes los perjudicamos, sino que ellos mismos fueron los inicuos.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Nicht Wir taten ihnen Unrecht, sondern sie selbst taten Unrecht.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=43:77&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=43:77&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic78\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic78\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/43:78' style='text-decoration:underline'>43:78</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(78)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control78\"></i></button> <audio id=\"player78\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ نَادَوۡا یٰمٰلِکُ لِیَقۡضِ عَلَیۡنَا رَبُّکَ ؕ قَالَ اِنَّکُمۡ مّٰکِثُوۡنَ ﴿۷۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And they will cry: ‘O master! let thy Lord finish with us.’ He will say, ‘You must remain.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And they will cry, ‘O Malik!<sup class='ref'>[<a class='ref' data-id='ref_43_78_2687' href='#'>2687</a>]</sup> let thy Lord make an end of us.’ He will say, ‘You must stay <i>here</i>.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_43_78_2687'>2687</span></div> <div><a name='2687'></a><div class='reference' data-id='ref_43_78_2687' style='display:none'> <p><b>2687.</b> <i>Malik</i>, meaning master, is generally considered to be the angel in charge of Hell. (<a href='javascript:void(0)' data-id='ref_43_78_2687' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور وہ پکاریں گے کہ اے مالک! تیرا ربّ ہمیں موت ہی دے دے۔ وہ کہے گا تم یقیناً (یہیں) ٹھہرے رہنے والے ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور وہ پکاریں گے کہ اے مالک (یعنی افسر دوزخ) تیرے رب کو چاہیئے کہ ہمیں موت دے دے۔ وہ کہے گا۔ تم دیر تک اس میں رہو گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et ils crieront : « Ô responsable <em>de l’Enfer !</em> Que ton Seigneur nous achève ! » Il dira : « Vous devez <em>y</em> rester. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y gritarán; “¡Oh custodio del Infierno! Haz que tu Señor nos haga perecer”. Dirá: “Debéis permanecer”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und sie werden schreien: \"O Vogt, lass deinen Herrn ein Ende mit uns machen!\" Er wird sprechen: \"Ihr müsst bleiben.", "spanish": " “En él hay para vosotros frutas en abundancia de las que comeréis”.", "urdu": " تمہارے لئے اس میں کثرت سے پھل موجود ہونگے جن میں سے تم حسب ضرورت کھاٶ گے۔"}, {"arabic": " لَقَدۡ جِئۡنٰکُمۡ بِالۡحَقِّ وَ لٰکِنَّ اَکۡثَرَکُمۡ لِلۡحَقِّ کٰرِہُوۡنَ ﴿۷۹﴾", "english": " God will say : ‘We certainly brought you the truth; but most of you were averse to the truth.’", "french": " Allāh dira : « Nous vous avons assurément apporté la vérité ; mais la plupart d’entre vous détestaient la vérité. »", "german": "", "spanish": " Dios dirá: “Ciertamente os trajimos la verdad; pero la mayoría de vosotros fuisteis adversos a la verdad”.", "urdu": " (خداتعالیٰ کہتا ہے) ہم تمہارے پاس حق لے کر آئے تھے‘ لیکن تم میں سے اکثر حق سے نفرت کرتے تھے۔"}, {"arabic": " اَمۡ اَبۡرَمُوۡۤا اَمۡرًا فَاِنَّا مُبۡرِمُوۡنَ ﴿ۚ۸۰﴾", "english": " Have they determined upon a course? Then We too are determined.", "french": " Ont-ils pris une décision de faire quelque chose ? Alors Nous aussi , Nous en avons pris une décision.", "german": " Haben sie sich für einen Plan entschlossen? Nun, auch Wir haben Uns entschlossen.", "spanish": " ¿Se han decidido a tomar un camino? Pues Nosotros también lo hemos decidido.", "urdu": " کیا ان لوگوں نے (رسول اللہ صلی اللہ علیہ وسلم پر) حملہ کرنے کا کوئی فیصلہ کر لیا ہے (اگر ایسا ہے) تو ہم نے بھی ان کی تباہی کا فیصلہ کر لیا ہے۔"}, {"arabic": " اَمۡ یَحۡسَبُوۡنَ اَنَّا لَا نَسۡمَعُ سِرَّہُمۡ وَ نَجۡوٰٮہُمۡ ؕ بَلٰی وَ رُسُلُنَا لَدَیۡہِمۡ یَکۡتُبُوۡنَ ﴿۸۱﴾", "english": " Do they think that We hear not their secrets and their private counsels? Yea! And Our messengers remain with them recording everything .", "french": " S’imaginent-ils que Nous n’entendons pas leurs secrets et leurs complots ? Mais oui ! Et Nos messagers restent auprès d’eux, consignant tout par écrit.", "german": " Wähnen sie denn, dass Wir ihre Geheimnisse und ihre verhohlenen Beratungen nicht hören? Doch, und Unsere Boten bei ihnen schreiben auf.", "spanish": " ¿Piensan acaso que no oímos sus secretos y conspiraciones? ¡Sí! Y Nuestros mensajeros permanecen con ellos registrándolo todo.", "urdu": " کیا وہ یہ گمان کرتے ہیں کہ ہم ان کی پوشیدہ باتوں اور پوشیدہ مشوروں کو نہیں سنتے یہ بات نہیں بلکہ ہمارے رسول ان کے پہلو میں بیٹھے لکھ رہے ہیں۔"}, {"arabic": " قُلۡ اِنۡ کَانَ لِلرَّحۡمٰنِ وَلَدٌ ٭ۖ فَاَنَا اَوَّلُ الۡعٰبِدِیۡنَ ﴿۸۲﴾", "english": " Say, ‘If there had been a son to the Gracious God , I would have been the first of worshippers.’", "french": " Dis : « Si le Dieu Gracieux avait un fils, j’aurais été le premier des adorateurs. »", "german": " Sprich: \"Hätte der Gnadenreiche einen Sohn gehabt, ich wäre der erste der Anbetenden gewesen.\"", "spanish": " Diles: “Si hubiese existido un hijo del Dios Clemente, yo habría sido el primero en adorarlo”.", "urdu": " تو کہہ دے کہ اگر رحمن (خدا) کا کوئی بیٹا ہوتا تو میں اس کی سب سے پہلے عبادت کرتا۔"}, {"arabic": " سُبۡحٰنَ رَبِّ السَّمٰوٰتِ وَ الۡاَرۡضِ رَبِّ الۡعَرۡشِ عَمَّا یَصِفُوۡنَ ﴿۸۳﴾", "english": " Holy is Allah , the Lord of the heavens and the earth, the Lord of the Throne, and He is free from all that which they attribute to Him .", "french": " Saint est Allāh , le Seigneur des cieux et de la terre, le Seigneur du Trône, bien au-dessus de tout ce qu’ils Lui attribuent.", "german": " Der Herr der Himmel und der Erde, der Herr des Thrones, ist frei von all dem, was sie behaupten.", "spanish": " Santo es Al-lah , el Señor de los cielos y de la tierra, el Señor del Trono, pues Él es libre de todo lo que Le atribuyen.", "urdu": " آسمانوں اور زمین کا رب اور عرش کا رب ان سب (صفات شرکیہ) سے پاک ہے جو مشرک بیان کرتے ہیں۔"}, {"arabic": " فَذَرۡہُمۡ یَخُوۡضُوۡا وَ یَلۡعَبُوۡا حَتّٰی یُلٰقُوۡا یَوۡمَہُمُ الَّذِیۡ یُوۡعَدُوۡنَ ﴿۸۴﴾", "english": " So leave them alone to indulge in vain discourse and amuse themselves until they meet that Day of theirs which they have been promised.", "french": " Laisse-les donc se complaire dans de vains discours, et s’amuser jusqu’à ce qu’ils rencontrent ce Jour, qui leur a été promis.", "german": " So lass sie sich ergehen in eitler Rede und sich vergnügen, bis sie ihrem Tag begegnen, der ihnen angedroht ward.", "spanish": " Dejadlos, pues, solos, dedicados a sus frívolas conversaciones y divirtiéndose hasta que se encuentren con ese Día suyo que les ha sido prometido.", "urdu": " پس (اے پیغمبر)! تو ان کو چھوڑ دے کہ گند اچھالتے رہیں اور اس وقت تک کھیلتے رہیں کہ وہ اپنے اس عذاب کے وقت کو پالیں جس کا ان سے وعدہ کیا گیا تھا۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ فِی السَّمَآءِ اِلٰہٌ وَّ فِی الۡاَرۡضِ اِلٰہٌ ؕ وَ ہُوَ الۡحَکِیۡمُ الۡعَلِیۡمُ ﴿۸۵﴾", "english": " And He it is Who is God in heaven, and God on earth; and He is the Wise, the All-Knowing.", "french": " Et c’est Lui Qui est Dieu au ciel et Dieu sur la terre ; et Il est le Sage, l’Omniscient.", "german": " Er ist Gott im Himmel und Gott auf Erden, und Er ist der Allweise, der Allwissende.", "spanish": " Él es Quien es Dios en el cielo y Dios en la tierra; pues Él es el Sabio, el Omnisciente.", "urdu": " اور وہ (خدا) ہی آسمانوں اور زمین میں واحد معبود ہے اور وہ بڑی حکمتوں والا اور بہت جاننے والا ہے۔"}, {"arabic": " وَ تَبٰرَکَ الَّذِیۡ لَہٗ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ مَا بَیۡنَہُمَا ۚ وَ عِنۡدَہٗ عِلۡمُ السَّاعَۃِ ۚ وَ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۸۶﴾", "english": " And blessed is He to Whom belongs the kingdom of the heavens and the earth and all that is between them, and with Him is the knowledge of the Hour, and to Him shall you be brought back.", "french": " Et béni est Celui à Qui appartiennent le Royaume des cieux et de la terre et tout ce qui est entre eux, et avec Lui est la Connaissance de l’Heure, et c’est vers Lui que vous serez ramenés.", "german": " Segensreich ist Er, Des das Königreich der Himmel und der Erde ist und all das, was zwischen beiden ist; und bei Ihm ist die Kenntnis der \"Stunde\", und zu Ihm sollt ihr zurückgebracht werden.", "spanish": " Bendito sea Aquel a Quien pertenece el reino de los cielos y de la tierra y todo cuanto hay entre ellos, pues en Él está el conocimiento de la Hora y a Él seréis devueltos.", "urdu": " اور بڑی برکتیں بخشنے والی وہ ہستی ہے جو آسمانوں اور زمین اور جو کچھ ان کے درمیان ہے‘ ان سب کی بادشاہت کی مالک ہے اور قیامت کا علم صرف اس کو حاصل ہے اور اسی کی طرف تم کو لوٹایا جائے گا۔"}, {"arabic": " وَ لَا یَمۡلِکُ الَّذِیۡنَ یَدۡعُوۡنَ مِنۡ دُوۡنِہِ الشَّفَاعَۃَ اِلَّا مَنۡ شَہِدَ بِالۡحَقِّ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۸۷﴾", "english": " And those on whom they call beside Him possess no power of intercession but he who bears witness to the truth, and they know him .", "french": " Et ceux qu’ils invoquent en dehors de Lui ne possèdent aucun pouvoir d’intercession, sauf celui qui porte témoignage de la vérité, et ils le savent bien .", "german": " Und jene, die ihr statt Ihn anrufet, haben kein Fürspracherecht, mit Ausnahme dessen, der die Wahrheit bezeugt, und sie wissen es.", "spanish": " Mas aquellos a quienes invocan aparte de Él no poseen poder de intercesión salvo el que es testigo de la verdad; y ellos lo conocen.", "urdu": " اور جن کو یہ لوگ خدا کے سوا پکارتے ہیں وہ شفاعت کے مالک نہیں مگر وہی شفاعت کا حق رکھتا ہے جو سچ کی گواہی دے اور وہ (کفار اس حقیقت کو) خوب سمجھ سکتے ہیں۔"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ مَّنۡ خَلَقَہُمۡ لَیَقُوۡلُنَّ اللّٰہُ فَاَنّٰی یُؤۡفَکُوۡنَ ﴿ۙ۸۸﴾", "english": " And if thou ask them, ‘Who created them?’, they will surely say, ‘Allah’. How then are they being turned away?", "french": " Et si tu leur demandes, « Qui les a créés ? », ils répondront assurément : « Allāh. » Comment donc sont-ils détournés ?", "german": " Und wenn du sie fragst: \"Wer schuf sie?\", werden sie sicherlich sagen: \"Allah\". Wie lassen sie sich da abwendig machen!", "spanish": " Si les preguntáis: “¿Quién los creó?”, responderán ciertamente: “Al-lah”. ¿Cómo es entonces que se están apartando?", "urdu": " اور اگر تو ان سے پوچھے کہ ان کو کس نے پیدا کیا ہے؟ تو وہ ضرور کہیں گے اللہ نے۔ پھر وہ کس طرف کو پھسلا کر لے جائے جا رہے ہیں۔"}, {"arabic": " وَ قِیۡلِہٖ یٰرَبِّ اِنَّ ہٰۤؤُلَآءِ قَوۡمٌ لَّا یُؤۡمِنُوۡنَ ﴿ۘ۸۹﴾", "english": " I swear by his repeated cry ‘O my Lord!’ that these are a people who will not believe.", "french": " Par le témoignage répété du Messager , « Ô mon Seigneur ! Ce sont là des gens qui ne croiront pas. »", "german": " Bei seinem (des Propheten) Ruf: \"O mein Herr! dies ist ein Volk, das nicht glauben will.\"", "spanish": " Juro por el clamor repetido , “¡Oh mi Señor!” que son un pueblo que no creerán.", "urdu": " اور ہم کو اس (رسول) کے اس قول کی قسم! جب اس نے کہا تھا اے میرے رب! یہ قوم تو ایسی ہے کہ کسی سچائی پر ایمان نہیں لاتی۔"}], "Surah": 43}