{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ السَّمَآءِ وَ الطَّارِقِ ۙ﴿۲﴾", "english": " By the heaven and the Morning Star —", "french": " Par le ciel et par ce qui devra se manifester la nuit –", "german": " Bei dem Himmel und dem Morgenstern –", "spanish": " Por el cielo y el Visitante Noc­turno.", "urdu": " میں آسمان کو اور صبح کے ستارے کو شہادت کے طور پر پیش کرتا ہوں۔"}, {"arabic": " وَ مَاۤ اَدۡرٰٮکَ مَا الطَّارِقُ ۙ﴿۳﴾", "english": " And what should make thee know what the Morning Star is?", "french": " Et qu’est-ce qui te fera savoir ce qui devra se manifester la nuit ?", "german": " und was lehrt dich wissen, was der Morgenstern ist?", "spanish": " Y ¿qué te hará entender qué es el Visitante Nocturno?", "urdu": " اور کس چیز نے تجھے علم دیا ہے کہ صبح کا ستارہ کیا ہے۔"}, {"arabic": " النَّجۡمُ الثَّاقِبُ ۙ﴿۴﴾", "english": " It is the star of piercing brightness —", "french": " C’est l’Etoile d’un éclat perçant.", "german": " Ein Stern von durchdringender Helligkeit –,", "spanish": " Es la estrella del brillo ful­gurante.", "urdu": " وہ ستارہ (وہ ہے) جو بہت چمکتا ہے۔"}, {"arabic": " اِنۡ کُلُّ نَفۡسٍ لَّمَّا عَلَیۡہَا حَافِظٌ ؕ﴿۵﴾", "english": " There is no soul but has a guardian over it.", "french": " Il n’y a aucune âme qui n’ait sur elle un gardien.", "german": " keine Seele gibt es, die nicht einen Wächter über sich hätte.", "spanish": " No hay alma que no tenga su propio guardián.", "urdu": " (ہم دعویٰ کرتے ہیں کہ اس قسم کی) کوئی جان نہیں‘ جس پر ایک نگران (خدا کی طرف سے) مقرر نہ ہو۔"}, {"arabic": " فَلۡیَنۡظُرِ الۡاِنۡسَانُ مِمَّ خُلِقَ ؕ﴿۶﴾", "english": " So let man consider from what he is created.", "french": " Aussi, que l’homme réfléchisse à ce dont il est créé.", "german": " Möge der Mensch denn betrachten, woraus er erschaffen.", "spanish": " Que el hombre considere, pues, de lo que ha sido creado.", "urdu": " پس انسان کو دیکھنا چاہیے کہ وہ کس چیز سے پیدا کیا گیا ہے۔"}, {"arabic": " خُلِقَ مِنۡ مَّآءٍ دَافِقٍ ۙ﴿۷﴾", "english": " He is created from a gushing fluid,", "french": " Il est créé d’un fluide jaillissant,", "german": " Erschaffen ward er aus einem sich ergießenden Wasser,", "spanish": " Es creado de un líquido eya­culado,", "urdu": " وہ ایک اچھلنے والے پانی سے پیدا کیا گیا ہے۔"}, {"arabic": " یَّخۡرُجُ مِنۡۢ بَیۡنِ الصُّلۡبِ وَ التَّرَآئِبِ ؕ﴿۸﴾", "english": " Which issues forth from between the loins and the breast-bones.", "french": " Qui sort d’entre les reins et le sternum.", "german": " das zwischen den Lenden und den Rippen hervorkommt.", "spanish": " Que sale de entre los riñones y las costillas.", "urdu": " وہ (پانی یا انسان) پیٹھ اور سینہ (کی ہڈیوں) کے درمیان سے نکلتا ہے۔"}, {"arabic": " اِنَّہٗ عَلٰی رَجۡعِہٖ لَقَادِرٌ ؕ﴿۹﴾", "english": " Surely, He has the power to bring him back to life", "french": " Assurément, Il a le pouvoir de le ramener à la vie .", "german": " Gewiss, Er vermag ihn wieder zu erwecken", "spanish": " En verdad, El tiene el poder para devolverlo a la vida .", "urdu": " وہ (یعنی خدا) اس کے دوبارہ لوٹانے پر بھی یقیناً قادر ہے۔"}, {"arabic": " یَوۡمَ تُبۡلَی السَّرَآئِرُ ۙ﴿۱۰﴾", "english": " On the day when secrets shall be disclosed.", "french": " Le jour où tous les secrets seront dévoilés.", "german": " am Tage, wenn die Geheimnisse enthüllt werden.", "spanish": " En el día en que se revelarán los secretos.", "urdu": " اس دن جب پوشیدہ بھید ظاہر کیے جائیں گے۔"}, {"arabic": " فَمَا لَہٗ مِنۡ قُوَّۃٍ وَّ لَا نَاصِرٍ ﴿ؕ۱۱﴾", "english": " Then he will have no strength and no helper.", "french": " Alors il n’aura aucune force ni personne pour l’aider.", "german": " Dann wird er keine Kraft und keinen Helfer haben.", "spanish": " Entonces no tendrá fuerza, ni tampoco quien le ayude.", "urdu": " جس کے نتیجہ میں نہ تو (اپنے اوپر سے مصیبت ٹلانے کی) کوئی طاقت اس (انسان) کے پاس رہے گی اور نہ اس کا کوئی مددگار ہوگا۔"}, {"arabic": " وَ السَّمَآءِ ذَاتِ الرَّجۡعِ ﴿ۙ۱۲﴾", "english": " By the cloud which gives rain after rain,", "french": " Par le ciel qui fait revenir la pluie encore et encore.", "german": " Bei der Wolke, die Regen um Regen sendet,", "spanish": " Por los cielos, que siempre vuelven (con la lluvia),", "urdu": " میں شہادت کے طور پر اس بادل کو پیش کرتا ہوں جو بارش سے بھرا ہوا باربار برستا ہے۔"}, {"arabic": " وَ الۡاَرۡضِ ذَاتِ الصَّدۡعِ ﴿ۙ۱۳﴾", "english": " And by the earth which opens out with herbage ,", "french": " Et par la terre qui se fend pour faire croître de la végétation ,", "german": " und der Erde, die sich spaltet (durch die Pflanzen),", "spanish": " Y por la tierra que se abre con pastos,", "urdu": " اور اس زمین کو بھی شہادت کے طور پر پیش کرتا ہوں جو بارش کے نازل ہونے کے بعد پھٹ کر روئیدگی نکالتی ہے۔"}, {"arabic": " اِنَّہٗ لَقَوۡلٌ فَصۡلٌ ﴿ۙ۱۴﴾", "english": " It is surely a decisive word,", "french": " C’est assurément une parole décisive,", "german": " dieser (Qur-ân) ist wahrlich ein entscheidendes, letztes Wort.", "spanish": " En verdad es una palabra decisiva,", "urdu": " یہ شہادت اس امر پر ہے کہ وہ (قرآن) یقیناً قطعی اور آخری بات ہے۔"}, {"arabic": " وَّ مَا ہُوَ بِالۡہَزۡلِ ﴿ؕ۱۵﴾", "english": " And it is not a useless talk.", "french": " Et ce n’est pas un vain discours.", "german": " Er ist kein Spiel.", "spanish": " Y no una charla inútil.", "urdu": " اور وہ کوئی (بے فائدہ اور) کمزور کلام نہیں۔"}, {"arabic": " اِنَّہُمۡ یَکِیۡدُوۡنَ کَیۡدًا ﴿ۙ۱۶﴾", "english": " Surely they plan a plan,", "french": " Assurément, ils ourdissent un complot,", "german": " Sie schmieden einen Plan,", "spanish": " Ciertamente preparan una treta,", "urdu": " وہ لوگ یقیناً (اس قرآن کے خلاف) خوب داٶ پیچ کریں گے۔"}, {"arabic": " وَّ اَکِیۡدُ کَیۡدًا ﴿ۚۖ۱۷﴾", "english": " And I also plan a plan.", "french": " Et Moi aussi, Je conçois un plan en guise de contre-mesure .", "german": " auch Ich schmiede einen Plan.", "spanish": " Mas Yo también estoy preparando un plan en su contra.", "urdu": " اور میں (خدا ان کے خلاف) خوب تدبیریں کروں گا (اور حق کھل جائے گا)"}, {"arabic": " فَمَہِّلِ الۡکٰفِرِیۡنَ اَمۡہِلۡہُمۡ رُوَیۡدًا ﴿٪۱۸﴾", "english": " So give time to the disbelievers. Aye , give them time for a little while.", "french": " Aussi, accorde un répit aux mécréants. Oui , accorde-leur un répit pour un peu de temps.", "german": " Drum gönne den Ungläubigen Zeit. Überlasse sie auf eine Weile sich selbst.", "spanish": " Da, pues, tiempo, a los incré­dulos, ¡Ay!, ¡dales un poco mas de tiempo!", "urdu": " پس (اے رسول)! کفار کو مہلت دو (ہاں) انہیں کچھ دن کی اور مہلت دو (تا کہ جو زور لگانا چاہیں لگالیں)"}], "Surah": 86}