{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " ہَلۡ اَتٰی عَلَی الۡاِنۡسَانِ حِیۡنٌ مِّنَ الدَّہۡرِ لَمۡ یَکُنۡ شَیۡئًا مَّذۡکُوۡرًا ﴿۲﴾", "english": " There has certainly come upon man a period of time when he was not a thing spoken of.", "french": " N’est-il pas passé sur l’homme une période où il n’était pas une chose dont on faisait mention ?", "german": " Wahrlich, es kam über den Menschen eine Zeit, da er nichts Nennenswertes war.", "spanish": " ¿Acaso no vino al hombre un período de tiempo en el que no era nada de lo que se pudiera hablar?", "urdu": " کیا انسان پر وہ گھڑی نہیں آئی جب وہ باکل بے حقیقت تھا‘ اور اس کے کاموں کو کوئی یاد نہیں کرتا تھا۔"}, {"arabic": " اِنَّا خَلَقۡنَا الۡاِنۡسَانَ مِنۡ نُّطۡفَۃٍ اَمۡشَاجٍ ٭ۖ نَّبۡتَلِیۡہِ فَجَعَلۡنٰہُ سَمِیۡعًۢا بَصِیۡرًا ﴿۳﴾", "english": " We have created man from a mingled sperm-drop that We might try him; so We made him hearing, seeing.", "french": " Nous créâmes l’homme d’une goutte d’un mélange de sperme que Nous faisons passer par des épreuves ; puis Nous l’avons fait devenir un être entendant et voyant.", "german": " Wir erschufen den Menschen aus einem Mischtropfen, auf dass Wir ihn prüfen möchten; dann gaben Wir ihm Gehör und Gesicht.", "spanish": " Creamos al hombre de una gota de esperma mezclada, sometiéndolo a pruebas, hasta que lo convertimos en un ser que oye y ve.", "urdu": " ہم نے انسان کو ایک ایسے نطفہ سے پیدا کیا ہے جس میں مختلف قوتیں ملی ہوئی تھیں تا کہ ہم اس کی آزمائش کریں پھر ہم نے اس کو بہت سننے والا (اور) دیکھنے والا بنا دیا۔"}, {"arabic": " اِنَّا ہَدَیۡنٰہُ السَّبِیۡلَ اِمَّا شَاکِرًا وَّ اِمَّا کَفُوۡرًا ﴿۴﴾", "english": " We have shown him the Way, whether he be grateful or ungrateful.", "french": " Nous lui avons montré la Voie, qu’il soit reconnaissant ou ingrat.", "german": " Wir haben ihm den Weg gezeigt, ob er nun dankbar oder undankbar sei.", "spanish": " Le hemos mostrado el camino, ya fuera agradecido o desagradecido.", "urdu": " ہم نے اسے اس کے مطابق حال رستہ بتادیا یعنی خواہ وہ شکر کرے یا نافرمان ہو جائے۔"}, {"arabic": " اِنَّاۤ اَعۡتَدۡنَا لِلۡکٰفِرِیۡنَ سَلٰسِلَا۠ وَ اَغۡلٰلًا وَّ سَعِیۡرًا ﴿۵﴾", "english": " Verily, We have prepared for the disbelievers chains and iron-collars and a blazing Fire.", "french": " En vérité, Nous avons préparé pour les mécréants des chaînes et des colliers de fer et une Fournaise.", "german": " Wahrlich, Wir haben für die Ungläubigen Ketten, eiserne Nackenfesseln und ein flammendes Feuer bereitet.", "spanish": " En verdad, hemos preparado para los incrédulos cadenas, argollas y un Fuego ardiente.", "urdu": " ہم نے کافروں کے لئے زنجیریں اور طوق اور جہنم تیار کر چھوڑے ہیں۔"}, {"arabic": " اِنَّ الۡاَبۡرَارَ یَشۡرَبُوۡنَ مِنۡ کَاۡسٍ کَانَ مِزَاجُہَا کَافُوۡرًا ۚ﴿۶﴾", "english": " But the virtuous drink of a cup, tempered with camphor —", "french": " Mais les vertueux boiront d’une coupe, tempérée de camphre –", "german": " Die Gerechten aber trinken aus einem Becher, dem Kampfer beigemischt ist –", "spanish": " Pero los virtuosos beben de una copa suavizada con alcanfor;", "urdu": " خدا کے نیک بندے ایسے پیالے پیئں گے‘ جن میں کافور کی خاصیت ملائی گئی ہوگی۔"}, {"arabic": " عَیۡنًا یَّشۡرَبُ بِہَا عِبَادُ اللّٰہِ یُفَجِّرُوۡنَہَا تَفۡجِیۡرًا ﴿۷﴾", "english": " A spring wherefrom the servants of Allah drink. They make it gush forth — a forceful gushing forth.", "french": " Une fontaine d’où boiront les serviteurs d’Allāh. Ils la font jaillir – un puissant jaillissement.", "german": " eine Quelle, von der die Diener Allahs trinken, und die sie hervorsprudeln lassen in reichlichem Sprudel.", "spanish": " Un manantial del que beben los siervos de Al-lah. Ellos lo hacen brotar con un vigoroso brote.", "urdu": " یہ (کافور) ایک چشمہ ہوگا جس میں سے اللہ کے بندے پیئں گے وہ کوشش کرکے اس (چشمہ) کو زمین پھاڑ کر نکالتے ہیں۔"}, {"arabic": " یُوۡفُوۡنَ بِالنَّذۡرِ وَ یَخَافُوۡنَ یَوۡمًا کَانَ شَرُّہٗ مُسۡتَطِیۡرًا ﴿۸﴾", "english": " They fulfil their vow, and fear a day the evil of which is widespread.", "french": " Ils accomplissent leur serment et redoutent un jour dont le mal sera largement répandu.", "german": " Sie vollbringen das Gelübde, und sie fürchten einen Tag, dessen Übel sich weithin ausbreitet.", "spanish": " Cumplen sus promesas, y temen un día cuya maldad está extendida.", "urdu": " وہ اپنی نذریں ادا کرتے ہیں اور اس دن سے ڈرتے ہیں جس دن کی برائی تمام دنیا میں پھیلی ہوئی ہوگی۔"}, {"arabic": " وَ یُطۡعِمُوۡنَ الطَّعَامَ عَلٰی حُبِّہٖ مِسۡکِیۡنًا وَّ یَتِیۡمًا وَّ اَسِیۡرًا ﴿۹﴾", "english": " And they feed, for love of Him, the poor, the orphan, and the prisoner,", "french": " Et pour l’amour de Lui, ils nourrissent l’indigent, l’orphelin, et le captif ;", "german": " Und sie geben Speise, aus Liebe zu Ihm, dem Armen, der Waise und dem Gefangenen,", "spanish": " Y dan de comer, por amor a Él, al pobre, al huérfano y al prisionero.", "urdu": " اور اس (خدا) کی محبت پر مسکین اور یتیم اور اسیر کو کھانا کھلاتے ہیں۔"}, {"arabic": " اِنَّمَا نُطۡعِمُکُمۡ لِوَجۡہِ اللّٰہِ لَا نُرِیۡدُ مِنۡکُمۡ جَزَآءً وَّ لَا شُکُوۡرًا ﴿۱۰﴾", "english": " Saying , ‘We feed you for Allah’s pleasure only . We desire no reward nor thanks from you.", "french": " En leur disant : « Nous vous donnons à manger uniquement pour le plaisir d’Allāh. Nous ne désirons de vous ni récompense ni remerciements.", "german": "", "spanish": " Diciendo; “Os damos de comer sólo por agradar a Al-lah. No deseamos ni recompensa ni vuestro agradecimiento”.", "urdu": " اور کہتے جاتے ہیں کہ اے لوگو! ہم تم کو صرف اللہ کی رضا کے لئے کھانا کھلاتے ہیں نہ ہم تم سے کوئی جزا طلب کرتے ہیں نہ تمہارا شکر چاہتے ہیں۔"}], "Surah": 76}