{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " قَدۡ سَمِعَ اللّٰہُ قَوۡلَ الَّتِیۡ تُجَادِلُکَ فِیۡ زَوۡجِہَا وَ تَشۡتَکِیۡۤ اِلَی اللّٰہِ ٭ۖ وَ اللّٰہُ یَسۡمَعُ تَحَاوُرَکُمَا ؕ اِنَّ اللّٰہَ سَمِیۡعٌۢ بَصِیۡرٌ ﴿۲﴾", "english": " Allah has indeed heard the speech of her who pleads with thee concerning her husband, and complains unto Allah. And Allah has heard your dialogue. Verily, Allah is All-Hearing, All-Seeing.", "french": " Allāh a en effet entendu la prière de celle qui discute avec toi au sujet de son mari, et qui se plaint à Allāh. Et Allāh a entendu votre dialogue. En vérité, Allāh entend tout, et voit tout .", "german": " Allah hat das Wort jener gehört, die bei dir wegen ihres Mannes vorstellig wurde und sich vor Allah beklagte. Und Allah hat euer Gespräch gehört; denn Allah ist allhörend, allsehend.", "spanish": " Al-lah ha oído en verdad la argumentación de la que disputa contigo en relación con su marido y se queja a Al-lah. Y Al-lah ha oído vuestro diálogo. En verdad, Al-lah es Omnioyente, Omnividente.", "urdu": " اللہ نے اس عورت کی دعا سن لی‘ جو اپنے خاوند کے متعلق تجھ سے بحث کرتی تھی اور اللہ سے فریاد کرتی تھی‘ اور اللہ تم دونوں کی بحث سن رہا تھا۔ اللہ یقیناً بہت سننے والا (اور) دیکھنے والا ہے۔"}, {"arabic": " اَلَّذِیۡنَ یُظٰہِرُوۡنَ مِنۡکُمۡ مِّنۡ نِّسَآئِہِمۡ مَّا ہُنَّ اُمَّہٰتِہِمۡ ؕ اِنۡ اُمَّہٰتُہُمۡ اِلَّا الّٰٓیِٴۡ وَلَدۡنَہُمۡ ؕ وَ اِنَّہُمۡ لَیَقُوۡلُوۡنَ مُنۡکَرًا مِّنَ الۡقَوۡلِ وَ زُوۡرًا ؕ وَ اِنَّ اللّٰہَ لَعَفُوٌّ غَفُوۡرٌ ﴿۳﴾", "english": " Those among you who put away their wives by calling them mothers — they do not become their mothers; their mothers are only those who gave them birth; and they certainly utter words that are manifestly evil and untrue; but surely Allah is the Effacer of sins, Most Forgiving.", "french": " Ceux d’entre vous qui mettent à l’écart leurs épouses en les appelant mères – elles ne deviennent pas leurs mères ; seule est leur mère celle qui leur a donné naissance ; et assurément ils prononcent des mots qui sont blâmables et faux ; mais assurément Allāh est Effaceur de péchés et est Très-Pardonnant.", "german": " Die unter euch, die ihre Frauen Mütter nennen – sie werden nicht ihre Mütter; ihre Mütter sind einzig jene, die sie geboren haben; und sie äußern da nur Worte, die unziemlich und unwahr sind; doch wahrlich, Allah ist Tilger der Sünden, allverzeihend.", "spanish": " Aquellos de entre vosotros que repudian a sus mujeres llamándolas madres, no por ello se convierten en sus madres; sus madres sólo son quienes les dieron a luz; y en verdad profieren palabras claramente perversas y falsas; pero ciertamente Al-lah es el Absolvedor de los pecados, el Sumo Indulgente.", "urdu": " (سو یاد رکھو کہ) تم میں سے جو لوگ اپنی بیویوں کو ماں کہہ بیٹھیں تو اس کہنے سے وہ ان کی مائیں نہیں ہو جاتیں‘ ان کی مائیں وہی ہیں جنہوں نے ان کو جنا ہے اور (جو کچھ وہ غلطی سے کہہ بیٹھتے ہیں ان کی نسبت یہی کہا جا سکتا ہے کہ) وہ ایک ناپسندیدہ اور جھوٹ بات کہتے ہیں اور اللہ یقیناً بہت معاف کرنے والا (اور) بہت بخشنے والا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یُظٰہِرُوۡنَ مِنۡ نِّسَآئِہِمۡ ثُمَّ یَعُوۡدُوۡنَ لِمَا قَالُوۡا فَتَحۡرِیۡرُ رَقَبَۃٍ مِّنۡ قَبۡلِ اَنۡ یَّتَمَآسَّا ؕ ذٰلِکُمۡ تُوۡعَظُوۡنَ بِہٖ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ خَبِیۡرٌ ﴿۴﴾", "english": " As to those who call their wives mothers, and then would go back on what they have said, the penalty for it is the freeing of a slave before they touch each other. This is what you are admonished with. And Allah is Well-Aware of what you do.", "french": " Quant à ceux qui mettent à l’écart leurs épouses en les appelant mères, et qui voudraient ensuite revenir sur ce qu’ils ont dit, ils doivent au préalable affranchir un esclave avant qu’ils se touchent. Vous êtes exhortés à agir ainsi. Et Allāh est Très-Conscient de ce que vous faites.", "german": " Jene nun, die ihre Frauen Mütter nennen und dann zurücknehmen möchten, was sie gesagt – (die Buße dafür) ist die Befreiung eines Sklaven, bevor sie einander berühren. Dies, um euch zu ermahnen. Und Allah ist wohl kundig dessen, was ihr tut.", "spanish": " En cuanto a quienes llaman madres a sus esposas y después se retractan de lo que han dicho, el castigo por ello es la liberación de un esclavo antes de tocarse mutuamente. Con esto es con lo que se os amonesta. Pues Al-lah es Perfectamente Consciente de lo que hacéis.", "urdu": " اور وہ لوگ جو اپنی بیویوں کو ماں کہہ دیتے ہیں پھر اس کے بعد (باوجود خداتعالیٰ کے منع کرنے کے) جو کچھ انہوں نے کہا تھا اس کی طرف لوٹ کے آتے ہیں ان کے لئے ضروری ہے کہ قبل اس کے کہ وہ دونوں (یعنی میاں بیوی) ایک دوسرے کو چھوئیں ایک غلام آزاد کریں‘ یہ وہ (بات) ہے جس کی تمہیں نصیحت کی جاتی ہے اور اللہ تمہارے اعمال سے خوب آگاہ ہے۔"}, {"arabic": " فَمَنۡ لَّمۡ یَجِدۡ فَصِیَامُ شَہۡرَیۡنِ مُتَتَابِعَیۡنِ مِنۡ قَبۡلِ اَنۡ یَّتَمَآسَّا ۚ فَمَنۡ لَّمۡ یَسۡتَطِعۡ فَاِطۡعَامُ سِتِّیۡنَ مِسۡکِیۡنًا ؕ ذٰلِکَ لِتُؤۡمِنُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ ؕ وَ تِلۡکَ حُدُوۡدُ اللّٰہِ ؕ وَ لِلۡکٰفِرِیۡنَ عَذَابٌ اَلِیۡمٌ ﴿۵﴾", "english": " But whoso does not find one , he must fast for two successive months, before they touch each other. And whoso is not able to do so, should feed sixty poor people. This is so , that you may truly believe in Allah and His Messenger. And these are the limits prescribed by Allah; and for the disbelievers is a painful punishment.", "french": " Mais quiconque n’ en trouve pas, il doit jeûner pendant deux mois consécutifs, avant qu’ils se touchent. Et quiconque ne peut pas faire cela , doit donner à manger à soixante indigents. Ceci est ainsi , afin que vous croyiez vraiment en Allāh et en Son Messager. Et celles-ci sont les limites prescrites par Allāh, et pour les mécréants il y a un châtiment douloureux.", "german": " Wer aber keinen findet, dann: zwei Monate hintereinander fasten, bevor sie einander berühren. Und wer es nicht vermag, dann: Speisung von sechzig Armen. Dies, damit ihr euch Allah ergebt und Seinem Gesandten. Das sind die Schranken Allahs; und für die Ungläubigen ist qualvolle Strafe.", "spanish": " Pero quien no encuentra uno , debe ayunar durante dos meses seguidos, antes de que se toquen recíprocamente. Y quien no pueda hacerlo, dará de comer a sesenta necesitados. Esto es así , para que creáis ciertamente en Al-lah y en Su Mensajero. Éstos son los límites prescritos por Al-lah; mas para los incrédulos hay un doloroso castigo.", "urdu": " اور جو شخص (غلام) نہ پائے وہ متواتر دو مہینے کے روزے رکھے پیشتر اس کے کہ وہ دونوں ایک دوسرے کو چھوئیں اور جس میں یہ طاقت بھی نہ ہو تو ساٹھ مسکینوں کو کھانا کھلائے۔ یہ (حکم) اس لئے (دیا گیا) ہے تا (کہ) تم اللہ اور اس کے رسول کی بات کو مانا کرو۔ اور یہ اللہ کی حدیں ہیں اور کافروں کے لئے دردناک عذاب (مقرر) ہے ۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یُحَآدُّوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ کُبِتُوۡا کَمَا کُبِتَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ وَ قَدۡ اَنۡزَلۡنَاۤ اٰیٰتٍۭ بَیِّنٰتٍ ؕ وَ لِلۡکٰفِرِیۡنَ عَذَابٌ مُّہِیۡنٌ ۚ﴿۶﴾", "english": " Those who oppose Allah and His Messenger will surely be abased even as those before them were abased; and We have already sent down clear Signs. And the disbelievers will have an humiliating punishment.", "french": " Ceux qui s’opposent à Allāh et à Son Messager seront sûrement humiliés, comme leurs devanciers ont été humiliés ; et Nous avons déjà envoyé des Signes clairs. Et les mécréants auront un châtiment humiliant.", "german": " Diejenigen, die sich Allah und Seinem Gesandten widersetzen, die werden gewiss erniedrigt werden, eben wie die vor ihnen erniedrigt wurden; denn Wir haben bereits deutliche Zeichen herniedergesandt. Und den Ungläubigen wird eine schmähliche Strafe.", "spanish": " Quienes se opongan a Al-lah y a Su Mensajero serán ciertamente humillados al igual que lo fueron quienes los precedieron; pues hemos revelado ya Signos manifiestos. Y los incrédulos sufrirán un castigo humillante.", "urdu": " جو لوگ اللہ اور اس کے رسول کے حکم کے خلاف جاتے ہیں وہ ذلیل کیے جائیں گے۔ جس طرح ان سے پہلے لوگ ذلیل کیے گئے۔ اور ہم اپنے واضح احکام اتار چکے ہیں۔ اور جو لوگ (ان واضح احکام کا) انکار کریں گے ان کو رسوا کرنے والا عذاب پہنچے گا۔"}, {"arabic": " یَوۡمَ یَبۡعَثُہُمُ اللّٰہُ جَمِیۡعًا فَیُنَبِّئُہُمۡ بِمَا عَمِلُوۡا ؕ اَحۡصٰہُ اللّٰہُ وَ نَسُوۡہُ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ شَہِیۡدٌ ٪﴿۷﴾", "english": " On the day when Allah will raise them all together, He will inform them of what they did. Allah has kept account of it, while they forgot it. And Allah is Witness over all things.", "french": " Le jour où Allāh les ressuscitera tous ensemble, Il les informera de ce qu’ils faisaient. Allāh en a tenu le compte, tandis qu’eux, ils l’ont oublié. Et Allāh est Témoin de toutes choses.", "german": " Am Tage, da Allah sie alle zusammen auferweckt, da wird Er ihnen verkünden, was sie getan. Allah hat Rechnung darüber geführt, während sie es vergaßen. Und Allah ist Zeuge über alle Dinge.", "spanish": " En el día en que Al-lah los resucite a todos, les informará de lo que hicieron. Al-lah conserva la cuenta, aunque ellos lo hayan olvidado, pues Al-lah es Testigo sobre todas las cosas.", "urdu": " جس دن اللہ ان سب کو جمع کرکے اٹھائے گا اور ان کے ان اعمال کی خبر دے گا جو اللہ نے تو گن رکھے ہیں مگر وہ ان کو بھول گئے ہیں اور اللہ ہر ایک چیز پر نگران ہے۔"}, {"arabic": " اَلَمۡ تَرَ اَنَّ اللّٰہَ یَعۡلَمُ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ مَا یَکُوۡنُ مِنۡ نَّجۡوٰی ثَلٰثَۃٍ اِلَّا ہُوَ رَابِعُہُمۡ وَ لَا خَمۡسَۃٍ اِلَّا ہُوَ سَادِسُہُمۡ وَ لَاۤ اَدۡنٰی مِنۡ ذٰلِکَ وَ لَاۤ اَکۡثَرَ اِلَّا ہُوَ مَعَہُمۡ اَیۡنَ مَا کَانُوۡا ۚ ثُمَّ یُنَبِّئُہُمۡ بِمَا عَمِلُوۡا یَوۡمَ الۡقِیٰمَۃِ ؕ اِنَّ اللّٰہَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۸﴾", "english": " Dost thou not see that Allah knows all that is in the heavens and all that is in the earth? There is no secret counsel of three, but He is their fourth, nor of five, but He is their sixth, nor of less than that, nor of more, but He is with them wheresoever they may be. Then on the Day of Resurrection He will inform them of what they did. Surely, Allah knows all things full well.", "french": " Ne vois-tu pas qu’Allāh sait tout ce qui est dans les cieux et tout ce qui est sur la terre ! Il n’y a aucun entretien secret à trois, qu’Il n’en soit le quatrième, ni de cinq qu’Il n’en soit le sixième, ni de moins ni de plus que cela, sans qu’Il ne soit avec eux où qu’ils puissent être. Puis, au Jour de la Résurrection, Il les informera de ce qu’ils faisaient. Assurément, Allāh connaît toutes choses très bien.", "german": " Siehst du denn nicht, dass Allah alles weiß, was in den Himmeln ist, und alles, was auf Erden ist? Keine geheime Unterredung zwischen dreien gibt es, bei der Er nicht vierter wäre, noch eine zwischen fünfen, bei der Er nicht sechster wäre, noch zwischen weniger oder mehr als diesen, ohne dass Er mit ihnen wäre, wo immer sie sein mögen. Dann wird Er ihnen am Tage der Auferstehung verkünden, was sie getan. Wahrlich, Allah weiß alle Dinge.", "spanish": " ¿No ves que Al-lah conoce todo lo que hay en los cielos y todo lo que hay en la tierra? No hay conversación secreta de tres in que Él sea el cuarto, ni de cinco, sin que Él sea el sexto, ni de un número mayor o menor, sin que Él esté con ellos dondequiera que estén. Luego, en el Día de la Resurrección, les informará de lo que hicieron. En verdad, Al-lah conoce muy bien todas las cosas.", "urdu": " کیا تجھے معلوم نہیں کہ آسمانوں اور زمین میں جو کچھ بھی ہے‘ اللہ اس کو جانتا ہے۔ دنیا میں کوئی تین آدمی علیحدہ مشورہ کرنے والے نہیں ہوتے جبکہ وہ ان کا چوتھا نہ ہو‘ اور نہ پانچ مشورہ کرنے والے ہوتے ہیں جبکہ وہ ان کا چھٹا نہ ہو اور نہ اس تعداد سے کم ہوتے ہیں نہ زیادہ کہ وہ (ہر صورت میں) ان کے ساتھ ہوتا ہے خواہ وہ کہیں بھی (مشورہ کر رہے) ہوں۔ پھر وہ ان کے اعمال کی قیامت کے دن ان کو خبر دے گا‘ اللہ ہر ایک چیز کو جاننے والا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ نُہُوۡا عَنِ النَّجۡوٰی ثُمَّ یَعُوۡدُوۡنَ لِمَا نُہُوۡا عَنۡہُ وَ یَتَنٰجَوۡنَ بِالۡاِثۡمِ وَ الۡعُدۡوَانِ وَ مَعۡصِیَتِ الرَّسُوۡلِ ۫ وَ اِذَا جَآءُوۡکَ حَیَّوۡکَ بِمَا لَمۡ یُحَیِّکَ بِہِ اللّٰہُ ۙ وَ یَقُوۡلُوۡنَ فِیۡۤ اَنۡفُسِہِمۡ لَوۡ لَا یُعَذِّبُنَا اللّٰہُ بِمَا نَقُوۡلُ ؕ حَسۡبُہُمۡ جَہَنَّمُ ۚ یَصۡلَوۡنَہَا ۚ فَبِئۡسَ الۡمَصِیۡرُ ﴿۹﴾", "english": " Hast thou not seen those who were forbidden to hold secret counsels and again return to what they were forbidden, and confer secretly for sin and transgression and disobedience to the Messenger? And when they come to thee, they greet thee with a greeting with which Allah has not greeted thee; but among themselves they say, ‘Why does not Allah punish us for what we say?’ Sufficient for them is Hell, wherein they will burn; and a most evil destination it is!", "french": " N’as-tu pas vu ceux à qui les entretiens secrets ont été interdits, et qui reviennent à ce qui leur a été interdit, et qui confèrent secrètement pour le péché et la transgression, et pour la désobéissance au Messager ? Et lorsqu’ils viennent à toi, ils te saluent d’une salutation dont Allāh ne t’a pas salué ; mais ils se disent entre eux : « Pourquoi Allāh ne nous punit-Il pas pour ce que nous disons ? » L’Enfer leur suffit, dans lequel ils brûleront ; et quelle mauvaise destination !", "german": " Hast du nicht die beobachtet, denen geheime Verschwörung verboten ward und die doch zurückkehren zu dem, was ihnen verboten ward, und sich insgeheim verschwören zu Sünde und Übertretung und Ungehorsam gegen den Gesandten? Und wenn sie zu dir kommen, so begrüßen sie dich mit dem, womit dich nicht Allah begrüßt hat; bei sich aber sprechen sie: \"Warum straft uns Allah nicht für das, was wir (wider ihn) sprechen?\" Genügend für sie ist die Hölle, worin sie eingehen werden; und übel ist die Bestimmung!", "spanish": " ¿No has visto a quienes se les prohibió celebrar conversaciones secretas y que volvieron, sin embargo, a lo que se les prohibió; que tratan en secreto del pecado, la trasgresión y la esobediencia al Mensajero? Mas cuando llegan a ti, te saludan con un saludo con el que Al-lah no te ha saludado; mas entre ellos se dicen: “¿Por qué Al-lah no nos castiga por lo que decimos?”. Les bastará el Infierno en el que arderán; ¡qué pésimo destino es!", "urdu": " کیا تو نے ان (لوگوں) کو نہیں دیکھا جن کو خفیہ سازشوں سے منع کیا گیا پھر بھی وہ اس ممنوع چیز کی طرف لوٹتے ہی رہتے ہیں اور گناہ اور زیادتی اور رسول کی نافرمانی کی باتوں کے متعلق مشورہ کرتے ہیں اور جب وہ تیرے پاس آتے ہیں تو تجھے ایسے لفظوں میں دعا دیتے ہیں جن (لفظوں) میں خدا نے دعا نہیں دی اور اپنے دلوں میں کہتے ہیں کہ کیوں اللہ ہمارے (منافقانہ) قول کی وجہ سے ہمیں عذاب نہیں دیتا۔ جہنم ان لوگوں کے لئے کافی ہے۔ وہ اس میں داخل ہونگے اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا تَنَاجَیۡتُمۡ فَلَا تَتَنَاجَوۡا بِالۡاِثۡمِ وَ الۡعُدۡوَانِ وَ مَعۡصِیَتِ الرَّسُوۡلِ وَ تَنَاجَوۡا بِالۡبِرِّ وَ التَّقۡوٰی ؕ وَ اتَّقُوا اللّٰہَ الَّذِیۡۤ اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۱۰﴾", "english": " O ye who believe! when you confer together in secret, confer not for the commission of sin and transgression and disobedience to the Messenger, but confer for the attainment of virtue and righteousness, and fear Allah unto Whom you shall all be gathered.", "french": " Ô vous qui croyez ! lorsque vous conférez ensemble en secret, ne conférez donc pas pour commettre le péché et la transgression, et pour la désobéissance au Messager, mais conférez pour atteindre la vertu et la piété, et craignez Allāh auprès de Qui vous serez tous rassemblés.", "german": " O die ihr glaubt, wenn ihr euch heimlich miteinander beredet, beredet euch nicht zu Sünde und Übertretung und Ungehorsam gegen den Gesandten, sondern beredet euch zu Tugend und Rechtschaffenheit, und fürchtet Allah, zu Dem ihr versammelt werdet.", "spanish": " ¡Oh vosotros, los creyentes! Cuando habléis en secreto, no habléis para cometer pecado, trasgresión y desobediencia al Mensajero, sino sobre la manera de alcanzar la virtud y la justicia, y temed a Al-lah, hacia Quien seréis todos reunidos.", "urdu": " اے مومنو! جب کبھی خفیہ مشورہ کرو تو گناہ کی بات اور زیادتی کی بات پر خفیہ مشورے نہ کیا کرو اور نہ رسول کی نافرمانی کی باتوں پر۔ بلکہ نیکی کی باتوں پر اور تقویٰ کی باتوں پر مشورہ کیا کرو‘ اور اللہ کا تقویٰ اختیار کیا کرو‘ جس کی طرف تم سب کو (زندہ کرکے) لوٹایا جائے گا۔"}, {"arabic": " اِنَّمَا النَّجۡوٰی مِنَ الشَّیۡطٰنِ لِیَحۡزُنَ الَّذِیۡنَ اٰمَنُوۡا وَ لَیۡسَ بِضَآرِّہِمۡ شَیۡئًا اِلَّا بِاِذۡنِ اللّٰہِ ؕ وَ عَلَی اللّٰہِ فَلۡیَتَوَکَّلِ الۡمُؤۡمِنُوۡنَ ﴿۱۱﴾", "english": " Holding of secret counsels for evil purposes is only of Satan, that he may cause grief to those who believe; but it cannot harm them in the least, except by Allah’s leave. And in Allah should the believers put their trust.", "french": " La tenue de réunions secrètes à de mauvaises fins ne provient que de Satan, afin qu’il puisse occasionner de l’affliction à ceux qui croient ; mais cela ne peut leur nuire nullement, sauf par la permission d’Allāh. Et c’est en Allāh que les croyants doivent placer leur confiance.", "german": " Geheime Verschwörung ist allein von Satan, auf dass er die betrübe, die gläubig sind; doch er kann ihnen nicht den geringsten Schaden zufügen, es sei denn mit Allahs Erlaubnis. Und auf Allah sollen die Gläubigen vertrauen.", "spanish": " La celebración de conversaciones secretas para fines perversos sólo corresponde a Satanás, para causar aflicción a los creyentes; aunque no puede perjudicarles en nada, salvo que Al-lah lo quiera. Y en Al-lah deben los creyentes poner su confianza.", "urdu": " خفیہ مشورہ کرنے کا طریق شیطان کی طرف سے آیا ہے اور اس کی غرض یہ ہے کہ مومنوں کو فکر میں ڈالے اور وہ ان کو اللہ کے حکم کے بغیر کچھ بھی نقصان نہیں پہنچا سکتا اور چاہیے کہ مومن صرف اللہ پر توکل کریں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا قِیۡلَ لَکُمۡ تَفَسَّحُوۡا فِی الۡمَجٰلِسِ فَافۡسَحُوۡا یَفۡسَحِ اللّٰہُ لَکُمۡ ۚ وَ اِذَا قِیۡلَ انۡشُزُوۡا فَانۡشُزُوۡا یَرۡفَعِ اللّٰہُ الَّذِیۡنَ اٰمَنُوۡا مِنۡکُمۡ ۙ وَ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ دَرَجٰتٍ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ خَبِیۡرٌ ﴿۱۲﴾", "english": " O ye who believe! when it is said to you, ‘Make room!’ in your assemblies, then do make room; Allah will make ample room for you. And when it is said, ‘Rise up!’ then rise up; Allah will raise those who believe from among you, and those to whom knowledge is given, to degrees of rank . And Allah is Well-Aware of what you do.", "french": " Ô vous qui croyez ! lorsqu’on vous dit : « Faites place ! » dans vos réunions, alors faites place ; Allāh fera amplement de la place pour vous. Et lorsqu’on dit : « Levez-vous ! » alors levez-vous ; Allāh élèvera à des rangs éminents ceux d’entre vous qui croient, et ceux à qui la connaissance a été donnée. Et Allāh est Très-Conscient de ce que vous faites.", "german": " O die ihr glaubt, wenn in Versammlungen zu euch gesprochen wird: \"Macht Platz!\" – dann macht Platz; Allah wird ausgiebigen Platz für euch machen. Und wenn gesprochen wird: \"Erhebt euch!\" – dann erhebt euch; Allah wird die unter euch, die gläubig sind, und die, denen Wissen gegeben ward, in Rängen erhöhen. Und Allah ist wohl kundig dessen, was ihr tut.", "spanish": " ¡Oh vosotros, los creyentes! Cuando se os dice: “¡Haced sitio!” en vuestras reuniones, haced sitio; Al-lah os hará un sitio amplio. Y Cuando se dice: “¡Levantaos y partid!” , entonces levantaos; Al-lah elevará a los creyentes de entre vosotros y a quienes se les dé el conocimiento, a grados de dignidad. Pues Al-lah conoce muy bien lo que hacéis.", "urdu": " اے مومنو! جب تم سے یہ کہا جائے کہ مجالس میں کھل کر بیٹھ جاٶ‘ تو کھل کر بیٹھ جایا کرو۔ اللہ بھی تمہارے لئے کشادگی کے سامان پیدا کرے گا۔ اور جب تمہیں کہا جائے کہ اٹھ جاٶ تو اٹھ جایا کرو۔ اللہ ان کو جو کہ مومن ہیں اور علم حقیقی رکھنے والے ہیں درجات میں بڑھا دے گا اور اللہ تمہارے اعمال سے خوب خبردار ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا نَاجَیۡتُمُ الرَّسُوۡلَ فَقَدِّمُوۡا بَیۡنَ یَدَیۡ نَجۡوٰٮکُمۡ صَدَقَۃً ؕ ذٰلِکَ خَیۡرٌ لَّکُمۡ وَ اَطۡہَرُ ؕ فَاِنۡ لَّمۡ تَجِدُوۡا فَاِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۳﴾", "english": " O ye who believe! when you consult the Messenger in private, give alms before your consultation. That is better for you and purer. But if you find not anything to give , then Allah is Most Forgiving, Merciful.", "french": " Ô vous qui croyez ! quand vous consultez le Messager en particulier, faites une offrande avant votre consultation. Cela est plus avantageux pour vous, et plus pur aussi . Mais si vous ne trouvez rien à donner , alors Allāh est Très-Pardonnant, Miséricordieux.", "german": " O die ihr glaubt, wenn ihr euch mit dem Gesandten vertraulich beraten wollt, so schickt Almosen eurer vertraulichen Beratung voraus. Das ist besser für euch und lauterer. Wenn ihr aber nicht (die Möglichkeit dazu) findet, dann ist Allah fürwahr allverzeihend, barmherzig.", "spanish": " ¡Oh vosotros, los creyentes! Cuando consultéis al Mensajero en privado, entregad una ofrenda antes de la consulta. Esto es mejor y más puro para vosotros. Pero si no encontráis nada que dar , sabed que Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اے ایمان دارو! جب تم رسول سے الگ مشورہ کرنا چاہو تو اپنے مشورہ سے پہلے کچھ صدقہ دیا کرو۔ یہ تمہارے لئے اچھا ہوگا اور دل کو پاک کرنے کا موجب ہوگا (مگر یہ حکم انہی کے لئے ہے جن کو توفیق ہو) اگر تم (کوئی چیز بھی صدقہ کے لئے) نہ پاٶ تو (ڈرو نہیں) اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " ءَاَشۡفَقۡتُمۡ اَنۡ تُقَدِّمُوۡا بَیۡنَ یَدَیۡ نَجۡوٰٮکُمۡ صَدَقٰتٍ ؕ فَاِذۡ لَمۡ تَفۡعَلُوۡا وَ تَابَ اللّٰہُ عَلَیۡکُمۡ فَاَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ وَ اَطِیۡعُوا اللّٰہَ وَ رَسُوۡلَہٗ ؕ وَ اللّٰہُ خَبِیۡرٌۢ بِمَا تَعۡمَلُوۡنَ ﴿٪۱۴﴾", "english": " Are you afraid of giving alms before your consultation? So, when you do not do so and Allah has been merciful to you, then observe Prayer and pay the Zakat and obey Allah and His Messenger. And Allah is Well-Aware of what you do.", "french": " Avez-vous peur de faire des offrandes avant votre consultation particulière ? Et quand vous ne le s faites pas, et qu’Allāh vous pardonne, alors il sera suffisant pour vous que vous observiez la Prière, et payiez la Zakāt, et obéissiez à Allāh et à Son Messager. Et Allāh est Très-Conscient de ce que vous faites.", "german": " Seid ihr unruhig in Bezug auf das Geben von Almosen vor eurer vertraulichen Beratung? Nun denn, wenn ihr es nicht tut und Allah euch in Seine Barmherzigkeit aufnimmt, dann verrichtet das Gebet und zahlet die Zakât und gehorchet Allah und Seinem Gesandten Und Allah ist wohl kundig dessen, was ihr tut.", "spanish": " ¿Teméis entregar ofrendas antes de vuestra consulta? Pero si no lo hacéis -y que Al-lah os perdone-, debería bastar que cumpláis la Oración, paguéis el Zakat y obedezcáis a Al-lah y a Su Mensajero. Pues Al-lah conoce muy bien lo que hacéis.", "urdu": " کیا تم مشورہ کرنے سے پہلے صدقہ دینے سے ڈر گئے؟ سو چونکہ تم نے ایسا نہیں کیا اور اللہ نے تم پر فضل فرما دیا ہے پس تم نمازیں قائم کرو‘ اور زکٰوتیں دو اور اللہ اور اس کے رسول کی اطاعت کرو۔ اور جو کچھ تم کرتے ہو اللہ اسے خوب جانتا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ تَوَلَّوۡا قَوۡمًا غَضِبَ اللّٰہُ عَلَیۡہِمۡ ؕ مَا ہُمۡ مِّنۡکُمۡ وَ لَا مِنۡہُمۡ ۙ وَ یَحۡلِفُوۡنَ عَلَی الۡکَذِبِ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۱۵﴾", "english": " Hast thou not seen those who make friends with a people with whom Allah is wroth? They are neither of you nor of them, and they swear to falsehood knowingly.", "french": " N’as-tu pas vu ceux qui se lient d’amitié avec un peuple contre qui Allāh est courroucé ! Ils ne sont ni des vôtres ni des leurs, et ils jurent des mensonges alors qu’ils savent.", "german": " Hast du nicht die gesehen, die sich ein Volk zu Freunden nehmen, dem Allah zürnt? Sie gehören weder zu euch noch zu ihnen, und Sie beschwören wissentlich eine Lüge.", "spanish": " ¿No has visto a quienes hacen amistad con las personas con quienes Al-lah está enojado? No son ni de vosotros ni de ellos, y juran en falso, a sabiendas.", "urdu": " کیا تو نے ان لوگوں کو طرف بھی دیکھا جنہوں نے ایسی قوم سے دوستی کی جن پر خدا نے غضب نازل کیا تھا۔ ایسے لوگ نہ تم میں سے ہیں نہ ان میں سے اور وہ جھوٹی بات پر جان بوجھ کر قسمیں کھاتے ہیں۔"}, {"arabic": " اَعَدَّ اللّٰہُ لَہُمۡ عَذَابًا شَدِیۡدًا ؕ اِنَّہُمۡ سَآءَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۶﴾", "english": " Allah has prepared for them a severe punishment. Evil indeed is that which they used to do.", "french": " Allāh a préparé pour eux un châtiment rigoureux. En vérité mauvais est ce qu’ils faisaient.", "german": " Allah hat für sie eine strenge Strafe bereitet. Übel ist fürwahr, was sie zu tun pflegen.", "spanish": " Al-lah ha preparado para ellos un duro castigo. Malo es en verdad lo que solían hacer.", "urdu": " اللہ نے ان کے لئے سخت عذاب تیار کر رکھا ہے۔ ان کے اعمال نہایت برے ہیں۔"}, {"arabic": " اِتَّخَذُوۡۤا اَیۡمَانَہُمۡ جُنَّۃً فَصَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ فَلَہُمۡ عَذَابٌ مُّہِیۡنٌ ﴿۱۷﴾", "english": " They have made their oaths a screen for their misdeeds , and they turn men away from the path of Allah; for them, therefore, will be an humiliating punishment.", "french": " Ils ont fait de leurs serments un bouclier pour leurs méfaits , et ils empêchent les gens de suivre la voie d’Allāh ; il y aura donc pour eux un châtiment humiliant.", "german": " Sie haben ihre Eide zu einem Schild (für ihre Missetaten) gemacht, und sie machen abwendig vom Pfade Allahs; für sie wird darum eine erniedrigende Strafe sein.", "spanish": " Hicieron de sus juramentos una pantalla para sus malas acciones, y apartan a los hombres del camino de Al-lah; tendrán, por tanto, un castigo ignominioso.", "urdu": " انہوں نے اپنی قسموں کو ڈھال بنایا ہوا ہے اور وہ اللہ کے رستہ سے (ان قسموں کے ذریعہ سے) روکتے ہیں۔ پس ان کو رسوا کن عذاب ملے گا۔"}, {"arabic": " لَنۡ تُغۡنِیَ عَنۡہُمۡ اَمۡوَالُہُمۡ وَ لَاۤ اَوۡلَادُہُمۡ مِّنَ اللّٰہِ شَیۡئًا ؕ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ؕ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۱۸﴾", "english": " Neither their riches nor their children will avail them aught against Allah. They are the inmates of the Fire wherein they will abide.", "french": " Ni leurs biens ni leurs enfants ne leur serviront le moindrement contre Allāh. Ceux-là sont les habitants du Feu où ils demeureront longtemps.", "german": " Weder ihre Reichtümer noch ihre Kinder werden ihnen im geringsten nützen gegen Allah. Sie sind die Bewohner des Feuers; darin müssen sie bleiben.", "spanish": " Ni sus riquezas ni sus hijos les servirán de nada contra Al-lah. Son los moradores del Fuego, en donde vivirán.", "urdu": " نہ ان کے مال اور نہ ان کی اولاد اللہ کے مقابلہ میں کوئی نفع دے سکیں گے۔ یہ لوگ دوزخی ہیں‘ وہ اس میں رہتے چلے جائیں گے۔"}, {"arabic": " یَوۡمَ یَبۡعَثُہُمُ اللّٰہُ جَمِیۡعًا فَیَحۡلِفُوۡنَ لَہٗ کَمَا یَحۡلِفُوۡنَ لَکُمۡ وَ یَحۡسَبُوۡنَ اَنَّہُمۡ عَلٰی شَیۡءٍ ؕ اَلَاۤ اِنَّہُمۡ ہُمُ الۡکٰذِبُوۡنَ ﴿۱۹﴾", "english": " On the day when Allah will raise them all together, they will swear to Him even as they swear to you, and they will think that they have something to stand upon . Now surely it is they who are the liars.", "french": " Le jour où Allāh les ressuscitera tous ensemble, ils Lui jureront comme ils vous jurent, et ils s’imagineront avoir quelque chose sur quoi s’appuyer . Or, ce sont eux les menteurs.", "german": " Am Tage, da Allah sie versammeln wird allzumal, da werden sie Ihm schwören, wie sie euch schwören, und sie werden wähnen, sie stünden auf etwas. Horchet! sie sind es sicherlich, die Lügner sind.", "spanish": " En el día en que Al-lah los resucite a todos juntos, jurarán ante Él al igual que juran ante vosotros, y pensarán que tienen algo en lo que apoyarse . Mas en verdad son ellos los embusteros.", "urdu": " جس دن اللہ ان سب کو جمع کرکے اٹھائے گا تو اس کے سامنے بھی اسی طرح قسمیں کھائیں گے جس طرح تمہارے سامنے قسمیں کھاتے ہیں اور خیال کریں گے کہ وہ بڑے پختہ (اور معقول) اصول پر ہیں۔ سنو! یہ لوگ (باوجود اپنی قسموں کے) جھوٹے ہیں۔"}, {"arabic": " اِسۡتَحۡوَذَ عَلَیۡہِمُ الشَّیۡطٰنُ فَاَنۡسٰہُمۡ ذِکۡرَ اللّٰہِ ؕ اُولٰٓئِکَ حِزۡبُ الشَّیۡطٰنِ ؕ اَلَاۤ اِنَّ حِزۡبَ الشَّیۡطٰنِ ہُمُ الۡخٰسِرُوۡنَ ﴿۲۰﴾", "english": " Satan has gained mastery over them, and has made them forget the remembrance of Allah. They are Satan’s party. Now surely it is Satan’s party that are the losers.", "french": " Satan a réussi à les dominer, et à leur faire oublier le souvenir d’Allāh. Ils sont les partisans de Satan. Or, ce sont les partisans de Satan qui sont les perdants.", "german": " Satan hat völlige Macht über sie gewonnen und hat sie die Ermahnung Allahs vergessen lassen. Sie sind Satans Partei. Horchet! es ist Satans Partei, die die Verlierende ist.", "spanish": " Satanás ha conseguido dominarlos y les ha hecho olvidar el recuerdo de Al-lah. Son del partido de Satanás. Mas en, verdad, el partido de Satanás es el de los perdedores.", "urdu": " شیطان ان پر غالب آگیا ہے اور اس نے اللہ کا ذکر ان کو بھلا دیا ہے۔ یہ لوگ شیطان کا گروہ ہیں اور سن رکھو کہ شیطان کا گروہ آخر گھاٹا پانے والا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یُحَآدُّوۡنَ اللّٰہَ وَ رَسُوۡلَہٗۤ اُولٰٓئِکَ فِی الۡاَذَلِّیۡنَ ﴿۲۱﴾", "english": " Certainly those who oppose Allah and His Messenger will be among the lowest.", "french": " Certainement, ceux qui s’opposent à Allāh et à Son Messager, ceux-là sont parmi les plus vils.", "german": " Fürwahr jene, die sich Allah und Seinem Gesandten widersetzen, werden unter den Niedrigsten sein.", "spanish": " Ciertamente quienes se oponen a Al-lah y a Su Mensajero estarán entre los más envilecidos.", "urdu": " یقیناً جو لوگ اللہ اور اس کے رسول کی مخالفت کرتے ہیں۔ وہ سخت ذلیل لوگوں میں شمار ہونگے۔"}, {"arabic": " کَتَبَ اللّٰہُ لَاَغۡلِبَنَّ اَنَا وَ رُسُلِیۡ ؕ اِنَّ اللّٰہَ قَوِیٌّ عَزِیۡزٌ ﴿۲۲﴾", "english": " Allah has decreed: ‘Most surely I will prevail, I and My Messengers.’ Verily, Allah is Powerful, Mighty.", "french": " Allāh a décrété : « Je prévaudrai très certainement, Moi et Mes Messagers. » En vérité, Allāh est Fort, Puissant", "german": " Allah hat verordnet: Sicherlich werde Ich obsiegen, Ich und Meine Gesandten. Wahrlich, Allah ist stark, allmächtig.", "spanish": " Al-lah ha decretado: “En verdad Yo prevaleceré, Yo y Mis Mensajeros”. Ciertamente, Al-lah es Poderoso, Potente.", "urdu": " اللہ نے فیصلہ کر چھوڑا ہے کہ میں اور میرے رسول غالب آئیں گے۔ اللہ یقیناً طاقتور (اور) غالب ہے۔"}, {"arabic": " لَا تَجِدُ قَوۡمًا یُّؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ یُوَآدُّوۡنَ مَنۡ حَآدَّ اللّٰہَ وَ رَسُوۡلَہٗ وَ لَوۡ کَانُوۡۤا اٰبَآءَہُمۡ اَوۡ اَبۡنَآءَہُمۡ اَوۡ اِخۡوَانَہُمۡ اَوۡ عَشِیۡرَتَہُمۡ ؕ اُولٰٓئِکَ کَتَبَ فِیۡ قُلُوۡبِہِمُ الۡاِیۡمَانَ وَ اَیَّدَہُمۡ بِرُوۡحٍ مِّنۡہُ ؕ وَ یُدۡخِلُہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ رَضِیَ اللّٰہُ عَنۡہُمۡ وَ رَضُوۡا عَنۡہُ ؕ اُولٰٓئِکَ حِزۡبُ اللّٰہِ ؕ اَلَاۤ اِنَّ حِزۡبَ اللّٰہِ ہُمُ الۡمُفۡلِحُوۡنَ ﴿٪۲۳﴾", "english": " Thou wilt not find any people who believe in Allah and the Last Day loving those who oppose Allah and His Messenger, even though they be their fathers, or their sons or their brethren, or their kindred. These are they in whose hearts Allah has inscribed true faith and whom He has strengthened with inspiration from Himself. And He will make them enter Gardens through which streams flow. Therein will they abide. Allah is well pleased with them, and they are well pleased with Him. They are Allah’s party. Hearken ye O people ! it is Allah’s party who will be successful.", "french": " Tu ne trouveras pas des gens qui croient en Allāh et au Jour Dernier éprouver de l'affection pour ceux qui s’opposent à Allāh et à Son Messager, même si c’était leur père, ou leurs fils ou leurs frères, ou les membres de leur tribu. Ce sont ceux-là dans le cœur de qui Allāh a inscrit la vraie foi, et qu’Il a fortifiés par une parole émanant de Lui. Et Il les fera entrer dans des Jardins sous lesquels coulent des ruisseaux. Ils y demeureront éternellement. Allāh est très content d’eux, et ils sont très contents de Lui. Ceux-là sont les partisans d’Allāh. Ecoutez bien, ô vous les gens ! ce sont les partisans d’Allāh qui réussiront.", "german": " Du wirst kein Volke finden, das an Allah und an den Jüngsten Tag glaubt, und dabei die liebt, die sich Allah und Seinem Gesandten widersetzen, selbst wenn es ihre Väter wären oder ihre Söhne oder ihre Brüder oder ihre Verwandten. Das sind die, in deren Herzen Allah den Glauben eingeschrieben hat und die Er gestärkt hat mit Seinem eigenen Wort. Er wird sie in Gärten führen, durch die Ströme fließen. Darin werden sie weilen ewiglich. Allah ist wohl zufrieden mit ihnen, und sie sind wohl zufrieden mit Ihm. Sie sind Allahs Partei. Horchet! es ist Allahs Partei, die erfolgreich ist.", "spanish": " No encontrarás pueblo alguno que crea en Al-lah y en el Último Día y ame a quienes se oponen a Al-lah y a Su Mensajero, aun cuando sean sus padres, sus hijos, sus hermanos o sus familiares. Son aquellos en cuyos corazones Al-lah ha grabado la fe verdadera y a quienes Él ha fortalecido con una Palabra Suya. Él los hará entrar en Jardines por los que corren ríos. En ellos habitarán. Al-lah se congratula con ellos y ellos se congratulan con Él. Son del partido de Al-lah. ¡Oíd vosotros, humanos ! El partido de Al-lah es el que tendrá éxito.", "urdu": " تو ایسی قوم نہ پائے گا‘ جو اللہ اور یوم آخر پر بھی ایمان لاتی ہو اور اللہ اور اس کے رسول کی شدید مخالفت کرنے والے سے بھی محبت رکھتی ہو خواہ ایسے لوگ ان کے باپ ہوں یا بیٹے ہوں یا بھائی ہوں یا ان کے خاندان میں سے ہوں۔ یہی (مومن) ہیں جن کے دلوں میں اللہ نے ایمان نقش کر دیا ہے اور اپنی طرف سے کلام بھیج کر ان کی مدد کی ہے اور وہ ان کو ایسی جنتوں میں داخل کرے گا جن کے نیچے نہریں بہتی ہوں گی وہ ان میں رہتے چلے جائیں گے اللہ ان سے راضی ہو گیا اور وہ اللہ سے راضی ہو گئے۔ وہ اللہ کا گروہ ہیں (اور) سن رکھو کہ اللہ کا گروہ ہی کامیاب ہوا کرتا ہے۔"}], "Surah": 58}