{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " قَدۡ اَفۡلَحَ الۡمُؤۡمِنُوۡنَ ۙ﴿۲﴾", "english": " Surely, success does come to the believers,", "french": " Sans aucun doute, le succès viendra aux croyants,", "german": " Erfolg fürwahr krönt die Gläubigen,", "spanish": " En verdad llegará el éxito a los creyentes,", "urdu": " (کامل) مومن اپنی مراد کو پہنچ گئے۔"}, {"arabic": " الَّذِیۡنَ ہُمۡ فِیۡ صَلَاتِہِمۡ خٰشِعُوۡنَ ۙ﴿۳﴾", "english": " Who are humble in their Prayers,", "french": " Qui sont humbles dans leurs Prières,", "german": " die sich demütigen in ihren Gebeten", "spanish": " Que son diligentes en el cumplimiento de sus Oraciones.", "urdu": " وہ (مومن) جو اپنی نمازوں میں عاجزانہ رویہ اختیار کرتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ عَنِ اللَّغۡوِ مُعۡرِضُوۡنَ ﴿ۙ۴﴾", "english": " And who shun all that which is vain,", "french": " Et qui se détournent de tout ce qui est vain,", "german": " und die sich fernhalten von allem Eiteln,", "spanish": " Que rechazan todo lo que es vano.", "urdu": " اور جو لغو باتوں سے اعراض کرتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ لِلزَّکٰوۃِ فٰعِلُوۡنَ ۙ﴿۵﴾", "english": " And who are active in paying the Zakat,", "french": " Et qui sont prompts à payer la Zakāt,", "german": " und die nach Reinheit streben", "spanish": " Que practican activamente el Zakat,", "urdu": " اور جو زکٰوۃ (باقاعدہ) دیتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ لِفُرُوۡجِہِمۡ حٰفِظُوۡنَ ۙ﴿۶﴾", "english": " And who guard their chastity —", "french": " Et qui préservent leurs parties intimes –", "german": " und die ihre Sinnlichkeit im Zaum halten –", "spanish": " Y que preservan su castidad,", "urdu": " اور جو اپنی شرم گاہوں کی حفاظت کرتے ہیں۔"}, {"arabic": " اِلَّا عَلٰۤی اَزۡوَاجِہِمۡ اَوۡ مَا مَلَکَتۡ اَیۡمَانُہُمۡ فَاِنَّہُمۡ غَیۡرُ مَلُوۡمِیۡنَ ۚ﴿۷﴾", "english": " Except from their wives or what their right hands possess, for then they are not to be blamed;", "french": " Excepté de leurs femmes ou de celles que possèdent leurs mains droites, car assurément ils ne sont pas à blâmer ;", "german": " es sei denn mit ihren Gattinnen oder denen, die ihre Rechte besitzt, denn dann sind sie nicht zu tadeln;", "spanish": " Excepto con sus esposas o con lo que poseen sus manos derechas, por lo que no deben ser reprochados;", "urdu": " سوائے اپنی بیویوں کے یا جن کے مالک ان کے دائیں ہاتھ ہوئے ہیں۔ پس ایسے لوگوں کو کسی قسم کی ملامت نہیں کی جائے گی۔"}, {"arabic": " فَمَنِ ابۡتَغٰی وَرَآءَ ذٰلِکَ فَاُولٰٓئِکَ ہُمُ الۡعٰدُوۡنَ ۚ﴿۸﴾", "english": " But those who seek anything beyond that are the transgressors —", "french": " Mais ceux qui recherchent quoi que ce soit au-delà de cela, ceux-là sont les transgresseurs –", "german": " die aber darüber hinaus Gelüste tragen, die sind die Übertreter –,", "spanish": " Mas quienes buscan algo más allá, ésos son los transgresores,", "urdu": " اور جواس کے سوا کسی اور بات کی خواہش کریں تو وہ لوگ زیادتی کرنے والے ہوں گے۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ لِاَمٰنٰتِہِمۡ وَ عَہۡدِہِمۡ رٰعُوۡنَ ۙ﴿۹﴾", "english": " And who are watchful of their trusts and their covenants,", "french": " Et qui veillent sur les dépôts qui leur sont confiés et sur leurs engagements,", "german": " und die ihre Treue und ihre Verträge wahren", "spanish": " Quienes están atentos a sus acuerdos y pactos,", "urdu": " اور وہ لوگ (یعنی کامل مومن) جو اپنی امانتوں اور اپنے عہدوں کا خیال رکھتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ عَلٰی صَلَوٰتِہِمۡ یُحَافِظُوۡنَ ۘ﴿۱۰﴾", "english": " And who are strict in the observance of their Prayers.", "french": " Et qui surveillent leurs Prières.", "german": " und die streng auf ihre Gebete achten.", "spanish": " Y cumplen con diligencia sus Oraciones.", "urdu": " اور جو لوگ اپنی نمازوں کی حفاظت کرتے رہتے ہیں۔"}, {"arabic": " اُولٰٓئِکَ ہُمُ الۡوٰرِثُوۡنَ ﴿ۙ۱۱﴾", "english": " These are the heirs,", "french": " Ceux-là sont les héritiers,", "german": " Das sind die Erben,", "spanish": " Éstos son los herederos,", "urdu": " یہی لوگ اصل وارث ہیں۔"}, {"arabic": " الَّذِیۡنَ یَرِثُوۡنَ الۡفِرۡدَوۡسَ ؕ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۱۲﴾", "english": " Who will inherit Paradise. They will abide therein.", "french": " Qui hériteront du Paradis. Ils y demeureront éternellement.", "german": " die das Paradies ererben werden. Ewig werden sie darin weilen.", "spanish": " Que heredarán el Paraíso. Allí morarán.", "urdu": " جو فردوس کے وارث ہوں گے وہ اس میں ہمیشہ رہتے چلے جائیں گے۔"}, {"arabic": " وَ لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ مِنۡ سُلٰلَۃٍ مِّنۡ طِیۡنٍ ﴿ۚ۱۳﴾", "english": " Verily, We created man from an extract of clay;", "french": " En vérité, Nous avons créé l’homme d’un extrait d’argile ;", "german": " Wahrlich, Wir erschufen den Menschen aus reinstem Ton;", "spanish": " En verdad, creamos al hombre de un extracto de arcilla;", "urdu": " اور ہم نے انسان کو گیلی مٹی کے خلاصہ سے بنایا۔"}, {"arabic": " ثُمَّ جَعَلۡنٰہُ نُطۡفَۃً فِیۡ قَرَارٍ مَّکِیۡنٍ ﴿۪۱۴﴾", "english": " Then We placed him as a drop of sperm in a safe depository;", "french": " Puis Nous l’avons placé comme une goutte de sperme dans un réceptacle sûr ;", "german": " dann setzten Wir ihn als Samentropfen an eine sichere Ruhestätte;", "spanish": " Luego lo colocamos en forma de gota de esperma en un lugar seguro;", "urdu": " پھر اس کو ایک ٹھہرنے والی محفوظ جگہ میں نطفہ کے طور پر رکھا۔"}, {"arabic": " ثُمَّ خَلَقۡنَا النُّطۡفَۃَ عَلَقَۃً فَخَلَقۡنَا الۡعَلَقَۃَ مُضۡغَۃً فَخَلَقۡنَا الۡمُضۡغَۃَ عِظٰمًا فَکَسَوۡنَا الۡعِظٰمَ لَحۡمًا ٭ ثُمَّ اَنۡشَاۡنٰہُ خَلۡقًا اٰخَرَ ؕ فَتَبٰرَکَ اللّٰہُ اَحۡسَنُ الۡخٰلِقِیۡنَ ﴿ؕ۱۵﴾", "english": " Then We fashioned the sperm into a clot; then We fashioned the clot into a shapeless lump; then We fashioned bones out of this shapeless lump; then We clothed the bones with flesh; then We developed it into another creation. So blessed be Allah, the Best of creators.", "french": " Puis Nous avons façonné le sperme en un caillot adhérent ; puis Nous avons façonné le caillot adhérent en une boule informe ; puis de cette boule informe Nous avons façonné des os ; puis Nous avons revêtu les os de chair ; puis Nous l’avons développé en une autre création. Aussi, Béni est Allāh, le Meilleur des Créateurs !", "german": " dann bildeten Wir den Tropfen zu geronnenem Blut; dann bildeten Wir das geronnene Blut zu einem Fleischklumpen; dann bildeten Wir aus dem Fleischklumpen Knochen; dann bekleideten Wir die Knochen mit Fleisch; dann entwickelten Wir es zu einer anderen Schöpfung. So sei denn Allah gepriesen, der beste Schöpfer.", "spanish": " Acto seguido convertimos el esperma en un coágulo; después convertimos el coágulo en un trozo informe; más tarde formamos los huesos de este montón informe; después cubrimos los huesos con carne y, por último, lo desarrollamos en otra creación. Bendito sea Al-lah, el Mejor de los creadores.", "urdu": " پھر نطفہ کو ترقی دے کر ایسی شکل دی کہ وہ چمٹنے والا وجود بن گیا۔ پھر اس چمٹنے والے وجود کو ایک بوٹی بنادیا‘ پھر اس بوٹی کو ہم نے ہڈیوں کی شکل میں تبدیل کردیا۔ پھر ان ہڈیوں پر ہم نے گوشت چڑھایا۔ پھر اس کو ایک اور شکل میں تبدیل کر دیا۔ پس بہت ہی برکت والا ہے وہ خدا جو سب سے اچھا پیدا کرنے والا ہے۔"}, {"arabic": " ثُمَّ اِنَّکُمۡ بَعۡدَ ذٰلِکَ لَمَیِّتُوۡنَ ﴿ؕ۱۶﴾", "english": " Then after that you must surely die.", "french": " Puis après cela vous devez sûrement mourir.", "german": " Dann, nach diesem, müsst ihr sicherlich sterben.", "spanish": " Después de esto ciertamente moriréis.", "urdu": " پھر تم لوگ اس کے بعد مرنے والے ہو۔"}, {"arabic": " ثُمَّ اِنَّکُمۡ یَوۡمَ الۡقِیٰمَۃِ تُبۡعَثُوۡنَ ﴿۱۷﴾", "english": " Then on the Day of Resurrection will you be raised up.", "french": " Puis le Jour de la Résurrection vous serez certainement ressuscités.", "german": " Dann werdet ihr am Tage der Auferstehung erweckt werden.", "spanish": " Luego, en el Día de la Resurrección, seréis resucitados.", "urdu": " پھر تم قیامت کے دن اٹھائے جانے والے ہو۔"}, {"arabic": " وَ لَقَدۡ خَلَقۡنَا فَوۡقَکُمۡ سَبۡعَ طَرَآئِقَ ٭ۖ وَ مَا کُنَّا عَنِ الۡخَلۡقِ غٰفِلِیۡنَ ﴿۱۸﴾", "english": " And We have created above you seven heavens lying one above the other, and We are never neglectful of the creation.", "french": " Et au-dessus de vous Nous avons créé sept voies placées l’une au-dessus de l’autre , et Nous ne sommes jamais négligent envers la création.", "german": " Und Wir haben über euch sieben Wege geschaffen, und nie sind Wir nachlässig gegen die Schöpfung.", "spanish": " Y por encima de vosotros hemos creado siete cielos, uno encima del otro, pues nunca hemos descuidado la creación.", "urdu": " اور ہم نے تمہارے اوپر (کے درجات کے لئے) سات (روحانی) راستے بنائے ہیں۔ اور ہم (اپنی) مخلوق سے غافل نہیں رہے۔"}, {"arabic": " وَ اَنۡزَلۡنَا مِنَ السَّمَآءِ مَآءًۢ بِقَدَرٍ فَاَسۡکَنّٰہُ فِی الۡاَرۡضِ ٭ۖ وَ اِنَّا عَلٰی ذَہَابٍۭ بِہٖ لَقٰدِرُوۡنَ ﴿ۚ۱۹﴾", "english": " And We sent down water from the sky according to measure, and We caused it to stay in the earth — and surely it is We Who determine its taking away —", "french": " Et Nous avons fait descendre de l’eau du ciel, selon une mesure, et Nous l’avons fait rester dans la terre – et assurément c’est Nous Qui déterminons sa disparition –", "german": " Wir sandten Wasser vom Himmel nieder nach bestimmtem Maß, und Wir ließen es in der Erde ruhen; aber Wir vermögen es wieder hinwegzunehmen.", "spanish": " Y enviamos agua desde el cielo en medida prudente, y la hicimos permanecer en la tierra - pues en verdad, somos Nosotros Quienes decidimos su desaparición -.", "urdu": " اور ہم نے آسمان سے ایک اندازہ کے مطابق پانی اتارا ہے۔ پھر اس کو زمین میں ٹھہرا دیا اور ہم اس کے اٹھا لینے پر بھی قادر ہیں۔"}, {"arabic": " فَاَنۡشَاۡنَا لَکُمۡ بِہٖ جَنّٰتٍ مِّنۡ نَّخِیۡلٍ وَّ اَعۡنَابٍ ۘ لَکُمۡ فِیۡہَا فَوَاکِہُ کَثِیۡرَۃٌ وَّ مِنۡہَا تَاۡکُلُوۡنَ ﴿ۙ۲۰﴾", "english": " And We produced for you thereby gardens of date-palms and vines; for you therein are abundant fruits; and of them you eat.", "french": " Et Nous en avons produit pour vous des datteraies et des vignobles ; il s’y trouve pour vous des fruits en abondance ; et vous en mangez.", "german": " Und Wir brachten damit Gärten für euch hervor von Dattelpalmen und Trauben; in ihnen habt ihr reichlich Früchte; und aus ihnen esset ihr;", "spanish": " Y con ella producimos para vosotros jardines de palmeras datileras y vid; para vosotros hay en ellos frutos abundantes; y de ellos os alimentáis;", "urdu": " پھر ہم نے تمہارے لئے اس سے باغات بنائے‘ کھجور کے (بھی) اور انگوروں کے (بھی۔) ان میں تمہارے لئے بہت سے پھل (پیدا کئے گئے) ہیں اور ان سے تم کھاتے ہو۔"}, {"arabic": " وَ شَجَرَۃً تَخۡرُجُ مِنۡ طُوۡرِ سَیۡنَآءَ تَنۡۢبُتُ بِالدُّہۡنِ وَ صِبۡغٍ لِّلۡاٰکِلِیۡنَ ﴿۲۱﴾", "english": " And a tree which springs forth from Mount Sinai; it produces oil and a sauce for those who eat.", "french": " Et un arbre qui s’élance du Mont Sinaï ; il produit de l’huile et plus d 'un condiments pour ceux qui mangent.", "german": " und einen Baum, der aus dem Berge Sinai emporwächst; er gibt Öl hervor und vielerlei Gewürze für die Essenden.", "spanish": " Y un árbol que brota en el Monte Sinaí; crece produciendo aceite y diversos condimentos para los que comen.", "urdu": " اور (ہم نے تمہارے لئے) وہ درخت بھی (پیدا کیا ہے) جو طور سینا سے نکلتا ہے جو اپنے اندر تیل لیکر اگتا ہے اور کھانے والوں کے لئے سالن لے کر بھی۔"}, {"arabic": " وَ اِنَّ لَکُمۡ فِی الۡاَنۡعَامِ لَعِبۡرَۃً ؕ نُسۡقِیۡکُمۡ مِّمَّا فِیۡ بُطُوۡنِہَا وَ لَکُمۡ فِیۡہَا مَنَافِعُ کَثِیۡرَۃٌ وَّ مِنۡہَا تَاۡکُلُوۡنَ ﴿ۙ۲۲﴾", "english": " And in the cattle also there is a lesson for you. We give you to drink of that which is in their bellies and you have in them many benefits, and of them you also eat;", "french": " Et dans les bestiaux aussi il y a certainement une leçon pour vous. Nous vous donnons à boire de ce qui est dans leur ventre, et en eux vous avez beaucoup de bienfaits, et vous en mangez aussi ;", "german": " Und im Vieh ist eine Lehre für euch. Wir geben euch zu trinken von dem, was in ihren Leibern ist, und ihr habt an ihnen vielerlei Nutzen, und von ihnen esset ihr;", "spanish": " Y en el ganado hay también una lección para vosotros. Os damos de beber de lo que hay en sus entrañas, tenéis en ellos muchos beneficios y también os alimentáis de ellos.", "urdu": " اور تمہارے لئے چارپایوں میں بڑی عبرت ہے۔ ہم تم کو اس چیز سے جو ان کے پیٹ میں ہوتی ہے پلاتے ہیں۔ اور ان چارپایوں میں تمہارے لئے اور بھی بہت سے نفعے ہیں اور تم ان میں سے بعض کو کھاتے ہو۔"}, {"arabic": " وَ عَلَیۡہَا وَ عَلَی الۡفُلۡکِ تُحۡمَلُوۡنَ ﴿٪۲۳﴾", "english": " And on them and on ships you are borne.", "french": " Et sur eux, et sur les navires, vous êtes transportés.", "german": " und auf ihnen sowohl wie in Schiffen werdet ihr getragen.", "spanish": " Y sobre ellos y sobre los buques sois transportados.", "urdu": " اور ان پر اور کشتیوں پر اٹھائے جاتے ہو۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا نُوۡحًا اِلٰی قَوۡمِہٖ فَقَالَ یٰقَوۡمِ اعۡبُدُوا اللّٰہَ مَا لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرُہٗ ؕ اَفَلَا تَتَّقُوۡنَ ﴿۲۴﴾", "english": " And We did send Noah to his people, and he said, ‘O my people, serve Allah. You have no God other than Him. Will you not then be righteous?’", "french": " Et Nous envoyâmes certainement Noé à son peuple, et il dit : « Ô mon peuple, adorez Allāh ; vous n’avez pas de dieu autre que Lui. Ne voulez-vous donc pas être droits ? »", "german": " Wir sandten Noah zu seinem Volk, und er sprach: \"O mein Volk, dienet Allah. Ihr habt keinen anderen Gott als Ihn. Wollt ihr also nicht rechtschaffen werden?\"", "spanish": " Enviamos a Noé a su pueblo, y dijimos: “Oh, pueblo mío, servid a Al-lah. No tenéis otro Dios fuera de Él. ¿No seréis, pues, justos?", "urdu": " اور ہم نے نوح کو اس کی قوم کی طرف مبعوث کیا۔ پس اس نے کہا‘ اے میری قوم! اللہ کی عبادت کرو‘ اس کے سوا اور کوئی تمہارا معبود نہیں۔ کیا تم اس کا تقویٰ اختیار نہیں کرتے؟"}, {"arabic": " فَقَالَ الۡمَلَؤُا الَّذِیۡنَ کَفَرُوۡا مِنۡ قَوۡمِہٖ مَا ہٰذَاۤ اِلَّا بَشَرٌ مِّثۡلُکُمۡ ۙ یُرِیۡدُ اَنۡ یَّتَفَضَّلَ عَلَیۡکُمۡ ؕ وَ لَوۡ شَآءَ اللّٰہُ لَاَنۡزَلَ مَلٰٓئِکَۃً ۚۖ مَّا سَمِعۡنَا بِہٰذَا فِیۡۤ اٰبَآئِنَا الۡاَوَّلِیۡنَ ﴿ۚ۲۵﴾", "english": " And the chiefs of his people, who disbelieved, said, ‘He is only a man like yourselves; he seeks to make himself superior to you. And if Allah had so willed, He could have surely sent down angels with him. We have never heard of such a thing among our forefathers.", "french": " Et les chefs de son peuple, qui avaient refusé de croire, dirent : « Il n’est qu’un homme comme vous ; il voudrait se rendre supérieur à vous. Et si Allāh l’avait voulu, Il aurait assurément pu faire descendre des anges. Nous n’avons jamais entendu une telle chose parmi nos aïeux.", "german": " Aber die Häupter seines Volks, die ungläubig waren, sprachen: \"Er ist nur ein Mensch wie ihr; er möchte sich bloß über euch erheben. Hätte Allah gewollt, Er hätte doch gewiss Engel hinabsenden können. Wir haben nie von solchem unter unseren Vorvätern gehört.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:25&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:25&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic26\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic26\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:26' style='text-decoration:underline'>23:26</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(26)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control26\"></i></button> <audio id=\"player26\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنۡ ہُوَ اِلَّا رَجُلٌۢ بِہٖ جِنَّۃٌ فَتَرَبَّصُوۡا بِہٖ حَتّٰی حِیۡنٍ ﴿۲۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘He is only a man <em>stricken </em>with madness; wait, therefore, concerning him for a while.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_26_b' href='#'>b</a>]</sup>‘He is but a man <i>stricken</i>with madness; wait, therefore, concerning him for a while.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_26_b'>b</span></div> <div><div class='reference' data-id='ref_23_26_b' style='display:none'> <p><b>b.</b> <a href='/quran/54:10' target=_blank>54:10</a>. (<a href='javascript:void(0)' data-id='ref_23_26_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہ تو محض ایک انسان ہے جسے جنون ہوگیا ہے۔ پس کچھ عرصہ تک اس کے (انجام کے) بارہ میں انتظار کرو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یہ تو فقط ایک انسان ہے جس کو جنون ہو گیا ہے۔ پس اس کے انجام کا کچھ دیر انتظار کرو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ce n’est qu’un homme frappé de folie ; attendez donc pendant quelque temps, à son sujet. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“No es más que un hombre<em> atacado</em> de locura; esperad algún tiempo, pues, respecto a él”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er ist nur ein Verrückter; wartet darum eine Weile mit ihm.\"", "spanish": " Mas los jefes de su pueblo que no cre­ían, dijeron: “No es más que un hombre como vosotros; intenta hacerse superior a vosotros. Y si Al-lah lo hubiese querido, en verdad habría enviado ángeles. Nunca oímos tal cosa entre nuestros antepasados”;", "urdu": " اس پر اس کی قوم کے کافروں کے سرداروں نے کہا یہ شخص تو فقط تمہارے جیسا ایک انسان ہے (اور) چاہتا ہے کہ تم پر فضیلت اختیار کرے اگر اللہ (پیغمبر بھیجنا) چاہتا تو فرشتوں کو اتارتا۔ ہم نے اپنے پہلے باپ دادوں میں تو کوئی اس قسم کا واقعہ ہوتا سنا نہیں۔"}, {"arabic": " قَالَ رَبِّ انۡصُرۡنِیۡ بِمَا کَذَّبُوۡنِ ﴿۲۷﴾", "english": " He said, ‘O my Lord, help me, for they have treated me as a liar.’", "french": " Il dit : « Ô mon Seigneur, aide-moi, car ils m’ont traité de menteur. »", "german": " Er sprach: \"Mein Herr, hilf mir, denn sie haben mich einen Lügner genannt.\"", "spanish": " Dijo: “Oh, mi Señor, ayúdame, pues me han tratado de mentiroso”.", "urdu": " (اس پر نوح نے) کہا‘ اے میرے رب! میری مدد کر کیونکہ یہ لوگ مجھے جھٹلاتے ہیں۔"}, {"arabic": " فَاَوۡحَیۡنَاۤ اِلَیۡہِ اَنِ اصۡنَعِ الۡفُلۡکَ بِاَعۡیُنِنَا وَ وَحۡیِنَا فَاِذَا جَآءَ اَمۡرُنَا وَ فَارَ التَّنُّوۡرُ ۙ فَاسۡلُکۡ فِیۡہَا مِنۡ کُلٍّ زَوۡجَیۡنِ اثۡنَیۡنِ وَ اَہۡلَکَ اِلَّا مَنۡ سَبَقَ عَلَیۡہِ الۡقَوۡلُ مِنۡہُمۡ ۚ وَ لَا تُخَاطِبۡنِیۡ فِی الَّذِیۡنَ ظَلَمُوۡا ۚ اِنَّہُمۡ مُّغۡرَقُوۡنَ ﴿۲۸﴾", "english": " So We sent revelation to him, saying , “Make the Ark under Our eyes and according to Our revelation. And when Our command comes, and the fountains of the earth gush forth, take thou into it two of every kind, male and female, and thy family, except those of them against whom the word has already gone forth. And address Me not concerning those who have done wrong; they shall be drowned.", "french": " Alors Nous lui envoyâmes une révélation ainsi : « Construis l’Arche sous Nos yeux et selon Notre révélation. Et lorsque Notre ordre viendra, et que les sources de la terre jailliront, prends à bord une paire de chaque espèce, mâle et femelle, et ta famille à l’exception de ceux contre qui le décret a déjà été prononcé. Et ne Me parle pas au sujet de ceux qui ont fait le mal ; ils seront certainement noyés.", "german": " So offenbarten Wir ihm: «Mache die Arche unter Unseren Augen und gemäß Unserer Offenbarung. Und wenn Unser Befehl ergeht und die Oberfläche der Erde (Wasser) hervorwallen lässt, dann nimm an Bord ein Paar von jeglicher Art, männlich und weiblich, sowie deine Angehörigen, mit Ausnahme derer unter ihnen, wider die das Wort bereits ergangen ist. Und sprich Mir nicht von denen, die gefrevelt haben, denn sie sollen ertränkt werden.", "spanish": " Por tanto le enviamos una revelación, diciéndole: “construye el Arca bajo Nuestra mirada y de acuerdo con uestra Revelación. Y cuando llegue Nuestra orden y las fuentes de la tierra broten, introduce en ella a dos parejas de cada sexo, macho y hembra, y a tu familia, excepto aquellos contra quienes haya sido pronunciada ya la palabra. Y no te dirijas a Mí en lo que respecta a los malvados; ellos serán ahogados”.", "urdu": " پس ہم نے اس کی طرف وحی کی کہ (جس) کشتی (کا ہم نے حکم دیا ہے اس) کو ہماری آنکھوں کے سامنے اور ہماری وحی کے مطابق بنا۔ پس جب ہمارا حکم آجائے اور زمین کا سوتا پھوٹ پڑے تو اس (کشتی) میں ہر ایک جانور میں سے (جس کا ہم حکم دیں) ایک ایک جوڑا رکھ لے اور اپنے رشتہ داروں کو بھی ان کے سوا جن کے خلاف ہمارا حکم پہلے سے اتر چکا ہے سوار کر دے اور جنہوں نے ظلم کیا ہے ان کے متعلق مجھ سے کوئی بات نہ کر کیونکہ وہ تو ضرور غرق کیے جائیں گے۔"}, {"arabic": " فَاِذَا اسۡتَوَیۡتَ اَنۡتَ وَ مَنۡ مَّعَکَ عَلَی الۡفُلۡکِ فَقُلِ الۡحَمۡدُ لِلّٰہِ الَّذِیۡ نَجّٰنَا مِنَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿۲۹﴾", "english": " “And when thou hast settled on the Ark — thou and those that are with thee — say, ‘All praise belongs to Allah Who has saved us from the unjust people!’", "french": " Et quand tu te seras installé sur l’Arche – toi et ceux qui sont avec toi – dis : 'Toutes les louanges appartiennent à Allāh Qui nous a sauvés du peuple injuste !'", "german": " Und wenn du dich in der Arche eingerichtet hast – du und die bei dir sind –, dann sprich: \"Aller Preis gehört Allah, Der uns errettet hat von dem ruchlosen Volk!\"", "spanish": " “Y cuando te hayas instalado en el Arca –tú y los que estén contigo-, di: “¡Toda alabanza corresponde a Al-lah, Quien nos ha salvado de los hombres injustos!”.", "urdu": " پس جب تو اور تیرے ساتھی کشتی میں اچھی طرح بیٹھ جائیں تو تم میں سے ہر ایک کہے کہ سب تعریف اللہ ہی کے لئے ہے جس نے ہمیں ظالموں کی قوم سے نجات دی۔"}, {"arabic": " وَ قُلۡ رَّبِّ اَنۡزِلۡنِیۡ مُنۡزَلًا مُّبٰرَکًا وَّ اَنۡتَ خَیۡرُ الۡمُنۡزِلِیۡنَ ﴿۳۰﴾", "english": " “And say, ‘My Lord, cause me to land a blessed landing, for Thou art the Best of those who bring men to land.’”", "french": " Et dis : 'Mon Seigneur, fais ma descente à terre une descente bénie, car Tu es le Meilleur de ceux qui amènent les hommes à destination.' «", "german": " Und sprich: \"Mein Herr, gewähre mir eine gesegnete Landung, denn Du bist der beste Lotse.\"»", "spanish": " “Y di: “Señor mío, hazme desembarcar con un desembarque bendito, pues Tú eres el Mejor de quienes escoltan a los hombres a su destino”.", "urdu": " اور (کشتی سے اترتے وقت) کہہ کہ اے میرے رب تو مجھے (اس کشتی سے) ایسی حالت میں اتار۔ کہ مجھ پر کثرت سے برکتیں نازل ہو رہی ہوں اور (مجھے اس دعا کی بھی کیا ضرورت ہے جبکہ) تمام اتارنے والوں سے تیرا وجود بہتر ہے۔"}, {"arabic": " اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ وَّ اِنۡ کُنَّا لَمُبۡتَلِیۡنَ ﴿۳۱﴾", "english": " Verily, in this there are Signs. Surely, We did try the people of Noah.", "french": " En vérité, en ceci il y a des Signes. Et certainement, de tout temps, Nous n'avons pas cessé de faire les gens passer par des épreuves.", "german": " Wahrlich, hierin sind Zeichen, und Wir stellen nur auf die Probe.", "spanish": " En verdad, en esto hay Signos. Ciertamente siempre hemos puesto a prueba a la gente.", "urdu": " اس میں بہت سے نشان ہیں اور ہم یقیناً بندوں کا امتحان لینے والے ہیں۔"}, {"arabic": " ثُمَّ اَنۡشَاۡنَا مِنۡۢ بَعۡدِہِمۡ قَرۡنًا اٰخَرِیۡنَ ﴿ۚ۳۲﴾", "english": " Then We raised after them another generation.", "french": " Ensuite, Nous suscitâmes après eux une autre génération.", "german": " Dann ließen Wir nach ihnen ein anderes Geschlecht erstehen.", "spanish": " A continuación originamos tras ellos a otra generación.", "urdu": " پھر ہم نے ان کے بعد کئی قومیں پیدا کیں۔"}, {"arabic": " فَاَرۡسَلۡنَا فِیۡہِمۡ رَسُوۡلًا مِّنۡہُمۡ اَنِ اعۡبُدُوا اللّٰہَ مَا لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرُہٗ ؕ اَفَلَا تَتَّقُوۡنَ ﴿٪۳۳﴾", "english": " And We sent among them a Messenger from among themselves who said , ‘Serve Allah. You have no God other than Him. Will you not then fear God?’", "french": " Et Nous envoyâmes parmi eux un Messager, qui était des leurs qui leur dit : « Adorez Allāh. Vous n’avez d’autre dieu que Lui. Ne voulez-vous donc pas être droits ? »", "german": " Und Wir entsandten unter sie einen Gesandten aus ihrer Mitte (der sprach): \"Dienet Allah. Ihr habt keinen anderen Gott als Ihn. Wollt ihr also nicht rechtschaffen werden?\"", "spanish": " Les enviamos un Mensajero de entre ellos mismos que dijo: “Servid a Al-lah. No tenéis ningún Dios distinto de Él. ¿No temeréis pues a Dios?”.", "urdu": " اور ہم نے ان میں انہی میں سے رسول بھیجا (یہ پیغام دیتے ہوئے) کہ اللہ کی عبادت کرو۔ اس کے سوا تمہارا کوئی اور معبود نہیں۔ کیا تم اس کے ذریعہ سے اپنے آپ کو ہلاکت سے بچاتے نہیں؟"}, {"arabic": " وَ قَالَ الۡمَلَاُ مِنۡ قَوۡمِہِ الَّذِیۡنَ کَفَرُوۡا وَ کَذَّبُوۡا بِلِقَآءِ الۡاٰخِرَۃِ وَ اَتۡرَفۡنٰہُمۡ فِی الۡحَیٰوۃِ الدُّنۡیَا ۙ مَا ہٰذَاۤ اِلَّا بَشَرٌ مِّثۡلُکُمۡ ۙ یَاۡکُلُ مِمَّا تَاۡکُلُوۡنَ مِنۡہُ وَ یَشۡرَبُ مِمَّا تَشۡرَبُوۡنَ ﴿۪ۙ۳۴﴾", "english": " And the chiefs of his people, who disbelieved and denied the meeting of the Hereafter and whom We had afforded ease and comfort in this life, said, ‘This is but a man like yourselves. He eats of that of which you eat, and drinks of that of which you drink.", "french": " Et les chefs de son peuple, qui refusaient de croire, et qui niaient la rencontre de l’au-delà, et à qui Nous avions accordé l’aisance en cette vie, dirent : « Ce n’est qu’un homme comme vous. Il mange de ce que vous mangez, et boit de ce que vous buvez.", "german": " Die Häupter seines Volks, die ungläubig waren und die Begegnung im Jenseits leugneten und denen Wir die guten Dinge des irdischen Lebens beschert hatten, sprachen: \"Das ist nur ein Mensch wie ihr. Er isst von dem, was ihr esset, und trinkt von dem, was ihr trinket.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:34&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:34&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic35\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic35\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:35' style='text-decoration:underline'>23:35</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(35)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control35\"></i></button> <audio id=\"player35\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَئِنۡ اَطَعۡتُمۡ بَشَرًا مِّثۡلَکُمۡ اِنَّکُمۡ اِذًا لَّخٰسِرُوۡنَ ﴿ۙ۳۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And if you obey a man like yourselves, you will then be surely losers.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_35_b' href='#'>b</a>]</sup>‘And if you obey a mortal like yourselves, you will then be surely losers; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_35_b'>b</span></div> <div><div class='reference' data-id='ref_23_35_b' style='display:none'> <p><b>b.</b> <a href='/quran/23:48' target=_blank>23:48</a>. (<a href='javascript:void(0)' data-id='ref_23_35_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اگر تم نے اپنے ہی جیسے کسی بشر کی اطاعت کی تو یقیناً تم بہت نقصان اٹھانے والے ہو جاؤ گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اگر تم اپنے جیسے ایک آدمی کی بات مانو گے تو تم گھاٹا پانے والوں میں سے ہو جاٶ گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et si vous obéissez à un homme semblable à vous-mêmes, alors vous serez sûrement des perdants.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Si obedecéis a un hombre como vosotros, seréis ciertamente perdedores”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und wenn ihr einem Menschen euresgleichen gehorcht, dann werdet ihr gewiss Verlierende sein.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:35&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:35&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic36\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic36\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:36' style='text-decoration:underline'>23:36</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(36)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control36\"></i></button> <audio id=\"player36\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَیَعِدُکُمۡ اَنَّکُمۡ اِذَا مِتُّمۡ وَ کُنۡتُمۡ تُرَابًا وَّ عِظَامًا اَنَّکُمۡ مُّخۡرَجُوۡنَ ﴿۪ۙ۳۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Does he promise you that when you are dead and have become dust and bones, you will be brought forth<I> again</I>?</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_36_c' href='#'>c</a>]</sup>‘Does he promise you that when you are dead and have become dust and bones, you will be brought forth <i>again</i>? <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_36_c'>c</span></div> <div><div class='reference' data-id='ref_23_36_c' style='display:none'> <p><b>c.</b> <a href='/quran/17:50' target=_blank>17:50</a>; <a href='/quran/36:79' target=_blank>36:79</a>; <a href='/quran/50:4' target=_blank>50:4</a>. (<a href='javascript:void(0)' data-id='ref_23_36_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا تمہیں یہ اس بات سے ڈراتا ہے کہ جب تم مرجاؤ گے اور مٹی اور ہڈیاں ہوجاؤگے تو تم نکالے جاؤگے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا وہ تم سے یہ وعدہ کرتا ہے کہ جب تم مر جاٶ گے اور مٹی ہو جاٶ گے اور ہڈیاں بن جاٶ گے تو تم (پھر زندہ کرکے) نکالے جاٶ گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Vous promet-il que, quand vous serez morts, et que vous serez devenus poussière et ossements, vous serez ramenés <em>de nouveau</em> ?</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Acaso os promete que cuando estéis muertos y os hayáis convertido en polvo y huesos, seréis resucitados <em>de nuevo?</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Verheißt er euch, dass ihr, wenn ihr tot seid und Staub und Gebeine geworden, wieder erstehen werdet?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:36&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:36&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic37\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic37\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:37' style='text-decoration:underline'>23:37</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(37)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control37\"></i></button> <audio id=\"player37\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ہَیۡہَاتَ ہَیۡہَاتَ لِمَا تُوۡعَدُوۡنَ ﴿۪ۙ۳۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Far, far <em>from truth </em>is that which you are promised.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_37_d' href='#'>d</a>]</sup>‘Far, very far <i>from truth</i><sup class='ref'>[<a class='ref' data-id='ref_23_37_1995' href='#'>1995</a>]</sup> is that which you are promised; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_37_d'>d</span><span class='collapsible plus' data-id='ref_23_37_1995'>1995</span></div> <div><div class='reference' data-id='ref_23_37_d' style='display:none'> <p><b>d.</b> <a href='/quran/50:4' target=_blank>50:4</a>. (<a href='javascript:void(0)' data-id='ref_23_37_d' class='ref'>close</a>)</p> </div> </div><div><a name='1995'></a><div class='reference' data-id='ref_23_37_1995' style='display:none'> <p><b>1995.</b> <i>Haihata </i>denotes one’s deeming a thing remote or improbable and despairing of it, and means, <i>Ba‘uda Jiddan </i>(he or it was or became very far off), or <i>Ma Ab‘ada-hu </i>(how far it is), signifying the intensification of the sense of being very far (Lane). (<a href='javascript:void(0)' data-id='ref_23_37_1995' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">دور کی بات ہے، بہت دور کی بات ہے جس کا تم وعدہ دئیے جاتے ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">جس بات کا تم سے وعدہ کیا جاتا ہے وہ عقل سے بہت ہی دور ہے اور ماننے کی بات نہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Loin, bien loin <em>de la réalité</em> est ce qui vous est promis.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Lejos, muy lejos de <em>la verdad</em> está lo que se os promete”;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Weit, weit gesucht ist das, was euch da verheißen wird!</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:37&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:37&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic38\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic38\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:38' style='text-decoration:underline'>23:38</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(38)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control38\"></i></button> <audio id=\"player38\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنۡ ہِیَ اِلَّا حَیَاتُنَا الدُّنۡیَا نَمُوۡتُ وَ نَحۡیَا وَ مَا نَحۡنُ بِمَبۡعُوۡثِیۡنَ ﴿۪ۙ۳۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘There is no life other than our present life; we were lifeless and<I> now </I>we live, but we shall not be raised up again.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_38_e' href='#'>e</a>]</sup>‘There is no life other than our present life; we die and we live, and we shall not be raised up <i>again</i>; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_38_e'>e</span></div> <div><div class='reference' data-id='ref_23_38_e' style='display:none'> <p><b>e.</b> <a href='/quran/6:30' target=_blank>6:30</a>; <a href='/quran/19:67' target=_blank>19:67</a>; <a href='/quran/36:79' target=_blank>36:79</a>; <a href='/quran/44:36' target=_blank>44:36</a>; <a href='/quran/45:25' target=_blank>45:25</a>. (<a href='javascript:void(0)' data-id='ref_23_38_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">ہماری تو صرف یہی دنیا کی زندگی ہے۔ ہم مرتے بھی ہیں اور زندہ بھی رہتے ہیں اور ہم ہرگز اٹھائے نہیں جائیں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">زندگی تو صرف ہماری اس دنیا کی زندگی ہے۔ ہم کبھی مردہ حالت میں ہوتے ہیں اور کبھی زندہ حالت میں۔ اور ہم کبھی مرنے کے بعد دوبارہ نہیں اٹھائے جائیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ce n’est qu’ici seulement que nous vivons notre vie. <em>Ici-bas</em> allons-nous mourir, et <em>ici-bas</em> vivons-nous, et jamais ne serons-nous ressuscités.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Aquí sólo es donde vivimos nuestra vida; aquí morimos y <em>aquí</em> vivimos, pero nunca seremos de nuevo resucitados”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Es gibt kein anderes Leben als unser Leben hienieden; wir sterben und wier leben, doch wir werden nicht wieder erweckt werden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:38&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:38&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic39\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic39\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:39' style='text-decoration:underline'>23:39</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(39)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control39\"></i></button> <audio id=\"player39\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنۡ ہُوَ اِلَّا رَجُلُ ۨ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا وَّ مَا نَحۡنُ لَہٗ بِمُؤۡمِنِیۡنَ ﴿۳۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘He is only a man who has forged a lie against Allah; and we are not going to believe him.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘He is only a man who has forged a lie against Allah; and we are not going to believe in him.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہ محض ایک ایسا شخص ہے جس نے اللہ پر جھوٹ گھڑا ہے اور ہم اس پر ایمان لانے والے نہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یہ تو (صرف) ایک اکیلا شخص ہے جو اللہ پر جھوٹا افترا کرتا ہے اور ہم اس (کی باتوں) کو کبھی نہیں مانیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il n’est qu’un homme qui a fabriqué un mensonge contre Allāh ; et nous n’allons pas croire en lui. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“No es más que un hombre que ha inventado una mentira contra Al-lah; y no vamos a creerle”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er ist nur ein Mensch, der eine Lüge wider Allah erdichtet hat; und wir wollen ihm nicht glauben.\"", "spanish": " Pero los jefes de su pueblo, que no creían y negaban la reunión del Más Allá y a quienes habíamos concedido riqueza y comodidad en esta vida, dijeron: “no es más que un hombre como vosotros”. Come de lo que coméis y bebe de lo que bebéis.", "urdu": " اور اس (نئے رسول) کی قوم میں سے جنہوں نے کفر کیا تھا اور بعد الموت خدا سے ملنے کا انکار کیا تھا اور جن کو ہم نے اس دنیا کی زندگی میں مالدار بنایا‘ ان کے سرداروں نے کہا‘ یہ تو تمہارے جیسا ایک آدمی ہے انہی (کھانوں) میں سے کھاتا ہے جو تم کھاتے ہو اور انہی (پانیوں) میں سے پیتا ہے جو تم پیتے ہو۔"}, {"arabic": " قَالَ رَبِّ انۡصُرۡنِیۡ بِمَا کَذَّبُوۡنِ ﴿۴۰﴾", "english": " He said, ‘My Lord, help me, for they have treated me as a liar.’", "french": " Il dit : « Mon Seigneur, aide-moi, car ils m’ont traité de menteur. »", "german": " Er sprach: \"Mein Herr, hilf mir, denn sie haben mich einen Lügner genannt.\"", "spanish": " Él dijo: “Señor mío, ayúdame, pues me han tratado de mentiroso”.", "urdu": " (اس پر) اس نے کہا‘ اے میرے رب! ان لوگوں نے مجھے جھٹلا دیا ہے‘ پس تو میری مدد کر۔"}, {"arabic": " قَالَ عَمَّا قَلِیۡلٍ لَّیُصۡبِحُنَّ نٰدِمِیۡنَ ﴿ۚ۴۱﴾", "english": " God said, ‘In a little while they will surely become repentant.’", "french": " Allāh dit : « Avant peu ils s’ en repentiront assurément. «", "german": " (Gott) sprach: \"In einer kleinen Weile werden sie sicherlich reuig werden.\"", "spanish": " Dios dijo: “En breve, en verdad, se arrepentirán”.", "urdu": " (تب خدا نے) فرمایا۔ یہ لوگ تھوڑے ہی عرصہ میں شرمندہ ہو جائیں گے۔"}, {"arabic": " فَاَخَذَتۡہُمُ الصَّیۡحَۃُ بِالۡحَقِّ فَجَعَلۡنٰہُمۡ غُثَآءً ۚ فَبُعۡدًا لِّلۡقَوۡمِ الظّٰلِمِیۡنَ ﴿۴۲﴾", "english": " Then punishment overtook them rightfully, and We made them as rubbish. Cursed, then, be the people who do wrong!", "french": " Alors le châtiment, sous forme d’une explosion formidable, frappa à bon droit, et Nous les rendîmes comme des débris roulés par le torrent. Maudits soient donc les gens qui font le mal.", "german": " Da fasste sie der Wirbel nach Gebühr, und Wir machten sie zur Spreu. Verflucht denn sei das Volk, das Frevel begeht!", "spanish": " Entonces el castigo se cernió sobre ellos con toda razón, y los redujimos a basura. ¡Malditas sean, pues, las personas que actúan con injusticia!", "urdu": " اور ان کو ایک عذاب نے پکڑ لیا جس کی پختہ خبر دی گئی تھی اور ہم نے ان کو کوڑا کرکٹ بنا دیا اور (فرشتوں کو حکم دیا کہ) ظالموں کے لئے خدا کی لعنت (مقدر کر دو) ۔"}, {"arabic": " ثُمَّ اَنۡشَاۡنَا مِنۡۢ بَعۡدِہِمۡ قُرُوۡنًا اٰخَرِیۡنَ ﴿ؕ۴۳﴾", "english": " Then We raised after them other generations.", "french": " Ensuite Nous suscitâmes d’autres générations après eux.", "german": " Dann ließen Wir nach ihnen andere Geschlechter erstehen.", "spanish": " Luego creamos tras ellos a otras generaciones.", "urdu": " پھر ان کے بعد ہم نے کئی اور قومیں پیدا کیں۔"}, {"arabic": " مَا تَسۡبِقُ مِنۡ اُمَّۃٍ اَجَلَہَا وَ مَا یَسۡتَاۡخِرُوۡنَ ﴿ؕ۴۴﴾", "english": " No people can go ahead of their appointed time, nor can they remain behind it .", "french": " Aucun peuple ne peut dépasser son terme fixé, et ils ne peuvent non plus rester en arrière. »", "german": " Kein Volk kann seine festgesetzte Zeit beschleunigen, noch kann es (sie) verzögern.", "spanish": " Ningún pueblo puede adelantarse a su tiempo fijado, ni permanecer tras él.", "urdu": " کوئی قوم اپنی مدت سے آگے نہیں گذرتی اور نہ ہی اس سے پیچھے رہ (کر بچ) سکتی ہے۔"}, {"arabic": " ثُمَّ اَرۡسَلۡنَا رُسُلَنَا تَتۡرَا ؕ کُلَّمَا جَآءَ اُمَّۃً رَّسُوۡلُہَا کَذَّبُوۡہُ فَاَتۡبَعۡنَا بَعۡضَہُمۡ بَعۡضًا وَّ جَعَلۡنٰہُمۡ اَحَادِیۡثَ ۚ فَبُعۡدًا لِّقَوۡمٍ لَّا یُؤۡمِنُوۡنَ ﴿۴۵﴾", "english": " Then We sent Our Messengers one after another. Every time there came to a people their Messenger, they treated him as a liar. So We made them follow one another to destruction and We made them mere tales. Cursed, then, be the people who believe not!", "french": " Ensuite Nous envoyâmes Nos Messagers l’un après l’autre. Chaque fois qu’à un peuple venait son Messager, ils le déclaraient menteur. Nous les fîmes donc se suivre les uns les autres à la perdition , et Nous fîmes d’eux rien d’autre que des fables. Maudits soient donc les gens qui ne croient pas !", "german": " Dann entsandten Wir Unsere Gesandten, einen nach dem anderen. Sooft sein Gesandter zu einem Volke kam, nannten sie ihn einen Lügner. So ließen Wir sie einander folgen und machten sie zu Geschichten. Verflucht denn sei das Volk, das nicht glaubt!", "spanish": " Luego enviamos a Nuestros Mensajeros uno tras otro. Cada vez que un Mensajero llegaba a su pueblo, lo trataban de mentiroso. Por ello, hicimos que uno tras otro cayera en la destrucción y los convertimos en meros cuentos. ¡Malditas sean, pues, las gentes que no creen!", "urdu": " پھر ہم نے اپنے رسول متواتر بھیجے۔ جب کبھی کسی قوم کے پاس اس کا رسول آتا تھا وہ اس کو جھٹلاتے تھے۔ پس ہم ان میں سے بعض کو بعض کے پیچھے بھیجتے چلے جاتے تھے (یعنی ہلاک کرتے جاتے تھے) اور ہم نے ان سب کو گزشتہ افسانے کرکے رکھ دیا۔ اور (ان کے متعلق فرشتوں کو حکم دیا کہ) جو لوگ ایمان نہیں لائے ان کے لئے خدا کی لعنت (مقدر کر دو) ۔"}, {"arabic": " ثُمَّ اَرۡسَلۡنَا مُوۡسٰی وَ اَخَاہُ ہٰرُوۡنَ ۬ۙ بِاٰیٰتِنَا وَ سُلۡطٰنٍ مُّبِیۡنٍ ﴿ۙ۴۶﴾", "english": " Then We sent Moses and his brother Aaron, with Our Signs and a clear authority,", "french": " Ensuite Nous envoyâmes Moïse et son frère Aaron avec Nos Signes et un argument clair et convaincant,", "german": " Dann sandten Wir Moses und seinen Bruder Aaron mit Unseren Zeichen und einer klaren Vollmacht", "spanish": " Luego enviamos a Moisés y a su hermano Aarón con Nuestros Signos y una autoridad evidente,", "urdu": " اس کے بعد ہم نے موسیٰ اور اس کے بھائی ہارون کو اپنے نشان اور کھلا کھلا غلبہ دے کر فرعون اور اس کے سرداروں کی طرف بھیجا۔ پس انہوں نے تکبر کیا۔ اور وہ سرکش لوگوں میں سے بن گئے۔"}, {"arabic": " اِلٰی فِرۡعَوۡنَ وَ مَلَا۠ئِہٖ فَاسۡتَکۡبَرُوۡا وَ کَانُوۡا قَوۡمًا عَالِیۡنَ ﴿ۚ۴۷﴾", "english": " To Pharaoh and his chiefs; but they behaved arrogantly and they were a haughty people.", "french": " A Pharaon et à ses chefs ; mais ils se comportèrent avec arrogance et ils étaient un peuple arrogant.", "german": " zu Pharao und seinen Häuptern; doch sie wandten sich verächtlich ab, und sie waren ein hochmütiges Volk.", "spanish": " Al Faraón y a sus jefes; pero se comportaron arrogantemente, pues eran gente altanera.", "urdu": " اس کے بعد ہم نے موسیٰ اور اس کے بھائی ہارون کو اپنے نشان اور کھلا کھلا غلبہ دے کر فرعون اور اس کے سرداروں کی طرف بھیجا۔ پس انہوں نے تکبر کیا۔ اور وہ سرکش لوگوں میں سے بن گئے۔"}, {"arabic": " فَقَالُوۡۤا اَنُؤۡمِنُ لِبَشَرَیۡنِ مِثۡلِنَا وَ قَوۡمُہُمَا لَنَا عٰبِدُوۡنَ ﴿ۚ۴۸﴾", "english": " And they said, ‘Shall we believe in two men like ourselves while their people are our servants?’", "french": " Et ils dirent : « Croirons-nous en deux hommes pareils à nous-mêmes alors que leur peuple nous sert d’esclaves ? »", "german": " Sie sprachen: \"Sollen wir an zwei Menschen gleich uns glauben, wo ihr Volk uns untertänig ist?\"", "spanish": " Y dijeron: “¿Debemos acaso creer en dos hombres como nosotros cuando sus gentes son nuestros siervos?”.", "urdu": " پھر انہوں نے کہا‘ کیا ہم اپنے جیسے دو انسانوں پر ایمان لے آئیں؟ حالانکہ ان دونوں کی قوم ہماری غلامی کر رہی ہے۔"}, {"arabic": " فَکَذَّبُوۡہُمَا فَکَانُوۡا مِنَ الۡمُہۡلَکِیۡنَ ﴿۴۹﴾", "english": " So they called them liars, and they were of those who were destroyed.", "french": " Ils les traitèrent donc de menteurs, et ils furent de ceux qui furent anéantis.", "german": " So schalten sie sie Lügner, und sie gehörten zu denen, die vernichtet wurden.", "spanish": " Los llamaron, pues, embusteros, y fueron de los que quedaron destruidos.", "urdu": " پس انہوں نے ان دونوں (یعنی موسیٰ اور ہارون) کو جھٹلا دیا۔ نتیجہ یہ ہوا کہ وہ بھی ہلاک ہونے والے لوگوں میں سے بن گئے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ لَعَلَّہُمۡ یَہۡتَدُوۡنَ ﴿۵۰﴾", "english": " And We gave Moses the Book, that they might be guided.", "french": " Et Nous donnâmes le Livre à Moïse, afin qu’ils soient guidés.", "german": " Wir gaben Moses das Buch, dass sie dem rechten Weg folgen möchten.", "spanish": " Entregamos a Moisés el Libro, para que fuesen guiados.", "urdu": " اور ہم نے موسیٰ کو (وہ) کتاب دی (جس کو سب جانتے ہیں) تا کہ وہ (اور اس کی قوم) ہدایت پائیں۔"}, {"arabic": " وَ جَعَلۡنَا ابۡنَ مَرۡیَمَ وَ اُمَّہٗۤ اٰیَۃً وَّ اٰوَیۡنٰہُمَاۤ اِلٰی رَبۡوَۃٍ ذَاتِ قَرَارٍ وَّ مَعِیۡنٍ ﴿٪۵۱﴾", "english": " And We made the son of Mary and his mother a Sign, and gave them refuge on an elevated land of green valleys and springs of running water.", "french": " Et Nous avons fait du fils de Marie et de sa mère un Signe, et Nous les avons sauvés et leur avons donné asile sur un endroit élevé reposant, abondant en sources d’eau .", "german": " Und Wir machten den Sohn der Maria und seine Mutter zu einem Zeichen, und gaben ihnen Zuflucht auf einem Hügel mit einer grünen Talmulde und dem fließenden Wasser von Quellen.", "spanish": " Y convertimos al hijo de María y a su madre en un Signo, y les rescatamos y les ayudamos a llegar a un lugar elevado, un lugar tranquilo con manantiales de agua corriente.", "urdu": " اور ہم نے ابن مریم اور اس کی ماں کو ایک نشان بنایا اور ہم نے ان دونوں کو ایک اونچی جگہ پر پناہ دی جو ٹھہرنے کے قابل اور بہتے ہوئے پانیوں والی تھی۔"}, {"arabic": " یٰۤاَیُّہَا الرُّسُلُ کُلُوۡا مِنَ الطَّیِّبٰتِ وَ اعۡمَلُوۡا صَالِحًا ؕ اِنِّیۡ بِمَا تَعۡمَلُوۡنَ عَلِیۡمٌ ﴿ؕ۵۲﴾", "english": " O ye Messengers, eat of the things that are pure, and do good works. Verily, I am well aware of what you do.", "french": " Ô Messagers, mangez des choses qui sont pures, et faites de bonnes œuvres. En vérité, Je sais très bien ce que vous faites.", "german": " O ihr Gesandten, esset von den reinen Dingen und tut Gutes. Wahrlich, Ich weiß recht wohl, was ihr tut.", "spanish": " Oh vosotros, Mensajeros, comed de las cosas que son puras, y haced buenas obras. En verdad, conozco muy bien lo que hacéis.", "urdu": " (اور ہم نے کہا) اے رسولو! پاک چیزوں میں سے کھاٶ اور مناسب حال عمل کرو (اور) میں اس کو جو تم کرتے ہو جانتا ہوں۔"}, {"arabic": " وَ اِنَّ ہٰذِہٖۤ اُمَّتُکُمۡ اُمَّۃً وَّاحِدَۃً وَّ اَنَا رَبُّکُمۡ فَاتَّقُوۡنِ ﴿۵۳﴾", "english": " And know that this community of yours is one community, and I am your Lord. So take Me as your Protector.", "french": " Et sachez que cette communauté qui est la vôtre forme une seule communauté, et Je suis votre Seigneur. Aussi, craignez-Moi Seul .", "german": " Diese eure Gemeinde ist die einige Gemeinde, und Ich bin euer Herr. So nehmet Mich zum Beschützer.", "spanish": " Y sabed que esta comunidad vuestra es una sola comunidad, y que Yo soy vuestro Señor. Temedme, por tanto, sólo a Mi.", "urdu": " اور یہ تمہاری جماعت (یعنی نبیوں کی) ایک ہی جماعت ہے اور میں تمہارا رب ہوں‘ پس مجھے ہلاکت سے بچنے کے لئے اپنی ڈھال بناٶ۔"}, {"arabic": " فَتَقَطَّعُوۡۤا اَمۡرَہُمۡ بَیۡنَہُمۡ زُبُرًا ؕ کُلُّ حِزۡبٍۭ بِمَا لَدَیۡہِمۡ فَرِحُوۡنَ ﴿۵۴﴾", "english": " But they (the people) have cut up their affairs among themselves forming themselves into parties, each group rejoicing in what they have.", "french": " Ils ont scindé leurs affaires morceau par morceau entre eux-mêmes, chaque groupe jubilant sur ce qu’ils avaient.", "german": " Aber sie wurden uneinig untereinander und spalteten sich in Parteien, und jede Partei freute sich über das, was sie selbst hatte.", "spanish": " Dividen sus asuntos entre ellos trozo a trozo, solazándose cada grupo con lo que tienen.", "urdu": " جس پر انہوں (یعنی کفار) نے شریعت کو ٹکڑے ٹکڑے کر دیا‘ اور ہر فرقہ نے جو ٹکڑا اپنے لئے اختیار کیا‘ اس پر فخر کرنے لگے۔"}, {"arabic": " فَذَرۡہُمۡ فِیۡ غَمۡرَتِہِمۡ حَتّٰی حِیۡنٍ ﴿۵۵﴾", "english": " So leave them in their confusion for a time.", "french": " Laisse-les donc, pendant quelque temps, dans leur confusion.", "german": " Darum überlasse sie eine Zeitlang ihrer Unwissenheit.", "spanish": " Dejadlos pues en su confusión durante algún tiempo.", "urdu": " پس تو ان کو ایک مدت تک اپنی غفلت میں پڑا رہنے دے۔"}, {"arabic": " اَیَحۡسَبُوۡنَ اَنَّمَا نُمِدُّہُمۡ بِہٖ مِنۡ مَّالٍ وَّ بَنِیۡنَ ﴿ۙ۵۶﴾", "english": " Do they think that by the wealth and children with which We help them,", "french": " Croient-ils que par les biens et les enfants avec lesquels Nous les aidons,", "german": " Wähnen sie etwa, dass durch die Glücksgüter und die Söhne, womit Wir ihnen helfen,", "spanish": " ¿Piensan acaso que con la riqueza y los hijos con que les ayudamos,", "urdu": " کیا وہ خیال کرتے ہیں کہ ہمارا ان کو مال اور بیٹوں سے مدد دینا ان کو نیکیوں میں جلد جلد بڑھانا ہے؟"}, {"arabic": " نُسَارِعُ لَہُمۡ فِی الۡخَیۡرٰتِ ؕ بَلۡ لَّا یَشۡعُرُوۡنَ ﴿۵۷﴾", "english": " We hasten to do them good? Nay, but they understand not.", "french": " Nous Nous empressons de leur faire du bien ? Certainement pas, mais ils ne s’ en rendent pas compte.", "german": " wir Uns beeilen, ihnen Gutes zu tun? Nein, sie verstehen nicht.", "spanish": " Nos apresuramos a hacerles el bien? No, pero no lo entienden.", "urdu": " (ایسا نہیں) بلکہ وہ (حقیقت حال کو) سمجھتے نہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ ہُمۡ مِّنۡ خَشۡیَۃِ رَبِّہِمۡ مُّشۡفِقُوۡنَ ﴿ۙ۵۸﴾", "english": " Verily, those who fear their Lord, holding Him in reverence,", "french": " En vérité, ceux qui, par crainte de leur Seigneur, sont constamment en garde contre les péchés.", "german": " Wahrlich, jene, die erbeben in Ehrfurcht vor ihrem Herrn,", "spanish": " En verdad, quienes por temor a su Señor se guardan contra los pecados,", "urdu": " وہ لوگ جو اپنے رب کے ڈر سے کانپتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ بِاٰیٰتِ رَبِّہِمۡ یُؤۡمِنُوۡنَ ﴿ۙ۵۹﴾", "english": " And those who believe in the Signs of their Lord,", "french": " Et ceux qui croient aux Signes de leur Seigneur,", "german": " und jene, die an die Zeichen ihres Herrn glauben,", "spanish": " Quienes creen en los Signos de su Señor,", "urdu": " اور وہ لوگ جو اپنے رب کی آیتوں پر ایمان لاتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ ہُمۡ بِرَبِّہِمۡ لَا یُشۡرِکُوۡنَ ﴿ۙ۶۰﴾", "english": " And those who ascribe not partners to their Lord,", "french": " Et ceux qui n’attribuent pas d’associés à leur Seigneur,", "german": " und jene, die ihrem Herrn nicht Götter zur Seite stellen,", "spanish": " Quienes no asocian partícipes a su Señor,", "urdu": " اور جو اپنے رب کا شریک کسی کو نہیں بناتے۔"}, {"arabic": " وَ الَّذِیۡنَ یُؤۡتُوۡنَ مَاۤ اٰتَوۡا وَّ قُلُوۡبُہُمۡ وَجِلَۃٌ اَنَّہُمۡ اِلٰی رَبِّہِمۡ رٰجِعُوۡنَ ﴿ۙ۶۱﴾", "english": " And those who give what they give while their hearts are full of fear because to their Lord they will return —", "french": " Et ceux qui donnent ce qu’ils donnent, le cœur plein de crainte parce que c’est auprès de leur Seigneur qu’ils retourneront,", "german": " und jene, die da spenden, was sie spenden; und ihre Herzen zittern, weil sie zu ihrem Herrn zurückkehren werden –", "spanish": " Y quienes dan lo que dan con sus corazones llenos de temor porque volverán a su Señor,", "urdu": " اور جو (خدا کے بخشے ہوئے) مال کو (آگے مستحقین کو) دیتے رہتے ہیں اور ان کے دل اس بات سے ڈرتے رہتے ہیں کہ انہیں ایک دن اپنے رب کے پاس لوٹ کر جانا ہوگا۔"}, {"arabic": " اُولٰٓئِکَ یُسٰرِعُوۡنَ فِی الۡخَیۡرٰتِ وَ ہُمۡ لَہَا سٰبِقُوۡنَ ﴿۶۲﴾", "english": " These it is who hasten to do good works, and these it is who are foremost in them.", "french": " Ceux-là qui s’empressent de faire de bonnes œuvres, et en cela, ils sont les plus diligents.", "german": " sie sind es, die sich beeilen in guten Werken und die ihnen darin voran sind.", "spanish": " Son éstos quienes se apresuran a hacer las buenas obras y quienes serán los primeros de todos ellos.", "urdu": " یہی لوگ نیکیوں میں جلدی کرنے والے ہیں اور وہ ان (نیکیوں) کی طرف ایک دوسرے سے آگے بڑھتے جا رہے ہیں۔"}, {"arabic": " وَ لَا نُکَلِّفُ نَفۡسًا اِلَّا وُسۡعَہَا وَ لَدَیۡنَا کِتٰبٌ یَّنۡطِقُ بِالۡحَقِّ وَ ہُمۡ لَا یُظۡلَمُوۡنَ ﴿۶۳﴾", "english": " And We burden not any soul beyond its capacity, and with Us is a Book that speaks the truth, and they will not be wronged.", "french": " Et Nous ne chargeons aucune âme au-delà de sa capacité, et avec Nous, se trouve un Livre qui dit la vérité, et ils ne seront pas injustement traités.", "german": " Wir belasten niemanden über sein Vermögen. Wir haben ein Buch, das die Wahrheit spricht; und es soll ihnen kein Unrecht geschehen.", "spanish": " Y no imponemos a ningún alma una carga superior a su capacidad, pues con Nosotros hay un Libro que dice la verdad, y no serán defraudados.", "urdu": " اور ہم کسی جان کے ذمہ کوئی کام نہیں لگاتے مگر اس کی طاقت کے مطابق۔ اور ہمارے پاس ایک اعمال نامہ ہے جو سچی سچی بات کہتا ہے اور ان پر کوئی ظلم نہیں کیا جائے گا۔"}, {"arabic": " بَلۡ قُلُوۡبُہُمۡ فِیۡ غَمۡرَۃٍ مِّنۡ ہٰذَا وَ لَہُمۡ اَعۡمَالٌ مِّنۡ دُوۡنِ ذٰلِکَ ہُمۡ لَہَا عٰمِلُوۡنَ ﴿۶۴﴾", "english": " Nay, their hearts are utterly heedless of this Book , and besides that they have deeds in which they are engaged;", "french": " Non, leur cœur en est complètement insouciant, et leurs œuvres sont différentes de celles qu’ils font apparaître", "german": " Nein, ihre Herzen sind gänzlich unachtsam dieses (Buches), und außerdem begehen sie Taten, die sie beharrlich fortsetzen,", "spanish": " No, sus corazones se muestran totalmente despreocupados ante este Libro , y además tienen obras a las que están dedicados;", "urdu": " لیکن ان کے دل تو اس تعلیم کے متعلق غفلت میں پڑے ہوئے ہیں اور اس کے سوا ان کے اور بھی بہت سے (خراب) اعمال ہیں جو وہ کر رہے ہیں۔"}, {"arabic": " حَتّٰۤی اِذَاۤ اَخَذۡنَا مُتۡرَفِیۡہِمۡ بِالۡعَذَابِ اِذَا ہُمۡ یَجۡـَٔرُوۡنَ ﴿ؕ۶۵﴾", "english": " Until, when We seize those of them who indulge in luxury with punishment, behold, they cry for help.", "french": " Jusqu’à ce que Nous saisissions par le châtiment ceux d’entre eux qui vivent dans le luxe, et voilà, ils crient au secours !", "german": " bis sie wenn Wir die Reichen unter ihnen mit Strafe erfassen um Hilfe schreien.", "spanish": " Hasta que, cuando caigamos con el castigo sobre quienes se entregan a la ostentación, griten pidiendo ayuda;", "urdu": " یہاں تک کہ جب ہم ان میں سے آسودہ حال لوگوں کو عذاب میں گرفتار کر لیتے ہیں تو اچانک وہ فریادیں کرنے لگ جاتے ہیں۔"}, {"arabic": " لَا تَجۡـَٔرُوا الۡیَوۡمَ ۟ اِنَّکُمۡ مِّنَّا لَا تُنۡصَرُوۡنَ ﴿۶۶﴾", "english": " ‘Cry not for help this day, surely you shall not be helped by Us.", "french": " « Ne criez pas au secours ce jour, assurément, vous ne serez pas secourus par Nous.", "german": " „Schreit nicht um Hilfe heute, denn ihr sollt bei Uns keine Hilfe finden.", "spanish": " “No pidáis ayuda en este día, pues ciertamente no recibiréis ayuda Nuestra”,", "urdu": " (اس وقت ہم ان سے کہتے ہیں) آج فریادیں نہ کرو‘ ہماری طرف سے تمہیں کوئی مدد نہ پہنچے گی۔"}, {"arabic": " قَدۡ کَانَتۡ اٰیٰتِیۡ تُتۡلٰی عَلَیۡکُمۡ فَکُنۡتُمۡ عَلٰۤی اَعۡقَابِکُمۡ تَنۡکِصُوۡنَ ﴿ۙ۶۷﴾", "english": " ‘Verily, My Signs were recited unto you, but you used to turn back on your heels,", "french": " En vérité, Mes Signes vous furent récités, mais vous aviez l’habitude de vous retourner sur vos talons et de vous éloigner ,", "german": " Meine Zeichen wurden euch vorgetragen, ihr aber pflegtet euch umzukehren auf euren Fersen,", "spanish": " “En verdad, Mis Signos os fueron recitados, pero acostumbrabais a volver las espaldas”,", "urdu": " میری آیتیں تم کو پڑھ کر سنائی جاتی تھیں‘ مگر تم ان سے بے پروائی کا اظہار کرتے ہوئے اور بے ہودہ باتیں کرتے ہوئے اور اس سے روگردانی کرتے ہوئے اپنی ایڑیوں کے بل پھر جایا کرتے تھے۔"}, {"arabic": " مُسۡتَکۡبِرِیۡنَ ٭ۖ بِہٖ سٰمِرًا تَہۡجُرُوۡنَ ﴿۶۸﴾", "english": " ‘Big with pride, telling stories about it (the Qur’an) by night, talking nonsense.’", "french": " Pleins d’orgueil, disant des sottises la nuit à son sujet - le Coran . «", "german": "", "spanish": " “Hinchados de orgullo, contando historias sobre él (el Corán) por la noche, diciendo sandeces”.", "urdu": " میری آیتیں تم کو پڑھ کر سنائی جاتی تھیں‘ مگر تم ان سے بے پروائی کا اظہار کرتے ہوئے اور بے ہودہ باتیں کرتے ہوئے اور اس سے روگردانی کرتے ہوئے اپنی ایڑیوں کے بل پھر جایا کرتے تھے۔"}, {"arabic": " اَفَلَمۡ یَدَّبَّرُوا الۡقَوۡلَ اَمۡ جَآءَہُمۡ مَّا لَمۡ یَاۡتِ اٰبَآءَہُمُ الۡاَوَّلِیۡنَ ﴿۫۶۹﴾", "english": " Have they not, then, pondered over the Divine Word, or has that come unto them which came not to their fathers of old?", "french": " N’ont-ils donc pas médité la Parole Divine , ou leur est-il venu ce qui n’était pas venu jadis à leurs pères ?", "german": " Haben sie denn das Wort nicht bedacht, oder ist zu ihnen gekommen, was nicht zu ihren Vorvätern kam?", "spanish": " ¿No han reflexionado, acaso, sobre la Palabra Divina , o les ha llegado lo que no llegó a sus antiguos padres?", "urdu": " کیا ان لوگوں نے اس قول (یعنی قرآن) پر غور نہیں کیا۔ یا ان کو وہ (وعدہ) ملا ہے جوان کے پہلے باپ دادوں کو نہیں ملا تھا۔"}, {"arabic": " اَمۡ لَمۡ یَعۡرِفُوۡا رَسُوۡلَہُمۡ فَہُمۡ لَہٗ مُنۡکِرُوۡنَ ﴿۫۷۰﴾", "english": " Or do they not recognize their Messenger, that they thus deny him?", "french": " Ou ne reconnaissent-ils pas leur Messager, au point qu’ils le nient ainsi ?", "german": " Oder kennen sie ihren Gesandten nicht, dass sie Ihn verleugnen?", "spanish": " O ¿acaso no reconocen a su Mensajero, que así lo niegan?", "urdu": " (اور) کیا انہوں نے اپنے رسول کو نہیں پہچانا‘ جس کی وجہ سے وہ اس کا انکار کر رہے ہیں۔"}, {"arabic": " اَمۡ یَقُوۡلُوۡنَ بِہٖ جِنَّۃٌ ؕ بَلۡ جَآءَہُمۡ بِالۡحَقِّ وَ اَکۡثَرُہُمۡ لِلۡحَقِّ کٰرِہُوۡنَ ﴿۷۱﴾", "english": " Or do they say, there is madness in him? Nay, he has brought them the truth, and most of them hate the truth.", "french": " Ou est-ce qu’ils disent : « C’est un insensé ? » Non, il leur a apporté la vérité, et la plupart d’entre eux détestent la vérité.", "german": " Oder sprechen sie: \"Er ist ein Besessener?\" Nein, er hat ihnen die Wahrheit gebracht, und die meisten von ihnen hassen die Wahrheit.", "spanish": " ¿O bien dicen que hay locura en él? ¡No!, les ha traído la verdad, y la mayoría de ellos odian la verdad.", "urdu": " کیا وہ کہتے ہیں کہ اس کو جنون ہے (مگر ایسی بات نہیں) بلکہ وہ ان کے پاس حق لے کر آیا ہے اور ان میں سے اکثر لوگ حق کو ناپسند کرتے ہیں۔"}, {"arabic": " وَ لَوِ اتَّبَعَ الۡحَقُّ اَہۡوَآءَہُمۡ لَفَسَدَتِ السَّمٰوٰتُ وَ الۡاَرۡضُ وَ مَنۡ فِیۡہِنَّ ؕ بَلۡ اَتَیۡنٰہُمۡ بِذِکۡرِہِمۡ فَہُمۡ عَنۡ ذِکۡرِہِمۡ مُّعۡرِضُوۡنَ ﴿ؕ۷۲﴾", "english": " And if the Truth had followed their desires, verily, the heavens and the earth and whosoever is therein would have been corrupted. Nay, We have brought them their admonition, but from their own admonition they now turn aside.", "french": " Et si la vérité devait être conforme à leurs désirs, les cieux et la terre et tout ce qui s’y trouve seraient tombés en chaos. Non, Nous leur avons apporté leur Admonition, mais c’est de leur propre Admonition qu’ils se détournent à présent .", "german": " Und wenn die Wahrheit sich nach ihren Begierden gerichtet hätte, wahrlich, die Himmel und die Erde und wer darinnen ist, wären in Unordnung gestürzt worden. Nein, Wir haben ihnen ihre Ehre gebracht, doch von ihrer eigenen Ehre kehren sie sich ab.", "spanish": " Mas si la verdad hubiera de seguir sus deseos, los cielos y la tierra, y cuanto encierran, habrían caído en el caos. ¡No!, les hemos traído su advertencia, pero ellos se apartan ahora de su propia advertencia.", "urdu": " اور اگر حق ان کی خواہشات کی اتباع کرتا تو آسمان اور زمین اور جو ان کے اندر بستے ہیں تباہ ہو جاتے۔ حقیقت یہ ہے کہ ہم ان کے پاس ان کی عزت کا سامان لے کر آئے ہیں اور وہ اپنی عزت کے سامان سے اعراض کر رہے ہیں۔"}, {"arabic": " اَمۡ تَسۡـَٔلُہُمۡ خَرۡجًا فَخَرَاجُ رَبِّکَ خَیۡرٌ ٭ۖ وَّ ہُوَ خَیۡرُ الرّٰزِقِیۡنَ ﴿۷۳﴾", "english": " Or dost thou ask of them any reward? But the reward of thy Lord is best; and He is the Best of providers.", "french": " Ou leur demandes-tu une récompense quelconque ? Mais la récompense de ton Seigneur est meilleure ; et Il est le Meilleur des pourvoyeurs.", "german": " Oder forderst du von ihnen irgend Lohn? Doch der Lohn deines Herrn ist besser; und Er ist der beste Versorger.", "spanish": " O ¿les pides retribución alguna? Pues la recompensa de Tu Señor es la mejor; y Él es el Mejor de los proveedores.", "urdu": " کیا تو ان سے کوئی تاوان مانگتا ہے (ایسا نہیں ہو سکتا) کیونکہ تیرے رب کا دیا ہوا مال بہت اچھا ہے اور وہ (رب) بہترین رزق دینے والا ہے۔"}, {"arabic": " وَ اِنَّکَ لَتَدۡعُوۡہُمۡ اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۷۴﴾", "english": " And most surely thou invitest them to a right path.", "french": " Et très assurément tu les invites à un droit chemin ;", "german": " Und gewiss, du lädst sie zu einem geraden Weg;", "spanish": " Y es absolutamente cierto que tú los invitas a un camino recto.", "urdu": " اور تو ان کو سیدھے راستے کی طرف بلاتا ہے۔"}, {"arabic": " وَ اِنَّ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ عَنِ الصِّرَاطِ لَنٰکِبُوۡنَ ﴿۷۵﴾", "english": " And those who believe not in the Hereafter, are indeed deviating from that path.", "french": " Et ceux qui ne croient pas en l’au-delà dévient assurément de ce chemin-là.", "german": " und jene, die nicht an das Jenseits glauben, weichen wahrlich ab von dem Weg.", "spanish": " Mas quienes no creen en el Más Allá se están desviando en verdad de ese camino.", "urdu": " اور جو لوگ آخرت پر ایمان نہیں لاتے وہ (سچے) راستہ سے ہٹنے والے ہیں۔"}, {"arabic": " وَ لَوۡ رَحِمۡنٰہُمۡ وَ کَشَفۡنَا مَا بِہِمۡ مِّنۡ ضُرٍّ لَّلَجُّوۡا فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۷۶﴾", "english": " And if We had mercy on them and relieved them of their affliction, they would still persist in their transgression, wandering blindly.", "french": " Et si Nous prenions pitié d’eux et les soulagions de leur affliction, ils s’obstineraient encore dans leur transgression, errant aveuglément.", "german": " Und hätten Wir Uns ihrer erbarmt und sie von ihrer Drangsal befreit, sie würden dennoch in ihrer Widerspenstigkeit verharren, verblendet irre wandernd.", "spanish": " Pero si tuviésemos misericordia de ellos y los libráramos de su angustia seguirían persistiendo en su transgresión, extraviados ciegamente.", "urdu": " اور اگر ہم ان پر رحم کریں اور جو ضرر ان کو پہنچ رہا ہے۔ اس کو دور کر دیں تو وہ اپنی سرکشی میں اور بھی بڑھ جائیں۔"}, {"arabic": " وَ لَقَدۡ اَخَذۡنٰہُمۡ بِالۡعَذَابِ فَمَا اسۡتَکَانُوۡا لِرَبِّہِمۡ وَ مَا یَتَضَرَّعُوۡنَ ﴿۷۷﴾", "english": " We did seize them with punishment, but they humbled not themselves to their Lord, nor would they supplicate in lowliness .", "french": " Nous les avons déjà saisis du châtiment, mais ils ne se sont pas humiliés devant leur Seigneur, et n’ont pas voulu supplier non plus ;", "german": " Wir haben sie mit Strafe erfasst, doch sie haben sich ihrem Herrn nicht unterworfen, noch haben sie sich gedemütigt –", "spanish": " Nosotros les aplicamos el castigo, pero no se humillaron ante su Señor, ni suplicaron modestamente.", "urdu": " اور ہم نے ان کو سخت عذاب میں جکڑ رکھا ہے پھر بھی وہ اپنے رب کے سامنے عاجزانہ طور پر نہیں جھکے اور نہ اس کے سامنے گریہ و زاری کی۔"}, {"arabic": " حَتّٰۤی اِذَا فَتَحۡنَا عَلَیۡہِمۡ بَابًا ذَا عَذَابٍ شَدِیۡدٍ اِذَا ہُمۡ فِیۡہِ مُبۡلِسُوۡنَ ﴿٪۷۸﴾", "english": " Until, when We open on them a gate of severe chastisement, behold, they are in despair thereat.", "french": " Jusqu’à ce que, quand Nous ouvrons sur eux une porte d’un châtiment sévère, et voilà qu’ils sont plongés dans le désespoir.", "german": " bis dass, Wir vor ihnen ein Tor zu strenger Strafe öffnen werden. Siehe, da werden sie in Verzweiflung darüber sein.", "spanish": " Hasta que, cuando abrimos sobre ellos la puerta del castigo severo, helos ahí desesperados ante él.", "urdu": " یہاں تک کہ جب ہم ان پر ایک سخت عذاب کا دروازہ کھول دیں گے تو وہ مایوس ہو کر بیٹھ جائیں گے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡۤ اَنۡشَاَ لَکُمُ السَّمۡعَ وَ الۡاَبۡصَارَ وَ الۡاَفۡـِٕدَۃَ ؕ قَلِیۡلًا مَّا تَشۡکُرُوۡنَ ﴿۷۹﴾", "english": " And He it is Who has created for you ears, and eyes, and hearts; but little thanks do you give.", "french": " Et c’est Lui Qui a créé pour vous des oreilles, et des yeux, et un cœur ; mais vous Lui montrez peu de reconnaissance.", "german": " Er ist es, Der euch Ohren und Augen und Herzen geschaffen hat. Ihr wisst wenig Dank.", "spanish": " Él es Quien ha creado para vosotros oídos, ojos y corazones; mas poco lo agradecéis.", "urdu": " اور وہ خدا ہی ہے جس نے تمہارے لئے کان اور آنکھیں اور دل پیدا کیا ہے۔ لیکن تم بالکل شکر نہیں کرتے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ ذَرَاَکُمۡ فِی الۡاَرۡضِ وَ اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۸۰﴾", "english": " And He it is Who has multiplied you in the earth, and unto Him shall you be gathered.", "french": " Et c’est Lui Qui vous a multipliés sur la terre, et c’est vers Lui que vous serez tous rassemblés.", "german": " Und Er ist es, Der euch auf der Erde gemehrt hat, und zu Ihm werdet ihr versammelt werden.", "spanish": " Y Él es Quien ha originado vuestro crecimiento en la tierra, y ante Él seréis reunidos.", "urdu": " اور وہی ہے جس نے زمین میں تم کو پھیلا دیا ہے اور تم اسی کی طرف اکٹھے کیے جاٶ گے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ یُحۡیٖ وَ یُمِیۡتُ وَ لَہُ اخۡتِلَافُ الَّیۡلِ وَ النَّہَارِ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۸۱﴾", "english": " And He it is Who gives life and causes death, and in His hands is the alternation of night and day. Will you not then understand?", "french": " Et c’est Lui Qui donne la vie et Qui cause la mort, et l’alternance de la nuit et du jour dépend de Lui. Ne voulez-vous donc pas comprendre ?", "german": " Und Er ist es, Der Leben gibt und Tod verursacht, und in Seinen Händen ist der Wechsel von Nacht und Tag. Wollt ihr denn nicht begreifen?", "spanish": " Él es Quien da la vida y causa la muerte, y en Sus manos está la sucesión de la noche y el día. ¿Es que no entenderéis?", "urdu": " اور وہی ہے جو تمہیں زندہ کرتا ہے اور جو تمہیں مارے گا اور رات اور دن کا آگے پیچھے آنا اسی کے اختیار میں ہے کیا تم عقل نہیں کرتے۔"}, {"arabic": " بَلۡ قَالُوۡا مِثۡلَ مَا قَالَ الۡاَوَّلُوۡنَ ﴿۸۲﴾", "english": " But they say like what the former people said.", "french": " Mais ils disent des choses pareilles à celles que disait le peuple antérieur.", "german": " Sie aber sprechen, wie schon die Alten sprachen.", "spanish": " Pero dicen lo que dijeron los pueblos anteriores.", "urdu": " حقیقت یہ ہے کہ وہ وہی بات کہتے ہیں جو ان سے پہلوں نے کہی تھی۔"}, {"arabic": " قَالُوۡۤا ءَ اِذَا مِتۡنَا وَ کُنَّا تُرَابًا وَّ عِظَامًا ءَ اِنَّا لَمَبۡعُوۡثُوۡنَ ﴿۸۳﴾", "english": " They say, ‘What! when we are dead and have become mere dust and bones, shall we indeed be raised up again?", "french": " Ils disent : « Comment ! Lorsque nous serons morts et que nous serons devenus poussière et ossements, serons-nous en vérité ressuscités ?", "german": " Sie sagen: \"Wie! wenn wir gestorben und Staub und Knochen geworden sind, sollen wir dann wirklich auferweckt werden?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:83&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:83&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic84\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic84\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:84' style='text-decoration:underline'>23:84</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(84)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control84\"></i></button> <audio id=\"player84\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَقَدۡ وُعِدۡنَا نَحۡنُ وَ اٰبَآؤُنَا ہٰذَا مِنۡ قَبۡلُ اِنۡ ہٰذَاۤ اِلَّاۤ اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿۸۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘This is what we have been promised before, we and our fathers. This is nothing but fables of the ancients.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_84_d' href='#'>d</a>]</sup>‘This is what we have been promised before, we and our fathers. This is nothing but fables of the ancients.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_84_d'>d</span></div> <div><div class='reference' data-id='ref_23_84_d' style='display:none'> <p><b>d.</b> <a href='/quran/27:69' target=_blank>27:69</a>. (<a href='javascript:void(0)' data-id='ref_23_84_d' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً ہم سے اور ہمارے آباءو اجداد سے بھی اس سے پہلے یہی وعدہ کیا گیا تھا۔ یہ کچھ نہیں مگر پہلے لوگوں کی کہانیاں ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اس سے پہلے اسی بات کا وعدہ ہم سے اور ہمارے باپ دادوں سے کیا گیا تھا (مگر ایسا نہیں ہوا) یہ تو صرف پہلوں کی کہانیاں ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« C’est ce qui nous a été promis auparavant, à nous et à nos pères. Ce ne sont que des fables des anciens. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Esto es lo que se nos prometió antes, a nosotros y a nuestros padres. No son más que fábulas de los antiguos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dies ist uns verheißen worden, uns und unseren Vätern zuvor. Das sind ja nichts als Fabeln der Alten.\"", "spanish": " Dicen: “¡Cómo! Cuando estemos muertos y nos hayamos convertido en polvo, ¿seremos, en verdad, resucitados de nuevo?", "urdu": " انہوں نے کہا تھا کہ کیا جب ہم مرجائیں گے اور مٹی ہو جائیں گے اور ہڈیاں بن جائیں گے توہم پھراٹھائے جائیں گے؟"}, {"arabic": " قُلۡ لِّمَنِ الۡاَرۡضُ وَ مَنۡ فِیۡہَاۤ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۸۵﴾", "english": " Say, ‘To whom belongs the earth and whosoever is therein, if you know?’", "french": " Dis : « A qui appartiennent la terre et quiconque s’y trouve, si vous le savez ? »", "german": " Sprich: \"Wessen ist die Erde und wer auf ihr ist, wenn ihr es wisset?\"", "spanish": " Diles: “¿a quién pertenece la tierra y cuanto en ella existe, si es que lo sabéis?”.", "urdu": " تو کہدے کہ اگر تم جانتے ہو تو (بتاٶ تو سہی) یہ سب زمین اور جو کچھ اس میں ہے کس کا ہے؟"}, {"arabic": " سَیَقُوۡلُوۡنَ لِلّٰہِ ؕ قُلۡ اَفَلَا تَذَکَّرُوۡنَ ﴿۸۶﴾", "english": " ‘To Allah’, they will say. Say, ‘Will you not then be admonished?’", "french": " Ils diront : « A Allāh. » Dis : « Ne voulez-vous donc pas prendre garde ? »", "german": " Sie werden sprechen: \"Allahs.\" Sprich: \"Wollt ihr denn nicht nachdenken?\"", "spanish": " “A Al-lah”, dirán. Diles: “¿No seréis pues advertidos?”.", "urdu": " یقیناً وہ (اس کے جواب میں) کہیں گے اللہ کا۔ اس پر تو کہہ دے‘ کیا تم سمجھ سے کام نہیں لیتے؟"}, {"arabic": " قُلۡ مَنۡ رَّبُّ السَّمٰوٰتِ السَّبۡعِ وَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ ﴿۸۷﴾", "english": " Say, ‘Who is the Lord of the seven heavens, and the Lord of the Great Throne?’", "french": " Dis : « Qui est le Seigneur des sept cieux, et le Seigneur du Grand Trône ? »", "german": " Sprich: \"Wer ist der Herr der sieben Himmel und der Herr des Großen Throns?\"", "spanish": " Diles: “¿Quién es el Señor de los siete cielos y el Señor del Gran Trono?”.", "urdu": " (پھر) تو (ان سے) کہہ کہ ساتوں آسمان اور عرش عظیم کا رب کون ہے؟"}, {"arabic": " سَیَقُوۡلُوۡنَ لِلّٰہِ ؕ قُلۡ اَفَلَا تَتَّقُوۡنَ ﴿۸۸﴾", "english": " They will say, ‘ They are Allah’s.’ Say, ‘Will you not then take Him as your Protector?’", "french": " Ils diront : « Ils appartiennent à Allāh. » Dis : « Ne vivrez-vous donc pas avec crainte ? »", "german": " Sie werden sprechen: \"(Sie sind) Allahs.\" Sprich: \"Wollt ihr denn nicht (Ihn) zum Beschützer nehmen?\"", "spanish": " Responderán: “Pertenecen a Al-lah”. Diles: “¿No seréis entonces temerosos?”.", "urdu": " وہ فوراً کہیں گے (یہ سب) اللہ کے ہیں۔ تو کہہ دے کیا پھر تم (اس خدا کے ذریعہ سے تباہی سے) بچنے کی کوشش نہیں کرتے؟"}, {"arabic": " قُلۡ مَنۡۢ بِیَدِہٖ مَلَکُوۡتُ کُلِّ شَیۡءٍ وَّ ہُوَ یُجِیۡرُ وَ لَا یُجَارُ عَلَیۡہِ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۸۹﴾", "english": " Say, ‘In Whose hand is the dominion over all things and Who protects, but against Whom there is not protection, if you know?’", "french": " Dis : « Dans la main de Qui se trouve l’empire sur toutes choses, et Qui protège, mais contre Qui il n’y a aucune protection, si seulement vous le savez ? »", "german": " Sprich: \"Wer ist es, in Dessen Hand die Herrschaft über alle Dinge ist und Der Schutz gewährt, aber gegen Den es keinen Schutz gibt, wenn ihr es wisset?\"", "spanish": " Diles: “¿En manos de Quién está el dominio sobre todas las cosas y Quién protege, pero contra Quién no hay protección, si es que lo sabéis?”.", "urdu": " (نیز) تو کہہ دے کہ کس کے قبضہ میں ہر چیز کی بادشاہت ہے اور وہ (سب کو) پناہ دیتا ہے‘ ہاں اس کے عذاب کے خلاف کوئی دوسرا پناہ نہیں دے سکتا۔ اگر تم جانتے ہو (تو اس کو سمجھ سکتے ہو)"}, {"arabic": " سَیَقُوۡلُوۡنَ لِلّٰہِ ؕ قُلۡ فَاَنّٰی تُسۡحَرُوۡنَ ﴿۹۰﴾", "english": " They will say, ‘ All this belongs to Allah.’ Say, ‘How then are you deluded?’", "french": " Ils diront : « Tout cela appartient à Allāh. » Dis : « Comment donc vous êtes-vous abusés ? »", "german": " Sie werden sprechen: \"(All dies ist) Allah vorbehalten.\" Sprich: \"Wie also seid ihr verblendet?\"", "spanish": " Responderán: “Todo esto pertenece a Al-lah”. Diles: “¿Cómo pues os habéis engañado?”.", "urdu": " وہ (اوپر کا سوال سن کر) فوراً کہیں گے۔ اللہ کے (قبضہ میں) اس پر تو کہہ دے کہ پھر تمہیں دھوکہ دے کر کدھر لے جایا جا رہا ہے۔"}, {"arabic": " بَلۡ اَتَیۡنٰہُمۡ بِالۡحَقِّ وَ اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿۹۱﴾", "english": " Yea, We have brought them the truth, and they are certainly liars.", "french": " Oui sans doute, Nous leur avons apporté la vérité, et certainement ils sont des menteurs.", "german": " Ja, Wir haben ihnen die Wahrheit gebracht, doch wahrhaftig, sie leugnen sie.", "spanish": " Sí, les hemos traído la verdad, y son ciertamente mentirosos.", "urdu": " حقیقت یہ ہے کہ ہم ان کے پاس حق لائے ہیں اور وہ اس کے قطعی منکر ہیں۔"}, {"arabic": " مَا اتَّخَذَ اللّٰہُ مِنۡ وَّلَدٍ وَّ مَا کَانَ مَعَہٗ مِنۡ اِلٰہٍ اِذًا لَّذَہَبَ کُلُّ اِلٰہٍۭ بِمَا خَلَقَ وَ لَعَلَا بَعۡضُہُمۡ عَلٰی بَعۡضٍ ؕ سُبۡحٰنَ اللّٰہِ عَمَّا یَصِفُوۡنَ ﴿ۙ۹۲﴾", "english": " Allah has not taken unto Himself any son, nor is there any other God along with Him; in that case each god would have taken away what he had created, and some of them would surely have dominated over others. Glorified be Allah above all that which they attribute to Him !", "french": " Allāh ne S’est pas pris de fils, et il n’y a pas non plus d’autre dieu avec Lui ; dans ce cas, chaque dieu aurait emporté ce qu’il avait créé, et assurément certains d’entre eux auraient dominé d’autres. Saint est Allāh bien au-dessus de tout ce qu’ils Lui attribuent !", "german": " Allah hat Sich keinen Sohn zugesellt, noch ist irgendein Gott neben Ihm: sonst würde jeder \"Gott\" mit sich fortgenommen haben, was er erschaffen, und die einen von ihnen hätten sich sicherlich gegen die anderen erhoben. Gepriesen sei Allah über all das, was sie behaupten!", "spanish": " Al-lah no ha tomado para Sí ningún hijo, ni hay ningún otro Dios junto a Él; en ese caso cada dios se habría apropiado de lo que hubiese creado, y algunos de ellos ciertamente habrían dominado sobre otros. ¡Glorificado sea Al-lah por encima de cuanto Le atribuyen!", "urdu": " اللہ نے کسی کو بیٹا نہیں بنایا اور اس کے ساتھ کوئی معبود نہیں (اگر ایسا ہوتا) تو ہر معبود اپنی پیدا کی ہوئی اشیا کو الگ کرکے لے جاتا۔ اور ان (معبودوں) میں سے بعض بعض پر ہلہ بول دیتے۔ اللہ پاک ہے اس سے جو یہ باتیں کرتے ہیں۔"}, {"arabic": " عٰلِمِ الۡغَیۡبِ وَ الشَّہَادَۃِ فَتَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿٪۹۳﴾", "english": " Knower of the unseen and of the seen! Exalted therefore is He above all that which they associate with Him !", "french": " Celui Qui connaît l’invisible, ainsi que le visible ! Exalté est-Il donc bien au-dessus de tout ce qu’ils Lui associent !", "german": " Der Kenner des Verborgenen und des Offenbaren! Erhaben ist Er darum über das, was sie anbeten.", "spanish": " ¡Conocedor de lo invisible y lo visible! ¡Exaltado sea Él, pues, por encima de todo lo que Le asocian!", "urdu": " وہ غیب کا بھی علم رکھتا ہے اور حاضر کا بھی (علم رکھتا ہے) پس جن کو وہ اس کا شریک بناتے ہیں ان سے وہ بہت اونچا ہے۔"}, {"arabic": " قُلۡ رَّبِّ اِمَّا تُرِیَنِّیۡ مَا یُوۡعَدُوۡنَ ﴿ۙ۹۴﴾", "english": " Say, ‘My Lord, if Thou wilt show me that with which they are threatened.", "french": " Dis : « Mon Seigneur, si Tu me montres ce dont ils sont menacés,", "german": " Sprich: \"Mein Herr, wenn Du mich schauen lassen willst, was ihnen angedroht ward,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:94&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:94&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic95\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic95\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:95' style='text-decoration:underline'>23:95</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(95)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control95\"></i></button> <audio id=\"player95\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">رَبِّ فَلَا تَجۡعَلۡنِیۡ فِی الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿۹۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘My Lord, then place me not with the wrongdoing people.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘My Lord, then place me not with the wrongdoing people.’<sup class='ref'>[<a class='ref' data-id='ref_23_95_2014' href='#'>2014</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_95_2014'>2014</span></div> <div><a name='2014'></a><div class='reference' data-id='ref_23_95_2014' style='display:none'> <p><b>2014.</b> The <i>Surah </i>was revealed towards the end of the Meccan period. The Holy Prophet was about to leave Mecca. His departure was a signal and a sign that as the result of his persistent denial, persecution and expulsion from Mecca by the Quraish, Divine punishment was about to overtake them. He is taught to pray to God that when the threatened punishment should seize them he might not be present with them in Mecca. (<a href='javascript:void(0)' data-id='ref_23_95_2014' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اے میرے ربّ! پس مجھے ظالم قوم میں سے نہ بنا دینا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">تو اے میرے رب! تو مجھے ظالم قوم میں سے نہ بنائیو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Alors, mon Seigneur, ne me place pas en compagnie des injustes. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Señor mío, no me incluyas entonces entre las gentes inicuas”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">dann, mein Herr, setze mich nicht unter das Volk der Frevler.\"", "spanish": " Diles: “Mi Señor, si me muestras aquello con lo que están amenazados,", "urdu": " تو کہہ دے اے میرے رب! اگر تو میری زندگی میں وہ کچھ دکھا دے جس کا ان سے وعدہ کیا جا رہا ہے۔"}, {"arabic": " وَ اِنَّا عَلٰۤی اَنۡ نُّرِیَکَ مَا نَعِدُہُمۡ لَقٰدِرُوۡنَ ﴿۹۶﴾", "english": " And certainly We have the power to show thee that with which We threaten them.", "french": " Et certainement, Nous avons le pouvoir de te montrer ce dont Nous les menaçons.", "german": " Wir haben wahrlich die Macht, dich schauen zu lassen, was Wir ihnen androhen.", "spanish": " En verdad tenemos el poder para mostrarte aquello con lo que les amenazamos.", "urdu": " اور ہم اس بات پر قادر ہیں کہ جو ان سے وعدہ کرتے ہیں تجھے دکھادیں۔"}, {"arabic": " اِدۡفَعۡ بِالَّتِیۡ ہِیَ اَحۡسَنُ السَّیِّئَۃَ ؕ نَحۡنُ اَعۡلَمُ بِمَا یَصِفُوۡنَ ﴿۹۷﴾", "english": " Repel evil with that which is best. We are well acquainted with the things they allege.", "french": " Repousse le mal avec ce qu’il y a de meilleur. Nous connaissons le mieux les choses qu’ils allèguent.", "german": " Wehre das Böse ab mit dem, was das Beste ist. Wir wissen recht wohl, was für Dinge sie sagen.", "spanish": " Rechaza el mal con lo que es mejor. Conocemos muy bien las cosas que alegan.", "urdu": " تو ان کی بری باتوں کو ایسی (جوابی) باتوں سے دور کر جو نہایت خوبصورت ہوں۔ ہم ان کی باتوں کو خوب جانتے ہیں۔"}, {"arabic": " وَ قُلۡ رَّبِّ اَعُوۡذُ بِکَ مِنۡ ہَمَزٰتِ الشَّیٰطِیۡنِ ﴿ۙ۹۸﴾", "english": " And say, ‘My Lord, I seek refuge in Thee from the incitements of the evil ones.", "french": " Et dis : « Mon Seigneur, je cherche refuge en Toi contre les incitations des satans.", "german": "", "spanish": " Y di: “Mi Señor, en Ti busco refugio contra las incitaciones de los Satanes”.", "urdu": " اور تو کہہ دے اے میرے رب میں سرکش لوگوں کی شرارتوں سے تیری پناہ مانگتا ہوں۔"}, {"arabic": " وَ اَعُوۡذُ بِکَ رَبِّ اَنۡ یَّحۡضُرُوۡنِ ﴿۹۹﴾", "english": " ‘And I seek refuge in Thee, my Lord, lest they come near me.’", "french": " Et je cherche refuge en Toi, ô mon Seigneur, pour qu’ils ne m’approchent pas. »", "german": " Und ich nehme meine Zuflucht bei Dir, mein Herr, dass sie sich mir nicht nähern.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:99&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:99&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic100\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic100\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:100' style='text-decoration:underline'>23:100</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(100)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control100\"></i></button> <audio id=\"player100\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">حَتّٰۤی اِذَا جَآءَ اَحَدَہُمُ الۡمَوۡتُ قَالَ رَبِّ ارۡجِعُوۡنِ ﴿ۙ۱۰۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">Until, when death comes to one of them, he says <em>entreating</em>, ‘My Lord, send me back,</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> Until, when death comes to one of them, <sup class='ref'>[<a class='ref' data-id='ref_23_100_a' href='#'>a</a>]</sup>he says <i>entreating repeatedly</i>, ‘My Lord, send me back, <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_100_a'>a</span></div> <div><div class='reference' data-id='ref_23_100_a' style='display:none'> <p><b>a.</b> <a href='/quran/39:59' target=_blank>39:59</a>. (<a href='javascript:void(0)' data-id='ref_23_100_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہاں تک کہ جب ان میں سے کسی کو موت آجاتی ہے تو کہتا ہے اے میرے ربّ! مجھے لوٹا دیجیئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اس وقت جب ان میں سے کسی کی موت آجائے گی وہ کہے گا اے میرے رب مجھے واپس لوٹادے‘ مجھے واپس لوٹادے‘ مجھے واپس لوٹادے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Jusqu’à ce que, quand la mort vient à l’un d’entre eux, il dit : « Mon Seigneur, renvoie-moi,</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Hasta que, cuando la muerte llegue a uno de ellos, diga <em> encarecidamente: </em>“Señor mío, mándame de vuelta”,</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wenn der Tod an einen von ihnen herantritt, spricht er: \"Mein Herr, sende mich zurück,", "spanish": " “Y en Ti me refugio, Mi Señor, para que no se me acerquen”.", "urdu": " اور اے میرے رب! میں تیری پناہ مانگتا ہوں اس سے (بھی) کہ وہ میرے سامنے آجائیں۔"}, {"arabic": " لَعَلِّیۡۤ اَعۡمَلُ صَالِحًا فِیۡمَا تَرَکۡتُ کَلَّا ؕ اِنَّہَا کَلِمَۃٌ ہُوَ قَآئِلُہَا ؕ وَ مِنۡ وَّرَآئِہِمۡ بَرۡزَخٌ اِلٰی یَوۡمِ یُبۡعَثُوۡنَ ﴿۱۰۱﴾", "english": " ‘That I may do righteous deeds in the life that I have left behind. ’ Never, it is but a word that he utters. And behind them is a barrier until the day when they shall be raised again.", "french": " Afin que je puisse agir bien dans la vie que j’ai laissée en arrière . » Jamais de la vie, ce n’est qu’un mot qu’il prononce. Et derrière eux se trouve une barrière jusqu’au jour où ils seront ressuscités.", "german": " auf dass ich recht handeln möge in dem, was ich zurückließ.\" Keineswegs, es ist nur ein Wort, das er ausspricht. Und hinter ihnen ist eine Schranke bis zum Tage, an dem sie auferweckt werden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:101&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:101&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic102\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic102\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:102' style='text-decoration:underline'>23:102</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(102)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control102\"></i></button> <audio id=\"player102\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَاِذَا نُفِخَ فِی الصُّوۡرِ فَلَاۤ اَنۡسَابَ بَیۡنَہُمۡ یَوۡمَئِذٍ وَّ لَا یَتَسَآءَلُوۡنَ ﴿۱۰۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And when the trumpet is blown, there will be no ties of relationship between them that day, nor will they ask after one another.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And when <sup class='ref'>[<a class='ref' data-id='ref_23_102_c' href='#'>c</a>]</sup>the trumpet is blown, there will be no ties of relationship<sup class='ref'>[<a class='ref' data-id='ref_23_102_2018' href='#'>2018</a>]</sup> any more between them on that day, nor will they ask after one another. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_102_c'>c</span><span class='collapsible plus' data-id='ref_23_102_2018'>2018</span></div> <div><div class='reference' data-id='ref_23_102_c' style='display:none'> <p><b>c.</b> <a href='/quran/18:100' target=_blank>18:100</a>; <a href='/quran/36:52' target=_blank>36:52</a>; <a href='/quran/50:21' target=_blank>50:21</a>; <a href='/quran/69:14' target=_blank>69:14</a>. (<a href='javascript:void(0)' data-id='ref_23_102_c' class='ref'>close</a>)</p> </div> </div><div><a name='2018'></a><div class='reference' data-id='ref_23_102_2018' style='display:none'> <p><b>2018.</b> When punishment overtakes a people, pedigree, descent and relationship prove of no avail. On the Judgment Day good works alone will be of any use or benefit to man and not his blood relations or friendships. (<a href='javascript:void(0)' data-id='ref_23_102_2018' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس جب بگل میں پھونکا جائے گا تو اس دن ان کے درمیان کوئی رشتے نہیں رہیں گے اور نہ ہی وہ ایک دوسرے سے سوال کر سکیں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پھر جب بگل میں پھونک ماری جائے گی تو اس دن ان کے درمیان کوئی قرابتیں باقی نہیں رہیں گی اور نہ وہ ایک دوسرے کا حال پوچھیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et lorsqu’on sonnera de la trompe, il n’y aura ce jour-là nul lien de parenté entre eux et ils ne s’enquerront pas non plus les uns des autres.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Mas cuando suene la trompeta, no habrá lazos de parentesco entre ellos en ese día, ni se consultarán mutuamente.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und wenn in die Posaune gestoßen wird, dann werden keine Verwandtschaftsbande zwischen ihnen sein an jenem Tage, noch werden sie einander befragen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:102&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:102&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic103\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic103\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:103' style='text-decoration:underline'>23:103</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(103)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control103\"></i></button> <audio id=\"player103\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَمَنۡ ثَقُلَتۡ مَوَازِیۡنُہٗ فَاُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۱۰۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">Then those whose good works are heavy — these will be prosperous;</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> Then those <sup class='ref'>[<a class='ref' data-id='ref_23_103_a' href='#'>a</a>]</sup>whose scales are heavy—these will be prosperous; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_103_a'>a</span></div> <div><div class='reference' data-id='ref_23_103_a' style='display:none'> <p><b>a.</b> <a href='/quran/7:9' target=_blank>7:9</a>; <a href='/quran/101:7' target=_blank>101:7</a>, <a href='/quran/101:8' target=_blank>8</a>. (<a href='javascript:void(0)' data-id='ref_23_103_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس وہ جس کے (اعمال کے) پلڑے بھاری ہوئے تو یہی لوگ ہیں جو کامیاب ہونے والے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پس جن کے وزن بھاری ہو جائیں گے‘ وہ لوگ بامراد ہوں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Alors ceux dont les balances seront lourdes <em>par rapport à leurs bonnes œuvres,</em> ceux-là qui seront prospères.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Entonces, aquellos cuyas balanzas sean pesadas <em>en obras</em>: ésos serán los prósperos;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dann werden die, deren gute Werke gewichtig sind, die Erfolgreichen sein.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:103&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:103&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic104\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic104\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:104' style='text-decoration:underline'>23:104</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(104)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control104\"></i></button> <audio id=\"player104\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَنۡ خَفَّتۡ مَوَازِیۡنُہٗ فَاُولٰٓئِکَ الَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ فِیۡ جَہَنَّمَ خٰلِدُوۡنَ ﴿۱۰۴﴾ۚ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">But those whose good works are light — these are they who ruin their souls; in Hell will they abide.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> But those <sup class='ref'>[<a class='ref' data-id='ref_23_104_b' href='#'>b</a>]</sup>whose scales are light—these are they who will have ruined their souls; in Hell will they abide. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_104_b'>b</span></div> <div><div class='reference' data-id='ref_23_104_b' style='display:none'> <p><b>b.</b> <a href='/quran/7:10' target=_blank>7:10</a>; <a href='/quran/101:9' target=_blank>101:9</a>, <a href='/quran/101:10' target=_blank>10</a>. (<a href='javascript:void(0)' data-id='ref_23_104_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور وہ جن کے (اعمال کے) پلڑے ہلکے ہوئے تو یہی وہ لوگ ہیں جنہوں نے اپنے آپ کو نقصان پہنچایا۔ جہنم میں وہ لمبے عرصہ تک رہنے والے ہوں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور جن کے وزن ہلکے ہو جائیں گے وہ لوگ گھاٹے میں پڑیں گے (اور اپنی جانوں کو تباہ کر دیں گے) اور جہنم میں ہمیشہ رہیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Mais ceux dont les bonnes œuvres sont légères – ceux-là auront causé la perte de leur âme ; c’est en Enfer qu’ils demeureront longtemps,</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Pero aquellos cuyas balanzas sean ligeras; ésos son los que pierden sus almas; en el Infierno morarán.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Jene aber, deren gute Werke leicht wiegen, werden die sein, die ihre Seelen verlieren; in der Hölle müssen sie bleiben.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:104&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:104&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic105\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic105\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:105' style='text-decoration:underline'>23:105</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(105)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control105\"></i></button> <audio id=\"player105\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">تَلۡفَحُ وُجُوۡہَہُمُ النَّارُ وَ ہُمۡ فِیۡہَا کٰلِحُوۡنَ ﴿۱۰۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">The Fire will burn their faces and they will grin <em>with fear </em>therein.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_23_105_c' href='#'>c</a>]</sup>The Fire will scorch their faces and they will grin <i>with fear </i>therein. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_105_c'>c</span></div> <div><div class='reference' data-id='ref_23_105_c' style='display:none'> <p><b>c.</b> <a href='/quran/10:28' target=_blank>10:28</a>; <a href='/quran/14:51' target=_blank>14:51</a>; <a href='/quran/54:49' target=_blank>54:49</a>; <a href='/quran/80:42' target=_blank>80:42</a>. (<a href='javascript:void(0)' data-id='ref_23_105_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">آگ ان کے چہروں کو جھلسائے گی اور اس میں (چہرے کے اذیت ناک کھچاؤ سے) ان کی کچلیاں نظر آنے لگیں گی۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">آگ ان کے مونہوں کو جھلسے گی اور وہ اس میں روسیاہ ہو جائیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Le Feu leur brûlera le visage et ils y grimaçeront <em>de douleur</em> .</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">El Fuego quemará sus rostros y en él su mueca será de <em> angustia</em>.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Das Feuer wird ihre Gesichter verbrennen, und sie werden darin schwarze Gesichter haben.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:105&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:105&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic106\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic106\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:106' style='text-decoration:underline'>23:106</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(106)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control106\"></i></button> <audio id=\"player106\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَلَمۡ تَکُنۡ اٰیٰتِیۡ تُتۡلٰی عَلَیۡکُمۡ فَکُنۡتُمۡ بِہَا تُکَذِّبُوۡنَ ﴿۱۰۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Were not My Signs recited unto you, and you treated them as lies?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <i>It will be said to them</i>, <sup class='ref'>[<a class='ref' data-id='ref_23_106_d' href='#'>d</a>]</sup>‘Were not My Signs recited unto you, and you treated them as lies?’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_106_d'>d</span></div> <div><div class='reference' data-id='ref_23_106_d' style='display:none'> <p><b>d.</b> <a href='/quran/40:51' target=_blank>40:51</a>; <a href='/quran/45:32' target=_blank>45:32</a>; <a href='/quran/67:9' target=_blank>67:9</a>. (<a href='javascript:void(0)' data-id='ref_23_106_d' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا تم پر میری آیات نہیں پڑھی جاتی تھیں؟ پس تم انہیں جھٹلایا کرتے تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اور کہا جائے گا) کیا تمہارے سامنے میری آیتیں نہیں پڑھی جاتی تھیں؟ اور تم ان کا انکار نہیں کرتے تھے؟ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« Mes Signes ne vous ont-ils pas été récités, et ne les avez-vous pas traités de mensonges ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Acaso no se os recitaron Mis Signos y los tratasteis como mentiras?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wurden euch Meine Zeichen nicht vorgetragen, und ihr verwarfet sie?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:106&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:106&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic107\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic107\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:107' style='text-decoration:underline'>23:107</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(107)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control107\"></i></button> <audio id=\"player107\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالُوۡا رَبَّنَا غَلَبَتۡ عَلَیۡنَا شِقۡوَتُنَا وَ کُنَّا قَوۡمًا ضَآلِّیۡنَ ﴿۱۰۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">They will say, ‘Our Lord, our wickedness overcame us, and we were an erring people.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> They will say, ‘Our Lord, our ill fortune overwhelmed us, and we were an erring people, </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">وہ کہیں گے اے ہمارے ربّ! ہم پر ہماری بدنصیبی غالب آگئی اور ہم ایک گمراہ قوم تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">وہ کہیں گے اے ہمارے رب! ہماری بدبختی ہم پر غالب آگئی اور ہم ایک گمراہ جماعت تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ils diront : « Notre Seigneur, notre malchance <em>de part nos fautes</em> nous a vaincus, et nous étions un peuple égaré.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Ellos responderán: “Señor Nuestro, nuestra maldad nos venció y fuimos un pueblo extraviado”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Sie werden sprechen: \"Unser Herr, unsere Ruchlosigkeit überkam uns, und wir waren ein irrendes Volk.", "spanish": " “Para que pueda hacer obras justas en la vida que he dejado detrás”. ¡Jamás! no es más que la palabra que él profiere. Pues detrás de ellos hay una barrera hasta el día en que sean resucitados.", "urdu": " تا کہ میں اس جگہ جس کو میں چھوڑ کر آگیا ہوں (یعنی دنیا میں) مناسب حال عمل کروں۔ ہرگز ایسا نہیں ہوگا۔ یہ صرف ایک منہ کی بات ہے جسے وہ کہہ رہے ہیں اور ان کے پیچھے ایک پردہ ہے اس دن تک کہ وہ دوبارہ اٹھائے جائیں گے (پس وہ دنیا کی طرف زندہ کرکے کبھی لوٹائے نہیں جائیں گے) ۔"}, {"arabic": " رَبَّنَاۤ اَخۡرِجۡنَا مِنۡہَا فَاِنۡ عُدۡنَا فَاِنَّا ظٰلِمُوۡنَ ﴿۱۰۸﴾", "english": " ‘Our Lord, take us out of this, then if we return to disobedience , we shall indeed be wrongdoers.", "french": " Notre Seigneur, fais-nous sortir de là. Si par la suite nous retournons à la désobéissance , alors en vérité, nous serons des injustes. »", "german": "", "spanish": " “Señor Nuestro, sácanos de aquí, y entonces, si volviéramos a la desobediencia, seríamos ciertamente malvados”.", "urdu": " اے ہمارے رب! ہمیں اس (دوزخ) سے نکال۔ پس اگر ہم (ان گناہوں کی طرف) پھر لوٹیں تو ہم ظالم ہوں گے۔"}, {"arabic": " قَالَ اخۡسَـُٔوۡا فِیۡہَا وَ لَا تُکَلِّمُوۡنِ ﴿۱۰۹﴾", "english": " God will say, “Away with you, despised therein, and speak not unto Me.", "french": " Allāh dira : « Disparaissez-y et ne m’adressez point la parole. »", "german": " Er wird sprechen: \"Hinab mit euch darein, und redet nicht mit Mir.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:109&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:109&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic110\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic110\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:110' style='text-decoration:underline'>23:110</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(110)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control110\"></i></button> <audio id=\"player110\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّہٗ کَانَ فَرِیۡقٌ مِّنۡ عِبَادِیۡ یَقُوۡلُوۡنَ رَبَّنَاۤ اٰمَنَّا فَاغۡفِرۡ لَنَا وَ ارۡحَمۡنَا وَ اَنۡتَ خَیۡرُ الرّٰحِمِیۡنَ ﴿۱۱۰﴾ۚۖ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">“There was a party from among My servants who said, ‘Our Lord, we believe; forgive us therefore <I>our sins</I>, and have mercy on us; for Thou art the Best of those who show mercy.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘There was a party of My servants who said, <sup class='ref'>[<a class='ref' data-id='ref_23_110_a' href='#'>a</a>]</sup>‘Our Lord, we believe; forgive us therefore our sins, and have mercy on us; for Thou art the Best of those who show mercy.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_110_a'>a</span></div> <div><div class='reference' data-id='ref_23_110_a' style='display:none'> <p><b>a.</b> <a href='/quran/3:17' target=_blank>3:17</a>, <a href='/quran/3:194' target=_blank>194</a>. (<a href='javascript:void(0)' data-id='ref_23_110_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً میرے بندوں میں سے ایک ایسا فریق بھی تھا جو کہا کرتا تھا۔ اے ہمارے ربّ! ہم ایمان لے آئے۔ پس ہمیں بخش دے اور ہم پر رحم کر اور تو رحم کرنے والوں میں سب سے بہتر ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">بات یہ ہے کہ میرے بندوں میں سے ایک گروہ ایسا تھا جو کہتا تھا کہ اے ہمارے رب! ہم ایمان لے آئے ہیں۔ سو تو ہم کو بخش دے اور ہم پر رحم کر‘ اور تو سب رحم کرنے والوں میں سے اچھا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« Il y avait un groupe de Mes serviteurs qui disaient : 'Notre Seigneur, nous croyons ; pardonne-nous donc <em>nos péchés</em> et fais-nous miséricorde ; car Tu es le Meilleur de ceux qui font miséricorde.'</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em> “</em>Hubo un grupo de entre Mis siervos que dijeron: “Señor nuestro, creemos; perdónanos pues <em>nuestros pecados</em>, y ten misericordia de nosotros; pues Tú eres el Mejor de quienes muestran misericordia”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Es gab eine Anzahl unter Meinen Dienern, die zu sprechen pflegten: \"Unser Herr, wir glauben; vergib uns darum und erbarme Dich unser, denn Du bist der beste Erbarmer.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:110&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:110&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic111\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic111\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:111' style='text-decoration:underline'>23:111</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(111)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control111\"></i></button> <audio id=\"player111\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَاتَّخَذۡتُمُوۡہُمۡ سِخۡرِیًّا حَتّٰۤی اَنۡسَوۡکُمۡ ذِکۡرِیۡ وَ کُنۡتُمۡ مِّنۡہُمۡ تَضۡحَکُوۡنَ ﴿۱۱۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">“But you made them a laughingstock until they became the cause of your forgetting My remembrance while you <em>continued </em>laughing at them.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘But you ridiculed<sup class='ref'>[<a class='ref' data-id='ref_23_111_2020' href='#'>2020</a>]</sup> them so much so that <i>ridicule of </i>them caused you to forget My remembrance while you <i>continued to </i>laugh at them; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_111_2020'>2020</span></div> <div><a name='2020'></a><div class='reference' data-id='ref_23_111_2020' style='display:none'> <p><b>2020.</b> <i>Sakhkhara-hu </i>means, he compelled him to do what he did not like or to work without recompense (Lane). The verse, therefore, may also mean that believers being poor and weak, the disbelievers employed them against their will or desire, exploited them and exacted compulsory service from them without paying them any wages or compensation for the work they did. (<a href='javascript:void(0)' data-id='ref_23_111_2020' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس تم نے انہیں تمسخر کا نشانہ بنا لیا یہاں تک کہ انہوں نے تمہیں میری یاد سے غافل کر دیا اور تم ان سے ٹھٹھا کرتے رہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">مگر تم نے ان کو ہنسی مذاق کا مورد بنالیا‘ یہاں تک کہ انہوں نے (تمہاری دلچسپی کا سامان بنکر) تم کو میری یاد بھلا دی اور تم ان سے ہمیشہ ہنسی کرتے رہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Mais vous les avez tournés en dérision, jusqu’à ce que cela vous fasse oublier Mon souvenir, pendant que vous vous moquiez d’eux.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em> “</em>Mas vosotros los convertisteis en objeto de vuestras burlas hasta que se convirtieron en la causa de que olvidarais Mi recuerdo mientras <em>continuabais </em>riéndoos de ellos.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ihr aber habt sie mit Spott empfangen, so sehr, dass sie euch Meine Ermahnung vergessen ließen, während ihr sie verlachtet.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:111&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:111&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic112\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic112\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:112' style='text-decoration:underline'>23:112</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(112)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control112\"></i></button> <audio id=\"player112\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنِّیۡ جَزَیۡتُہُمُ الۡیَوۡمَ بِمَا صَبَرُوۡۤا ۙ اَنَّہُمۡ ہُمُ الۡفَآئِزُوۡنَ ﴿۱۱۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">“I have rewarded them this day for their steadfastness so that they alone have triumphed.”</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> I have rewarded them this day for their patient endurance; they are, indeed, the ones who have achieved bliss.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً آج میں نے ان کو اُس کی، جو وہ صبر کیا کرتے تھے، یہ جزا دی ہے کہ یقیناً وہی ہیں جو کامیاب ہونے والے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ان کے صبر کرنے کی وجہ سے میں آج ان کو (مناسب حال) بدلہ دوں گا۔ یقیناً وہ کامیاب ہوں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Aujourd’hui Je les ai récompensés pour leur constance, du fait que ce sont eux les triomphants. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>“</em>A ellos los he recompensado en este día por su perseverancia, por lo que sólo ellos han triunfado”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ich habe sie heute belohnt, denn sie waren standhaft. Wahrlich, sie sind es, die den Sieg erreicht haben.\"", "spanish": " Dios les dirá: “¡Perdeos allí, y no me habléis!”.", "urdu": " (خدا) فرمائے گا (دور ہو جاٶ اور) دوزخ میں چلے جاٶ اور مجھ سے کلام مت کرو۔"}, {"arabic": " قٰلَ کَمۡ لَبِثۡتُمۡ فِی الۡاَرۡضِ عَدَدَ سِنِیۡنَ ﴿۱۱۳﴾", "english": " God will say, ‘What number of years did you tarry in the earth?’", "french": " Allāh dira : « Combien d’années êtes-vous restés sur la terre ? »", "german": " (Gott) wird sprechen: \"Wie viele Jahre verweiltet ihr auf Erden?\"", "spanish": " Dios dirá: “¿Cuántos años permanecisteis en la tierra?”.", "urdu": " پھر وہ (یعنی خدا) فرمائے گا‘ کتنے سال تم زمین میں رہے ہو؟"}, {"arabic": " قَالُوۡا لَبِثۡنَا یَوۡمًا اَوۡ بَعۡضَ یَوۡمٍ فَسۡـَٔلِ الۡعَآدِّیۡنَ ﴿۱۱۴﴾", "english": " They will say, ‘We tarried for a day or part of a day, but ask those who keep count.’", "french": " Ils diront : « Nous sommes restés pendant un jour ou une partie d’une journée, mais demande à ceux qui tiennent le compte. »", "german": " Sie werden sprechen: \"Wir verweilten einen Tag oder den Teil eines Tags, doch frage die Rechnungführenden.\"", "spanish": " Responderán: “permanecimos un día o parte de un día, pero pregunta a quienes llevan la cuenta”.", "urdu": " وہ کہیں گے‘ ہم ایک ہی دن یا دن کا کچھ حصہ زمین میں رہے ہیں‘ تو گننے والوں سے پوچھ لے۔"}, {"arabic": " قٰلَ اِنۡ لَّبِثۡتُمۡ اِلَّا قَلِیۡلًا لَّوۡ اَنَّکُمۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۱۱۵﴾", "english": " He will say, ‘You tarried but a little, if only you knew!", "french": " Il dira : « Vous n’êtes restés que peu de temps, si seulement vous saviez !", "german": " Er wird sprechen: \"Ihr verweiltet nur ein weniges, wenn ihr es nur wüsstet!</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=23:115&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=23:115&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic116\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic116\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/23:116' style='text-decoration:underline'>23:116</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(116)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control116\"></i></button> <audio id=\"player116\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَفَحَسِبۡتُمۡ اَنَّمَا خَلَقۡنٰکُمۡ عَبَثًا وَّ اَنَّکُمۡ اِلَیۡنَا لَا تُرۡجَعُوۡنَ ﴿۱۱۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Did you then think that We had created you without purpose, and that you would not be brought back to Us?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> What! Did you then think that We had created you without purpose, and that you would not be brought back to Us?<sup class='ref'>[<a class='ref' data-id='ref_23_116_2022' href='#'>2022</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_23_116_2022'>2022</span></div> <div><a name='2022'></a><div class='reference' data-id='ref_23_116_2022' style='display:none'> <p><b>2022.</b> Man has been created to serve a great purpose––to develop and reflect in his person Divine attributes. He has been endowed with a Divine personality and is manifestly the central figure in the whole creation or at least that part of the creation which is related to our universe. Having a great purpose to fulfil, his life will not end with his departure from this world and with the soul’s flight from its physical habitat. The human soul will continue its never-ending journey in a new world, in a new form and a new body. The very idea that with the dissolution of its physical tabernacle the human soul suffers death militates against God’s wisdom and His whole design and purpose in creating the universe. (<a href='javascript:void(0)' data-id='ref_23_116_2022' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس کیا تم نے گمان کیا تھا کہ ہم نے تمہیں بے مقصد پیدا کیا ہے اور یہ کہ تم ہرگز ہماری طرف لوٹائے نہیں جاؤ گے؟</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا تم یہ سمجھا کرتے تھے کہ ہم نے تم کو بغیر کسی مقصد کے پیدا کیا ہے؟ اور یہ کہ تم ہماری طرف لوٹائے نہیں جاٶ گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« Croyiez-vous donc que Nous vous avions créés sans but, et que vous ne seriez pas ramenés devant Nous ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Pensabais entonces que os habíamos creado sin ninguna finalidad, y que no seríais devueltos a Nosotros?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Glaubtet ihr denn, Wir hätten euch in Sinnlosigkeit geschaffen, und dass ihr nicht zu Uns zurückgebracht würdet?\"", "spanish": " Él dirá: “¡No permanecisteis sino muy poco, si lo supierais!”.", "urdu": " (اس پر خداتعالیٰ) فرمائے گا‘ اگر تم سمجھ سے کام لو تو تم بہت تھوڑا عرصہ رہے ہو۔"}, {"arabic": " فَتَعٰلَی اللّٰہُ الۡمَلِکُ الۡحَقُّ ۚ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ رَبُّ الۡعَرۡشِ الۡکَرِیۡمِ ﴿۱۱۷﴾", "english": " Exalted then be Allah, the True King. There is no God but He, the Lord of the Glorious Throne.", "french": " Exalté est Allāh, le Souverain Légitime ! Il n’y a de dieu que Lui, le Seigneur du Trône Glorieux ! »", "german": " Doch hoch erhaben ist Allah, der wahre König. Es gibt keinen Gott außer Ihm, dem Herrn des herrlichen Throns.", "spanish": " Exaltado sea pues Al-lah, el Justo Soberano. No hay Dios sino Él, el Señor del Trono Glorioso.", "urdu": " پس اللہ بڑی بلند شان والا‘ بادشاہ‘ اور قائم رہنے والا اور قائم رکھنے والا ہے۔ اس کے سوا کوئی معبود نہیں‘ وہ عرش کریم کا رب ہے۔"}, {"arabic": " وَ مَنۡ یَّدۡعُ مَعَ اللّٰہِ اِلٰـہًا اٰخَرَ ۙ لَا بُرۡہَانَ لَہٗ بِہٖ ۙ فَاِنَّمَا حِسَابُہٗ عِنۡدَ رَبِّہٖ ؕ اِنَّہٗ لَا یُفۡلِحُ الۡکٰفِرُوۡنَ ﴿۱۱۸﴾", "english": " And he who calls on another God along with Allah, for which he has no proof, shall have to render an account to his Lord. Certainly the disbelievers will not prosper.", "french": " Et celui qui invoquera avec Allāh un autre dieu, dont il n’a aucune preuve, certainement son compte est auprès de son Seigneur. Certainement, les mécréants ne prospéreront point.", "german": " Und wer neben Allah einen anderen Gott anruft, für den er keinen Beweis hat, der wird seinem Herrn Rechenschaft abzulegen haben. Wahrlich, die Ungläubigen haben keinen Erfolg.", "spanish": " Y quien invoca a otro dios junto a Al-lah, para lo que no tiene prueba alguna, tendrá que dar cuenta a su Señor. En verdad, los incrédulos no prosperarán.", "urdu": " اور جو کوئی اللہ کے سوا کسی اور معبود کو پکارے جس کی کوئی دلیل نہیں‘ تو اس کا حساب اس کے رب کے پاس ہے۔ حقیقت یہ ہے کہ کافر کبھی کامیاب نہیں ہوتے۔"}], "Surah": 23}