{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " الٓرٰ ۟ تِلۡکَ اٰیٰتُ الۡکِتٰبِ وَ قُرۡاٰنٍ مُّبِیۡنٍ ﴿۲﴾", "english": " Alif Lam Ra. These are verses of the Book and of the illuminating Qur’an.", "french": " Alif Lām Rā (Je suis Allāh, Je vois). Ceux-ci sont les versets du Livre et du Coran manifeste", "german": " Alif Lâm Râ. Dies sind Verse des Buches und des erleuchtenden Qur-ân.", "spanish": " Alif Lam Ra. Éstos son versículos del Libro y del Corán manifiesto.", "urdu": " میں اللہ دیکھنے والا ہوں۔ یہ (ایک) کامل کتاب اور اپنے (مطالب کو) واضح کر دینے والے قرآن کی آیات ہیں۔"}, {"arabic": " رُبَمَا یَوَدُّ الَّذِیۡنَ کَفَرُوۡا لَوۡ کَانُوۡا مُسۡلِمِیۡنَ ﴿۳﴾", "english": " Often will the disbelievers wish that they were Muslims.", "french": " Souvent les mécréants souhaitent qu’ils fussent Musulmans.", "german": " Oft werden die Ungläubigen wünschen, sie wären Muslime.", "spanish": " Con frecuencia, los incrédulos desearán haber sido musulmanes.", "urdu": " جن لوگوں نے (اس کا) انکار کیا ہے‘ وہ بسا اوقات آرزو کیا کرتے ہیں کہ کاش وہ (بھی اس کی) فرمانبرداری اختیار کرنے والے ہوتے۔"}, {"arabic": " ذَرۡہُمۡ یَاۡکُلُوۡا وَ یَتَمَتَّعُوۡا وَ یُلۡہِہِمُ الۡاَمَلُ فَسَوۡفَ یَعۡلَمُوۡنَ ﴿۴﴾", "english": " Leave them alone that they may eat and enjoy themselves and that vain hope may beguile them; but they will soon know.", "french": " Laisse-les seuls, qu’ils puissent manger et jouir des bénéfices pour un temps, et que de vaines espérances les séduisent ; mais ils sauront bientôt.", "german": " Überlasse sie sich selbst, dass sie schmausen und genießen und dass eitle Hoffnung sie einlulle; bald werden sie es erfahren.", "spanish": " Déjalos solos para que coman y disfruten y la esperanza vana les engañe; mas pronto sabrán.", "urdu": " تو ان کو کھانے پینے اور وقتی سامانوں سے نفع اٹھانے میں مشغول چھوڑ دے اور (انہیں چھوڑے دے کہ ان کی جھوٹی) امیدیں انہیں غافل کرتی رہیں کیونکہ وہ جلد (ہی حقیقت) معلوم کر لیں گے۔"}, {"arabic": " وَ مَاۤ اَہۡلَکۡنَا مِنۡ قَرۡیَۃٍ اِلَّا وَ لَہَا کِتَابٌ مَّعۡلُوۡمٌ ﴿۵﴾", "english": " And We have never destroyed any town but there was for it a known decree.", "french": " Et Nous n’avons jamais détruit une ville quelconque sans qu’il n’y eût pour elle un décret connu.", "german": " Wir haben nie eine Stadt zerstört, ohne dass für sie ein wohlbekannter Erlass wäre.", "spanish": " Pues nunca hemos destruido ciudad alguna sin que existiera para ella un decreto conocido.", "urdu": " اور ہم نے کبھی کسی بستی کو بغیر اس کے کہ اس کے متعلق (پہلے سے) ایک معلوم فیصلہ ہو چکا ہو ہلاک نہیں کیا۔"}, {"arabic": " مَا تَسۡبِقُ مِنۡ اُمَّۃٍ اَجَلَہَا وَ مَا یَسۡتَاۡخِرُوۡنَ ﴿۶﴾", "english": " No people can outstrip their appointed time, nor can they remain behind.", "french": " Aucun peuple ne peut devancer son terme fixé, et il ne peut non plus rester en arrière.", "german": " Kein Volk kann seine Frist überschreiten; noch können sie dahinter zurückbleiben.", "spanish": " Ningún pueblo puede anticipar el tiempo que le ha sido fijado, ni retrasarlo.", "urdu": " کوئی قوم بھی اپنی (ہلاکت کی) میعاد سے بھاگ (کر بچ) نہیں سکتی اور نہ ہی پیچھے رہ (کر اس سے بچ) سکتی ہے۔"}, {"arabic": " وَ قَالُوۡا یٰۤاَیُّہَا الَّذِیۡ نُزِّلَ عَلَیۡہِ الذِّکۡرُ اِنَّکَ لَمَجۡنُوۡنٌ ؕ﴿۷﴾", "english": " And they said, ‘O thou to whom this Exhortation has been sent down, thou art surely a madman.", "french": " Et ils disent : « Ô toi, à qui cette Exhortation a été transmise d’en-haut, tu es assurément un insensé !", "german": " Sie sprachen: \"O du, zu dem die Ermahnung herabgesandt ward, du bist fürwahr ein Verrückter.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:7&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:7&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic8\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic8\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:8' style='text-decoration:underline'>15:8</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(8)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control8\"></i></button> <audio id=\"player8\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَوۡ مَا تَاۡتِیۡنَا بِالۡمَلٰٓئِکَۃِ اِنۡ کُنۡتَ مِنَ الصّٰدِقِیۡنَ ﴿۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Why dost thou not bring angels to us, if thou art of the truthful?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_8_c' href='#'>c</a>]</sup>‘Why dost thou not bring angels to us, if thou art of the truthful?’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_8_c'>c</span></div> <div><div class='reference' data-id='ref_15_8_c' style='display:none'> <p><b>c.</b> <a href='/quran/6:9' target=_blank>6:9</a>; <a href='/quran/11:13' target=_blank>11:13</a>; <a href='/quran/25:8' target=_blank>25:8</a>. (<a href='javascript:void(0)' data-id='ref_15_8_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">تو ہمارے پاس فرشتے لئے ہوئے کیوں نہیں آتا اگر تو سچوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اگر تو سچا ہے تو کیوں ملائکہ کو ہمارے پاس نہیں لاتا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Pourquoi ne nous amènes-tu pas des anges, si tu es du nombre des véridiques ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Por qué no nos envías unos ángeles, si eres de los veraces?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Warum bringst du nicht Engel zu uns, wenn du der Wahrhaftigen einer bist?\"", "spanish": " Y dijeron: “Oh tú, a quien ha sido revelada esta Exhortación, sin duda eres un loco,", "urdu": " اور انہوں نے (بڑے زور سے) کہا (کہ) اے وہ شخص جس پر یہ ذکر اتارا گیا ہے‘ تو یقیناً دیوانہ ہے۔"}, {"arabic": " مَا نُنَزِّلُ الۡمَلٰٓئِکَۃَ اِلَّا بِالۡحَقِّ وَ مَا کَانُوۡۤا اِذًا مُّنۡظَرِیۡنَ ﴿۹﴾", "english": " We do not send down angels but by due right, and then they are granted no respite.", "french": " Or, Nous n’envoyons les anges qu’avec la vérité, et alors aucun répit ne leur est accordé.", "german": " Wir senden keine Engel hernieder, außer mit triftigem Grunde, und dann wird ihnen kein Aufschub gewährt.", "spanish": " Nosotros no enviamos ángeles sino con la verdad, y entonces no se les concede respiro alguno.", "urdu": " (کیا انہیں معلوم نہیں کہ) ہم (جب بھی) فرشتوں کو (اتارے ہیں تو) حق کے مطابق اتارتے ہیں اور (جب انہیں کافروں کے لئے اتارتے ہیں تو) اس وقت انہیں (یعنی کفار کو ذرہ بھی) مہلت نہیں دی جاتی۔"}, {"arabic": " اِنَّا نَحۡنُ نَزَّلۡنَا الذِّکۡرَ وَ اِنَّا لَہٗ لَحٰفِظُوۡنَ ﴿۱۰﴾", "english": " Verily, We Ourself have sent down this Exhortation, and most surely We will be its Guardian.", "french": " En vérité, Nous avons Nous-Même envoyé cette Exhortation, et assurément Nous en serons le Gardien.", "german": " Wahrlich, Wir, Wir Selbst haben diese Ermahnung hinabgesandt, und sicherlich werden Wir ihr Hüter sein.", "spanish": " En verdad, Nosotros mismos hemos revelado esta Exhortación, y ciertamente seremos su Guardián.", "urdu": " اس ذکر (یعنی قرآن) کو ہم نے ہی اتارا ہے اور ہم یقیناً اس کی حفاظت کریں گے۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا مِنۡ قَبۡلِکَ فِیۡ شِیَعِ الۡاَوَّلِیۡنَ ﴿۱۱﴾", "english": " And We sent Messengers before thee among parties of ancient peoples.", "french": " Et Nous avons envoyé des Messagers avant toi parmi des groupes des peuples anciens.", "german": " Wir entsandten schon vor dir (Gesandte) zu frühereren Stämmen.", "spanish": " Pues enviamos Mensajeros antes de ti de varias confesiones de pueblos anteriores.", "urdu": " اور ہم نے اگلے (زمانہ کے) لوگوں کی جماعتوں میں (بھی) تجھ سے پہلے رسول بھیجے تھے۔"}, {"arabic": " وَ مَا یَاۡتِیۡہِمۡ مِّنۡ رَّسُوۡلٍ اِلَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿۱۲﴾", "english": " And there never came to them any Messenger but they mocked at him.", "french": " Et aucun Messager ne leur est jamais venu sans qu’ils ne se soient moqués de lui.", "german": " Und nie kam ein Gesandter zu ihnen, über den sie nicht höhnten.", "spanish": " Pero nunca les llegó Mensajero alguno sin que se burlaran de él.", "urdu": " اور جو رسول بھی ان کے پاس آتا تھا‘ وہ اس کی ہنسی اڑاتے تھے۔"}, {"arabic": " کَذٰلِکَ نَسۡلُکُہٗ فِیۡ قُلُوۡبِ الۡمُجۡرِمِیۡنَ ﴿ۙ۱۳﴾", "english": " Thus do We cause this habit of mocking to enter into the hearts of the sinful people;", "french": " C’est ainsi que nous la faisons entrer - cette habitude de moquerie- dans les cœurs des pécheurs.", "german": " So lassen Wir diese (Sucht, zu höhnen) in die Herzen der Sünder einziehen;", "spanish": " Así hicimos que esta costumbre de burlarse entrara en los corazones de los pecadores;", "urdu": " اسی طرح ہم اس (عادت استہزا) کو مجرموں کے دلوں میں راسخ کرتے ہیں۔"}, {"arabic": " لَا یُؤۡمِنُوۡنَ بِہٖ وَ قَدۡ خَلَتۡ سُنَّۃُ الۡاَوَّلِیۡنَ ﴿۱۴﴾", "english": " They believe not therein, though the example of the former peoples has gone before them .", "french": " Ils n’y croient pas bien que l’exemple des peuples antérieurs soit passé avant eux .", "german": " sie glauben nicht daran, wiewohl das Beispiel der Früheren ergangen ist.", "spanish": " No creen en él, aunque el ejemplo de los pueblos anteriores les precedió.", "urdu": " یہ (لوگ) اس (قرآن) پر ایمان نہیں لاتے حالانکہ پہلوں (کے متعلق اللہ) کی سنت گذر چکی ہے۔"}, {"arabic": " وَ لَوۡ فَتَحۡنَا عَلَیۡہِمۡ بَابًا مِّنَ السَّمَآءِ فَظَلُّوۡا فِیۡہِ یَعۡرُجُوۡنَ ﴿ۙ۱۵﴾", "english": " And even if We opened to them a door from heaven, and they began ascending through it,", "french": " Et même si Nous leur ouvrions une voie céleste, et qu’ils se mettaient à monter à travers pour qu’ils voient de leurs yeux des Signes de la véridicité du Prophète,", "german": " Und selbst wenn Wir ihnen ein Tor des Himmels öffneten und sie begännen dadurch hinaufzusteigen,", "spanish": " Y aunque les abriésemos una puerta del Cielo, y empezaran a subir por ella,", "urdu": " اور اگر (بالفرض) ہم ان پر (شناخت کی) کوئی آسمانی راہ کھول (بھی) دیتے اور وہ اس سے (فائدہ اٹھا کر) حقیقت کو سمجھنے بھی لگتے۔"}, {"arabic": " لَقَالُوۡۤا اِنَّمَا سُکِّرَتۡ اَبۡصَارُنَا بَلۡ نَحۡنُ قَوۡمٌ مَّسۡحُوۡرُوۡنَ ﴿٪۱۶﴾", "english": " They would surely say, ‘Only our eyes are dazed; rather we are a bewitched people.’", "french": " Ils diraient certainement : « Nous avons seulement les yeux embrouillés par un quelconque intoxicant , ou plutôt nous sommes un peuple ensorcelé. »", "german": " sie würden gewisslich sprechen: \"Nur unsere Blicke sind benommen; fürwahr, wir sind ein behextes Volk.\"", "spanish": " Dirían ciertamente: “Es que nuestros ojos están deslumbrados; más bien somos un pueblo embrujado”.", "urdu": " تو (بھی) وہ (یہی) کہتے (کہ) محض ہماری نظروں پر پردہ ڈالا گیا ہے (ورنہ حقیقت کچھ نہیں) بلکہ ہم (لوگوں) پر (کوئی) جادو کر دیا گیا ہے۔"}, {"arabic": " وَ لَقَدۡ جَعَلۡنَا فِی السَّمَآءِ بُرُوۡجًا وَّ زَیَّنّٰہَا لِلنّٰظِرِیۡنَ ﴿ۙ۱۷﴾", "english": " And We have, indeed, made mansions of stars in the heaven and have adorned it for beholders.", "french": " Et Nous avons mis, en vérité, des constellations dans les cieux, et Nous les avons ornés pour ceux qui contemplent.", "german": " Und Wir haben fürwahr Türme in den Himmel gesetzt und sie ausgeschmückt für die Beschauer.", "spanish": " Mas en verdad hemos creado constelaciones en el firmamento y las hemos adornado para quienes contemplan.", "urdu": " اور یقیناً ہم نے آسمان میں (ستاروں کی) کئی منزلیں بنائی ہیں اور ہم نے اسے دیکھنے والوں کے لئے خوبصورت بنایا ہے۔"}, {"arabic": " وَ حَفِظۡنٰہَا مِنۡ کُلِّ شَیۡطٰنٍ رَّجِیۡمٍ ﴿ۙ۱۸﴾", "english": " And We have protected it against every rejected satan.", "french": " Et Nous les avons protégés contre tout satan rejeté.", "german": " Und Wir haben ihn geschützt vor jedem verworfenen Satan,", "spanish": " Y lo hemos protegido contra todo Satanás rechazado.", "urdu": " اور (نیز) ہم نے اسے ہر ایک سرکش (اور) دھتکارے ہوئے (وجود کی رسائی) سے محفوظ کر دیا ہے۔"}, {"arabic": " اِلَّا مَنِ اسۡتَرَقَ السَّمۡعَ فَاَتۡبَعَہٗ شِہَابٌ مُّبِیۡنٌ ﴿۱۹﴾", "english": " But if any one hears stealthily, there pursues him a bright flame.", "french": " Mais si l’un d’eux écoute à la dérobée quelque révélation et la déforme , une flamme brillante le poursuit.", "german": " wenn aber einer heimlich lauscht, dann verfolgt ihn eine helle Flamme.", "spanish": " Mas si alguien escucha furtivamente, le persigue una llama brillante.", "urdu": " مگر جو شخص چوری سے (وحی الٰہی کی) کوئی بات سن لے۔ (اور اُسے بگاڑ کر پھیلائے) تو اس کے پیچھے ایک روشن شعلہ لگا دیا جاتا ہے۔"}, {"arabic": " وَ الۡاَرۡضَ مَدَدۡنٰہَا وَ اَلۡقَیۡنَا فِیۡہَا رَوَاسِیَ وَ اَنۡۢبَتۡنَا فِیۡہَا مِنۡ کُلِّ شَیۡءٍ مَّوۡزُوۡنٍ ﴿۲۰﴾", "english": " And the earth have We spread out, and set therein firm mountains and caused everything to grow therein in proper proportion.", "french": " Et Nous avons étendu la terre, et Nous y avons placé des montagnes solidement ancrées, et Nous y avons fait croître toute chose en proportions appropriées.", "german": " Und die Erde haben Wir ausgebreitet, und darein feste Berge gesetzt, und Wir ließen alles auf ihr wachsen im rechten Verhältnis.", "spanish": " Pues hemos extendido la tierra, poniendo en ella montañas firmes, y hemos hecho que todo germinara en ella en la proporción adecuada.", "urdu": " اور ہم نے زمین کو پھیلایا ہے اور اس میں ہم نے محکم پہاڑ قائم کیے ہیں اور (نیز) ہم نے اس میں ہر قسم کی موزون چیزوں کو (پیدا کیا اور) بڑھایا ہے۔"}, {"arabic": " وَ جَعَلۡنَا لَکُمۡ فِیۡہَا مَعَایِشَ وَ مَنۡ لَّسۡتُمۡ لَہٗ بِرٰزِقِیۡنَ ﴿۲۱﴾", "english": " And We have made for you therein means of livelihood, and also for all those for whom you do not provide.", "french": " Et Nous y avons placé pour vous des moyens d’existence, et aussi pour tous ceux dont vous n’êtes pas les pourvoyeurs.", "german": " Und Wir schufen darin Mittel zu eurem Unterhalt und derer, die ihr nicht versorgt.", "spanish": " Y en ella dispusimos medios de subsistencia para vosotros, y también para todos aquellos a quienes no sustentáis.", "urdu": " اور اس میں ہم نے تمہارے لئے اور (ہر) اس (مخلوق) کے لئے جسے تم رزق نہیں دیتے معیشت کے سامان پیدا کیے ہیں۔"}, {"arabic": " وَ اِنۡ مِّنۡ شَیۡءٍ اِلَّا عِنۡدَنَا خَزَآئِنُہٗ ۫ وَ مَا نُنَزِّلُہٗۤ اِلَّا بِقَدَرٍ مَّعۡلُوۡمٍ ﴿۲۲﴾", "english": " And there is not a thing but with Us are the treasures thereof and We send it not down except in a known measure.", "french": " Et il n’existe pas une chose dont Nous n’ayons avec Nous des réserves illimitées ; et Nous ne la faisons pas descendre sauf dans une mesure connue.", "german": " Und es gibt kein Ding, von dem Wir nicht Schätze hätten; aber Wir senden es nur nach bestimmtem Maß hinab.", "spanish": " Y no existe cosa alguna cuyos tesoros no estén en Nosotros, y sólo los enviamos en medida conocida.", "urdu": " اور کوئی چیز ایسی نہیں جس کے (غیر محدود) خزانے ہمارے پاس نہ ہوں۔ لیکن ہم اسے ایک معین اندازے سے ہی اتارا کرتے ہیں۔"}, {"arabic": " وَ اَرۡسَلۡنَا الرِّیٰحَ لَوَاقِحَ فَاَنۡزَلۡنَا مِنَ السَّمَآءِ مَآءً فَاَسۡقَیۡنٰکُمُوۡہُ ۚ وَ مَاۤ اَنۡتُمۡ لَہٗ بِخٰزِنِیۡنَ ﴿۲۳﴾", "english": " And We send impregnating winds, then We send down water from the clouds, then We give it to you to drink; and you are not the ones to store it up.", "french": " Et Nous avons envoyé des vents fécondants, puis Nous avons fait descendre de l’eau des nuages, et Nous vous l’avons donnée à boire, alors que vous n’étiez pas en mesure de la mettre en réserve vous-mêmes.", "german": " Und Wir senden die befruchtenden Winde, dann senden Wir Wasser nieder von den Wolken, dann geben Wir es euch zu trinken; und ihr hättet es nicht aufspeichern können.", "spanish": " Y enviamos los vientos fecundantes, y después hacemos que caiga el agua de las nubes, entregándoosla para que bebáis; pero no sois los que la almacenáis.", "urdu": " اور ہم نے (بخارات کو) اٹھانے والی ہوائیں (بھی) چھوڑ رکھی ہیں اور (ان کے ذریعہ سے) ہم نے بادلوں سے پانی اتارا ہے۔ پھر وہ تمہیں پلایا ہے اور تم خود اسے محفوظ نہیں رکھ سکتے تھے (لیکن اس ذریعہ سے ہم نے اسے محفوظ کر دیا ہے)"}, {"arabic": " وَ اِنَّا لَنَحۡنُ نُحۡیٖ وَ نُمِیۡتُ وَ نَحۡنُ الۡوٰرِثُوۡنَ ﴿۲۴﴾", "english": " And verily, it is We Who give life, and We Who cause death; and it is We Who are the sole Inheritor.", "french": " Et en vérité, c’est Nous Qui donnons la vie, et Nous Qui causons la mort ; et c’est Nous Qui sommes le Seul Héritier.", "german": " Wahrlich, Wir Selbst geben Leben und schicken Tod; und Wir allein sind die Erben.", "spanish": " Y en verdad, somos Nosotros quienes damos la vida y causamos la muerte; pues sólo Nosotros somos el único Heredero.", "urdu": " اور یقیناً ہم ہی زندہ کرتے اور مارتے ہیں اور ہم ہی (سب کے) وارث ہیں۔"}, {"arabic": " وَ لَقَدۡ عَلِمۡنَا الۡمُسۡتَقۡدِمِیۡنَ مِنۡکُمۡ وَ لَقَدۡ عَلِمۡنَا الۡمُسۡتَاۡخِرِیۡنَ ﴿۲۵﴾", "english": " And We do know those who go ahead among you and We do know those who lag behind.", "french": " Et Nous connaissons en vérité ceux d’entre vous qui vont de l’avant, et Nous connaissons aussi assurément ceux qui traînent,", "german": " Und Wir kennen wohl jene unter euch, die voranschreiten, und Wir kennen wohl jene, die zurückbleiben.", "spanish": " Conocemos a los que van delante de vosotros y conocemos a los que vienen detrás.", "urdu": " اور ہم تم میں سے آگے نکل جانے والوں کو (بھی) جانتے ہیں۔ اور (اسی طرح) ہم (تم میں سے) پیچھے رہ جانے والوں کو (بھی) جانتے ہیں۔"}, {"arabic": " وَ اِنَّ رَبَّکَ ہُوَ یَحۡشُرُہُمۡ ؕ اِنَّہٗ حَکِیۡمٌ عَلِیۡمٌ ﴿٪۲۶﴾", "english": " And surely, it is thy Lord Who will gather them together. Surely, He is Wise, All-Knowing.", "french": " Et assurément, c’est ton Seigneur Qui les rassemblera. Assurément, Il est Sage, Omniscient.", "german": " Wahrlich, es ist dein Herr, Der sie versammeln wird. Siehe, Er ist allweise, allwissend.", "spanish": " Y en verdad, es tu Señor quien los reunirá a todos. En verdad, Él es Sabio, Omnisciente.", "urdu": " اور یقیناً تیرا رب ہی انہیں جمع کرے گا۔ وہ حکمت والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ مِنۡ صَلۡصَالٍ مِّنۡ حَمَاٍ مَّسۡنُوۡنٍ ﴿ۚ۲۷﴾", "english": " And, surely, We created man from dry ringing clay, from black mud wrought into shape.", "french": " Et assurément, Nous avons créé l’homme d’argile sèche qui résonne, façonnée de la boue noire croupie.", "german": " Wahrlich, Wir haben den Menschen aus trockenem, tönendem Lehm erschaffen, aus schwarzem, zu Gestalt gebildetem Schlamm.", "spanish": " En verdad, creamos al hombre de arcilla seca sonora, modelado de barro estancado.", "urdu": " اور انسان کو ہم نے آواز دینے والی مٹی سے یعنی سیاہ گارے سے جس کی ہیئت تبدیل ہو گئی تھی پیدا کیا ہے۔"}, {"arabic": " وَ الۡجَآنَّ خَلَقۡنٰہُ مِنۡ قَبۡلُ مِنۡ نَّارِ السَّمُوۡمِ ﴿۲۸﴾", "english": " And the Jinn We had created before from the fire of hot wind.", "french": " Et Nous avions créé plus tôt le djinn du feu de vents brûlants.", "german": " Und die Jinn erschufen Wir zuvor aus dem Feuer des heißen Windes.", "spanish": " Y anteriormente habíamos creado a los Yinn del fuego de vientos llameantes.", "urdu": " اور (اس سے) پہلے جنوں کو ہم نے سخت گرم ہوا کی (قسم کی) آگ سے پیدا کیا تھا۔"}, {"arabic": " وَ اِذۡ قَالَ رَبُّکَ لِلۡمَلٰٓئِکَۃِ اِنِّیۡ خَالِقٌۢ بَشَرًا مِّنۡ صَلۡصَالٍ مِّنۡ حَمَاٍ مَّسۡنُوۡنٍ ﴿۲۹﴾", "english": " And remember when thy Lord said to the angels, ‘I am about to create man from dry ringing clay, from black mud wrought into shape;", "french": " Et souviens-toi quand ton Seigneur dit aux anges : « Je suis sur le point de créer l’homme d’argile sèche qui résonne, façonnée de la boue noire croupie ;", "german": " Und (gedenke der Zeit) da dein Herr zu den Engeln sprach: \"Ich bin im Begriffe, den Menschen aus trockenem, tönendem Lehm zu erschaffen, aus schwarzem, zu Gestalt gebildetem Schlamm;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:29&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:29&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic30\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic30\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:30' style='text-decoration:underline'>15:30</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(30)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control30\"></i></button> <audio id=\"player30\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَاِذَا سَوَّیۡتُہٗ وَ نَفَخۡتُ فِیۡہِ مِنۡ رُّوۡحِیۡ فَقَعُوۡا لَہٗ سٰجِدِیۡنَ ﴿۳۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘So when I have fashioned him<I> in perfection </I>and have breathed into him of My Spirit, fall ye down in submission to him.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘So <sup class='ref'>[<a class='ref' data-id='ref_15_30_c' href='#'>c</a>]</sup>when I have fashioned him <i>in perfection </i>and have breathed into him of My Spirit, <sup class='ref'>[<a class='ref' data-id='ref_15_30_d' href='#'>d</a>]</sup>fall ye down in submission to him.’<sup class='ref'>[<a class='ref' data-id='ref_15_30_1495' href='#'>1495</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_30_c'>c</span><span class='collapsible plus' data-id='ref_15_30_d'>d</span><span class='collapsible plus' data-id='ref_15_30_1495'>1495</span></div> <div><div class='reference' data-id='ref_15_30_c' style='display:none'> <p><b>c.</b> <a href='/quran/32:10' target=_blank>32:10</a>; <a href='/quran/38:73' target=_blank>38:73</a>. (<a href='javascript:void(0)' data-id='ref_15_30_c' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_15_30_d' style='display:none'> <p><b>d.</b> <a href='/quran/2:35' target=_blank>2:35</a>; <a href='/quran/7:12' target=_blank>7:12</a>; <a href='/quran/17:62' target=_blank>17:62</a>; <a href='/quran/18:51' target=_blank>18:51</a>; <a href='/quran/20:117' target=_blank>20:117</a>. (<a href='javascript:void(0)' data-id='ref_15_30_d' class='ref'>close</a>)</p> </div> </div><div><a name='1495'></a><div class='reference' data-id='ref_15_30_1495' style='display:none'> <p><b>1495.</b> By the word \"angels\" is meant the whole of creation, because angels constitute the first link of all creation and, as such, a command given to them really applies to the whole of creation. It is significant that whereas elsewhere the Qur’an speaks of the command of God to the angels to submit to \"Adam\", in the present and the following verses the word used is \"man\". Thus both these words have been used synonymously in the Qur’an. The command given to angels with regard to Adam applies to every man. Into every man God breathes His Spirit and angels are commanded to serve him. Man is God’s vicegerent on earth and in his person he reflects Divine attributes. (<a href='javascript:void(0)' data-id='ref_15_30_1495' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس جب میں اسے ٹھیک ٹھاک کر لوں اور اس میں اپنا کلام پھونکوں تو اس کی اطاعت میں سجدہ ریز ہو جانا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پس جب میں اسے مکمل کر دوں اور اس (کے دل) میں اپنا کلام ڈال دوں تو تم سب اس کے ساتھ سجدہ کرتے ہوئے (اللہ کے حضور) گر جانا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Alors, quand Je l’aurai formé en harmonie et que J’aurai insufflé Ma Parole dans son cœur, courbez vous en soumission à lui. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Así, cuando lo haya moldeado <em>con perfección</em> y le haya insuflado Mi Espíritu, postraos en señal de sumisión a Él”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">wenn Ich ihn nun vollkommen geformt und ihm von Meinem Geiste eingehaucht habe, dann fallet mit ihm dienend nieder.\"", "spanish": " Y acuérdate de cuando tu Señor dijo a los ángeles: “Estoy a punto de crear al hombre de arcilla seca sonora, de barro negro moldeado en su forma”;", "urdu": " اور (اے مخاطب اس وقت کو یاد کر) جب تیرے رب نے فرشتوں کو کہا تھا (کہ) میں آواز دینے والی مٹی یعنی سیاہ گارے سے جس کی ہئیت تبدیل ہو چکی ہو ایک بشر پیدا کرنے والا ہوں۔"}, {"arabic": " فَاِذَا سَوَّیۡتُہٗ وَ نَفَخۡتُ فِیۡہِ مِنۡ رُّوۡحِیۡ فَقَعُوۡا لَہٗ سٰجِدِیۡنَ ﴿۳۰﴾", "english": " ‘So when I have fashioned him in perfection and have breathed into him of My Spirit, fall ye down in submission to him.’", "french": " Alors, quand Je l’aurai formé en harmonie et que J’aurai insufflé Ma Parole dans son cœur, courbez vous en soumission à lui. »", "german": " wenn Ich ihn nun vollkommen geformt und ihm von Meinem Geiste eingehaucht habe, dann fallet mit ihm dienend nieder.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:30&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:30&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic31\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic31\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:31' style='text-decoration:underline'>15:31</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(31)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control31\"></i></button> <audio id=\"player31\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَسَجَدَ الۡمَلٰٓئِکَۃُ کُلُّہُمۡ اَجۡمَعُوۡنَ ﴿ۙ۳۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">So the angels submitted, all of them together,</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_31_a' href='#'>a</a>]</sup>So the angels submitted, all of them together. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_31_a'>a</span></div> <div><div class='reference' data-id='ref_15_31_a' style='display:none'> <p><b>a.</b> <a href='/quran/2:35' target=_blank>2:35</a>; <a href='/quran/7:12' target=_blank>7:12</a>; <a href='/quran/17:62' target=_blank>17:62</a>; <a href='/quran/18:51' target=_blank>18:51</a>; <a href='/quran/20:117' target=_blank>20:117</a>. (<a href='javascript:void(0)' data-id='ref_15_31_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">تو تمام فرشتوں نے سجدہ کیا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">جس پر سب کے سب فرشتوں نے (اس کے ساتھ خدا کو) سجدہ کیا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Les anges se sont donc soumis, tous ensemble,</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Los ángeles se sometieron pues, todos ellos juntos.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Da fielen die Engel alle zusammen nieder.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:31&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:31&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic32\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic32\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:32' style='text-decoration:underline'>15:32</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(32)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control32\"></i></button> <audio id=\"player32\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِلَّاۤ اِبۡلِیۡسَ ؕ اَبٰۤی اَنۡ یَّکُوۡنَ مَعَ السّٰجِدِیۡنَ ﴿۳۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">Except Iblis; he refused to be among those who submit.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_32_b' href='#'>b</a>]</sup>But Iblis <i>did not</i>; he refused to be among those who submit.<sup class='ref'>[<a class='ref' data-id='ref_15_32_1496' href='#'>1496</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_32_b'>b</span><span class='collapsible plus' data-id='ref_15_32_1496'>1496</span></div> <div><div class='reference' data-id='ref_15_32_b' style='display:none'> <p><b>b.</b> <a href='/quran/2:35' target=_blank>2:35</a>; <a href='/quran/7:12' target=_blank>7:12</a>; <a href='/quran/17:62' target=_blank>17:62</a>; <a href='/quran/18:51' target=_blank>18:51</a>; <a href='/quran/20:117' target=_blank>20:117</a>. (<a href='javascript:void(0)' data-id='ref_15_32_b' class='ref'>close</a>)</p> </div> </div><div><a name='1496'></a><div class='reference' data-id='ref_15_32_1496' style='display:none'> <p><b>1496.</b> God punished Satan (vv.35, 36) for his failure to carry out a command which was addressed only to angels (vv.29, 30), because a command given to angels automatically applied to all those creatures which were subject to the authority of the angels. Elsewhere, the Qur’an itself makes the point clear that the command to angels applied to Iblis also (<a href='/quran/7:12' target=_blank>7:12</a>, 13). (<a href='javascript:void(0)' data-id='ref_15_32_1496' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">سوائے ابلیس کے۔ اس نے انکار کردیا کہ سجدہ کرنے والوں کے ساتھ شامل ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">سوائے ابلیس کے (کہ) اس نے (خدا کو خالص) سجدہ کرنے والوں کے ساتھ (ہوکر) سجدہ کرنے سے انکار کیا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Excepté Iblīs ; il refusa d’être parmi ceux qui se soumettent.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Excepto Iblis; se negó a ser de los que se someten.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Nicht also Iblis; er weigerte sich, unter den Niederfallenden zu sein.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:32&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:32&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic33\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic33\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:33' style='text-decoration:underline'>15:33</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(33)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control33\"></i></button> <audio id=\"player33\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ یٰۤـاِبۡلِیۡسُ مَا لَکَ اَلَّا تَکُوۡنَ مَعَ السّٰجِدِیۡنَ ﴿۳۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\"><I> God </I>said, ‘O Iblis, what is the matter with thee that thou wouldst not be among those who submit?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_33_c' href='#'>c</a>]</sup><i>God </i>said, ‘O Iblis, what has happened to thee<sup class='ref'>[<a class='ref' data-id='ref_15_33_1496A' href='#'>1496A</a>]</sup> that thou wouldst not be among those who submit?’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_33_c'>c</span><span class='collapsible plus' data-id='ref_15_33_1496A'>1496A</span></div> <div><div class='reference' data-id='ref_15_33_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:13' target=_blank>7:13</a>; <a href='/quran/38:76' target=_blank>38:76</a>. (<a href='javascript:void(0)' data-id='ref_15_33_c' class='ref'>close</a>)</p> </div> </div><div><a name='1496A'></a><div class='reference' data-id='ref_15_33_1496A' style='display:none'> <p><b>1496A.</b> The Arabic expression also means, what ails thee; what is your reason; what is the matter with thee? (<a href='javascript:void(0)' data-id='ref_15_33_1496A' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا اے ابلیس! تجھے کیا ہوا کہ تو سجدہ کرنے والوں کے ساتھ شامل نہیں ہوا؟</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اس پر خدا نے) فرمایا (کہ) اے ابلیس! تجھے کیا ہوا کہ تو (خالص اس کے حضور) سجدہ کرنے والوں کے ساتھ نہیں ہوتا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Allāh</em> dit : « Ô Iblīs, qu’as-tu à ne pas vouloir être parmi ceux qui se soumettent ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Dios dijo: “Oh, Iblis, ¿qué te ocurre que no estás entre los que se someten?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">(Gott) sprach: \"O Iblis, was ist dir, dass du nicht unter den Niederfallenden sein wolltest?\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:33&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:33&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic34\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic34\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:34' style='text-decoration:underline'>15:34</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(34)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control34\"></i></button> <audio id=\"player34\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ لَمۡ اَکُنۡ لِّاَسۡجُدَ لِبَشَرٍ خَلَقۡتَہٗ مِنۡ صَلۡصَالٍ مِّنۡ حَمَاٍ مَّسۡنُوۡنٍ ﴿۳۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He answered, ‘I am not going to submit to man whom Thou hast created from dry ringing clay, from black mud wrought into shape.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_34_d' href='#'>d</a>]</sup>He answered, ‘I am not going to submit to a mortal whom Thou hast created of dry ringing clay, of black mud wrought into shape.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_34_d'>d</span></div> <div><div class='reference' data-id='ref_15_34_d' style='display:none'> <p><b>d.</b> <a href='/quran/7:13' target=_blank>7:13</a>; <a href='/quran/17:62' target=_blank>17:62</a>; <a href='/quran/18:51' target=_blank>18:51</a>. (<a href='javascript:void(0)' data-id='ref_15_34_d' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا میں ایسا نہیں کہ میں ایک ایسے بشر کے لئے سجدہ کروں جسے تو نے گلے سڑے کیچڑ سے بنی ہوئی خشک کھنکتی ہوئی ٹھیکریوں سے پیدا کیا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اس نے کہا میں ایسا نہیں کہ ایک ایسے بشر کے طریق پر ہو کر فرمانبرداری اختیار کروں جسے تو نے آواز دینے والی مٹی سے یعنی سیاہ گارے سے جس کی ہئیت تبدیل ہو چکی تھی پیدا کیا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il répondit : « Je ne vais pas me soumettre à un homme que Tu as créé d’argile sèche qui résonne, façonnée de la boue noire croupie. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Él respondió: “No voy a someterme al hombre a quien has creado de arcilla seca sonora, de barro negro moldeado en su forma”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er antwortete: \"Nimmermehr werde ich niederfallen auf die Art eines Menschenwesens, das Du aus trockenem, tönendem Lehm erschaffen hast, aus schwarzem, zu Gestalt gebildetem Schlamm.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:34&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:34&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic35\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic35\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:35' style='text-decoration:underline'>15:35</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(35)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control35\"></i></button> <audio id=\"player35\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ فَاخۡرُجۡ مِنۡہَا فَاِنَّکَ رَجِیۡمٌ ﴿ۙ۳۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\"><I> God </I>said, ‘Then get out hence, for, surely, thou art rejected.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_35_e' href='#'>e</a>]</sup><i>God </i>said, ‘Then get out hence,<sup class='ref'>[<a class='ref' data-id='ref_15_35_1497' href='#'>1497</a>]</sup> for, surely, thou art rejected. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_35_e'>e</span><span class='collapsible plus' data-id='ref_15_35_1497'>1497</span></div> <div><div class='reference' data-id='ref_15_35_e' style='display:none'> <p><b>e.</b> <a href='/quran/7:14' target=_blank>7:14</a>, <a href='/quran/7:19' target=_blank>19</a>; <a href='/quran/38:78' target=_blank>38:78</a>. (<a href='javascript:void(0)' data-id='ref_15_35_e' class='ref'>close</a>)</p> </div> </div><div><a name='1497'></a><div class='reference' data-id='ref_15_35_1497' style='display:none'> <p><b>1497.</b> The pronoun <i>ha </i>in the expression <i>min-ha </i>does not refer to the post- mortal Heaven because Heaven is a place where Satan could not possibly enter and tempt Adam and from where no one is ever turned out (<a href='/quran/15:49' target=_blank>15:49</a>). It refers to that state of apparent bliss in this world in which men happen to be before the advent of a Prophet when, though they might be victim to wrong beliefs, yet, not having rejected a Prophet, they are not altogether deprived of (<a href='javascript:void(0)' data-id='ref_15_35_1497' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا اس (مقام) میں سے نکل جا۔ یقیناً تُو دھتکارا ہوا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">فرمایا (اگر تیرا یہ خیال ہے) تو تو اس (مقام) سے نکل جا کیونکہ تو یقیناً دھتکارا ہوا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Allāh</em> dit : « Alors sors d’ici, car assurément tu es rejeté.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>Dios</em> dijo: “Sal de aquí, porque en verdad has sido rechazado”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">(Gott) sprach: \"Hinaus denn von hier, denn wahrlich, du bist verworfen.", "spanish": " “Así, cuando lo haya moldeado con perfección y le haya insuflado Mi Espíritu, postraos en señal de sumisión a Él”.", "urdu": " پس جب میں اسے مکمل کر دوں اور اس (کے دل) میں اپنا کلام ڈال دوں تو تم سب اس کے ساتھ سجدہ کرتے ہوئے (اللہ کے حضور) گر جانا۔"}, {"arabic": " وَّ اِنَّ عَلَیۡکَ اللَّعۡنَۃَ اِلٰی یَوۡمِ الدِّیۡنِ ﴿۳۶﴾", "english": " ‘And, surely, on thee shall be My curse till the Day of Judgment.’", "french": " Et assurément, la malédiction sera sur toi jusqu’au Jour du Jugement. »", "german": " Fluch soll auf dir sein bis zum Tag des Gerichts.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:36&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:36&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic37\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic37\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:37' style='text-decoration:underline'>15:37</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(37)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control37\"></i></button> <audio id=\"player37\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ رَبِّ فَاَنۡظِرۡنِیۡۤ اِلٰی یَوۡمِ یُبۡعَثُوۡنَ ﴿۳۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He said, ‘My Lord, then grant me respite till the day when they shall be raised.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_37_b' href='#'>b</a>]</sup>He said, ‘My Lord, then grant me respite till the day when they shall be raised.’<sup class='ref'>[<a class='ref' data-id='ref_15_37_1498' href='#'>1498</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_37_b'>b</span><span class='collapsible plus' data-id='ref_15_37_1498'>1498</span></div> <div><div class='reference' data-id='ref_15_37_b' style='display:none'> <p><b>b.</b> <a href='/quran/7:15' target=_blank>7:15</a>; <a href='/quran/17:63' target=_blank>17:63</a>; <a href='/quran/38:80' target=_blank>38:80</a>. (<a href='javascript:void(0)' data-id='ref_15_37_b' class='ref'>close</a>)</p> </div> </div><div><a name='1498'></a><div class='reference' data-id='ref_15_37_1498' style='display:none'> <p><b>1498.</b> The words 'when they shall be raised' signify the spiritual rebirth of man when having attained the stage of <i>Nafs-e-Mutma’innah </i>(the soul at peace with God) he becomes immune to satanic seduction and spiritual fall. This dialogue between God and Satan is, as hinted here, only an allegory or a metaphor. (<a href='javascript:void(0)' data-id='ref_15_37_1498' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا اے میرے ربّ! مجھے اس دن تک مہلت دے جب وہ (بشر) اٹھائے جائیں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اس نے کہا (کہ) اے میرے رب (اگر تو فوراً مجھے سزا نہیں دیتا تو) تو مجھے ان کے (دوبارہ) اٹھائے جانے کے دن تک مہلت دے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il dit : « Mon Seigneur, alors accorde-moi un délai jusqu’au jour où ils seront ressuscités. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Él dijo: “Señor mío, concédeme un respiro hasta el día en que sean resucitados”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er sprach: \"Mein Herr, so gewähre mir Aufschub bis zum Tage, an dem sie auferweckt werden.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:37&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:37&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic38\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic38\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:38' style='text-decoration:underline'>15:38</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(38)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control38\"></i></button> <audio id=\"player38\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ فَاِنَّکَ مِنَ الۡمُنۡظَرِیۡنَ ﴿ۙ۳۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\"><I> God </I>said, ‘Thou art of those that are granted respite,</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_38_c' href='#'>c</a>]</sup><i>God </i>said, ‘Thou art of those who are respited <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_38_c'>c</span></div> <div><div class='reference' data-id='ref_15_38_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:16' target=_blank>7:16</a>; <a href='/quran/38:81' target=_blank>38:81</a>. (<a href='javascript:void(0)' data-id='ref_15_38_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا پس یقیناً تُو مہلت دیئے جانے والوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">فرمایا : تو مہلت پانے والوں میں سے ہوگا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Allāh</em> dit : « Tu es de ceux à qui un délai est accordé,</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em> Dios</em> dijo: “Eres de aquellos a los que se les concede un respiro”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">(Gott) sprach: \"Du bist unter denen, die Aufschub erlangen,", "spanish": " “ Pues en verdad sobre ti caerá Mi maldición, hasta el Día del Juicio”.", "urdu": " اور (یاد رکھ کہ) جزا (وسزا) کے دن تک تجھ پر (میری) لعنت رہے گی۔"}, {"arabic": " اِلٰی یَوۡمِ الۡوَقۡتِ الۡمَعۡلُوۡمِ ﴿۳۹﴾", "english": " ‘Till the day of the appointed time.’", "french": " Jusqu’au jour du terme fixé. »", "german": "", "spanish": " “ Hasta que llegue el día del tiempo fijado”.", "urdu": " اسی معین وقت تک (جس کا ذکر اوپر ہو چکا ہے)"}, {"arabic": " قَالَ رَبِّ بِمَاۤ اَغۡوَیۡتَنِیۡ لَاُزَیِّنَنَّ لَہُمۡ فِی الۡاَرۡضِ وَ لَاُغۡوِیَنَّہُمۡ اَجۡمَعِیۡنَ ﴿ۙ۴۰﴾", "english": " He answered, ‘My Lord, since Thou hast adjudged me as lost, I will surely make evil appear beautiful to them on the earth, and I will surely lead them all astray,", "french": " Il répondit : « Mon Seigneur, puisque Tu m’as déclaré égaré, je ferai sûrement que leur séjour leur paraisse beau sur la terre, et sûrement je les égarerai tous,", "german": " Er antwortete: \"Mein Herr, da Du mich als verloren erklärt hast, will ich ihnen wahrlich (das Böse) auf Erden herausschmücken, und wahrlich, ich will sie alle irreleiten,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:40&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:40&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic41\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic41\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:41' style='text-decoration:underline'>15:41</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(41)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control41\"></i></button> <audio id=\"player41\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِلَّا عِبَادَکَ مِنۡہُمُ الۡمُخۡلَصِیۡنَ ﴿۴۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Except Thy chosen servants from among them.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_15_41_f' href='#'>f</a>]</sup>‘Except Thy chosen servants from among them.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_41_f'>f</span></div> <div><div class='reference' data-id='ref_15_41_f' style='display:none'> <p><b>f.</b> <a href='/quran/38:84' target=_blank>38:84</a>. (<a href='javascript:void(0)' data-id='ref_15_41_f' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">سوائے اُن میں سے تیرے چنیدہ بندوں کے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">مگر جو تیرے برگزیدہ بندے ہیں (اور جو میرے فریب میں نہیں آسکتے وہ بچ جائیں گے) </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Excepté Tes serviteurs choisis de parmi eux. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Excepto a Tus siervos elegidos de entre ellos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">bis auf Deine erwählten Diener unter ihnen.\"", "spanish": " Él respondió: “Señor mío, ya que Me has juzgado como perdido, haré ciertamente que el mal les aparezca bello en la tierra, y extraviaré a todos ellos”.", "urdu": " اس نے کہا (کہ) اے میرے رب چونکہ تو نے مجھے گمراہ قرار دیا ہے میں ضرور ان کے لئے دنیا میں (گمراہی کو) خوبصورت کرکے دکھاٶں گا اور ان سب کو گمراہ کر دوں گا۔"}, {"arabic": " قَالَ ہٰذَا صِرَاطٌ عَلَیَّ مُسۡتَقِیۡمٌ ﴿۴۲﴾", "english": " God said, ‘This is a path leading straight to Me.", "french": " Allāh dit : « Voici un chemin menant droit à Moi.", "german": " (Gott) sprach: \"Dies ist ein gerader Weg zu Mir.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:42&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:42&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic43\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic43\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:43' style='text-decoration:underline'>15:43</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(43)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control43\"></i></button> <audio id=\"player43\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّ عِبَادِیۡ لَیۡسَ لَکَ عَلَیۡہِمۡ سُلۡطٰنٌ اِلَّا مَنِ اتَّبَعَکَ مِنَ الۡغٰوِیۡنَ ﴿۴۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Surely, thou shalt have no power over My servants, except such of the erring ones as <em>choose to</em> follow thee.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Surely, <sup class='ref'>[<a class='ref' data-id='ref_15_43_g' href='#'>g</a>]</sup>thou shalt have no power over My servants, except such of the <sup class='ref'>[<a class='ref' data-id='ref_15_43_h' href='#'>h</a>]</sup>erring ones as <i>choose to </i>follow thee.’<sup class='ref'>[<a class='ref' data-id='ref_15_43_1500' href='#'>1500</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_43_g'>g</span><span class='collapsible plus' data-id='ref_15_43_h'>h</span><span class='collapsible plus' data-id='ref_15_43_1500'>1500</span></div> <div><div class='reference' data-id='ref_15_43_g' style='display:none'> <p><b>g.</b> <a href='/quran/17:66' target=_blank>17:66</a>; <a href='/quran/34:22' target=_blank>34:22</a>. (<a href='javascript:void(0)' data-id='ref_15_43_g' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_15_43_h' style='display:none'> <p><b>h.</b> <a href='/quran/7:19' target=_blank>7:19</a>; <a href='/quran/17:64' target=_blank>17:64</a>; <a href='/quran/38:86' target=_blank>38:86</a>. (<a href='javascript:void(0)' data-id='ref_15_43_h' class='ref'>close</a>)</p> </div> </div><div><a name='1500'></a><div class='reference' data-id='ref_15_43_1500' style='display:none'> <p><b>1500.</b> The verse seems to suggest that human nature is intrinsically pure. Only those lose the right path who defile their own nature and choose to follow Satan. This idea has been further explained in <a href='/quran/91:11' target=_blank>91:11</a>. (<a href='javascript:void(0)' data-id='ref_15_43_1500' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً (جو) میرے بندے (ہیں) ان پر تجھے کوئی غلبہ نصیب نہ ہوگا سوائے گمراہوں میں سے اُن کے جو (از خود) تیری پیروی کریں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">جو میرے بندے ہیں ان پر تیرا کبھی بھی تسلط نہیں ہوگا۔ ہاں ایسے افراد جو تیرے پیچھے چلیں یعنی خود گمراہ ہوں (وہ مستثنیٰ ہیں) ۔</span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Assurément, tu n’auras aucun pouvoir sur Mes serviteurs, sauf celui d’entre les pervers qui te suivra <em>de son gré</em>. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“En verdad, no tendrás poder sobre Mis siervos, excepto aquellos de los perversos que te sigan”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Fürwahr, du sollst keine Macht haben über Meine Diener, bis auf jene der Verführten, die dir folgen.\"", "spanish": " Dios dijo: “Éste es un camino que lleva recto hasta Mí;”", "urdu": " (پھر) فرمایا (کہ) میری طرف آنے کی یہی سیدھی راہ ہے۔"}, {"arabic": " وَ اِنَّ جَہَنَّمَ لَمَوۡعِدُہُمۡ اَجۡمَعِیۡنَ ﴿۟ۙ۴۴﴾", "english": " And, surely, Hell is the promised place for them all.", "french": " Et, assurément, l’Enfer est le lieu qui leur est promis à tous ;", "german": " Und die Hölle ist wahrlich ihnen allen der verheißene Ort.", "spanish": " Pues en verdad, el Infierno es el lugar prometido para todos ellos.", "urdu": " اور یقیناً جہنم ان سب کے (لئے) وعدہ کی جگہ ہے۔"}, {"arabic": " لَہَا سَبۡعَۃُ اَبۡوَابٍ ؕ لِکُلِّ بَابٍ مِّنۡہُمۡ جُزۡءٌ مَّقۡسُوۡمٌ ﴿٪۴۵﴾", "english": " It has seven gates: and each gate has a portion of them allotted to it .", "french": " Ayant sept portes, et à chaque porte est assignée une partie d’entre eux.", "german": " Sieben Tore hat sie, und jedem Tor ist ihrer ein Teil zugewiesen.", "spanish": " Tiene siete puertas; y a cada puerta se le asigna un grupo de ellos.", "urdu": " اس کے سات دروازے ہیں (اور اس کے) ہر دروازہ کے لئے ان (کفار) میں سے ایک مقرر حصہ ہوگا۔"}, {"arabic": " اِنَّ الۡمُتَّقِیۡنَ فِیۡ جَنّٰتٍ وَّ عُیُوۡنٍ ﴿ؕ۴۶﴾", "english": " Verily, the righteous will be placed amid gardens and fountains.", "french": " En vérité, les vertueux seront placés au milieu des Jardins et des fontaines.", "german": " Die Rechtschaffenen werden mitten in Gärten und Quellen sein.", "spanish": " Ciertamente el justo estará colocado entre jardines y fuentes.", "urdu": " متقی (لوگ) یقیناً باغوں اور چشموں (والے مقام) میں (داخل) ہوں گے۔"}, {"arabic": " اُدۡخُلُوۡہَا بِسَلٰمٍ اٰمِنِیۡنَ ﴿۴۷﴾", "english": " ‘Enter therein with peace, in safety.’", "french": " « Entrez-y en paix, en sécurité. »", "german": " Tretet darein in Frieden, geborgen.", "spanish": " “Entrad en ella en paz y seguridad”.", "urdu": " (انہیں کہا جائے گا کہ) تم سلامتی کے ساتھ بے خوف (وخطر) ان میں داخل ہو جاٶ۔"}, {"arabic": " وَ نَزَعۡنَا مَا فِیۡ صُدُوۡرِہِمۡ مِّنۡ غِلٍّ اِخۡوَانًا عَلٰی سُرُرٍ مُّتَقٰبِلِیۡنَ ﴿۴۸﴾", "english": " And We shall remove whatever of rancour may be in their breasts so that they will become as brothers seated on thrones, facing one another.", "french": " Et Nous dissiperons tout ce qu’ils pour­raient avoir de rancœur dans leur cœur de sorte qu’ils deviendront comme des frères assis sur des canapés, faisant face les uns aux autres.", "german": " Und Wir wollen hinwegnehmen, was an Groll in ihrer Brust sein mag; wie Brüder sitzend auf erhöhten Sitzen, einander gegenüber.", "spanish": " Haremos desaparecer cualquier rencor que pueda haber en sus pechos de manera que se vuelvan como hermanos, reclinados en divanes, unos frente a otros;", "urdu": " اور ان کے سینوں میں جو کینہ (وغیرہ) بھی ہوگا‘ اسے ہم نکال دیں گے‘ وہ بھائی بھائی بن کر (جنت میں رہیں گے) اور تختوں پر ایک دوسرے کے سامنے (بیٹھے) ہوں گے۔"}, {"arabic": " لَا یَمَسُّہُمۡ فِیۡہَا نَصَبٌ وَّ مَا ہُمۡ مِّنۡہَا بِمُخۡرَجِیۡنَ ﴿۴۹﴾", "english": " Fatigue shall not touch them there, nor shall they ever be ejected therefrom.", "french": " La fatigue ne les y atteindra pas, et ils n’en seront jamais expulsés.", "german": " Müdigkeit soll sie darin nicht berühren, noch sollen sie je von dort vertrieben werden,", "spanish": " La fatiga no les alcanzará, ni serán nunca expulsados de allí.", "urdu": " نہ انہیں ان میں کوئی تھکان ہوگی اور نہ انہیں ان میں سے کبھی نکالا جائے گا۔"}, {"arabic": " نَبِّیٴۡ عِبَادِیۡۤ اَنِّیۡۤ اَنَا الۡغَفُوۡرُ الرَّحِیۡمُ ﴿ۙ۵۰﴾", "english": " Tell My servants that I am surely the One Most Forgiving, the Merciful;", "french": " Informe Mes serviteurs, ô Prophète, que Je suis assurément le Très-Pardonnant, le Miséricordieux ;", "german": " verkünde Meinen Dienern, dass Ich fürwahr der Allverzeihende, der Barmherzige bin,", "spanish": " Di a Mis siervos que Yo soy ciertamente el Sumo Perdonador, el Misericordioso;", "urdu": " (اے پیغمبر)! میرے بندوں کو آگاہ کر دے کہ میں بہت ہی بخشنے والا (اور) باربار رحم کرنے والا ہوں۔"}, {"arabic": " وَ اَنَّ عَذَابِیۡ ہُوَ الۡعَذَابُ الۡاَلِیۡمُ ﴿۵۱﴾", "english": " And also that My punishment is the grievous punishment.", "french": " Et aussi que Mon châtiment est certainement le châtiment douloureux.", "german": " und dass Meine Strafe die schmerzliche Strafe ist.", "spanish": " Y también que Mi castigo es el castigo doloroso.", "urdu": " اور (یہ) کہ میرا عذاب ہی (حقیقتاً) دردناک عذاب (ہوتا) ہے۔"}, {"arabic": " وَ نَبِّئۡہُمۡ عَنۡ ضَیۡفِ اِبۡرٰہِیۡمَ ﴿ۘ۵۲﴾", "english": " And tell them about Abraham’s guests.", "french": " Et informe -les des hôtes d’Abraham.", "german": " Und verkünde ihnen von den Gästen Abrahams.", "spanish": " E infórmales de los huéspedes de Abraham.", "urdu": " اور انہیں ابراہیم کے مہمانوں کے متعلق (بھی) آگاہ کر۔"}, {"arabic": " اِذۡ دَخَلُوۡا عَلَیۡہِ فَقَالُوۡا سَلٰمًا ؕ قَالَ اِنَّا مِنۡکُمۡ وَجِلُوۡنَ ﴿۵۳﴾", "english": " When they entered in unto him and said, ‘Peace,’ he answered, ‘Verily, we feel afraid of you.’", "french": " Quand ils entrèrent chez lui et dirent : « Paix soit sur toi , » il répondit : « En vérité, par votre venue, vous nous faites peur. »", "german": " Da sie bei ihm eintraten und sprachen: \"Frieden\", antwortete er: \"Wir fürchten uns vor euch.\"", "spanish": " Cuando se presentaron ante él, diciéndole: “Paz”, él respondió: “En verdad sentimos miedo de vosotros”.", "urdu": " جب وہ اس کے پاس آئے اور کہا (کہ ہم تمہیں) سلام (کہتے ہیں) تو اس نے کہا (کہ) ہم تو تمہاری (آمد کی) وجہ سے ڈر رہے ہیں ۔"}, {"arabic": " قَالُوۡا لَا تَوۡجَلۡ اِنَّا نُبَشِّرُکَ بِغُلٰمٍ عَلِیۡمٍ ﴿۵۴﴾", "english": " They said, ‘Fear not, we give thee glad tidings of a son who shall be endowed with knowledge.’", "french": " Ils dirent : « N’aie pas peur ; nous t’an­nonçons la bonne nouvelle d’un fils qui sera doué de savoir. »", "german": " Sie sprachen: \"Fürchte dich nicht, wir bringen dir frohe Kunde von einem Sohn, mit Wissen begabt.\"", "spanish": " Respondieron: “No temas, pues venimos a darte la buena nueva de un hijo que estará dotado de conocimiento”.", "urdu": " انہوں نے کہا (کہ) تو خوف نہ کر‘ ہم تجھے ایک بہت علم (پانے) والے لڑکے کی بشارت دیتے ہیں۔"}, {"arabic": " قَالَ اَبَشَّرۡتُمُوۡنِیۡ عَلٰۤی اَنۡ مَّسَّنِیَ الۡکِبَرُ فَبِمَ تُبَشِّرُوۡنَ ﴿۵۵﴾", "english": " He said, ‘Do you give me the glad tidings in spite of the fact that old age has overtaken me? Of what then do you give me the glad tidings?’", "french": " Il dit : « M’annoncez-vous cette bonne nouvelle bien que la vieillesse m’ait atteint ? Sur quoi donc vous vous basez pour m’annoncer cette bonne nouvelle ? »", "german": " Er sprach: \"Bringt ihr mir die frohe Kunde ungeachtet dessen, dass mich das Alter ereilt hat? Warum denn bringt ihr mir also die frohe Kunde?\"", "spanish": " Él dijo: “¿Me dais esa buena nueva a pesar de que la vejez me ha alcanzado? ¿Sobre qué pues me dais la buena nueva?”.", "urdu": " اس نے کہا (کہ) کیا تم نے میرے بوڑھا ہو جانے کے باوجود مجھے یہ بشارت دی ہے‘ پس (بتاٶ کہ) کس بنا پر تم مجھے (یہ) بشارت دیتے ہو۔"}, {"arabic": " قَالُوۡا بَشَّرۡنٰکَ بِالۡحَقِّ فَلَا تَکُنۡ مِّنَ الۡقٰنِطِیۡنَ ﴿۵۶﴾", "english": " They said, ‘We have, indeed, given thee glad tidings in truth; be not therefore of those who despair.’", "french": " Ils dirent : « Nous t’avons donné la bonne nouvelle basée sur la vérité ; ne sois donc pas de ceux qui désespèrent. »", "german": " Sie sprachen: \"Wir haben dir die frohe Kunde mit der Wahrheit gebracht; sei darum nicht einer der Verzweifelnden.\"", "spanish": " Respondieron: “No te hemos dado sino la buena nueva basada en la verdad; no seas pues de los que desesperan”.", "urdu": " انہوں نے کہا (کہ) ہم نے تجھے سچی بشارت دی ہے۔ پس تو نا امید مت ہو۔"}, {"arabic": " قَالَ وَ مَنۡ یَّقۡنَطُ مِنۡ رَّحۡمَۃِ رَبِّہٖۤ اِلَّا الضَّآلُّوۡنَ ﴿۵۷﴾", "english": " He said, ‘And who can despair of the mercy of his Lord save those who go astray?’", "french": " . Il dit : « Et qui désespère de la miséricorde de Son Seigneur, sinon ceux qui s’égarent ? »", "german": " Er sprach: \"Und wer könnte verzweifeln an der Barmherzigkeit seines Herrn, wenn nicht die Verirrten?\"", "spanish": " Dijo: “¿Mas quién puede desesperar de la misericordia de su Señor salvo los extraviados?”.", "urdu": " اس نے کہا (کہ میں کیونکرناامید ہوسکتاہوں) اور گمراہوں کے سوااپنے رب کی رحمت سے کون ناامید ہوتاہے۔"}, {"arabic": " قَالَ فَمَا خَطۡبُکُمۡ اَیُّہَا الۡمُرۡسَلُوۡنَ ﴿۵۸﴾", "english": " He said, ‘What now is your business, O ye messengers?’", "french": " Il dit : « Dites-moi maintenant quel est l’objet de votre mission, ô messagers ? »", "german": " Er sprach: \"Was ist euer Auftrag, ihr Boten?\"", "spanish": " Y añadió: “¿Cuál es vuestra misión actual, Oh mensajeros?”.", "urdu": " (پھر) کہا (کہ اچھا) تو اے (خدا کے) فرستادو! (وہ) تمہارا اہم کام کیا ہے؟ (جس کے لئے تمہیں بھیجا گیا ہے)"}, {"arabic": " قَالُوۡۤا اِنَّاۤ اُرۡسِلۡنَاۤ اِلٰی قَوۡمٍ مُّجۡرِمِیۡنَ ﴿ۙ۵۹﴾", "english": " They said, ‘We have been sent unto a guilty people", "french": " Ils dirent : « Nous avons été envoyés à un peuple coupable condamné à la destruction,", "german": "", "spanish": " Respondieron: “Hemos sido enviados a un pueblo culpable”,", "urdu": " انہوں نے کہا (کہ) ہمیں ایک مجرم قوم کی طرف (ان کی ہلاکت کے لئے) بھیجا گیا ہے۔"}, {"arabic": " اِلَّاۤ اٰلَ لُوۡطٍ ؕ اِنَّا لَمُنَجُّوۡہُمۡ اَجۡمَعِیۡنَ ﴿ۙ۶۰﴾", "english": " ‘Excepting the family of Lot. Them we shall save all,", "french": " Excepté les disciples de Lot. Eux, nous les sauverons tous,", "german": " die Anhänger des Lot ausgenommen. Sie alle sollen wir erretten,", "spanish": " “Exceptuada la familia de Lot. Salvaremos a todos ellos”,", "urdu": " سوائے لوط کے پیروٶں کے (کہ) ان سب کو ہم بچالیں گے۔"}, {"arabic": " اِلَّا امۡرَاَتَہٗ قَدَّرۡنَاۤ ۙ اِنَّہَا لَمِنَ الۡغٰبِرِیۡنَ ﴿٪۶۱﴾", "english": " ‘Except his wife. We surmise that she shall be of those who remain behind.’", "french": " Sauf sa femme. Nous estimons qu’elle sera du nombre de ceux qui resteront en arrière. »", "german": " bis auf sein Weib. Wir vermuten, dass sie unter denen sein soll, die zurückbleiben.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:61&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:61&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic62\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic62\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:62' style='text-decoration:underline'>15:62</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(62)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control62\"></i></button> <audio id=\"player62\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَلَمَّا جَآءَ اٰلَ لُوۡطِ ۣالۡمُرۡسَلُوۡنَ ﴿ۙ۶۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And when the messengers came unto the family of Lot,</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And <sup class='ref'>[<a class='ref' data-id='ref_15_62_e' href='#'>e</a>]</sup>when the messengers came unto Lot <i>and his </i>followers; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_62_e'>e</span></div> <div><div class='reference' data-id='ref_15_62_e' style='display:none'> <p><b>e.</b> <a href='/quran/11:78' target=_blank>11:78</a>; <a href='/quran/29:34' target=_blank>29:34</a>. (<a href='javascript:void(0)' data-id='ref_15_62_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس جب آلِ لوط کے پاس پیغامبر پہنچے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پھر جب ہمارے بھیجے ہوئے آل لوط کے پاس آئے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et quand les messagers vinrent auprès de la famille de Lot,</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Mas cuando los mensajeros se presentaron ante la familia de Lot,</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Als die Boten zu den Anhängern des Lot kamen,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:62&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:62&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic63\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic63\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:63' style='text-decoration:underline'>15:63</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(63)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control63\"></i></button> <audio id=\"player63\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ اِنَّکُمۡ قَوۡمٌ مُّنۡکَرُوۡنَ ﴿۶۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He said, ‘Verily, you are a party of strangers.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> He said, <sup class='ref'>[<a class='ref' data-id='ref_15_63_f' href='#'>f</a>]</sup>‘Verily, you are a party of strangers.’<sup class='ref'>[<a class='ref' data-id='ref_15_63_1507' href='#'>1507</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_63_f'>f</span><span class='collapsible plus' data-id='ref_15_63_1507'>1507</span></div> <div><div class='reference' data-id='ref_15_63_f' style='display:none'> <p><b>f.</b> <a href='/quran/51:26' target=_blank>51:26</a>. (<a href='javascript:void(0)' data-id='ref_15_63_f' class='ref'>close</a>)</p> </div> </div><div><a name='1507'></a><div class='reference' data-id='ref_15_63_1507' style='display:none'> <p><b>1507.</b> Lot thought these men to be mere wayfarers whose visit to the place was only casual. (<a href='javascript:void(0)' data-id='ref_15_63_1507' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا تم یقیناً اجنبی لوگ ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">تو اس نے (انہیں) کہا (کہ) آپ (اس علاقہ میں) اجنبی (معلوم ہوتے) ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il dit : « En vérité, vous êtes des étrangers. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Él dijo: “En verdad, sois un grupo de desconocidos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">da sprach er: \"Fürwahr, ihr seid fremde Leute.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:63&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:63&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic64\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic64\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:64' style='text-decoration:underline'>15:64</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(64)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control64\"></i></button> <audio id=\"player64\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالُوۡا بَلۡ جِئۡنٰکَ بِمَا کَانُوۡا فِیۡہِ یَمۡتَرُوۡنَ ﴿۶۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">They said, ‘Nay, but we have come to thee with that about which they doubted.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> They said, ‘Nay; but we have brought thee that <i>news of the punishment </i>concerning which they have been in doubt; </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">انہوں نے جواب دیا بلکہ ہم تو تیرے پاس وہ (خبر) لائے ہیں جس کے متعلق وہ شک میں مبتلا رہتے تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">انہوں نے کہا (اصل) بات یہ ہے کہ ہم تمہارے پاس اس (عذاب) کی خبر لے کر آئے ہیں جس کے متعلق یہ (لوگ) شک کرتے رہے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ils dirent : « En fait, nous sommes venus à toi avec ce dont ils ont douté.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Respondieron: “No; sólo hemos venido a ti con aquello sobre lo que dudaron”;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Sie sprachen: \"Nein, aber wir sind zu dir gekommen mit dem, woran sie zweifelten.", "spanish": " “Excepto a su mujer. Suponemos que estará entre los que se queden detrás”.", "urdu": " ہاں اس کی بیوی کے متعلق ہمارا اندازہ ہے کہ وہ پیچھے رہنے (اور ہلاک ہونے) والوں میں سے ہوگی۔"}, {"arabic": " وَ اَتَیۡنٰکَ بِالۡحَقِّ وَ اِنَّا لَصٰدِقُوۡنَ ﴿۶۵﴾", "english": " ‘And we have come to thee with the truth, and surely we are truthful.", "french": " Et nous sommes venus à toi avec la vérité, et assurément nous sommes véridiques.", "german": " Und wir sind zu dir gekommen mit der Wahrheit, und gewiss, wir sind wahrhaftig.", "spanish": " “Y hemos venido a ti con la verdad, pues ciertamente somos veraces”.", "urdu": " اور ہم تمہارے پاس یقینی خبر لائے ہیں اور ہم سچے ہیں۔"}, {"arabic": " فَاَسۡرِ بِاَہۡلِکَ بِقِطۡعٍ مِّنَ الَّیۡلِ وَ اتَّبِعۡ اَدۡبَارَہُمۡ وَ لَا یَلۡتَفِتۡ مِنۡکُمۡ اَحَدٌ وَّ امۡضُوۡا حَیۡثُ تُؤۡمَرُوۡنَ ﴿۶۶﴾", "english": " ‘So go forth with thy family in the latter part of the night, and follow thou in their rear. And let none of you look back, and now proceed to where you are commanded.’", "french": " Pars donc avec ta famille dans une partie de la nuit, et toi, suis derrière eux. Et qu’aucun d’entre vous ne regarde en arrière, et maintenant partez là où il vous est com­mandé. »", "german": " So mache dich fort mit deinen Angehörigen im (späteren) Teil der Nacht und ziehe hinter ihnen her. Und keiner von euch soll sich umwenden, sondern gehet, wohin euch geboten wird.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:66&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:66&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic67\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic67\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:67' style='text-decoration:underline'>15:67</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(67)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control67\"></i></button> <audio id=\"player67\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ قَضَیۡنَاۤ اِلَیۡہِ ذٰلِکَ الۡاَمۡرَ اَنَّ دَابِرَ ہٰۤؤُلَآءِ مَقۡطُوۡعٌ مُّصۡبِحِیۡنَ ﴿۶۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And We communicated to him this decree that the root of them was to be cut off by the morning.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And <sup class='ref'>[<a class='ref' data-id='ref_15_67_a' href='#'>a</a>]</sup>We communicated to him clearly this decree that the roots of these <i>people </i>would be cut off by the morning. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_67_a'>a</span></div> <div><div class='reference' data-id='ref_15_67_a' style='display:none'> <p><b>a.</b> <a href='/quran/6:46' target=_blank>6:46</a>; <a href='/quran/7:73' target=_blank>7:73</a>, <a href='/quran/7:85' target=_blank>85</a>. (<a href='javascript:void(0)' data-id='ref_15_67_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ہم نے اُسے یہ فیصلہ سنا دیا کہ ان لوگوں کی جڑ صبح ہوتے وقت کاٹی جا چکی ہو گی۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور یہ بات ہم نے اسے یقینی طور پر بتا دی کہ ان لوگوں کی جڑ صبح (ہوتے ہی) کاٹ دی جائے گی۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et Nous lui annonçâmes ce décret que ces gens seraient totalement annihilés au matin.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y le comunicamos este decreto: de que hasta el último de ellos sería exterminado por la mañana.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und Wir verkündeten ihm diesen Ratschluss, dass die Wurzel jener abgeschnitten werden sollte am Morgen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:67&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:67&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic68\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic68\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:68' style='text-decoration:underline'>15:68</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(68)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control68\"></i></button> <audio id=\"player68\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ جَآءَ اَہۡلُ الۡمَدِیۡنَۃِ یَسۡتَبۡشِرُوۡنَ ﴿۶۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And the people of the city came rejoicing.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And <sup class='ref'>[<a class='ref' data-id='ref_15_68_b' href='#'>b</a>]</sup>the people of the city came rejoicing.<sup class='ref'>[<a class='ref' data-id='ref_15_68_1510' href='#'>1510</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_68_b'>b</span><span class='collapsible plus' data-id='ref_15_68_1510'>1510</span></div> <div><div class='reference' data-id='ref_15_68_b' style='display:none'> <p><b>b.</b> <a href='/quran/11:79' target=_blank>11:79</a>. (<a href='javascript:void(0)' data-id='ref_15_68_b' class='ref'>close</a>)</p> </div> </div><div><a name='1510'></a><div class='reference' data-id='ref_15_68_1510' style='display:none'> <p><b>1510.</b> Lot had been told by his people not to bring strangers into the city and so when the guests came to him they were glad that he would be taken to task for having defied their warnings. (<a href='javascript:void(0)' data-id='ref_15_68_1510' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور شہر کے رہنے والے خوشیاں مناتے ہوئے آئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اس شہر کے لوگ خوشیاں مناتے ہوئے اس (یعنی لوط) کے پاس آئے (اس خیال سے کہ اب اسے پکڑنے کا موقعہ مل گیا ہے) </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et les habitants de la ville vinrent en se réjouissant.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Mas la gente de la ciudad acudieron regocijados.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und das Volk der Stadt kam frohlockend.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:68&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:68&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic69\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic69\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:69' style='text-decoration:underline'>15:69</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(69)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control69\"></i></button> <audio id=\"player69\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ اِنَّ ہٰۤؤُلَآءِ ضَیۡفِیۡ فَلَا تَفۡضَحُوۡنِ ﴿ۙ۶۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He said, ‘These are my guests, so put me not to shame;</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> He said, <sup class='ref'>[<a class='ref' data-id='ref_15_69_c' href='#'>c</a>]</sup>‘These are my guests, so put me not to shame. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_69_c'>c</span></div> <div><div class='reference' data-id='ref_15_69_c' style='display:none'> <p><b>c.</b> <a href='/quran/11:79' target=_blank>11:79</a>. (<a href='javascript:void(0)' data-id='ref_15_69_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا یہ میرے مہمان ہیں پس مجھے رُسوا نہ کرو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(جس پر) اس نے (ان سے) کہا (کہ) یہ لوگ میرے مہمان ہیں۔ تم (انہیں ڈرا کر) مجھے رسوا نہ کرو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il dit : « Ce sont là mes hôtes ; ne me déshonorez pas.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Él dijo: “Éstos son mis invitados, no me avergoncéis”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er sprach: \"Das sind meine Gäste, so tut mir nicht Schande an.", "spanish": " “Sal pues con tu familia en la última parte de la noche, y sigue tú detrás de ellos. Que ninguno de vosotros mire atrás, y dirigios ahora a donde se os ordene”.", "urdu": " سو تم رات کے آخری حصہ میں (کسی وقت) اپنے گھر والوں کو لے کر (یہاں سے) چلے جاٶ۔ اور (خود) ان کے پیچھے (پیچھے) رہو اور تم میں سے کوئی پیچھے مڑ کر نہ دیکھے اور جہاں جانے کا حکم تمہیں دیا جاتا ہے (سب وہاں) چلے جاٶ۔"}, {"arabic": " وَ قَضَیۡنَاۤ اِلَیۡہِ ذٰلِکَ الۡاَمۡرَ اَنَّ دَابِرَ ہٰۤؤُلَآءِ مَقۡطُوۡعٌ مُّصۡبِحِیۡنَ ﴿۶۷﴾", "english": " And We communicated to him this decree that the root of them was to be cut off by the morning.", "french": " Et Nous lui annonçâmes ce décret que ces gens seraient totalement annihilés au matin.", "german": " Und Wir verkündeten ihm diesen Ratschluss, dass die Wurzel jener abgeschnitten werden sollte am Morgen.", "spanish": " Y le comunicamos este decreto: de que hasta el último de ellos sería exterminado por la mañana.", "urdu": " اور یہ بات ہم نے اسے یقینی طور پر بتا دی کہ ان لوگوں کی جڑ صبح (ہوتے ہی) کاٹ دی جائے گی۔"}, {"arabic": " وَ جَآءَ اَہۡلُ الۡمَدِیۡنَۃِ یَسۡتَبۡشِرُوۡنَ ﴿۶۸﴾", "english": " And the people of the city came rejoicing.", "french": " Et les habitants de la ville vinrent en se réjouissant.", "german": " Und das Volk der Stadt kam frohlockend.", "spanish": " Mas la gente de la ciudad acudieron regocijados.", "urdu": " اور اس شہر کے لوگ خوشیاں مناتے ہوئے اس (یعنی لوط) کے پاس آئے (اس خیال سے کہ اب اسے پکڑنے کا موقعہ مل گیا ہے)"}, {"arabic": " قَالَ اِنَّ ہٰۤؤُلَآءِ ضَیۡفِیۡ فَلَا تَفۡضَحُوۡنِ ﴿ۙ۶۹﴾", "english": " He said, ‘These are my guests, so put me not to shame;", "french": " Il dit : « Ce sont là mes hôtes ; ne me déshonorez pas.", "german": " Er sprach: \"Das sind meine Gäste, so tut mir nicht Schande an.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=15:69&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=15:69&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic70\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic70\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/15:70' style='text-decoration:underline'>15:70</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(70)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control70\"></i></button> <audio id=\"player70\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اتَّقُوا اللّٰہَ وَ لَا تُخۡزُوۡنِ ﴿۷۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And fear Allah and disgrace me not.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And fear Allah and do not humiliate me.’<sup class='ref'>[<a class='ref' data-id='ref_15_70_1511' href='#'>1511</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_15_70_1511'>1511</span></div> <div><a name='1511'></a><div class='reference' data-id='ref_15_70_1511' style='display:none'> <p><b>1511.</b> Lot begged his people not to disgrace him for offering hospitality to the strangers. (<a href='javascript:void(0)' data-id='ref_15_70_1511' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اللہ سے ڈرو اور مجھے ذلیل نہ کرو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اللہ کا تقویٰ اختیار کرو‘ اور مجھے ذلیل نہ کرو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et craignez Allāh, et ne m’humiliez pas. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Temed a Al-lah y no me cubráis de vergüenza”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und fürchtet Allah und stürzet mich nicht in Schmach.\"", "spanish": " Él dijo: “Éstos son mis invitados, no me avergoncéis”.", "urdu": " (جس پر) اس نے (ان سے) کہا (کہ) یہ لوگ میرے مہمان ہیں۔ تم (انہیں ڈرا کر) مجھے رسوا نہ کرو۔"}, {"arabic": " قَالُوۡۤا اَوَ لَمۡ نَنۡہَکَ عَنِ الۡعٰلَمِیۡنَ ﴿۷۱﴾", "english": " They said, ‘Did we not forbid thee to entertain all sorts of people?’", "french": " Ils dirent : « Ne t’avons-nous pas défendu d’accueillir toutes sortes de gens ? »", "german": " Sie sprachen: \"Haben wir dir nicht verboten, Leute aller Art (aufzunehmen)?\"", "spanish": " Respondieron: “¿Acaso no te prohibimos recibir a todo tipo de gentes?”.", "urdu": " انہوں نے کیا ہم نے تمہیں ہر ایرے غیرے کو اپنے پاس ٹھہرانے سے روکا نہ تھا۔"}, {"arabic": " قَالَ ہٰۤؤُلَآءِ بَنٰتِیۡۤ اِنۡ کُنۡتُمۡ فٰعِلِیۡنَ ﴿ؕ۷۲﴾", "english": " He said, ‘These are my daughters if you must do something.’", "french": " Il dit : « Mes filles sont aussi présentes ici. Ayez donc de l’égard pour leur pudeur, au cas où vous songeriez sérieusement à tenter quoi que ce soit. »", "german": " Er sprach: \"Hier sind meine Töchter, wenn ihr etwas tun müsst.\"", "spanish": " Dijo: “Mis hijas también están presentes aquí. Tenedlo en cuenta si os sentís inclinados a hacer algo”.", "urdu": " اس نے کہا (کہ) اگر تم نے (میرے خلاف) کچھ کرنا (ہی) ہو تو یہ میری بیٹیاں (تم میں موجود ہی) ہیں (جوکافی ضمانت ہیں) ۔"}, {"arabic": " لَعَمۡرُکَ اِنَّہُمۡ لَفِیۡ سَکۡرَتِہِمۡ یَعۡمَہُوۡنَ ﴿۷۳﴾", "english": " By thy life, these too in their mad intoxication are wandering in distraction —", "french": " Par ta vie, ô Prophète, ceux-ci aussi dans leur folle ivresse errent comme des affolés.", "german": " Bei deinem Leben, (auch) diese in ihrer Trunkenheit wandern blindlings irre.", "spanish": " Por tu vida, éstos también vagan distraídos en su loca embriaguez.", "urdu": " (اے ہمارے نبی!) تیری زندگی کی قسم (کہ) یہ (تیرے مخالفین بھی) یقیناً (انہی کی طرح) اپنی بدمستی میں بہک رہے ہیں۔"}, {"arabic": " فَاَخَذَتۡہُمُ الصَّیۡحَۃُ مُشۡرِقِیۡنَ ﴿ۙ۷۴﴾", "english": " Then the punishment seized them at sunrise.", "french": " Alors le châtiment sous forme d’une explosion formidable les saisit au lever du soleil.", "german": " Da erfasste die Strafe sie bei Sonnenaufgang.", "spanish": " Pero entonces el castigo se abatió sobre ellos al despuntar el sol.", "urdu": " اس پر اس (موعود) عذاب نے انہیں (یعنی لوط کی قوم کو) دن چڑھتے (ہی) پکڑ لیا۔"}, {"arabic": " فَجَعَلۡنَا عَالِیَہَا سَافِلَہَا وَ اَمۡطَرۡنَا عَلَیۡہِمۡ حِجَارَۃً مِّنۡ سِجِّیۡلٍ ﴿ؕ۷۵﴾", "english": " We turned it upside down, and We rained upon them stones of clay.", "french": " . Et la ville, Nous la renversâmes sens dessus dessous, et Nous fîmes pleuvoir sur eux des pierres d’argile.", "german": " Und Wir kehrten das Oberste zuunterst, und Wir ließen auf sie Backsteine niederregnen.", "spanish": " Le dimos completamente la vuelta, e hicimos llover sobre ellos piedras arcillosas.", "urdu": " جس پر ہم نے اس بستی کی اوپر والی سطح کو اس کی نچلی سطح کر دیا اور ان پر سنگریزوں سے بنے ہوئے پتھروں کی بارش برسائی۔"}, {"arabic": " اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّلۡمُتَوَسِّمِیۡنَ ﴿۷۶﴾", "english": " Surely, in this are Signs for those who can read signs .", "french": " Assurément, en ceci se trouvent des indications pour ceux qui savent lire les Signes .", "german": " Fürwahr, hierin sind Zeichen für die Einsichtigen.", "spanish": " En verdad, en todo esto hay señales para quien sepa leer los signos.", "urdu": " اس (ذکر) میں فراست سے کام لینے والوں کے لئے یقیناً کئی نشان ہیں۔"}, {"arabic": " وَ اِنَّہَا لَبِسَبِیۡلٍ مُّقِیۡمٍ ﴿۷۷﴾", "english": " And it lies on a road that still exists.", "french": " Et cette ville, elle est située sur une route qui existe toujours.", "german": " Und es liegt an einer Straße, die besteht.", "spanish": " Pues se encuentra en un camino que todavía existe.", "urdu": " اور وہ (کوئی گمنام جگہ نہیں بلکہ) ایک بڑے مستقل راستے پر (واقع) ہے۔"}, {"arabic": " اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّلۡمُؤۡمِنِیۡنَ ﴿ؕ۷۸﴾", "english": " Surely, in this is a Sign for believers.", "french": " Assurément, en ceci se trouve un Signe pour les croyants.", "german": " Fürwahr, hierin ist ein Zeichen für die Gläubigen.", "spanish": " En verdad, en esto hay un Signo para los creyentes.", "urdu": " اس (واقعہ) میں مومنوں (کے فائدہ) کے لئے یقیناً ایک نشان (موجود) ہے۔"}, {"arabic": " وَ اِنۡ کَانَ اَصۡحٰبُ الۡاَیۡکَۃِ لَظٰلِمِیۡنَ ﴿ۙ۷۹﴾", "english": " And the People of the Wood too were surely wrongdoers.", "french": " Et le Peuple des Bois était aussi pécheur.", "german": " Auch die Waldleute waren gewisslich Frevler.", "spanish": " Y los de el Pueblo del Bosque, fueron también, ciertamente, inicuos.", "urdu": " اور ایکہ والے (بھی) یقیناً ظالم تھے۔"}, {"arabic": " فَانۡتَقَمۡنَا مِنۡہُمۡ ۘ وَ اِنَّہُمَا لَبِاِمَامٍ مُّبِیۡنٍ ﴿ؕ٪۸۰﴾", "english": " So We chastised them also . And they both lie on a manifest way.", "french": " Nous les avons donc châtiés . Et ces deux villes restent ensevelies à côté d’une grande route bien connue.", "german": " Darum züchtigten Wir sie. Und beide liegen sie an einer bekannten Straße.", "spanish": " Por ello les castigamos. Y ambos yacen enterrados en un camino notorio.", "urdu": " اس لیے ہم نے انہیں بھی (اسی طرح سخت) سزا دی تھی اور یہ دونوں (جگہیں) ایک (صاف اور) واضح راستے پر (واقع) ہیں۔"}, {"arabic": " وَ لَقَدۡ کَذَّبَ اَصۡحٰبُ الۡحِجۡرِ الۡمُرۡسَلِیۡنَ ﴿ۙ۸۱﴾", "english": " And the People of the Hijr also did treat the Messengers as liars.", "french": " Et le Peuple du Hijr aussi traita les Messagers de menteurs.", "german": " Auch das Volk von Hidschr behandelte die Gesandten als Lügner.", "spanish": " Las Gentes del Hillr trataron también a los Mensajeros como mentirosos.", "urdu": " حجر والوں نے (بھی) یقیناً (ہمارے) پیغمبروں کو جھٹلایا تھا۔"}, {"arabic": " وَ اٰتَیۡنٰہُمۡ اٰیٰتِنَا فَکَانُوۡا عَنۡہَا مُعۡرِضِیۡنَ ﴿ۙ۸۲﴾", "english": " And We gave them Our Signs, but they turned away from them.", "french": " Et Nous leur accordâmes Nos Signes, mais ils s’en détournèrent.", "german": " Und Wir gaben ihnen Unsere Zeichen, sie aber wandten sich von ihnen ab.", "spanish": " Les dimos nuestros Signos, pero se apartaron de ellos.", "urdu": " اور انہیں (بھی) ہم نے اپنے (ہرقسم کے) نشان دئیے تھے جس کا نتیجہ (الٹا) یہ ہوا کہ وہ ان سے روگردان ہو گئے۔"}, {"arabic": " وَ کَانُوۡا یَنۡحِتُوۡنَ مِنَ الۡجِبَالِ بُیُوۡتًا اٰمِنِیۡنَ ﴿۸۳﴾", "english": " And they used to hew out houses in the mountains, in security.", "french": " Et ils taillaient des maisons dans les montagnes, en sécurité.", "german": " Und sie pflegten sich Behausungen in die Berge zu graben zur Sicherheit.", "spanish": " Solían excavar sus casas en las montañas, para más seguridad.", "urdu": " اور وہ پہاڑوں کے بعض حصوں کو کاٹ کر امن کے ساتھ (زندگی بسر کرتے ہوئے) مکان بناتے تھے۔"}, {"arabic": " فَاَخَذَتۡہُمُ الصَّیۡحَۃُ مُصۡبِحِیۡنَ ﴿ۙ۸۴﴾", "english": " But the punishment seized them in the morning,", "french": " Mais le châtiment sous forme d’une explosion formidable les saisit le matin.", "german": " Jedoch die Strafe erfasste sie am Morgen.", "spanish": " Pero el castigo cayó sobre ellos al amanecer,", "urdu": " اور (وعید کے مطابق) صبح ہوتے (ہی) اس (موعود) عذاب نے انہیں پکڑ لیا۔"}, {"arabic": " فَمَاۤ اَغۡنٰی عَنۡہُمۡ مَّا کَانُوۡا یَکۡسِبُوۡنَ ﴿ؕ۸۵﴾", "english": " And all that they had earned availed them not.", "french": " . Et tout ce qu’ils avaient acquis ne leur avait servi à rien.", "german": " Und alles, was sie sich erworben hatten, nützte ihnen nichts.", "spanish": " Y no les sirvió de nada todo lo que habían ganado.", "urdu": " اور جو (مال) وہ جمع کیا کرتے تھے اس نے انہیں (اس وقت) کچھ بھی فائدہ نہ دیا۔"}, {"arabic": " وَ مَا خَلَقۡنَا السَّمٰوٰتِ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَاۤ اِلَّا بِالۡحَقِّ ؕ وَ اِنَّ السَّاعَۃَ لَاٰتِیَۃٌ فَاصۡفَحِ الصَّفۡحَ الۡجَمِیۡلَ ﴿۸۶﴾", "english": " And We have not created the heavens and the earth and all that is between the two but in accordance with the requirements of wisdom; and the Hour is sure to come. So turn away from them in a comely manner.", "french": " Et Nous n’avons créé les cieux et la terre, et tout ce qui est entre les deux, qu’avec la vérité et l’Heure viendra sûrement. Ainsi fais preuve d’une belle tolérance envers eux .", "german": " Wir erschufen die Himmel und die Erde und was zwischen den beiden ist, nicht anders als in Weisheit; und die \"Stunde\" kommt gewiss. Darum vergib in schöner Vergebung.", "spanish": " Pues no hemos creado los cielos y la tierra y todo lo que hay entre ellos sino de acuerdo con la verdad; y es seguro que vendrá la Hora. Aléjate, pues, de ellos, apartándote con cortesía.", "urdu": " اور ہم نے آسمانوں اور زمین کو اور جو کچھ ان دونوں کے درمیان ہے حق (وحکمت) کے ساتھ پیدا کیا ہے‘ اور وہ (موعودہ) گھڑی یقیناً آنے والی ہے اس لئے تو (ان کی زیادتیوں پر) بہت درگذر سے کام لے۔"}, {"arabic": " اِنَّ رَبَّکَ ہُوَ الۡخَلّٰقُ الۡعَلِیۡمُ ﴿۸۷﴾", "english": " Verily, it is thy Lord Who is the Great Creator, the All-Knowing.", "french": " En vérité, c’est ton Seigneur Qui est le Grand Créateur, l’Omniscient.", "german": " Wahrlich, dein Herr, Er ist der erhabene Schöpfer, der Allwissende.", "spanish": " En verdad, tu Señor es el Gran Creador, el Omnisciente.", "urdu": " یقیناً تیرا رب بہت پیدا کرنے والا (اور) خوب جاننے والا ہے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنٰکَ سَبۡعًا مِّنَ الۡمَثَانِیۡ وَ الۡقُرۡاٰنَ الۡعَظِیۡمَ ﴿۸۸﴾", "english": " And We have, indeed, given thee the seven oft-repeated verses , and the Great Qur’an.", "french": " Et Nous t’avons assurément donné les sept versets souvent-répétés, et le Grand Coran.", "german": " Und Wir gaben dir fürwahr die sieben oft wiederholten (Verse) und den erhabenen Qur-ân.", "spanish": " Y, en efecto, te hemos dado los siete versículos , que se repiten a menudo y el Gran Corán.", "urdu": " اور ہم نے یقیناً تجھے سات دہرائی جانے والی (آیات) اور (بہت بڑی) عظمت والا قرآن دیا ہے۔"}, {"arabic": " لَا تَمُدَّنَّ عَیۡنَیۡکَ اِلٰی مَا مَتَّعۡنَا بِہٖۤ اَزۡوَاجًا مِّنۡہُمۡ وَ لَا تَحۡزَنۡ عَلَیۡہِمۡ وَ اخۡفِضۡ جَنَاحَکَ لِلۡمُؤۡمِنِیۡنَ ﴿۸۹﴾", "english": " Stretch not thy eyes towards what We have bestowed on some classes of them to enjoy for a short time, and grieve not over them; and lower thy wing of mercy for the believers.", "french": " N’envoie pas un regard d’envie sur les jouissances éphémères que Nous avons octroyées à divers groupes parmi eux, et ne t’afflige pas à leur propos ; et baisse ton aile de miséricorde pour les croyants.", "german": " Richte deine Augen nicht auf das, was Wir manchen von ihren zu kurzem Genuss verliehen, und betrübe dich auch nicht über sie; und senke deinen Fittich auf die Gläubigen.", "spanish": " No dirijas tu mirada con codicia al placer temporal que hemos proporcionado a algunos grupos de ellos, ni te aflijas por ellos; más bien cubre con tu ala de misericordia a los creyentes.", "urdu": " اورجو ہم نے ان میں سے کئی گروہوں کو (عارضی نفع کا) سامان دیا ہے اس کی طرف آنکھیں پھاڑ پھاڑ کر نہ دیکھ۔ اور ان (کی تباہی) پر غم نہ کھا اور مومنوں پر اپنا (شفقت کا) بازو جھکائے رکھ۔"}, {"arabic": " وَ قُلۡ اِنِّیۡۤ اَنَا النَّذِیۡرُ الۡمُبِیۡنُ ﴿ۚ۹۰﴾", "english": " And say, ‘I am, indeed, a plain Warner.’", "french": " Et dis : « Je suis en vérité l’Avertisseur évident. »", "german": " Und sprich: \"Ich bin gewiss der aufklärende Warner.\"", "spanish": " Diles: “Soy ciertamente un simple Amonestador”.", "urdu": " تو کہہ دے میں ایک کھلا کھلا ہوشیار کرنے والا ہوں۔"}, {"arabic": " کَمَاۤ اَنۡزَلۡنَا عَلَی الۡمُقۡتَسِمِیۡنَ ﴿ۙ۹۱﴾", "english": " Because We have decided to send down punishment on those who have formed themselves into groups against thee ;", "french": " Comme cela a toujours été le cas, Nous enverrons le châtiment sur ceux qui se scindent en sectes,", "german": " Weil Wir (die Strafe) herabsenden werden auf jene, die sich (gegen dich) in Gruppen verbanden,", "spanish": " Igual que siempre, enviaremos el castigo a quienes se dividieron en sectas.", "urdu": " اس لئے کہ (خدا کہتاہے کہ) ہم نے ان (لوگوں) کے لئے (بھی) عذاب مقرر کر چھوڑا ہے جنہوں نے (رسول کریم صلی اللہ علیہ وسلم کے خلاف منصوبوں میں اپنی) ڈیوٹیاں تقسیم کی ہوئی تھیں۔"}, {"arabic": " الَّذِیۡنَ جَعَلُوا الۡقُرۡاٰنَ عِضِیۡنَ ﴿۹۲﴾", "english": " Who have pronounced the Qur’an to be so many lies;", "french": " Et qui diviseront le Coran en morceaux.", "german": " die den Qur-ân als lauter Lügen erklärten,", "spanish": " Y a quienes dividirán al Corán en fragmentos.", "urdu": " (یعنی) وہ (لوگ) جنہوں نے قرآن کو جھوٹی باتوں کا مجموعہ قرار دیا تھا۔"}, {"arabic": " فَوَ رَبِّکَ لَنَسۡـَٔلَنَّہُمۡ اَجۡمَعِیۡنَ ﴿ۙ۹۳﴾", "english": " So by thy Lord, We will, surely, question them all", "french": " Alors, par ton Seigneur, Nous les inter­rogerons sûrement tous", "german": " darum, bei deinem Herrn, Wir werden sie sicherlich alle zur Rechenschaft ziehen", "spanish": " Así pues, por tu Señor, en verdad que interrogaremos a todos ellos", "urdu": " سو تیرے رب کی قسم! ہم ان سب سے جواب طلبی کریں گے۔"}, {"arabic": " عَمَّا کَانُوۡا یَعۡمَلُوۡنَ ﴿ٙ۹۴﴾", "english": " Concerning that which they used to do.", "french": " Sur ce qu’ils avaient l’habitude de faire.", "german": " um dessentwillen, was sie zu tun pflegten.", "spanish": " Sobre lo que solían hacer.", "urdu": " ان کاموں کے متعلق جو وہ کیا کرتے تھے۔"}, {"arabic": " فَاصۡدَعۡ بِمَا تُؤۡمَرُ وَ اَعۡرِضۡ عَنِ الۡمُشۡرِکِیۡنَ ﴿۹۵﴾", "english": " So declare openly that with which thou art commanded and turn aside from those who ascribe partners to God.", "french": " . Déclare donc ouvertement ce qui t’est enjoint, et détourne-toi des associateurs .", "german": " So tue denn offen kund, was dir geboten ward, und wende dich ab von den Götzendienern.", "spanish": " Declara pues abiertamente lo que se te ha ordenado y aléjate de quienes adscriben partícipes a Dios.", "urdu": " سو جس بات (کے پہنچانے) کا تجھے حکم دیا جاتا ہے وہ کھول کر (لوگوں کو) بتا دے اور ان مشرکوں (کی بات) سے اعراض کر۔"}, {"arabic": " اِنَّا کَفَیۡنٰکَ الۡمُسۡتَہۡزِءِیۡنَ ﴿ۙ۹۶﴾", "english": " We will, surely, suffice thee against those who mock:", "french": " Nous te suffisons assurément contre les railleurs,", "german": " Wir werden dir sicherlich genügen gegen die Spötter,", "spanish": " En verdad, te bastaremos contra quienes se burlan;", "urdu": " ہم یقیناً تجھے ان تمسخر کرنے والوں (کے شر) سے محفوظ رکھیں گے۔"}, {"arabic": " الَّذِیۡنَ یَجۡعَلُوۡنَ مَعَ اللّٰہِ اِلٰہًا اٰخَرَ ۚ فَسَوۡفَ یَعۡلَمُوۡنَ ﴿۹۷﴾", "english": " Who set up another God with Allah, but soon shall they come to know.", "french": " Qui établissent un autre dieu avec Allāh, mais bientôt ils vont savoir.", "german": " die einen anderen Gott neben Allah setzen, doch bald werden sie wissen.", "spanish": " Quienes elevan a otro dios a la altura de Al-lah, aunque pronto lo sabrán.", "urdu": " جو اللہ کے ساتھ کئی اور معبود بنا رہے ہیں‘ سو وہ عنقریب (اس کا نتیجہ) معلوم کر لیں گے۔"}, {"arabic": " وَ لَقَدۡ نَعۡلَمُ اَنَّکَ یَضِیۡقُ صَدۡرُکَ بِمَا یَقُوۡلُوۡنَ ﴿ۙ۹۸﴾", "english": " And, indeed, We know that thy bosom becomes straitened because of what they say.", "french": " Et, en vérité, Nous savons que ton cœur se serre à cause de ce qu’ils disent.", "german": " Und fürwahr, Wir wissen, dass deine Brust beklommen wird ob dessen, was sie reden.", "spanish": " Pues, en verdad, sabemos que tu pecho se encoge por lo que dicen.", "urdu": " اور ہم یقیناً جانتے ہیں کہ جو کچھ وہ کہتے ہیں اس سے تیرا دل تنگ پڑتا ہے۔"}, {"arabic": " فَسَبِّحۡ بِحَمۡدِ رَبِّکَ وَ کُنۡ مِّنَ السّٰجِدِیۡنَ ﴿ۙ۹۹﴾", "english": " But glorify thy Lord praising Him, and be of those who prostrate themselves before Him .", "french": " Mais avec les louanges de ton Seigneur, glorifie- Le et sois de ceux qui se prosternent devant Lui.", "german": " Aber lobpreise deinen Herrn und sei einer der sich Unterwerfenden.", "spanish": " Y glorifica a tu Señor alabándole, y sé de los que se postran ante Él.", "urdu": " پس تو اپنے رب کی حمد کرتے ہوئے (اس کی) تسبیح کر اور (اس کے) کامل فرمانبرداروں میں سے بن۔"}, {"arabic": " وَ اعۡبُدۡ رَبَّکَ حَتّٰی یَاۡتِیَکَ الۡیَقِیۡنُ ﴿٪۱۰۰﴾", "english": " And continue worshipping thy Lord, till death comes to thee.", "french": " Et continue à adorer ton Seigneur, jusqu’à ce que la mort vienne à toi.", "german": " Und diene deinem Herrn, bis der Tod zu dir kommt.", "spanish": " Y continúa adorando a tu Señor hasta que te llegue la muerte.", "urdu": " اور اپنے رب کی عبادت کرتا رہ‘ یہاں تک کہ تجھ پر موت (کی گھڑی) آجائے۔"}], "Surah": 15}