{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَلَّذِیۡنَ کَفَرُوۡا وَ صَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ اَضَلَّ اَعۡمَالَہُمۡ ﴿۲﴾", "english": " Those who disbelieve and hinder men from the way of Allah — He renders their works vain.", "french": " Ceux qui refusent de croire et empêchent les gens de suivre la voie d’Allāh – Il rend vaines leurs œuvres.", "german": " Diejenigen, die ungläubig sind und abwendig machen vom Wege Allahs – deren Werke macht Er zunichte.", "spanish": " A los que no creen y apartan a los hombres del camino de Al-lah: Él hará que sus trabajos sean vanos.", "urdu": " وہ لوگ جنہوں نے کفر کیا اور اللہ کے راستے سے روکا‘ اللہ نے ان کے اعمال کو تباہ کر دیا۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ اٰمَنُوۡا بِمَا نُزِّلَ عَلٰی مُحَمَّدٍ وَّ ہُوَ الۡحَقُّ مِنۡ رَّبِّہِمۡ ۙ کَفَّرَ عَنۡہُمۡ سَیِّاٰتِہِمۡ وَ اَصۡلَحَ بَالَہُمۡ ﴿۳﴾", "english": " But as for those who believe and do good works and believe in that which has been revealed to Muhammad — and it is the truth from their Lord — He removes from them their sins and improves their condition.", "french": " Mais quant à ceux qui croient, et font de bonnes œuvres, et croient à ce qui a été révélé à Mohammad – et c’est la vérité provenant de leur Seigneur – Il leur enlèvera leurs méfaits, et réformera leur conduite.", "german": " Die aber gläubig sind und gute Werke tun und an das glauben, was auf Muhammad herabgesandt ward – und es ist die Wahrheit von ihrem Herrn –, denen nimmt Er ihre Sünden hinweg und bessert ihren Stand.", "spanish": " Mas a quienes crean y hagan buenas obras y crean en lo que ha sido revelado a Mohammad -que es la verdad de su Señor– Él les eliminará sus pecados y reformará su conducta.", "urdu": " اور جو ایمان لائے اور انہوں نے ایمان کے مطابق عمل کیے اور جو محمد (رسول اللہ صلی اللہ علیہ وسلم) پر نازل ہوا‘ اس پر ایمان لائے اور وہی ان کے رب کی طرف سے حق ہے۔ اللہ ان کی بدیوں کو ڈھانپ دے گا اور ان کے حالات کو درست کر دے گا۔"}, {"arabic": " ذٰلِکَ بِاَنَّ الَّذِیۡنَ کَفَرُوا اتَّبَعُوا الۡبَاطِلَ وَ اَنَّ الَّذِیۡنَ اٰمَنُوا اتَّبَعُوا الۡحَقَّ مِنۡ رَّبِّہِمۡ ؕ کَذٰلِکَ یَضۡرِبُ اللّٰہُ لِلنَّاسِ اَمۡثَالَہُمۡ ﴿۴﴾", "english": " That is because those who disbelieve follow falsehood while those who believe follow the truth from their Lord. Thus does Allah set forth for men their similitudes.", "french": " Cela est parce que ceux qui refusent de croire suivent le mensonge, tandis que ceux qui croient suivent la vérité émanant de leur Seigneur. C’est ainsi qu’Allāh explique leurs états aux hommes à travers des similitudes.", "german": " Dies, weil jene, die ungläubig sind, dem Falschen folgen; die aber gläubig sind, folgen der Wahrheit von ihrem Herrn. Also beschreibt Allah den Menschen ihren Zustand.", "spanish": " Esto es porque los incrédulos siguen la falsedad, mientras que los creyentes siguen la verdad de su Señor. Así Al-lah propone a los hombres sus ejemplos.", "urdu": " یہ اس لئے کیا گیا کہ جنہوں نے کفر کیا تھا انہوں نے جھوٹ کی پیروی کی تھی۔ اور جو ایمان لائے تھے وہ اپنے رب کی طرف سے آنے والے حق کے پیچھے چلے تھے اللہ اسی طرح لوگوں کے سامنے ان کا (اصل) حال بیان کرتا ہے۔"}, {"arabic": " فَاِذَا لَقِیۡتُمُ الَّذِیۡنَ کَفَرُوۡا فَضَرۡبَ الرِّقَابِ ؕ حَتّٰۤی اِذَاۤ اَثۡخَنۡتُمُوۡہُمۡ فَشُدُّوا الۡوَثَاقَ ٭ۙ فَاِمَّا مَنًّۢا بَعۡدُ وَ اِمَّا فِدَآءً حَتّٰی تَضَعَ الۡحَرۡبُ اَوۡزَارَہَا ۬ۚ۟ۛ ذٰؔلِکَ ؕۛ وَ لَوۡ یَشَآءُ اللّٰہُ لَانۡتَصَرَ مِنۡہُمۡ وَ لٰکِنۡ لِّیَبۡلُوَا۠ بَعۡضَکُمۡ بِبَعۡضٍ ؕ وَ الَّذِیۡنَ قُتِلُوۡا فِیۡ سَبِیۡلِ اللّٰہِ فَلَنۡ یُّضِلَّ اَعۡمَالَہُمۡ ﴿۵﴾", "english": " And when you meet in regular battle those who disbelieve, smite their necks; and, when you have overcome them, bind fast the fetters — then afterwards either release them as a favour or by taking ransom — until the war lays down its burdens. That is the ordinance . And if Allah had so pleased, He could have punished them Himself , but He has willed that He may try some of you by others. And those who are killed in the way of Allah — He will never render their works vain.", "french": " Et lorsque vous rencontrez les mécréants en bataille régulière , frappez- les au cou ; et lorsque vous les aurez vaincus, serrez bien les liens. Ensuite plus tard, relâchez-les soit comme une faveur soit contre une rançon – jusqu’à ce que la guerre dépose ses fardeaux. C’est cela l’ordonnance . Et si Allāh l’avait voulu, Il aurait pu les châtier Lui-Même, mais Il éprouve certains d’entre vous par le moyen des autres. Et quant à ceux qui sont tués dans la voie d’Allāh – Il ne rendra jamais vaines leurs œuvres.", "german": " Wenn ihr (in der Schlacht) auf die stoßet, die ungläubig sind, trefft (ihre) Nacken; und wenn ihr sie so überwältigt habt, dann schnüret die Bande fest. Hernach dann entweder Gnade oder Lösegeld, bis der Krieg seine Waffen niederlegt. Das ist so. Und hätte Allah es gewollt, Er hätte sie Selbst strafen können, aber Er wollte die einen von euch durch die anderen prüfen. Und diejenigen, die auf Allahs Weg getötet werden – nie wird Er ihre Werke zunichte machen.", "spanish": " Cuando os enfrentéis en una batalla regular contra los incrédulos, golpeadles en el cuello y, una vez que los hayáis vencido, tad fuertemente a los vencidos –más tarde, liberadlos como gracia o recibiendo un rescate– hasta que la guerra haya depuesto sus cargas. Eso es lo ordenado. Mas si así lo hubiese decidido Al-lah, Él mismo les abría exigido la retribución, pero Él somete a algunos de vosotros a prueba a manos de otros. Y quienes mueren por la causa de Al-lah sepan que Él no permitirá que sus obras queden en vano.", "urdu": " پس (چاہیئے کہ) جب تم کافروں سے میدان جنگ میں ملو‘ تو گردنیں کاٹو۔ یہاں تک کہ جب تم ان کا خون بہالو‘ تو خوب زور سے مشکیں کسو۔ پھر اس کے بعد یا تو احسان کرکے (ان کو چھوڑ دو) یا تاوان جنگ لے کر (چھوڑ دو) یہاں تک کہ لڑائی اپنے ہتھیار رکھ دے (یعنی ختم ہو جائے) یہ سب کچھ حالات کے ماتحت ہوا ہے۔ اور اگر اللہ چاہتا تو خود ہی ان سے بدلہ لے لیتا۔ لیکن اس نے چاہا کہ تم میں سے بعض کو بعض کے ذریعہ سے آزمائے جو لوگ اللہ کے راستہ میں مارے گئے۔ اللہ ان کے اعمال کو کبھی ضائع نہیں کرے گا۔"}, {"arabic": " سَیَہۡدِیۡہِمۡ وَ یُصۡلِحُ بَالَہُمۡ ۚ﴿۶﴾", "english": " He will guide them and improve their condition,", "french": " Il les guidera, et réformera leur conduite.", "german": " Er wird ihnen zum Sieg verhelfen und ihren Stand bessern", "spanish": " Él los guiará y reformará su conducta.", "urdu": " وہ ان کو ضرور کامیابی کی طرف لے جائے گا اور ان کی حالت کو درست کرے گا۔"}, {"arabic": " وَ یُدۡخِلُہُمُ الۡجَنَّۃَ عَرَّفَہَا لَہُمۡ ﴿۷﴾", "english": " And admit them into the Garden which He has made known to them.", "french": " Et Il les admettra dans le Jardin qu’Il a embelli et a rendu distingué pour eux.", "german": " und sie ins Paradies führen, das Er ihnen zu wissen getan hat.", "spanish": " Y los admitirá en el Jardín que Él ha embellecido y distinguido para ellos.", "urdu": " اور ان کو ان جنتوں میں داخل کرے گا جو اس نے ان کو پہلے سے بتا چھوڑی ہیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنۡ تَنۡصُرُوا اللّٰہَ یَنۡصُرۡکُمۡ وَ یُثَبِّتۡ اَقۡدَامَکُمۡ ﴿۸﴾", "english": " O ye who believe! if you help the cause of Allah, He will help you and will make your steps firm.", "french": " Ô vous qui croyez ! Si vous aidez la cause d’ Allāh, Il vous aidera, et affermira vos pas.", "german": " O die ihr glaubt, wenn ihr Allahs (Sache) helft; so wird Er euch helfen und euch fest Fuß fassen lassen.", "spanish": " ¡Oh vosotros, los creyentes! Si ayudáis a la causa de Al-lah, Él os ayudará y hará firmes vuestros pasos.", "urdu": " اے مومنو! اگر تم اللہ کی مدد کرو گے تو وہ تمہاری مدد کرے گا اور تمہارے قدموں کو مضبوط کرے گا۔"}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡا فَتَعۡسًا لَّہُمۡ وَ اَضَلَّ اَعۡمَالَہُمۡ ﴿۹﴾", "english": " But as for those who disbelieve, perdition is their lot ; and He will make their works vain.", "french": " Mais quant à ceux qui refusent de croire, pour eux c’est la ruine, et Il rendra vaines leurs œuvres.", "german": " Die aber ungläubig sind – wehe ihnen! Er wird ihre Werke zunichte machen.", "spanish": " Mas en cuanto a los incrédulos, su destino es la perdición; Él hará que sus trabajos sean inútiles.", "urdu": " اور جنہوں نے کفر کیا ہے ان پر افسوس ہے اور خدا ان کے اعمال کو ضائع کر دے گا۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمۡ کَرِہُوۡا مَاۤ اَنۡزَلَ اللّٰہُ فَاَحۡبَطَ اَعۡمَالَہُمۡ ﴿۱۰﴾", "english": " That is because they hate what Allah has revealed; so He has made their works futile.", "french": " C’est parce qu’ils détestent ce qu’Allāh a révélé ; ainsi a-t-Il rendu vaines leurs œuvres.", "german": " Dies, weil sie hassen, was Allah herniedergesandt hat; so machte Er ihre Werke fruchtlos.", "spanish": " Esto es porque odian lo que Al-lah ha revelado; por ello Él ha hecho que sus trabajos sean vanos.", "urdu": " کیونکہ انہوں نے اللہ کے اتارے ہوئے (کلام) کو ناپسند کیا ہے سو خدا نے بھی ان کے اعمال کو ضائع کر دیا۔"}, {"arabic": " اَفَلَمۡ یَسِیۡرُوۡا فِی الۡاَرۡضِ فَیَنۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ دَمَّرَ اللّٰہُ عَلَیۡہِمۡ ۫ وَ لِلۡکٰفِرِیۡنَ اَمۡثَالُہَا ﴿۱۱﴾", "english": " Have they not travelled in the earth and seen what was the end of those who were before them? Allah utterly destroyed them, and for the disbelievers there will be the like thereof.", "french": " N’ont-ils pas parcouru la terre et vu quelle a été la fin de leurs devanciers ? Allāh les a complètement anéantis, et il en sera de même pour les mécréants.", "german": " Sind sie nicht auf der Erde umhergereist, um zu sehen, wie das Ende derer war, die vor ihnen waren? Allah richtete sie zugrunde, und für die Ungläubigen ist das gleiche wie ihnen bestimmt.", "spanish": " ¿Acaso no han viajado por la tierra y han visto cuál fue el fin de os que existieron antes que ellos? Al-lah los destruyó totalmente , y a los incrédulos les ocurrirá algo similar.", "urdu": " کیا وہ زمین میں نہیں پھرے کہ دیکھتے کہ جو ان سے پہلے گذر چکے ہیں ان کا انجام کیا ہوا۔ اللہ نے ان پر عذاب نازل کیا تھا اور (آج کل کے) کافروں کا بھی انہی جیسا حال ہوگا۔"}, {"arabic": " ذٰلِکَ بِاَنَّ اللّٰہَ مَوۡلَی الَّذِیۡنَ اٰمَنُوۡا وَ اَنَّ الۡکٰفِرِیۡنَ لَا مَوۡلٰی لَہُمۡ ﴿٪۱۲﴾", "english": " That is because Allah is the Protector of those who believe, and as for the disbelievers, there is no protector for them.", "french": " Ceci est parce qu’Allāh est le Protecteur de ceux qui croient, et quant aux mécréants, il n’y a pour eux aucun protecteur.", "german": " Das ist, weil Allah der Beschützer derer ist, die glauben; die Ungläubigen aber haben keinen Beschützer.", "spanish": " Esto es porque Al-lah es el Protector de los creyentes y, en cuanto a los incrédulos, para ellos no hay protector.", "urdu": " یہ (اس لئے ہوگا) کہ اللہ مومنوں کا مددگار ہے۔ اور کافروں کا کوئی مددگار نہیں۔"}, {"arabic": " اِنَّ اللّٰہَ یُدۡخِلُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ؕ وَ الَّذِیۡنَ کَفَرُوۡا یَتَمَتَّعُوۡنَ وَ یَاۡکُلُوۡنَ کَمَا تَاۡکُلُ الۡاَنۡعَامُ وَ النَّارُ مَثۡوًی لَّہُمۡ ﴿۱۳﴾", "english": " Verily, Allah will make those who believe and do good works enter the Gardens underneath which rivers flow; while those who disbelieve enjoy themselves and eat even as the cattle eat, and the Fire will be their resort.", "french": " En vérité, Allāh admettra ceux qui croient et font de bonnes œuvres, dans des Jardins sous lesquels coulent des rivières ; tandis que ceux qui refusent de croire jouissent des bénéfices temporaires, et mangent comme mangent les bestiaux, et leur lieu de séjour sera le Feu.", "german": " Allah wird jene, die glauben und gute Werke tun, in Gärten führen, die Ströme durchfließen; die aber ungläubig sind, die genießen und fressen wie das Vieh, und das Feuer wird ihre Wohnstatt sein.", "spanish": " En verdad, Al-lah hará que los que creen y practican el bien entren en los Jardines bajo los cuales fluyen los ríos; mientras que los incrédulos disfrutan y comen, como come el ganado, mas el Fuego será su morada.", "urdu": " اللہ مومنوں اور ایمان کے مطابق عمل کرنے والوں کو ایسے باغات میں داخل کرے گا جن کے نیچے نہریں بہ رہی ہوں گی اور جنہوں نے کفر کیا ہے وہ کچھ دنیوی فائدہ اٹھائیں گے اور اس طرح کھائیں پئیں گے جس طرح چارپائے کھاتے پیتے ہیں۔ اور دوزخ ان کا ٹھکانا ہوگا۔"}, {"arabic": " وَ کَاَیِّنۡ مِّنۡ قَرۡیَۃٍ ہِیَ اَشَدُّ قُوَّۃً مِّنۡ قَرۡیَتِکَ الَّتِیۡۤ اَخۡرَجَتۡکَ ۚ اَہۡلَکۡنٰہُمۡ فَلَا نَاصِرَ لَہُمۡ ﴿۱۴﴾", "english": " And how many a township, more powerful than thy town which has driven thee out, have We destroyed, and they had no helper!", "french": " Et que de villes, plus puissantes que ta ville qui t’a expulsé, n’avons-Nous détruites, et quant aux habitants , ils n’eurent aucun aide !", "german": " Und wie so manche Stadt, mächtiger als deine Stadt, die dich austrieb, haben Wir schon zerstört; und sie hatten keinen Helfer!", "spanish": " ¡Cuántas ciudades más poderosas que tu ciudad, que te expulsó, hemos destruido, y no tuvieron quien les ayudara!", "urdu": " اور بہت سے بستیاں ایسی تھیں جو تیری اس بستی سے جس نے تجھ کو نکال دیا زیادہ طاقتور تھیں (پھر بھی) ہم نے (ان کی طاقت کے باوجود) ان کو ہلاک کر دیا اور کوئی ان کا مددگار نہ بن سکا۔"}, {"arabic": " اَفَمَنۡ کَانَ عَلٰی بَیِّنَۃٍ مِّنۡ رَّبِّہٖ کَمَنۡ زُیِّنَ لَہٗ سُوۡٓءُ عَمَلِہٖ وَ اتَّبَعُوۡۤا اَہۡوَآءَہُمۡ ﴿۱۵﴾", "english": " Is he then who stands upon a clear proof from his Lord like those to whom the evil of their deeds is made to look beautiful and who follow their evil inclinations?", "french": " Celui-là donc qui s’appuie sur une preuve manifeste de la part de son Seigneur, est-il pareil à ceux à qui l’iniquité de leurs œuvres est embellie, et qui suivent leurs mauvais penchants ?", "german": " Sollte denn der, der sich auf einen klaren Beweis von seinem Herrn stützt, gleich denen sein, denen das Übel ihres Tuns schön gemacht wurde und die ihren bösen Gelüsten folgen?", "spanish": " ¿Acaso quien se apoya en una prueba evidente de su Señor es como aquellos a los que se hace que aparezca bella la maldad de sus acciones y siguen sus perversas inclinaciones?", "urdu": " کیا وہ جو اپنے رب کی طرف سے ایک (مضبوط) دلیل پر قائم ہوتا ہے ان کی طرح ہو سکتا ہے جن کے برے اعمال انہیں خوبصورت کرکے دکھائے گئے ہوں اور جو اپنی خواہشوں کے پیچھے چلتے ہوں۔"}, {"arabic": " مَثَلُ الۡجَنَّۃِ الَّتِیۡ وُعِدَ الۡمُتَّقُوۡنَ ؕ فِیۡہَاۤ اَنۡہٰرٌ مِّنۡ مَّآءٍ غَیۡرِ اٰسِنٍ ۚ وَ اَنۡہٰرٌ مِّنۡ لَّبَنٍ لَّمۡ یَتَغَیَّرۡ طَعۡمُہٗ ۚ وَ اَنۡہٰرٌ مِّنۡ خَمۡرٍ لَّذَّۃٍ لِّلشّٰرِبِیۡنَ ۬ۚ وَ اَنۡہٰرٌ مِّنۡ عَسَلٍ مُّصَفًّی ؕ وَ لَہُمۡ فِیۡہَا مِنۡ کُلِّ الثَّمَرٰتِ وَ مَغۡفِرَۃٌ مِّنۡ رَّبِّہِمۡ ؕ کَمَنۡ ہُوَ خَالِدٌ فِی النَّارِ وَ سُقُوۡا مَآءً حَمِیۡمًا فَقَطَّعَ اَمۡعَآءَہُمۡ ﴿۱۶﴾", "english": " A description of the Garden promised to the righteous: therein are rivers of water which corrupts not; and rivers of milk of which the taste changes not; and rivers of wine, a delight to those who drink, and rivers of clarified honey. And in it will they have all kinds of fruit, and forgiveness from their Lord. Can those who enjoy such bliss be like those who abide in the Fire and who are given boiling water to drink so that it tears their bowels?", "french": " Voici une description du Jardin qui a été promis aux pieux : il s’y trouve des rivières d’eau qui ne se corrompt point ; et des rivières de lait dont le goût ne change point ; et des rivières de vin, un délice pour ceux qui boivent, et des rivières de miel clarifié. Et ils y auront des fruits de toutes espèces, ainsi qu’un pardon de leur Seigneur. Ceux qui jouissent d’une telle félicité peuvent-ils être pareils à ceux qui séjournent dans le Feu, et à qui l’on donne de l’eau bouillante à boire, de sorte qu’elle déchire leurs entrailles ?", "german": " Ein Gleichnis von dem Paradiese, den Rechtschaffenen verheißen: Darin sind Ströme von Wasser, das nicht verdirbt, und Ströme von Milch, deren Geschmack sich nicht ändert, und Ströme von Wein, köstlich für die Trinkenden, und Ströme geläuterten Honigs. Und darin werden sie Früchte aller Art haben und Vergebung von ihrem Herrn. Können sie wohl denen gleich sein, die im Feuer weilen und denen siedendes Wasser zu trinken gegeben wird, das ihre Eingeweide zerreißt?", "spanish": " He aquí una descripción del Jardín prometido a los justos: en él hay ríos de agua que no se corrompe; ríos de leche cuyo sabor no cambia; ríos de vino, una delicia para quienes lo beben, y ríos de miel clara. En él tendrán toda clase de frutas y el perdón de su Señor. ¿Acaso quienes disfrutan esta felicidad son iguales que quienes moran en el Fuego, a quienes se da agua hirviendo para beber, que deshace sus entrañas?", "urdu": " متقیوں سے جن جنتوں کا وعدہ کیا گیا ہے ان میں ایسے پانی کی نہریں ہونگی جس میں سڑنے کا مادہ نہیں ہوگا اور ایسی نہریں ہونگی جن میں ایسا دودھ چلتا ہوگا جس کا مزا کبھی نہیں بدلے گا (یعنی وہ بھی نہیں سڑے گا) اور ایسی شراب کی نہریں ہونگی جو پینے والوں کو مزے دار لگیں گی اور پاک و صاف شہد کی نہریں بھی ہونگی اور ان کو ان جنتوں میں ہر قسم کے پھل بھی ملیں گے اور اپنے رب کی طرف سے مغفرت بھی ملے گی (کیا یہ جنتی) ان لوگوں کی طرح ہو سکتے ہیں جو کہ دیر تک آگ میں رہنے کے مستحق قرار دیئے گئے ہیں اور جن کو ایسا گرم پانی پلایا جائے گا جو ان کی انتڑیوں کو کاٹ دے گا۔"}, {"arabic": " وَ مِنۡہُمۡ مَّنۡ یَّسۡتَمِعُ اِلَیۡکَ ۚ حَتّٰۤی اِذَا خَرَجُوۡا مِنۡ عِنۡدِکَ قَالُوۡا لِلَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ مَاذَا قَالَ اٰنِفًا ۟ اُولٰٓئِکَ الَّذِیۡنَ طَبَعَ اللّٰہُ عَلٰی قُلُوۡبِہِمۡ وَ اتَّبَعُوۡۤا اَہۡوَآءَہُمۡ ﴿۱۷﴾", "english": " And among them are some who listen to thee till, when they go forth from thy presence, they say to those who have been given knowledge, ‘What has he been talking about just now?’ These are they whose hearts Allah has sealed, and who follow their own evil inclinations.", "french": " Et parmi eux il y en a qui t’écoutent jusqu’à ce que, quand ils quittent ta présence, ils disent à ceux à qui le savoir a été accordé : « Qu’est-ce qu’il racontait à l’instant ? » Ce sont ceux-là dont Allāh a scellé le cœur, et qui suivent leurs mauvais penchants.", "german": " Und unter ihnen sind einige, die auf dich hören, doch wenn sie von dir fortgehen, sagen sie jenen, denen das Wissen gegeben ward: \"Was hat er da soeben gesagt?\" Diese sind es, deren Herzen Allah versiegelt hat und die ihren bösen Gelüsten folgen.", "spanish": " Entre ellos hay algunos que te escuchan hasta que, cuando se van de tu presencia, dicen a quienes se ha dado conocimiento: “¿De qué ha estado hablando precisamente ahora?”. Son ellos cuyos corazones ha sellado Al-lah y que siguen sus propias inclinaciones malvadas.", "urdu": " اور ان میں سے بعض ایسے ہیں جو بظاہر تیری طرف کان رکھتے ہیں مگر جب وہ تیرے پاس سے اٹھ کر چلے جاتے ہیں تو ان لوگوں سے جن کو علم دیا گیا ہے کہتے ہیں۔ اس (رسول) نے ابھی کیا کہا تھا۔ وہ لوگ ایسے ہیں جن کے دلوں پر اللہ نے مہر کر دی اور وہ اپنی خواہشات کے پیچھے چل پڑے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ اہۡتَدَوۡا زَادَہُمۡ ہُدًی وَّ اٰتٰہُمۡ تَقۡوٰٮہُمۡ ﴿۱۸﴾", "english": " But as for those who follow guidance, He adds to their guidance, and bestows on them their righteousness.", "french": " Mais quant à ceux qui suivent la bonne voie, Il les y fait progresser, et leur accorde leur droiture.", "german": " Denen aber, die rechtgeleitet sind, mehrt Er die Führung und verleiht ihnen Rechtschaffenheit.", "spanish": " Mas quienes siguen la guía, Él aumenta su guía y les concede piedad.", "urdu": " اور وہ لوگ جو کہ ہدایت پاتے ہیں‘ اللہ ان کو ہدایت میں زیادہ کرتا جاتا ہے اور ان کو ان کے مناسب حال تقویٰ بخشتا ہے۔"}, {"arabic": " فَہَلۡ یَنۡظُرُوۡنَ اِلَّا السَّاعَۃَ اَنۡ تَاۡتِیَہُمۡ بَغۡتَۃً ۚ فَقَدۡ جَآءَ اَشۡرَاطُہَا ۚ فَاَنّٰی لَہُمۡ اِذَا جَآءَتۡہُمۡ ذِکۡرٰٮہُمۡ ﴿۱۹﴾", "english": " They wait not but for the Hour, that it should come upon them suddenly. The signs thereof have already come. But of what avail will their admonition be to them when it has actually come upon them?", "french": " Ils n’attendent que l’Heure, qu’elle leur survienne subitement. Les signes en sont déjà arrivés. Mais à quoi leur servira le rappel lorsqu’elle leur sera survenue ?", "german": " Sie warten nur auf die \"Stunde\", dass sie plötzlich über sie komme. Die Zeichen dafür sind schon eingetroffen. Doch was wird ihr Erinnern ihnen nützen, wenn sie über sie gekommen ist?", "spanish": " No esperan sino la Hora, que debe llegarles de improviso. Sus Signos ya han aparecido. Mas ¿de qué les servirá su advertencia si les ha llegado realmente?", "urdu": " پس وہ صرف آخری فیصلہ کی گھڑی کا انتظار کر رہے ہیں کہ وہ ان کے پاس اچانک آجائے۔ سو اس کی علامتیں تو ظاہر ہو چکی ہیں اور جب اس کی اصل حقیقت ان کے پاس آپہنچے گی تو (بتائیں کہ) اس وقت ان کو کیا چیز نفع دے گی؟"}, {"arabic": " فَاعۡلَمۡ اَنَّہٗ لَاۤ اِلٰہَ اِلَّا اللّٰہُ وَ اسۡتَغۡفِرۡ لِذَنۡۢبِکَ وَ لِلۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ ؕ وَ اللّٰہُ یَعۡلَمُ مُتَقَلَّبَکُمۡ وَ مَثۡوٰٮکُمۡ ﴿٪۲۰﴾", "english": " Know, therefore, that there is no God other than Allah, and ask forgiveness for thy frailties, and for believing men and believing women. And Allah knows the place where you move about and the place where you stay.", "french": " Sache donc, qu’il n’y a de dieu qu’Allāh, et demande pardon pour tes manquements qui en somme ne sont pas délibérés , et demande pardon pour les croyants et les croyantes. Et Allāh connaît vos allées et venues et votre lieu de repos.", "german": " Wisse drum, dass es keinen Gott gibt außer Allah, und bitte um Vergebung für deine Fehler und für die gläubigen Männer und die gläubigen Frauen. Allah kennt die Stätte eures Aus- und Eingehens und die Stätte eurer Rast.", "spanish": " Sabe, pues, que no hay Dios distinto de Al-lah. Pide perdón por tus faltas y por los hombres y mujeres creyentes. Pues Al-lah sabe el lugar por el que os movéis y el lugar en el que estáis.", "urdu": " اور جان لے کہ اللہ کے سوائے کوئی معبود نہیں اور تیرے حق میں جو (تیری منکر قوم نے) گناہ کیے ہیں ان کے لئے خدا سے معافی مانگتا رہ اور مومن مردوں اور مومن عورتوں کے بارے میں بھی معافی مانگتا رہ کہ اللہ ان کی کوتاہیوں کو معاف کر دے اور اللہ تمہارے ادھر ادھر پھرنے اور کسی جگہ ٹھہرنے کو خوب جانتا ہے۔"}, {"arabic": " وَ یَقُوۡلُ الَّذِیۡنَ اٰمَنُوۡا لَوۡ لَا نُزِّلَتۡ سُوۡرَۃٌ ۚ فَاِذَاۤ اُنۡزِلَتۡ سُوۡرَۃٌ مُّحۡکَمَۃٌ وَّ ذُکِرَ فِیۡہَا الۡقِتَالُ ۙ رَاَیۡتَ الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ یَّنۡظُرُوۡنَ اِلَیۡکَ نَظَرَ الۡمَغۡشِیِّ عَلَیۡہِ مِنَ الۡمَوۡتِ ؕ فَاَوۡلٰی لَہُمۡ ﴿ۚ۲۱﴾", "english": " And those who believe say, ‘Why is not a Surah revealed?’ But when a decisive Surah is revealed and fighting is mentioned therein, thou seest those in whose hearts is a disease looking towards thee with the look of one who is fainting on account of approaching death. So ruin seize them!", "french": " Et ceux qui croient disent : « Pourquoi une sourate n’est-elle pas révélée ? » Mais lorsqu’une sourate décisive est révélée, et que le combat y est mentionné, tu vois ceux dont le cœur est atteint d’une maladie te regarder avec le regard de celui qui s’évanouit à l'approche de la mort. Que la destruction les saisisse donc !", "german": " Und die da glauben, sprechen: \"Warum wird keine Sura herabgesandt?\" Doch wenn eine entscheidende Sura herabgesandt wird und es ist darin von Kampf die Rede, dann siehst du die, in deren Herzen Krankheit ist, dich anschauen mit dem Blicke eines, der ob des Todes von Ohnmacht befallen wird. Verderben denn auf sie!", "spanish": " Los creyentes dicen: “¿Por qué no se revela un Surah?”. Mas cuando se revela un Surah decisivo, y en él se menciona la lucha, verás a los de corazón enfermo mirarte con la mirada de quien está aturdido ante la sombra de la muerte . ¡La ruina caerá sobre ellos!", "urdu": " اور مومن کہتے ہیں کہ کیوں (اس پر) کوئی ایسی سورۃ نازل نہیں ہوئی (جس میں جنگ کا حکم ہو) پس جب کوئی ایسی پختہ (احکام والی) سورۃ نازل ہوتی ہے اور اس میں لڑائی کا ذکر ہوتا تو تو ان لوگوں کو جن کے دلوں میں بیماری ہے دیکھتا ہے کہ وہ تیری طرف ایسے آدمی کی طرح دیکھتے ہیں جس پر موت کی غشی طاری ہو۔ پس ان کے لئے (خدا کی طرف سے) ہلاکت مقدر ہے۔"}, {"arabic": " طَاعَۃٌ وَّ قَوۡلٌ مَّعۡرُوۡفٌ ۟ فَاِذَا عَزَمَ الۡاَمۡرُ ۟ فَلَوۡ صَدَقُوا اللّٰہَ لَکَانَ خَیۡرًا لَّہُمۡ ﴿ۚ۲۲﴾", "english": " Obedience and a kind word is better for them . And when the matter is determined upon, it is good for them if they were true to Allah.", "french": " L’ obéissance et une parole convenable auraient été meilleures pour eux . Et quand l’affaire est décidée, il vaudrait mieux pour eux qu’ils soient fidèles à Allāh.", "german": " Gehorsam und ein gutes Wort (wäre besser für sie). Und wenn die Sache beschlossen ist, dann wäre es für sie am besten, sie würden Allah treu bleiben.", "spanish": " Para ellos lo mejor es la obediencia y una palabra amable. Mas cuando se decida el asunto, lo mejor para ellos es que hayan sido veraces con Al-lah.", "urdu": " (ان کا اصل طریق یہ ہونا چاہیئے تھا کہ وہ کہتے کہ ہمیں کسی جلد بازی کی ضرورت نہیں) ہمارا کام تو اطاعت کرنا اور (لوگوں کو) نیک باتیں سنانا ہے پھر جب بات پختہ ہو جاتی (یعنی لڑائی چھڑ جاتی) تو اگر وہ اللہ کے حضور سچے بنتے (یعنی جو اطاعت کا وعدہ کیا تھا اسے پورا کر دیتے) تو یہ ان کے لئے بہتر ہوتا۔"}, {"arabic": " فَہَلۡ عَسَیۡتُمۡ اِنۡ تَوَلَّیۡتُمۡ اَنۡ تُفۡسِدُوۡا فِی الۡاَرۡضِ وَ تُقَطِّعُوۡۤا اَرۡحَامَکُمۡ ﴿۲۳﴾", "english": " Would you then, if you are placed in authority, create disorder in the land and sever your ties of kinship?", "french": " Voudriez-vous donc, si l’autorité vous était accordée, créer du désordre sur la terre, et rompre vos liens de parenté ?", "german": " Wolltet ihr denn, indem ihr euch (vom Kampf) abwendet, Verderben im Land haben und die Verwandtschaftsbande zerschneiden?", "spanish": " ¿Si ocuparais, pues, un puesto de autoridad, crearíais el desorden en el país y romperíais vuestros lazos de parentesco?", "urdu": " پس کیا یہ امر قریب نہیں کہ اگر تم پیٹھ پھیر لو تو (پھر بھی) زمین میں فساد کرنے کا موجب ہو جاٶ۔ اور رشتوں کو کاٹ دو۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ لَعَنَہُمُ اللّٰہُ فَاَصَمَّہُمۡ وَ اَعۡمٰۤی اَبۡصَارَہُمۡ ﴿۲۴﴾", "english": " It is these whom Allah curses so that He makes them deaf and makes their eyes blind.", "french": " Ce sont ceux-là qu’Allāh a maudits, a rendus sourds, et a rendu leurs yeux aveugles.", "german": " Diese sind es, die Allah verflucht, so dass Er sie taub macht und ihre Blicke blendet.", "spanish": " A éstos es a quienes Al-lah maldice, haciéndoles sordos y cegando sus ojos.", "urdu": " یہی وہ لوگ ہیں جن پر اللہ نے لعنت کی ہے اور ان کو بہرہ کر دیا ہے‘ اور ان کی آنکھوں کی بینائی ضائع کر دی ہے۔"}, {"arabic": " اَفَلَا یَتَدَبَّرُوۡنَ الۡقُرۡاٰنَ اَمۡ عَلٰی قُلُوۡبٍ اَقۡفَالُہَا ﴿۲۵﴾", "english": " Will they not, then, ponder over the Qur’an, or is it that on the hearts are their locks?", "french": " Ne veulent-ils donc pas réfléchir sur le Coran, ou est-ce que leur cœur est verrouillé de l'interieur ?", "german": " Wollen sie also nicht über den Qur-ân nachdenken, oder ist´s, dass die Herzen unter ihren Schlössern sind?", "spanish": " ¿No meditarán, pues, en el Corán, o es que ellos mismos han cerrado sus corazones por dentro?", "urdu": " کیا وہ قرآن پر غور نہیں کرتے‘ کیا ان کے دلوں پر ایسے قفل ہیں جو ان کے دلوں ہی کی پیداوار ہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ ارۡتَدُّوۡا عَلٰۤی اَدۡبَارِہِمۡ مِّنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُمُ الۡہُدَی ۙ الشَّیۡطٰنُ سَوَّلَ لَہُمۡ ؕ وَ اَمۡلٰی لَہُمۡ ﴿۲۶﴾", "english": " Surely, those who turn their backs after guidance has become manifest to them, Satan has seduced them, and holds out to them false hopes.", "french": " Assurément, ceux qui tournent le dos après que la direction leur soit devenue manifeste, Satan les a séduits, et leur a tendu de faux espoirs.", "german": " Jene, die den Rücken kehren, nachdem ihnen der Weg sichtbar ward, Satan hat sie getäuscht und ihnen falsche Hoffnungen eingegeben.", "spanish": " En verdad, quienes vuelven la espalda después de que se les ha manifestado la guía, es porque Satanás los ha seducido, y alienta en ellos falsas esperanzas.", "urdu": " وہ لوگ جو ہدایت ظاہر ہونے پر پھر گئے۔ شیطان نے ان کو ان کا عمل اچھا کرکے دکھایا ہے۔ اور ان کو (جھوٹی) امیدیں دلائی ہیں۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمۡ قَالُوۡا لِلَّذِیۡنَ کَرِہُوۡا مَا نَزَّلَ اللّٰہُ سَنُطِیۡعُکُمۡ فِیۡ بَعۡضِ الۡاَمۡرِ ۚۖ وَ اللّٰہُ یَعۡلَمُ اِسۡرَارَہُمۡ ﴿۲۷﴾", "english": " That is because they said to those who hate what Allah has revealed, ‘We will obey you in some matters;’ and Allah knows their secrets.", "french": " C’est parce qu’ils ont dit à ceux qui détestent ce qu’Allāh a révélé : « Nous vous obéissons dans certaines choses. » Et Allāh connaît leurs secrets.", "german": " Dies, weil sie zu denen, die das hassen, was Allah herniedersandte, sprachen: \"Wir wollen euch in einigen Sachen folgen.\" Und Allah kennt ihre Heimlichkeiten.", "spanish": " Esto es porque dijeron a quienes odian lo que ha revelado Al-lah: “Os obedeceremos en algunos asuntos”, mas Al-lah conoce sus secretos.", "urdu": " یہ اس لئے (ہوا) ہے کہ وہ ان لوگوں کو جو خدائی تعلیم کو ناپسندیدگی کی نگاہ سے دیکھ رہے ہیں کہہ رہے ہیں کہ ہم تمہاری بعض باتوں میں اطاعت کریں گے اور اللہ ان کی راز داری کو جانتا ہے۔"}, {"arabic": " فَکَیۡفَ اِذَا تَوَفَّتۡہُمُ الۡمَلٰٓئِکَۃُ یَضۡرِبُوۡنَ وُجُوۡہَہُمۡ وَ اَدۡبَارَہُمۡ ﴿۲۸﴾", "english": " But how will they fare when the angels will cause them to die, smiting their faces and their backs?", "french": " Mais comment sera-t-il lorsque les anges les feront mourir, leur frappant le visage et le dos ?", "german": " Wie aber, wenn die Engel ihre Seelen dahinnehmen im Tode und sie aufs Gesicht und den Rücken schlagen?", "spanish": " Pero ¿qué harán cuando los ángeles les hagan morir, golpeándoles en sus rostros y espaldas?", "urdu": " سو اس وقت کیا حال ہوگا۔ جب کہ فرشتے ان کی روح قبض کر رہے ہوں گے (اور) ان کے مونہوں اور ان کی پیٹھوں پر کوڑے لگا رہے ہوں گے۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمُ اتَّبَعُوۡا مَاۤ اَسۡخَطَ اللّٰہَ وَ کَرِہُوۡا رِضۡوَانَہٗ فَاَحۡبَطَ اَعۡمَالَہُمۡ ﴿٪۲۹﴾", "english": " This is because they followed that which displeased Allah, and hated that which pleased Him. So He rendered their works vain.", "french": " C’est parce qu’ils suivaient ce qui courrouçait Allāh, et qu’ils détestaient ce qui Lui était agréable. Il a donc rendu vaines leurs œuvres.", "german": " Dies, weil sie dem folgten, was Allah erzürnte und hassten, was Ihm wohlgefällig war. So machte Er ihre Werke zunichte.", "spanish": " Esto es por haber seguido lo que desagradaba a Al-lah y odiado lo que le agradaba. De este modo Él hizo inútiles sus trabajos.", "urdu": " یہ اس لئے ہوگا کہ جس بات کو اللہ نے ناپسند کیا وہ اس کے پیچھے چل پڑے اور خدا کی رضا (کی جستجو) کو ناپسند کیا سو خدا نے بھی ان کے اعمال ضائع کر دئیے۔"}, {"arabic": " اَمۡ حَسِبَ الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ اَنۡ لَّنۡ یُّخۡرِجَ اللّٰہُ اَضۡغَانَہُمۡ ﴿۳۰﴾", "english": " Do those in whose hearts is a disease suppose that Allah will not bring to light their malice?", "french": " Ceux dans le cœur de qui siège une maladie, s’imaginent-ils qu’Allāh ne fera pas apparaître leur haine ?", "german": " Wähnen etwa die, in deren Herzen Krankheit ist, Allah werde ihren geheimen Groll nicht ans Licht bringen?", "spanish": " ¿Suponen acaso los que tienen el corazón enfermo que Al-lah no sacará a la luz su malicia?", "urdu": " کیا وہ لوگ جن کے دلوں میں بیماری ہے سمجھتے ہیں کہ اللہ ان کے دلوں کے مخفی کینوں کو کبھی ظاہر نہیں کرے گا۔"}, {"arabic": " وَ لَوۡ نَشَآءُ لَاَرَیۡنٰکَہُمۡ فَلَعَرَفۡتَہُمۡ بِسِیۡمٰہُمۡ ؕ وَ لَتَعۡرِفَنَّہُمۡ فِیۡ لَحۡنِ الۡقَوۡلِ ؕ وَ اللّٰہُ یَعۡلَمُ اَعۡمَالَکُمۡ ﴿۳۱﴾", "english": " And if We pleased, We could show them to thee so that thou shouldst know them by their marks. And thou shalt surely recognize them by the tone of their speech. And Allah knows your deeds.", "french": " Et si Nous le voulions, Nous pourrions te les montrer, pour que tu les reconnaisses à leurs traits. Et tu les reconnaîtras assurément au ton de leur discours. Et Allāh connaît vos actions.", "german": " Und wenn Wir es wollten, Wir könnten sie dir zeigen, so dass du sie an ihren Merkmalen erkennen würdest. Und du sollst sie gewiss am Klang der Rede erkennen. Und Allah kennt euer Tun.", "spanish": " Mas si lo hubiésemos querido, te los habríamos mostrado para que los conocieras por sus señales. Ciertamente los reconocerás por el tono de sus palabras. Y Al-lah conoce vuestras acciones.", "urdu": " اور اگر ہم چاہیں تو ان کا وجود تجھ پر ظاہر کر دیں۔ اور تو ان کو ان کے چہروں سے پہچان لے اور (اب بھی) تو ان کو ان کے کلام کی ادا سے پہچان لیتا ہے‘ اور اللہ تمہارے اعمال کو جانتا ہے۔"}, {"arabic": " وَ لَنَبۡلُوَنَّکُمۡ حَتّٰی نَعۡلَمَ الۡمُجٰہِدِیۡنَ مِنۡکُمۡ وَ الصّٰبِرِیۡنَ ۙ وَ نَبۡلُوَا۠ اَخۡبَارَکُمۡ ﴿۳۲﴾", "english": " And We will surely try you until We distinguish those among you who strive for the cause of God and those who are steadfast. And We will make known the facts about you.", "french": " Et Nous vous éprouverons assurément jusqu’à ce que Nous distinguions ceux d’entre vous qui sont les véritables combattants pour la cause d’Allāh , et ceux qui sont endurants. Et par le moyen d’épreuves , Nous rendrons manifestes les faits exacts vous concernant.", "german": " Wir wollen euch sicherlich prüfen, bis Wir diejenigen unter euch ausscheiden, die (für die Sache Gottes) streiten und standhaft sind. Und Wir wollen die Tatsachen über euch bekannt machen.", "spanish": " Ciertamente os pondremos a prueba hasta que distingamos a los que se esfuerzan verdaderamente en la causa de Dios y a los que son perseverantes. Y mediante la prueba verificaremos vuestra auténtica valía.", "urdu": " اور ہم تمہاری آزمائش کریں گے‘ اس وقت تک کہ ہم تم میں سے خدا کی راہ میں جہاد کرنے والوں اور صبر کرنے والوں کو جان لیں۔ اور ہم تمہارے اندرونی حالات کی ضرور آزمائش کریں گے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ صَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ وَ شَآقُّوا الرَّسُوۡلَ مِنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُمُ الۡہُدٰی ۙ لَنۡ یَّضُرُّوا اللّٰہَ شَیۡئًا ؕ وَ سَیُحۡبِطُ اَعۡمَالَہُمۡ ﴿۳۳﴾", "english": " Those who disbelieve and hinder men from the way of Allah and oppose the Messenger after guidance has become manifest to them, shall not harm Allah in the least; and He will make their works fruitless.", "french": " Ceux qui refusent de croire, et empêchent les gens de suivre la voie d’Allāh, et qui s’opposent au Messager, après que la direction leur soit devenue manifeste, ne nuiront nullement à Allāh ; et Il rendra vaines leurs œuvres.", "german": " Jene, die ungläubig sind und die abwendig machen von Allahs Weg und sich dem Gesandten widersetzen, nachdem ihnen der Weg sichtbar geworden, sie werden Allah in nichts schaden; doch Er wird ihre Werke fruchtlos machen.", "spanish": " Los que no creen y apartan a los hombres del camino de Al-lah, oponiéndose al Mensajero después de que la guía se les ha hecho evidente, no perjudicarán a Al-lah en lo más mínimo y Él hará estériles sus obras.", "urdu": " جن لوگوں نے کفر کیا ہے اور اللہ کے راستہ سے (لوگوں کو) روکتے ہیں اور رسول سے ہدایت کے ظاہر ہو جانے کے بعد اختلاف کرتے ہیں۔ یہ لوگ اللہ کو کچھ بھی نقصان نہیں پہنچائیں گے‘ بلکہ وہ (اللہ) ان کے اعمال کو ضائع کر دے گا۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَطِیۡعُوا اللّٰہَ وَ اَطِیۡعُوا الرَّسُوۡلَ وَ لَا تُبۡطِلُوۡۤا اَعۡمَالَکُمۡ ﴿۳۴﴾", "english": " O ye who believe! obey Allah and obey the Messenger and let not your works go vain.", "french": " Ô vous qui croyez ! Obéissez à Allāh et obéissez au Messager, et ne rendez pas vaines vos œuvres.", "german": " O die ihr glaubt, gehorchet Allah und gehorchet dem Gesandten und vereitelt nicht eure Werke!", "spanish": " ¡Oh vosotros, creyentes! Obedeced a Al-lah y al Mensajero y no permitáis que vuestras obras queden en vano.", "urdu": " اے ایمان دارو! اللہ اور اس کے رسول کی اطاعت کرو‘ اور اپنے اعمال کو ضائع نہ کرو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ صَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ ثُمَّ مَاتُوۡا وَ ہُمۡ کُفَّارٌ فَلَنۡ یَّغۡفِرَ اللّٰہُ لَہُمۡ ﴿۳۵﴾", "english": " Verily, those who disbelieve and hinder men from the way of Allah, and then die while they are disbelievers — Allah certainly will not forgive them.", "french": " En vérité, ceux qui refusent de croire, et empêchent les gens de suivre la voie d’Allāh, et meurent ensuite en état de mécréance – Allāh ne leur pardonnera assurément pas.", "german": " Wahrlich, jene, die ungläubig sind und die abwendig machen von Allahs Weg und dann als Ungläubige sterben – ihnen wird Allah gewiss nicht verzeihen.", "spanish": " En verdad, a los que no creen y apartan a los hombres del camino de Al-lah, y mueren mientras están en la incredulidad: Al-lah ciertamente no los perdonará.", "urdu": " یقیناً جنہوں نے کفر کیا ہے اور اللہ کے رستہ سے لوگوں کو روکا ہے‘ پھر وہ اسی حالت میں مر بھی گئے کہ وہ کافروں میں سے تھے‘ تو اللہ ان کو کبھی معاف نہیں کرے گا۔"}, {"arabic": " فَلَا تَہِنُوۡا وَ تَدۡعُوۡۤا اِلَی السَّلۡمِ ٭ۖ وَ اَنۡتُمُ الۡاَعۡلَوۡنَ ٭ۖ وَ اللّٰہُ مَعَکُمۡ وَ لَنۡ یَّتِرَکُمۡ اَعۡمَالَکُمۡ ﴿۳۶﴾", "english": " So be not slack and sue not for peace; for you will certainly have the upper hand. And Allah is with you, and He will not deprive you of the reward of your actions.", "french": " Ne faiblissez donc pas, surtout au point de solliciter la paix alors qu’il est déjà certain que vous aurez la victoire. Allāh est avec vous, et Il ne vous privera pas de la récompense de vos actions.", "german": " So ermattet nicht, damit ihr nicht nach Frieden rufen müsst; denn ihr sollt obsiegen. Allah ist mit euch, und Er wird euch eure Taten nicht schmälern.", "spanish": " No flaqueéis, de manera que demandéis la paz, cuando estáis destinados a salir victoriosos. Al-lah está con vosotros y Él no os privará de la recompensa de vuestras acciones.", "urdu": " پس اے مومنو! سست مت ہو جس کے نتیجہ میں صلح کی طرف بلانا شروع کر دو۔ آخر تم ہی غالب رہو گے اور اللہ تمہارے ساتھ ہے اور کبھی تمہارے اعمال میں کمی نہیں آنے دے گا۔"}, {"arabic": " اِنَّمَا الۡحَیٰوۃُ الدُّنۡیَا لَعِبٌ وَّ لَہۡوٌ ؕ وَ اِنۡ تُؤۡمِنُوۡا وَ تَتَّقُوۡا یُؤۡتِکُمۡ اُجُوۡرَکُمۡ وَ لَا یَسۡـَٔلۡکُمۡ اَمۡوَالَکُمۡ ﴿۳۷﴾", "english": " The life of this world is but a sport and a pastime, and if you believe and be righteous, He will give you your rewards, and will not ask of you your possessions.", "french": " La vie de ce monde n’est qu’un jeu et un amusement ; et si vous croyez, et si vous agissez avec droiture, Il vous accordera vos récompenses, et ne vous demandera pas vos biens.", "german": " Das Leben in dieser Welt ist nur ein Spiel und ein Scherz, und wenn ihr gläubig seid und euch vor Übel hütet, so wird Er euch euren Lohn geben und wird nicht euer Gut von euch verlangen.", "spanish": " La vida de este mundo no es más que juego y diversión; si creéis y sois justos, Él os dará vuestras recompensas y no os pedirá vuestras posesiones.", "urdu": " یہ دنیا کی زندگی محض ایک کھیل اور غفلت کا سامان ہے اور اگر تم ایمان لاٶ اور تقویٰ اختیار کرو‘ تو اللہ تمہارے اجر تم کو دے گا۔ اور وہ تمہارے مال تم سے نہیں مانگتا۔"}, {"arabic": " اِنۡ یَّسۡـَٔلۡکُمُوۡہَا فَیُحۡفِکُمۡ تَبۡخَلُوۡا وَ یُخۡرِجۡ اَضۡغَانَکُمۡ ﴿۳۸﴾", "english": " If He ask them of you, and press you, you would be niggardly, and He would bring to light your malice.", "french": " S’Il vous les demandait et vous pressait, vous deviendriez avares, et Il ferait apparaître vos rancoeurs.", "german": " Sollte Er es von euch verlangen und euch drängen, ihr würdet geizig sein, und Er würde euren geheimen Groll ans Licht bringen.", "spanish": " Si os las pidiera y os las exigiera, os comportaríais mezquinamente y Él sacaría a la luz vuestra malicia.", "urdu": " اگر وہ تمہارے مال تم سے مانگے اور (اس پر) تم سے اصرار کرے‘ تو تم بخل سے کام لے سکتے ہو‘ اور وہ ضرور تمہارے کینے تمہارے دلوں سے نکال دے گا۔"}, {"arabic": " ہٰۤاَنۡتُمۡ ہٰۤؤُلَآءِ تُدۡعَوۡنَ لِتُنۡفِقُوۡا فِیۡ سَبِیۡلِ اللّٰہِ ۚ فَمِنۡکُمۡ مَّنۡ یَّبۡخَلُ ۚ وَ مَنۡ یَّبۡخَلۡ فَاِنَّمَا یَبۡخَلُ عَنۡ نَّفۡسِہٖ ؕ وَ اللّٰہُ الۡغَنِیُّ وَ اَنۡتُمُ الۡفُقَرَآءُ ۚ وَ اِنۡ تَتَوَلَّوۡا یَسۡتَبۡدِلۡ قَوۡمًا غَیۡرَکُمۡ ۙ ثُمَّ لَا یَکُوۡنُوۡۤا اَمۡثَالَکُمۡ ﴿٪۳۹﴾", "english": " Behold, you are those who are called upon to spend in the way of Allah; but of you there are some who are niggardly. And whoso is niggardly, is niggardly only against his own soul. And Allah is Self- Sufficient, and it is you that are needy. And if you turn your backs, He will bring in your stead a people other than you, then they will not be like you.", "french": " Attention ! Vous êtes ceux qui sont appelés à dépenser dans la voie d’Allāh ; mais il y en a parmi vous qui sont avares. Et quiconque est avare, n’est avare qu’envers sa propre âme. Et Allāh Se suffit à Lui-Même, et c’est vous qui êtes dans le besoin. Et si vous tournez le dos, Il vous remplacera par un autre peuple ; alors ceux-là ne seront pas avares comme vous.", "german": " Siehe, ihr seid diejenigen, die berufen sind, in Allahs Weg zu spenden; doch unter euch sind manche, die geizig sind. Und wer geizig ist, der geizt nur gegen sich selber; denn Allah ist der Unbedürftige, und ihr seid Bedürftige. Und wenn ihr den Rücken kehrt, so wird Er ein anderes Volk an eure Stelle setzen; und sie werden nicht gleich euch sein.", "spanish": " He ahí que sois los invitados a gastar en la causa de Al-lah; pero hay algunos de vosotros que se comportan mezquinamente. Pero quien es mezquino lo es solamente contra su propia alma. Al-lah es Autosuficiente, y sois vosotros los necesitados. Mas si volvéis la espalda, colocará en vuestro lugar a un pueblo distinto a vosotros, que no será como vosotros.", "urdu": " سنو! تم وہ لوگ ہو جن کو اس لئے بلایا جاتا ہے کہ تم اللہ کے راستہ میں خرچ کرو‘ اور تم میں سے بعض ایسے ہوتے ہیں جو بخل سے کام لیتے ہیں اور جو بھی بخل سے کام لے وہ اپنی جان ہی کے متعلق بخل سے کام لیتا ہے ورنہ اللہ بے نیاز ہے اور تم ہی محتاج ہو۔ اور اگر تم پھر جاٶ‘ تو وہ تمہاری جگہ ایک اور قوم کو بدل کر لے آئے گا اور وہ تمہاری طرح (سستی کرنے والے) نہیں ہوں گے۔"}], "Surah": 47}