{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el Nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " الٓـمّٓرٰ ۟ تِلۡکَ اٰیٰتُ الۡکِتٰبِ ؕ وَ الَّذِیۡۤ اُنۡزِلَ اِلَیۡکَ مِنۡ رَّبِّکَ الۡحَقُّ وَ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یُؤۡمِنُوۡنَ ﴿۲﴾", "english": " Alif Lam Mim Ra. These are verses of the Book. And that which has been revealed to thee from thy Lord is the truth, but most men believe not.", "french": " Alif Lām Mīm Rā (Je suis Allāh, le Plus-Savant et Je vois). Ceux-ci sont des versets du Livre parfait . Et ce qui t’a été révélé de la part de ton Seigneur est la vérité, mais la plupart des hommes ne croient pas.", "german": " Alif Lâm Mîm Râ. Das sind die Verse des Buches. Und was zu dir von deinem Herrn hinabgesandt ward, es ist die Wahrheit. Jedoch die meisten Menschen glauben nicht.", "spanish": " Alif Lam Mim Ra. Éstos son los versículos del Libro. Y lo que te ha sido revelado por tu Señor es la verdad, pero la mayoría de los hombres no lo creen.", "urdu": " میں اللہ جاننے والا اور دیکھنے والا ہوں۔ یہ کامل کتاب کی آیات ہیں۔ اور جو کلام تجھ پر تیرے رب کی طرف سے اتارا گیا ہے وہ بالکل حق ہے۔ لیکن اکثر لوگ ایمان نہیں لاتے۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ رَفَعَ السَّمٰوٰتِ بِغَیۡرِ عَمَدٍ تَرَوۡنَہَا ثُمَّ اسۡتَوٰی عَلَی الۡعَرۡشِ وَ سَخَّرَ الشَّمۡسَ وَ الۡقَمَرَ ؕ کُلٌّ یَّجۡرِیۡ لِاَجَلٍ مُّسَمًّی ؕ یُدَبِّرُ الۡاَمۡرَ یُفَصِّلُ الۡاٰیٰتِ لَعَلَّکُمۡ بِلِقَآءِ رَبِّکُمۡ تُوۡقِنُوۡنَ ﴿۳﴾", "english": " Allah is He Who raised up the heavens without any pillars that you can see. Then He settled Himself on the Throne. And He pressed the sun and the moon into service: each pursues its course until an appointed term. He regulates it all. He clearly explains the Signs, that you may have a firm belief in the meeting with your Lord.", "french": " Allāh est Celui Qui a érigé les cieux sans colonnes qui vous soient visibles. Puis Il S’est installé sur le Trône. Et Il a soumis le soleil et la lune à votre service, chacun poursuivant son orbite jusqu’à un terme fixe. Il est le Régulateur de toute chose et Il explique clairement les Signes, afin que vous croyiez fermement en la rencontre avec votre Seigneur.", "german": " Allah ist es, Der die Himmel erhöht hat ohne Stützpfeiler, die ihr sehen könnt. Dann setzte Er Sich auf den Thron. Und Er zwang Sonne und Mond in Dienstbarkeit; alles läuft seine Bahn zum vorgezeichneten Ziel. Er ordnet alle Dinge. Er macht die Zeichen deutlich klar, auf dass ihr an die Begegnung mit eurem Herrn fest glauben möchtet.", "spanish": " Al-lah es Quien levantó los cielos sin pilares visibles para vosotros. Después se asentó Él mismo en el Trono y sometió el sol y la luna: cada uno de los cuales sigue su curso hasta el plazo fijado. Él rige las leyes de la naturaleza . Explica claramente los Signos, para que creáis firmemente en el encuentro con vuestro Señor.", "urdu": " اللہ وہ ہے جس نے آسمانوں کو بغیر ستونوں کے بلند کیا ہے۔ جیسا کہ تم دیکھ ہی رہے ہو (اور) پھر وہ عرش پر قائم ہوا ہے اور سورج اور چاند کو اس نے (تمہاری) خدمت پر لگا رکھا ہے (چنانچہ) ہر ایک (سیارہ) ایک معین میعاد تک (اپنی گردش کے مطابق) چل رہا ہے۔ وہ (اللہ) ہر امر کا انتظام کرتا ہے۔ (اور) اپنی آیات کو کھول کر بیان کرتا ہے تا کہ تم (لوگ) اپنے رب سے ملنے کا یقین رکھو۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ مَدَّ الۡاَرۡضَ وَ جَعَلَ فِیۡہَا رَوَاسِیَ وَ اَنۡہٰرًا ؕ وَ مِنۡ کُلِّ الثَّمَرٰتِ جَعَلَ فِیۡہَا زَوۡجَیۡنِ اثۡنَیۡنِ یُغۡشِی الَّیۡلَ النَّہَارَ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّتَفَکَّرُوۡنَ ﴿۴﴾", "english": " And He it is Who spread out the earth and made therein mountains and rivers. And fruits of every kind He made therein in two sexes. He causes the night to cover the day. Therein, verily, are Signs for a people who reflect.", "french": " Et c’est Lui Qui a étendu la terre et y a formé des montagnes solidement ancrées et des rivières et Il a créé les fruits en paires, mâles et femelles. Il fait que la nuit recouvre le jour. En vérité, il y a là des Signes pour des gens qui réfléchissent.", "german": " Und Er ist es, Der die Erde ausbreitete und Berge und Flüsse in ihr gründete. Und Früchte aller Art schuf Er auf ihr, ein Paar von jeder. Er lässt die Nacht den Tag bedecken. Hierin sind wahrlich Zeichen für ein nachdenkendes Volk.", "spanish": " Él es Quien dilató la tierra y estableció en ella montañas y ríos. Los frutos los hizo a pares, masculinos y femeninos. Hace que la noche cubra el día. Aquí hay, en verdad, signos para las gentes que reflexionan.", "urdu": " اور وہی ہے جس نے زمین کو پھیلایا ہے‘ اور اس میں استحکام کے ساتھ ٹھہرے رہنے والے پہاڑ اور (نیز) دریا بنائے ہیں اور اس میں تمام (اقسام) کے پھلوں سے دونوں قسمیں (یعنی نرومادہ) بنائی ہیں۔ وہ رات کو دن پر لا ڈالتا ہے۔ جو لوگ سوچتے ہیں ان کے لئے (بلاشک وشبہ) اس (بات) میں کئی نشان (پائے جاتے) ہیں۔"}, {"arabic": " وَ فِی الۡاَرۡضِ قِطَعٌ مُّتَجٰوِرٰتٌ وَّ جَنّٰتٌ مِّنۡ اَعۡنَابٍ وَّ زَرۡعٌ وَّ نَخِیۡلٌ صِنۡوَانٌ وَّ غَیۡرُ صِنۡوَانٍ یُّسۡقٰی بِمَآءٍ وَّاحِدٍ ۟ وَ نُفَضِّلُ بَعۡضَہَا عَلٰی بَعۡضٍ فِی الۡاُکُلِ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّعۡقِلُوۡنَ ﴿۵﴾", "english": " And in the earth are diverse tracts, adjoining one another, and gardens of vines, and corn-fields, and datepalms, growing together from one root and others not so growing; they are watered with the same water, yet We make some of them excel others in fruit. Therein are Signs for a people who understand.", "french": " Et sur la terre il y a diverses étendues qui se touchent, et des vignobles, et des champs de grains et des dattiers, qui poussent d’une seule racine et d’autres qui ne poussent pas ainsi ; ils sont tous arrosés de la même eau, et pourtant Nous faisons que certains d’entre eux surpassent d’autres en matière de goût. Il y a là des Signes pour des gens qui comprennent.", "german": " Und auf der Erde sind dicht beieinander (verschiedene) Landstriche und Rebengärten und Getreidefelder und Dattelpalmen, aus einer Wurzel zusammen erwachsend und andere nicht so erwachsend; mit dem nämlichen Wasser sind sie getränkt, dennoch lassen Wir die einen von ihnen die anderen übertreffen an Frucht. Hierin sind wahrlich Zeichen für ein verstehendes Volk.", "spanish": " Y en la tierra hay parcelas diversas limítrofes unas con otras, jardines de vid, campos de grano y palmeras, que crecen juntos a partir de una raíz y otros que no crecen de esta manera; son regados con la misma agua, y sin embargo hacemos que algunos de ellos superen a otros en sus frutos. Aquí hay Signos para las gentes que entienden.", "urdu": " اور زمین میں ایک دوسرے کے پاس پاس کئی (اقسام کے) قطعات ہیں اور کئی طرح کے انگوروں کے باغات اور (کئی قسم کی) کھیتی اور (طرح طرح کے) کھجور کے درخت (جن میں سے بعض) ایک ایک جڑ سے کئی کئی نکلنے والے (ہوتے ہیں) اور (بعض) ایک ایک جڑ سے کئی کئی نکلنے والوں کے خلاف (ایک ہی تنے کے ہوتے) ہیں۔ جنہیں ایک ہی (طرح کے) پانی سے سیراب کیا جاتا ہے اور (باوجود اس کے) پھل کے لحاظ سے ہم ان میں سے بعض (درختوں) کو بعض پر فضیلت دیتے ہیں۔ اس میں بھی ان لوگوں کے لئے جو عقل سے کام لیتے ہیں کئی نشان (موجود) ہیں۔"}, {"arabic": " وَ اِنۡ تَعۡجَبۡ فَعَجَبٌ قَوۡلُہُمۡ ءَ اِذَا کُنَّا تُرٰبًا ءَ اِنَّا لَفِیۡ خَلۡقٍ جَدِیۡدٍ ۬ؕ اُولٰٓئِکَ الَّذِیۡنَ کَفَرُوۡا بِرَبِّہِمۡ ۚ وَ اُولٰٓئِکَ الۡاَغۡلٰلُ فِیۡۤ اَعۡنَاقِہِمۡ ۚ وَ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۶﴾", "english": " And if thou dost wonder, then wondrous indeed is their saying: ‘What! when we have become dust, shall we then be in a state of new creation?’ These it is who disbelieve in their Lord; and these it is who shall have shackles round their necks, and they shall be the inmates of the Fire, wherein they shall abide.", "french": " Et si tu devais t’étonner, alors il y a, en vérité, de quoi s’étonner quand ils disent : « Comment ! quand nous serons devenus poussière, serons-nous alors dans l’état d’ une nouvelle création ? » Ce sont ceux-là qui ne croient pas en leur Seigneur ; et ceux-là auront un carcan autour du cou, et ils seront les habitants du Feu où ils demeureront longtemps.", "german": " Wenn du dich wunderst, so ist wunderlich fürwahr ihre Rede: \"Wie! wenn wir zu Staub geworden sind, sollen wir dann in einer Neuschöpfung sein?\" Diese sind es, die ihrem Herrn den Glauben versagen, und diese sind es, die Fesseln um ihren Hals haben werden, und sie werden die Bewohner des Feuers sein, darin müssen sie bleiben.", "spanish": " Y si te asombras, lo más asombroso es en verdad lo que dicen: ¡Cómo! Cuando nos convirtamos en polvo ¿estaremos entonces en un estado de nueva creación?”. Son éstos quienes no creen en su Señor y son éstos quienes tendrán argollas alrededor de sus cuellos y serán los moradores del Fuego, en donde habitarán.", "urdu": " اور (اے مخاطب) اگر تجھے (ان منکرین حق پر) تعجب آئے تو (وہ بجا ہے کیونکہ) ان کا (یہ) کہنا (کہ) کیا جب ہم مر کر مٹی ہو جائیں گے تو ہمیں واقعہ میں (پھر) کسی نئے جنم میں آنا ہوگا۔ تیری بات سے بھی زیادہ عجیب بات ہے یہ وہ لوگ ہیں جنہوں نے اپنے رب کا انکار کر دیا ہے اور یہ وہ لوگ ہیں جن کی گردنوں میں طوق (پڑے) ہوں گے۔ اور یہ (لوگ دوزخ کی) آگ (میں پڑنے) والے ہیں۔ وہ اس میں رہتے چلے جائیں گے۔"}, {"arabic": " وَ یَسۡتَعۡجِلُوۡنَکَ بِالسَّیِّئَۃِ قَبۡلَ الۡحَسَنَۃِ وَ قَدۡ خَلَتۡ مِنۡ قَبۡلِہِمُ الۡمَثُلٰتُ ؕ وَ اِنَّ رَبَّکَ لَذُوۡ مَغۡفِرَۃٍ لِّلنَّاسِ عَلٰی ظُلۡمِہِمۡ ۚ وَ اِنَّ رَبَّکَ لَشَدِیۡدُ الۡعِقَابِ ﴿۷﴾", "english": " And they want thee to hasten on the punishment in preference to good, whereas exemplary punishments have already occurred before them. And verily, thy Lord is full of forgiveness for mankind despite their wrongdoing, and verily, thy Lord is also strict in condign punishment.", "french": " Et ils sont impatients d’exiger de toi que tu fasses tomber sur eux le malheur plutôt que le bien, alors que des châtiments exemplaires sont déjà survenus avant eux. En vérité ton Seigneur est plein de magnanimité pour les hommes, en dépit de leurs iniquités, et en vérité ton Seigneur est aussi sévère en ce qui concerne les châtiments mérités.", "german": " Sie werden dich eher die Strafe als die Wohltat beschleunigen heißen, obwohl (schon) vor ihnen beispielgebende Bestrafungen erfolgt sind. Wahrlich, dein Herr ist voll Verzeihung für die Menschheit, trotz ihres Missetuns, und siehe, dein Herr ist streng im angemessenen Bestrafen.", "spanish": " Y están impacientes exigiéndote que les traigas el mal antes que el bien , cuando ya han acontecido castigos ejemplares anteriormente a ellos. Y en verdad, tu Señor está lleno de perdón hacia la humanidad a pesar de sus iniquidades; y ciertamente tu Señor también es estricto en el castigo merecido.", "urdu": " اور وہ سزا کو نیک جزا سے جلد تر لانے کا تجھ سے مطالبہ کر رہے ہیں۔ حالانکہ ان سے پہلے (ایسے لوگوں پر) تمام (قسم کے) عبرتناک عذاب آچکے ہیں اور تیرا رب لوگوں کو ان کے ظلم کے باوجود (بھی) بلاشک و شبہ (بہت ہی) بخشنے والا ہے اور (اسی طرح) تیرا رب یقیناً سخت سزا دینے والا (بھی ہے)۔"}, {"arabic": " وَ یَقُوۡلُ الَّذِیۡنَ کَفَرُوۡا لَوۡ لَاۤ اُنۡزِلَ عَلَیۡہِ اٰیَۃٌ مِّنۡ رَّبِّہٖ ؕ اِنَّمَاۤ اَنۡتَ مُنۡذِرٌ وَّ لِکُلِّ قَوۡمٍ ہَادٍ ٪﴿۸﴾", "english": " And those who disbelieve say, ‘Wherefore has not a Sign been sent down to him from his Lord?’ Thou art, surely, a Warner. And there is a Guide for every people.", "french": " Et ceux qui ne croient pas disent « Pourquoi un Signe ne lui est-il pas descendu de son Seigneur ? » Tu es seulement un Avertisseur. Et pour chaque peuple il y a eu un Guide.", "german": " Die nicht glauben, sprechen: \"Warum ward nicht ein Zeichen herabgesandt zu ihm von seinem Herrn?\" Du bist nur ein Warner. Und ein Führer ward jedem Volk.", "spanish": " Y los incrédulos dicen: “¿Por qué su Señor no le ha enviado un Signo?”. En verdad eres un Amonestador. Y hay una Guía para cada pueblo.", "urdu": " اور جن لوگوں نے انکار کیا ہے وہ کہتے ہیں (کہ) اس (شخص) پر اس کے رب کی طرف سے کوئی نشان کیوں نہیں اتارا گیا (حالانکہ) تو صرف آگاہ (اور ہوشیار) کرنے والا ہے اور ہر ایک قوم کے لئے (خدا کی طرف سے) ایک راہنما (بھیجا جاچکا) ہے۔"}, {"arabic": " اَللّٰہُ یَعۡلَمُ مَا تَحۡمِلُ کُلُّ اُنۡثٰی وَ مَا تَغِیۡضُ الۡاَرۡحَامُ وَ مَا تَزۡدَادُ ؕ وَ کُلُّ شَیۡءٍ عِنۡدَہٗ بِمِقۡدَارٍ ﴿۹﴾", "english": " Allah knows what every female bears, and what wombs diminish and what they cause to grow. And with Him everything has a proper measure.", "french": " Allāh sait ce que chaque femelle porte, et ce que les utérus diminuent et ce qu’ils font croître. Et auprès de Lui chaque chose a une mesure appropriée .", "german": " Allah weiß, was jedes Weib trägt und was der Mutterschoß geringer werden und was er zunehmen lässt. Und bei Ihm hat jedes Ding ein Maß.", "spanish": " Al-lah sabe lo que lleva cada hembra, lo que disminuye los vientres lo que los hace crecer. Pues con Él todo tiene su medida apropiada.", "urdu": " اللہ (خوب) جانتا ہے اسے (بھی) جو ہر مادہ اٹھاتی ہے اور جسے رحم ناقص کر (کے گرا) دیتے ہیں۔ اور (اسے بھی) جسے وہ بڑھاتے ہیں۔ اور ہر ایک چیز اس کے پاس ضرورت کے مطابق موجود ہے۔"}, {"arabic": " عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ الۡکَبِیۡرُ الۡمُتَعَالِ ﴿۱۰﴾", "english": " He is the Knower of the unseen and the seen, the Incomparably Great, the Most High.", "french": " Il est Celui Qui connaît l’invisible et le visible, l’Incomparablement Grand, le Très-Haut.", "german": " Der Kenner des Verborgenen und des Sichtbaren, der Große, der Erhabenste!", "spanish": " Él es el Conocedor de lo invisible y de lo visible, el Incomparablemente Grande, el Sublime.", "urdu": " وہ غائب اور حاضر (دونوں) کا جاننے والا ہے۔ بڑے مرتبہ والا (اور) بڑی شان والا ہے۔"}, {"arabic": " سَوَآءٌ مِّنۡکُمۡ مَّنۡ اَسَرَّ الۡقَوۡلَ وَ مَنۡ جَہَرَ بِہٖ وَ مَنۡ ہُوَ مُسۡتَخۡفٍۭ بِالَّیۡلِ وَ سَارِبٌۢ بِالنَّہَارِ ﴿۱۱﴾", "english": " He among you who conceals his word, and he who utters it openly are equal in His sight ; and also he who hides by night, and he who goes forth openly by day.", "french": " Celui parmi vous qui prononce sa parole secrètement, et celui qui la prononce ouvertement sont égaux dans Sa connaissance ; et aussi celui qui se cache pendant la nuit, et celui qui sort ouvertement pendant le jour.", "german": " Der unter euch das Wort verhehlt und der es offen ausspricht, sind gleich (vor Ihm); und (ebenso) der sich in der Nacht verbirgt und der am Tage offen hervortritt.", "spanish": " Ante Su vista son iguales aquel de vosotros que oculta su palabra y el que la expresa abiertamente; como también quien se oculta por la noche y sale a las claras durante el día.", "urdu": " جو تم میں سے بات چھپاتا ہے اور وہ بھی جو اسے ظاہر کرتا ہے (اس کے علم کے لحاظ سے دونوں) برابر ہیں۔ نیز وہ بھی جو رات کو چھپ رہتا ہے اور جو دن کو چلتا ہے۔"}, {"arabic": " لَہٗ مُعَقِّبٰتٌ مِّنۡۢ بَیۡنِ یَدَیۡہِ وَ مِنۡ خَلۡفِہٖ یَحۡفَظُوۡنَہٗ مِنۡ اَمۡرِ اللّٰہِ ؕ اِنَّ اللّٰہَ لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتّٰی یُغَیِّرُوۡا مَا بِاَنۡفُسِہِمۡ ؕ وَ اِذَاۤ اَرَادَ اللّٰہُ بِقَوۡمٍ سُوۡٓءًا فَلَا مَرَدَّ لَہٗ ۚ وَ مَا لَہُمۡ مِّنۡ دُوۡنِہٖ مِنۡ وَّالٍ ﴿۱۲﴾", "english": " For him (the Messenger) is a succession of angels before him and behind him; they guard him by the command of Allah. Surely, Allah changes not the condition of a people until they change that which is in their hearts. And when Allah wishes to punish a people, there is no repelling it, nor have they any helper beside Him.", "french": " Pour chacun, il y a des sentinelles qui se meuvent sans répit devant lui et derrière lui pour le protéger par ordre d’Allāh. Assurément, Allāh ne change pas la condition d’un peuple avant qu’ils n’aient changé ce qui est dans leurs cœurs. Et lorsqu’Allāh décide d’un mauvais résultat pour un peuple, nul ne peut le repousser et ils ne peuvent avoir de protecteur en dehors de Lui.", "german": " Für ihn (den Gesandten) ist eine Schar (von Engeln) vor ihm und hinter ihm; sie behüten ihn auf Allahs Geheiß. Gewiss, Allah ändert die Lage eines Volkes nicht, ehe sie nicht selbst das ändern, was in ihren Herzen ist. Und wenn Allah ein Volk zu bestrafen wünscht, so gibt es dagegen keine Abwehr, noch haben sie einen Helfer außer Ihm.", "spanish": " Para él (el Mensajero) hay una sucesión de ángeles delante y detrás de él, que lo guardan por mandato de Al-lah. En verdad, Al-lah no cambia el estado de un pueblo mientras ellos no cambien lo que hay en sus corazones. Cuando Al-lah desea castigar a un pueblo, nadie puede impedirlo, ni tienen socorredor alguno fuera de Él.", "urdu": " اس کی طرف سے اس (رسول) کے آگے بھی اور اس کے پیچھے بھی (ایک دوسرے کے ساتھ ساتھ) آنے والی (ملائکہ کی) ایک جماعت (حفاظت کے لئے) مقرر ہے جو اللہ کے حکم سے اس کی حفاظت کر رہی ہے۔ اللہ کبھی بھی کسی قوم کی حالت کو نہیں بدلتا جب تک کہ وہ اپنی اندرونی حالت کو نہ بدلے اور جب اللہ کسی قوم کے متعلق عذاب کا فیصلہ کر لیتا ہے تو اس (عذاب) کو ہٹانے والا کوئی نہیں ہوتا اور اس کے سوا ان کا اور کوئی (بھی) مددگار نہیں (ہوسکتا۔)"}, {"arabic": " ہُوَ الَّذِیۡ یُرِیۡکُمُ الۡبَرۡقَ خَوۡفًا وَّ طَمَعًا وَّ یُنۡشِیٴُ السَّحَابَ الثِّقَالَ ﴿ۚ۱۳﴾", "english": " He it is Who shows you the lightning to inspire fear and hope, and He raises the heavy clouds.", "french": " C’est Lui Qui vous montre les éclairs pour inspirer crainte et espoir, et Il suscite la formation de nuages lourds.", "german": " Er ist es, Der euch den Blitz zeigt, Furcht und Hoffnung einzuflößen, und Er lässt die schweren Wolken aufsteigen.", "spanish": " Él es Quien os muestra el relámpago para inspirar temor y esperanza, Quien hace surgir las nubes pesadas.", "urdu": " وہی ہے جو تمہیں بجلی (کی چمک) دکھاتا ہے۔ خوف کے لئے (بھی) اور طمع کے لئے (بھی) اور بھاری بادل اٹھاتا ہے۔"}, {"arabic": " وَ یُسَبِّحُ الرَّعۡدُ بِحَمۡدِہٖ وَ الۡمَلٰٓئِکَۃُ مِنۡ خِیۡفَتِہٖ ۚ وَ یُرۡسِلُ الصَّوَاعِقَ فَیُصِیۡبُ بِہَا مَنۡ یَّشَآءُ وَ ہُمۡ یُجَادِلُوۡنَ فِی اللّٰہِ ۚ وَ ہُوَ شَدِیۡدُ الۡمِحَالِ ﴿ؕ۱۴﴾", "english": " And the thunder glorifies Him with His praise and likewise do the angels for awe of Him; and He sends the thunderbolts, and smites therewith whom He wills, yet they dispute concerning Allah, while He is severe in punishing.", "french": " Et le tonnerre Le glorifie de Ses louanges, et les anges en font de même par crainte de Lui ; et Il envoie les coups de foudre dont Il frappe qui Il veut, et néanmoins ils discutent entre eux sur Allāh, alors qu’Il est sévère en châtiment.", "german": " Und der Donner verherrlicht Ihn mit Seiner Lobpreisung und (also) die Engel in Ehrfurcht vor Ihm. Er sendet die Donnerschläge und trifft damit, wen Er will; doch streiten sie über Allah, während Er streng im Strafen ist.", "spanish": " El trueno Lo glorifica con Su alabanza y lo mismo hacen los ángeles por temor a Él; y Él envía los rayos, golpeando con ellos a quien desea; y sin embargo disputan sobre Al-lah, a pesar de que es severo en el castigo.", "urdu": " اور کڑک اس کی تعریف کے ساتھ (ساتھ) اس کی پاکیزگی کا اظہار بھی کرتی ہے اور فرشتے بھی اس کے خوف کے سبب سے (ایسا ہی کرتے ہیں) اور گرنے والی بجلیاں بھی بھیجتا ہے پھر جن پر چاہتا ہے انہیں گراتا ہے اور وہ اللہ کے بارہ میں جھگڑ رہے ہیں۔ حالانکہ وہ سخت عذاب دینے والا ہے۔"}, {"arabic": " لَہٗ دَعۡوَۃُ الۡحَقِّ ؕ وَ الَّذِیۡنَ یَدۡعُوۡنَ مِنۡ دُوۡنِہٖ لَا یَسۡتَجِیۡبُوۡنَ لَہُمۡ بِشَیۡءٍ اِلَّا کَبَاسِطِ کَفَّیۡہِ اِلَی الۡمَآءِ لِیَبۡلُغَ فَاہُ وَ مَا ہُوَ بِبَالِغِہٖ ؕ وَ مَا دُعَآءُ الۡکٰفِرِیۡنَ اِلَّا فِیۡ ضَلٰلٍ ﴿۱۵﴾", "english": " Unto Him is the true prayer. And those on whom they call beside Him answer them not at all, except as he is answered who stretches forth his two hands toward water that it may reach his mouth, but it reaches it not. And the prayer of the disbelievers is but a thing wasted.", "french": " Ce n’est qu’à Lui Seul que sont adressées les vraies prières. Et ceux à qui ils en appellent en dehors de Lui ne leur rendent aucune réponse, sauf la réponse que reçoit celui qui tend les deux mains vers l’eau afin qu’elle atteigne sa bouche, mais elle ne l’atteint pas. Et la prière des mécréants n’est que peine perdue.", "german": " Ihm gebührt das wahre Gebet. Und jene, die sie statt Ihn anrufen, geben ihnen kein Gehör; (sie sind) wie jener, der seine beiden Hände nach Wasser ausstreckt, damit es seinen Mund erreiche, doch es erreicht ihn nicht. Und das Gebet der Ungläubigen ist bloß ein verschwendetes Ding.", "spanish": " La verdadera oración es la dirigida sólo a Él. Aquellos a quienes nvocan en lugar de Él no les responden en absoluto, salvo como es respondido aquel que extiende sus dos manos hacia el agua para que llegue a su boca, pero nunca llega. Pues la oración de los incrédulos no es más que una pérdida de tiempo.", "urdu": " نہ ٹلنے والا بلاوا اسی کا ہے۔ اور جنہیں وہ اس کے سوا پکارتے ہیں۔ وہ ان (کی دعا) کا کوئی جواب نہیں دیتے۔ (ہاں) مگر (ان کا فعل) اس (شخص) کی طرح ہے جو اپنے دونوں ہاتھ پانی کی طرف پھیلا رہا ہو۔ تا وہ اس کے منہ تک پہنچ جائے‘ لیکن وہ (پانی) اس تک کبھی نہیں پہنچے گا اور کافروں کی (چیخ اور) پکار ضائع ہو جائے گی۔"}, {"arabic": " وَ لِلّٰہِ یَسۡجُدُ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ طَوۡعًا وَّ کَرۡہًا وَّ ظِلٰلُہُمۡ بِالۡغُدُوِّ وَ الۡاٰصَالِ ﴿ٛ۱۶﴾", "english": " And to Allah submits whosoever is in the heavens and the earth willingly or unwillingly and likewise do their shadows, in the mornings and the evenings.", "french": " Et à Allāh se soumettent, de gré ou de force, tous ceux qui sont dans les cieux et sur la terre ; et de même font leurs ombres matin et soir.", "german": " Wer immer in den Himmeln und auf der Erde ist, wirft sich nieder vor Allah, willig oder widerwillig, und (also) ihre Schatten, des Morgens und des Abends.", "spanish": " Mas a Al-lah se someten quienes están en los cielos y en la tierra, de grado o a la fuerza, e igualmente lo hacen sus sombras, al amanecer y al atardecer.", "urdu": " اور جو (وجود) آسمانوں میں ہیں یا زمین میں ہیں اور ان کے سائے بھی خوشی سے یا کراہت سے (ہر) صبح اور شام اللہ ہی کو سجدہ کرتے ہیں۔"}, {"arabic": " قُلۡ مَنۡ رَّبُّ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ قُلِ اللّٰہُ ؕ قُلۡ اَفَاتَّخَذۡتُمۡ مِّنۡ دُوۡنِہٖۤ اَوۡلِیَآءَ لَا یَمۡلِکُوۡنَ لِاَنۡفُسِہِمۡ نَفۡعًا وَّ لَا ضَرًّا ؕ قُلۡ ہَلۡ یَسۡتَوِی الۡاَعۡمٰی وَ الۡبَصِیۡرُ ۬ۙ اَمۡ ہَلۡ تَسۡتَوِی الظُّلُمٰتُ وَ النُّوۡرُ ۬ۚ اَمۡ جَعَلُوۡا لِلّٰہِ شُرَکَآءَ خَلَقُوۡا کَخَلۡقِہٖ فَتَشَابَہَ الۡخَلۡقُ عَلَیۡہِمۡ ؕ قُلِ اللّٰہُ خَالِقُ کُلِّ شَیۡءٍ وَّ ہُوَ الۡوَاحِدُ الۡقَہَّارُ ﴿۱۷﴾", "english": " Say, ‘Who is the Lord of the heavens and the earth?’ Say, ‘Allah.’ Say, ‘Have you then taken beside Him helpers who have no power for good or harm even for themselves?’ Say, ‘Can the blind and the seeing be equal? Or, can darkness be equal to light? Or, do they assign to Allah partners who have created the like of His creation so that the two creations appear similar to them?’ Say, ‘Allah alone is the Creator of all things, and He is the One, the Most Supreme.’", "french": " Dis : « Qui est le Seigneur des cieux et de la terre ? » Dis : « Allāh. » Dis : « Avez-vous donc pris à Sa place des aides qui n’ont aucun pouvoir pour faire le bien ou le mal ne serait-ce que pour eux-mêmes ? » Dis : « L’aveugle et le voyant peuvent-ils être égaux ? Ou, l’obscurité peut-elle égaler la lumière ? Ou, attribuent-ils à Allāh des associés qui ont créé comme Sa création, de sorte que la création leur paraisse confuse ? » Dis : « Allāh Seul est le Créateur de toutes choses, et Il est l’Unique, le Tout-Dominant de par Sa majesté et Sa gloire . »", "german": " Sprich: \"Wer ist der Herr der Himmel und der Erde?\" Sprich: \"Allah.\" Sprich: \"Habt ihr euch Helfer außer Ihm genommen, die sich selbst weder nützen noch schaden können?\" Sprich: \"Können der Blinde und der Sehende gleich sein? Oder kann die Finsternis gleich sein dem Licht? Oder stellen sie Allah Götter zur Seite, die eine Schöpfung geschaffen wie die Seine, also dass (beide) Schöpfungen ihnen gleichartig erscheinen?\" Sprich: \"Allah ist der Schöpfer aller Dinge, und Er ist der Einige, der Allmächtige.\"", "spanish": " Diles: “¿Quién es el Señor de los cielos y la tierra?”. Responde: “Al-lah”. Diles: ¿Habéis tomado, pues, en lugar de Él, socorredores que o tienen poder para hacer ningún bien ni ningún mal ni siquiera a ellos mismos?”. Diles: “¿Pueden equipararse el ciego y el vidente? o ¿pueden ser las tinieblas iguales a la luz? o ¿asignan socios a Al-lah que hayan creado algo similar a Su Creación hasta el punto de que aparezcan similares las dos creaciones ante ellos?”. Diles: “ Sólo Al-lah es el Creador de todas las cosas, Él es el Único, el Supremo”.", "urdu": " تو ان سے کہہ (کہ بتاٶ) آسمانوں اور زمین کا رب کون ہے؟ (اس کا جواب وہ تو کیا دیں گے) تو (خود ہی) کہہ دے (کہ) اللہ‘ (اور پھر تو ان سے) کہہ‘ کیا پھر (بھی) تم نے اس کے سوا (اپنے) ایسے مددگار تجویز کر رکھے ہیں جو خود اپنے لئے (بھی) کسی نفع (کو حاصل کرنے) کی قدرت نہیں رکھتے۔ اور نہ کسی نقصان کو روکنے کی (اور ان سے) کہہ (کہ) کیا اندھا اور دیکھنے والا برابر (ہوسکتا) ہے؟ یا کیا تاریکی اور روشنی برابر (ہوسکتی) ہے؟ کیا انہوں نے اللہ کے ایسے شریک تجویز کئے ہیں جنہوں نے اس کی طرح (کچھ) مخلوق پیدا کی ہے۔ جس کی وجہ سے (اس کی اور دوسروں کی) مخلوق ان کے لئے مشتبہ ہو گئی ہے تو ان سے کہہ (کہ) اللہ (ہی) ہر ایک چیز کا خالق ہے اور وہ کامل طور پر یکتا (اور ہر ایک چیز پر) کامل اقتدار رکھنے والا ہے۔"}, {"arabic": " اَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَسَالَتۡ اَوۡدِیَۃٌۢ بِقَدَرِہَا فَاحۡتَمَلَ السَّیۡلُ زَبَدًا رَّابِیًا ؕ وَ مِمَّا یُوۡقِدُوۡنَ عَلَیۡہِ فِی النَّارِ ابۡتِغَآءَ حِلۡیَۃٍ اَوۡ مَتَاعٍ زَبَدٌ مِّثۡلُہٗ ؕ کَذٰلِکَ یَضۡرِبُ اللّٰہُ الۡحَقَّ وَ الۡبَاطِلَ ۬ؕ فَاَمَّا الزَّبَدُ فَیَذۡہَبُ جُفَآءً ۚ وَ اَمَّا مَا یَنۡفَعُ النَّاسَ فَیَمۡکُثُ فِی الۡاَرۡضِ ؕ کَذٰلِکَ یَضۡرِبُ اللّٰہُ الۡاَمۡثَالَ ﴿ؕ۱۸﴾", "english": " He sends down water from the sky, so that valleys flow according to their measure, and the flood bears on its surface swelling foam. And from that which they heat in the fire, seeking to make ornaments or utensils, comes out a foam similar to it. Thus does Allah illustrate truth and falsehood. Now, as to the foam, it goes away as rubbish, but as to that which benefits men, it stays on the earth. Thus does Allah set forth parables.", "french": " Il fait descendre l’eau du ciel, de sorte que les vallées coulent selon leur capacité, et que le flot porte à sa surface de l’écume flottante. Et de ce qu’ils chauffent au feu, cherchant à en faire des ornements ou des ustensiles, sort une écume semblable. C’est ainsi qu’Allāh illustre la vérité et le mensonge. Et quant à l’écume, elle s’en va comme rebut ; mais quant à ce qui profite aux gens, il reste sur la terre. C’est ainsi qu’Allāh énonce des paraboles.", "german": " Er sendet Wasser herab vom Himmel, auf dass die Täler durchströmt werden nach ihrem Maß, und die Flut trägt gischtend aufsteigenden Schaum. Und ein ähnlicher Schaum ist in dem, was sie im Feuer erhitzen im Verlangen nach Schmuck und Gerät. So verdeutlicht Allah Wahr und Falsch. Der Schaum aber, der vergeht wie Blasen; das aber, was den Menschen nützt, es bleibt auf der Erde zurück. Also prägt Allah die Gleichnisse.", "spanish": " Él hace descender el agua del cielo, para que los ríos recorran los valles según la medida, y la corriente lleve en su superficie una spuma flotante. Y de lo que calientan al fuego, con la intención de fabricar adornos o utensilios, emana una espuma similar a ella. Así ilustra Al-lah la verdad y la falsedad. Ahora bien, en cuanto a la espuma, se desvanece como basura, mas aquello que beneficia a los hombres, permanece en la tierra. Así Al-lah explica las parábolas.", "urdu": " اس نے آسمان سے کچھ پانی اتارا‘ پھر (اس سے) کئی وادیاں اپنی (اپنی) گنجائش کے مطابق بہ نکلیں‘ اور اس سیلاب نے اوپر آجانے والی جھاگ کو اٹھالیا اور جس (دھات) کو وہ کسی زیور یا اور کسی گھریلو استعمال کے سامان بنانے کے لئے آگ میں تپاتے ہیں اس میں (بھی) اس (سیلاب) جیسا ایک جھاگ (ہوتا)ہے اسی طرح اللہ حق اور باطل (کے فرق) کو بیان کرتا ہے۔ پھر جھاگ تو پھینکا جاکر تباہ ہو جاتا ہے‘ اور جو چیز لوگوں کو نفع دینے والی ہوتی ہے۔ وہ زمین میں ٹھہری رہتی ہے۔ اللہ تمام باتوں کو اسی طرح (کھول کر) بیان کرتا ہے۔"}, {"arabic": " لِلَّذِیۡنَ اسۡتَجَابُوۡا لِرَبِّہِمُ الۡحُسۡنٰی ؕؔ وَ الَّذِیۡنَ لَمۡ یَسۡتَجِیۡبُوۡا لَہٗ لَوۡ اَنَّ لَہُمۡ مَّا فِی الۡاَرۡضِ جَمِیۡعًا وَّ مِثۡلَہٗ مَعَہٗ لَافۡتَدَوۡا بِہٖ ؕ اُولٰٓئِکَ لَہُمۡ سُوۡٓءُ الۡحِسَابِ ۬ۙ وَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ بِئۡسَ الۡمِہَادُ ﴿٪۱۹﴾", "english": " For those who respond to their Lord is eternal good; and as for those who respond not to Him, if they had all that is in the earth and the like of it added thereto, they would readily ransom themselves therewith. It is these that shall have an evil reckoning, and their abode is Hell. What a wretched place of rest!", "french": " Pour ceux qui obéissent à leur Seigneur est le bien éternel ; et quant à ceux qui ne Lui répondent pas, s’ils avaient tout ce qui est sur la terre et encore une fois autant, ils se rançonneraient volontiers . Ceux-là auront un mauvais règlement de compte, et leur habitation sera l’Enfer. Quel misérable lieu de repos !", "german": " Denen, die auf ihren Herrn hören, wird das Gute; die aber nicht auf Ihn hören – hätten sie auch alles, was auf Erden ist, und noch einmal soviel dazu, sie würden sich gerne damit loskaufen. Diese sind es, die eine schlimme Abrechnung haben werden, und ihre Bleibe ist die Hölle. Welch ein elender Ruheplatz!", "spanish": " Para quienes responden a su Señor existe el bien eterno; y en cuanto a quienes no Le responden, si poseyeran uanto hay en la tierra y otro tanto igual añadido, lo darían fácilmente como rescate de sí mismos. Son éstos quienes tendrán una pésima cuenta y cuya morada es el Infierno. ¡Qué mal lugar de descanso!", "urdu": " جنہوں نے اپنے رب کا کہا مانا ان کے لئے کامیابی ہے اور جنہوں نے اس کا کہا نہیں مانا (ان کی یہ حالت ہوگی کہ) جو کچھ بھی زمین میں ہے اگر (سب) ان کا ہوتا اور اس کے برابر اور بھی‘ تو وہ اس سب مال کو دیکر (اپنے آپ کو عذاب سے) چھڑانے کی کوشش کرتے ان کے لئے برے انجام والا حساب (مقدر) ہے اور ان کا ٹھکانا جہنم ہے اور وہ رہنے کے لحاظ سے بہت بری (جگہ) ہے۔"}, {"arabic": " اَفَمَنۡ یَّعۡلَمُ اَنَّمَاۤ اُنۡزِلَ اِلَیۡکَ مِنۡ رَّبِّکَ الۡحَقُّ کَمَنۡ ہُوَ اَعۡمٰی ؕ اِنَّمَا یَتَذَکَّرُ اُولُوا الۡاَلۡبَابِ ﴿ۙ۲۰﴾", "english": " Is he, then, who knows that what has been revealed to thee from thy Lord is the truth, like one who is blind? But only those gifted with understanding will reflect:", "french": " Ainsi, celui qui sait que ce qui t’a été révélé par ton Seigneur est la vérité, est-il comme celui qui est aveugle ? Mais seuls les hommes doués d’intelligence feront attention ;", "german": " Ist denn der, der weiß, dass das, was zu dir von deinem Herrn hinabgesandt ward, die Wahrheit ist, gleich einem, der blind ist? (Jedoch) nur die mit Verstand Begabten wollen es bedenken.", "spanish": " ¿El que sabe que lo que te ha sido revelado por tu Señor es la verdad, es acaso comparable al que está ciego? Pero sólo reflexionarán los dotados de entendimiento;", "urdu": " جو شخص جانتا ہے کہ جو (کلام) تمہارے رب کی طرف سے تمہاری طرف اتارا گیا ہے وہ بالکل حق ہے کیا وہ اس شخص جیسا (ہوسکتا) ہے جو اندھا ہے (نہیں‘ کیونکہ) عقل رکھنے والے ہی نصیحت پکڑتے ہیں۔"}, {"arabic": " الَّذِیۡنَ یُوۡفُوۡنَ بِعَہۡدِ اللّٰہِ وَ لَا یَنۡقُضُوۡنَ الۡمِیۡثَاقَ ﴿ۙ۲۱﴾", "english": " Those who fulfil Allah’s pact, and break not the covenant;", "french": " Ceux qui accomplissent le pacte d’Allāh, et ne brisent pas l’alliance ;", "german": " Sie, die den Bund Allahs halten und den Vertrag nicht brechen;", "spanish": " Quienes cumplen el pacto de Al-lah y no incumplen la promesa;", "urdu": " ایسے لوگ جو اللہ کے (ساتھ کئے ہوئے) عہد کو پورا کرتے ہیں اور اس پختہ عہد کو نہیں توڑتے۔"}, {"arabic": " وَ الَّذِیۡنَ یَصِلُوۡنَ مَاۤ اَمَرَ اللّٰہُ بِہٖۤ اَنۡ یُّوۡصَلَ وَ یَخۡشَوۡنَ رَبَّہُمۡ وَ یَخَافُوۡنَ سُوۡٓءَ الۡحِسَابِ ﴿ؕ۲۲﴾", "english": " And those who join what Allah has commanded to be joined, and fear their Lord, and dread the evil reckoning;", "french": " Et ceux qui unissent ce qu’Allāh a commandé d’unir, et craignent leur Seigneur, et qui redoutent le règlement des mauvais comptes ;", "german": " und die, welche verbinden, was Allah zu verbinden geboten, und vor ihrem Herrn erbeben und Furcht haben vor dem Schlimmen der Abrechnung;", "spanish": " Y quienes unen lo que Al‑lah ha ordenado que sea unido, temen a su Señor, y sienten temor por la cuenta aciaga;", "urdu": " اور جو (لوگ) ان تعلقات کو ہمیشہ قائم رکھتے ہیں جن کے قائم رکھنے کا اللہ نے حکم دیا ہے اور اپنے رب سے ڈرتے ہیں اور برے (انجام والے) حساب سے خوف رکھتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ صَبَرُوا ابۡتِغَآءَ وَجۡہِ رَبِّہِمۡ وَ اَقَامُوا الصَّلٰوۃَ وَ اَنۡفَقُوۡا مِمَّا رَزَقۡنٰہُمۡ سِرًّا وَّ عَلَانِیَۃً وَّ یَدۡرَءُوۡنَ بِالۡحَسَنَۃِ السَّیِّئَۃَ اُولٰٓئِکَ لَہُمۡ عُقۡبَی الدَّارِ ﴿ۙ۲۳﴾", "english": " And those who persevere in seeking the favour of their Lord, and observe Prayer, and spend out of that with which We have provided them, secretly and openly, and repel evil with good. It is these who shall have the best reward of the final Abode —", "french": " Et ceux qui persévèrent à rechercher le plaisir de leur Seigneur, et observent la Prière et dépensent secrètement et ouvertement de ces dons et richesses que Nous leur avons accordés et repoussent le mal avec le bien. Ce sont ceux-là qui recevront la meilleure récompense de la Demeure finale –", "german": " und die standhaft bleiben im Verlangen nach dem Wohlgefallen ihres Herrn und das Gebet verrichten und von dem, was Wir ihnen gegeben haben, im verborgenen und öffentlich Spenden und das Böse durch das Gute abwehren – diese sind es, denen der Lohn der Wohnstatt wird:", "spanish": " Y quienes perseveran buscan­do el favor de su Señor, observan la Oración, gastan de lo que les hemos provisto, secreta y abiertamente, y echazan el mal con el bien. Son ellos quienes tendrán la mejor recompensa de la Morada final­ :", "urdu": " اور جنہوں نے اپنے رب کی رضا کی طلب میں ثابت قدمی سے کام لیا ہے اور نماز کو عمدگی سے ادا کیا ہے اور جو کچھ ہم نے انہیں دیا ہے اس میں سے چھپ کر (بھی) اور ظاہر (بھی ہماری راہ میں) خرچ کیا ہے اور (جو) بدی کو نیکی کے ذریعہ سے دور کرتے (رہتے) ہیں‘ انہی کے لئے اس گھر کا (بہترین) انجام (مقدر) ہے۔"}, {"arabic": " جَنّٰتُ عَدۡنٍ یَّدۡخُلُوۡنَہَا وَ مَنۡ صَلَحَ مِنۡ اٰبَآئِہِمۡ وَ اَزۡوَاجِہِمۡ وَ ذُرِّیّٰتِہِمۡ وَ الۡمَلٰٓئِکَۃُ یَدۡخُلُوۡنَ عَلَیۡہِمۡ مِّنۡ کُلِّ بَابٍ ﴿ۚ۲۴﴾", "english": " Gardens of Eternity. They shall enter them and also those who are righteous from among their fathers, and their wives and their children. And angels shall enter unto them from every gate, saying :", "french": " Les Jardins d’Eternité. Ils y entreront et aussi ceux qui sont justes de parmi leurs pères, et leurs femmes, et leurs enfants. Et des anges entreront auprès d’eux de chaque porte, en disant :", "german": " Gärten der Ewigkeit. Dort sollen sie eingehen und (auch) wer rechtschaffen ist von ihren Eltern und ihren Frauen und ihren Kindern. Und Engel sollen zu ihnen treten aus jeglichem Tor:", "spanish": " Jardines de Eternidad. Entrarán en ellos, como también los justos de entre sus padres, sus esposas y sus hijos. Y los ángeles penetrarán en ellos por todas sus puertas, diciendo:", "urdu": " یعنی مستقل رہائش کے باغات جن میں وہ (خود بھی) داخل ہوں گے اور ان کے بڑوں اور ان کی بیویوں اور ان کی نسلوں میں سے بھی۔ (وہ لوگ) جنہوں نے نیکی اختیار کی ہوگی (اس میں داخل ہوں گے) اور فرشتے ہر دروازہ سے ان کے پاس آئیں گے۔"}, {"arabic": " سَلٰمٌ عَلَیۡکُمۡ بِمَا صَبَرۡتُمۡ فَنِعۡمَ عُقۡبَی الدَّارِ ﴿ؕ۲۵﴾", "english": " ‘Peace be unto you, because you were steadfast; behold how excellent is the reward of the final Abode!’", "french": " »La paix soit avec vous, parce que vous avez été endurants ; voyez comme est excellente la récompense de la Demeure finale ! »", "german": " Friede sei auf euch, weil ihr standhaft wart; sehet, wie herrlich ist der Lohn der Wohnstatt!", "spanish": " \"La paz sea con vosotros, porque fuisteis perseverantes, ¡mirad que excelente es la recompensa de la Morada <em>final</em>!\"", "urdu": " (اور کہیں گے) تمہارے لئے سلامتی ہے کیونکہ تم ثابت قدم رہے پس (اب دیکھو کہ تمہارے لئے) اس گھر کا کیا ہی اچھا انجام ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یَنۡقُضُوۡنَ عَہۡدَ اللّٰہِ مِنۡۢ بَعۡدِ مِیۡثَاقِہٖ وَ یَقۡطَعُوۡنَ مَاۤ اَمَرَ اللّٰہُ بِہٖۤ اَنۡ یُّوۡصَلَ وَ یُفۡسِدُوۡنَ فِی الۡاَرۡضِ ۙ اُولٰٓئِکَ لَہُمُ اللَّعۡنَۃُ وَ لَہُمۡ سُوۡٓءُ الدَّارِ ﴿۲۶﴾", "english": " And those who break the covenant of Allah, after having established it and cut asunder what Allah has commanded to be joined, and act corruptly in the earth — on them is the curse and they shall have a grievous abode.", "french": " Et ceux qui brisent le pacte d’Allāh après l’avoir établi, et qui rompent ce qu’Allāh a ordonné d’unir, et qui créent le désordre sur la terre, sur ceux-là pèse la malédiction d’Allāh , et ils auront une demeure très désagréable.", "german": " Die aber, die den Bund Allahs brechen, nach dessen Bekräftigung, und trennen, was Allah zu verbinden geboten, und Unheil stiften auf Erden, auf ihnen ist der Fluch und sie haben eine schlimme Wohnstatt.", "spanish": " Mas para quienes rompen el pacto de Al‑lah después de establecerlo y cortan con ello lo que Al‑lah ha ordenado que sea unido, actuando con corrupción en la tierra, sobre ellos caerá la maldición y tendrán una morada deplorable.", "urdu": " اور جو اللہ کے (ساتھ کیے ہوئے) پختہ عہد کو پکے اقرار کے بعد توڑتے ہیں اور جس تعلق کے قائم کرنے کا اللہ نے حکم دیا تھا اسے پارہ پارہ کرتے ہیں اور زمین میں فساد کرتے ہیں ان کے لئے (اللہ کی طرف سے) لعنت مقدر ہے اور ان کے لئے ایک برا گھر (بھی) مقرر ہے۔"}, {"arabic": " اَللّٰہُ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ وَ یَقۡدِرُ ؕ وَ فَرِحُوۡا بِالۡحَیٰوۃِ الدُّنۡیَا ؕ وَ مَا الۡحَیٰوۃُ الدُّنۡیَا فِی الۡاٰخِرَۃِ اِلَّا مَتَاعٌ ﴿٪۲۷﴾", "english": " Allah enlarges His provision for whomsoever He pleases and straitens it for whomsoever He pleases . And they rejoice in the present life, while the present life is but a temporary enjoyment as compared with that which is to come.", "french": " Allāh accroît Sa provision pour qui Il veut et Il la restreint pour qui Il veut . Et ils se réjouissent de la vie d’ici-bas, alors que la vie d’ici-bas n’est qu’une jouissance temporaire comparée à l’au-delà.", "german": " Allah erweitert und beschränkt die Mittel zum Unterhalt, wem Er will. Sie freuen sich des Lebens hienieden, doch das Leben hienieden ist nur ein vergängliches Gut im Vergleich zu dem künftigen.", "spanish": " Al‑lah prodiga Su provisión a quien le place y la restringe a quién quiere. Ellos se regocijan n la vida presente, aunque esta vida no es más que un goce temporal comparada con la que ha de venir.", "urdu": " اللہ جس کے لئے پسند کرتا ہے (اس کے لئے) رزق کو فراخ کر دیتا ہے اور (جس کے لئے چاہتا ہے اس کے لئے) تنگ کر دیتا ہے اور یہ (لوگ) اس ورلی زندگی پر (ہی) خوش ہوگئے ہیں۔ حالانکہ یہ ورلی زندگی آخرت کے مقابلہ میں محض ایک وقتی سامان ہے۔"}, {"arabic": " وَ یَقُوۡلُ الَّذِیۡنَ کَفَرُوۡا لَوۡ لَاۤ اُنۡزِلَ عَلَیۡہِ اٰیَۃٌ مِّنۡ رَّبِّہٖ ؕ قُلۡ اِنَّ اللّٰہَ یُضِلُّ مَنۡ یَّشَآءُ وَ یَہۡدِیۡۤ اِلَیۡہِ مَنۡ اَنَابَ ﴿ۖۚ۲۸﴾", "english": " And those who disbelieve say, ‘Why is not a Sign sent down to him from his Lord?’ Say, ‘Allah lets go astray those whom He wills and guides to Himself those who turn to Him :", "french": " Et ceux qui ne croient pas disent : « Pourquoi un Signe ne descend-il pas sur lui de son Seigneur ? » Dis : « En vérité, Allāh laisse s’égarer qui Il veut, et guide vers Lui celui qui se tourne vers Lui ;", "german": "", "spanish": " Y los incrédulos dicen: \"¿Por qué no se le ha revelado un Signo de su Señor?\". Diles: \"Al‑lah deja que se extravíen quienes El quiere y guía a Sí mismo a quienes acuden <em>a El;</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und jene, die ungläubig sind, sagen: \"Warum ist kein Zeichen herabgesandt worden zu ihm von seinem Herrn?\" Sprich: \"Allah lässt zugrunde gehen, wen Er will, und leitet zu Sich die, welche sich bekehren:", "urdu": " اور جن لوگوں نے (تمہارا) انکار کیا ہے وہ کہتے ہیں کہ اس پر اس کے رب کی طرف سے کوئی نشان کیوں نہیں اتارا گیا۔ تو کہہ اللہ جسے چاہتا ہے ہلاک کر دیتا ہے اور جو (اس کی طرف) مائل ہو اس کی اپنی طرف رہنمائی کرتا ہے۔"}, {"arabic": " اَلَّذِیۡنَ اٰمَنُوۡا وَ تَطۡمَئِنُّ قُلُوۡبُہُمۡ بِذِکۡرِ اللّٰہِ ؕ اَلَا بِذِکۡرِ اللّٰہِ تَطۡمَئِنُّ الۡقُلُوۡبُ ﴿ؕ۲۹﴾", "english": " ‘Those who believe, and whose hearts find comfort in the remembrance of Allah. Aye! it is in the remembrance of Allah that hearts can find comfort;", "french": " Ceux qui croient et dont les cœurs trouvent la tranquillité dans le souvenir d’Allāh. Oui, c’est dans le souvenir d’Allāh que les cœurs trouvent la tranquillité ;", "german": " Sie, die glauben und deren Herzen Trost finden im Gedenken Allahs. Ja! im Gedenken Allahs ist´s, dass Herzen Trost finden können.", "spanish": " Quienes creen y cuyos cora­zones hallan sosiego en el recuerdo de Al‑lah. ¡Ay! En el recuerdo de Al‑lah es en lo que los corazones pueden hallar sosiego;", "urdu": " یعنی جو ایمان لائے ہوں اور ان کے دل اللہ کی یاد سے اطمینان پاتے ہوں (ان کو ہدایت دیتا ہے) پس سمجھ لو کہ اللہ کی یاد ہی سے دل اطمینان پاتے ہیں۔"}, {"arabic": " اَلَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ طُوۡبٰی لَہُمۡ وَ حُسۡنُ مَاٰبٍ ﴿۳۰﴾", "english": " ‘Those who believe and do good works — happiness shall be theirs, and an excellent place of return.’", "french": " Ceux qui croient et font de bonnes œuvres – la Félicité est décrétée pour eux ainsi qu’un excellent lieu de retour. »", "german": "", "spanish": " \"Para quienes creen y hacen buenas obras: suya será la felicidad y un excelente lugar de retorno.\"", "urdu": " جو لوگ ایمان لائے ہیں اور انہوں نے نیک (اور مناسب حال) عمل کئے ہیں ان کے لئے (بڑی) قابل رشک حالت اور بہترین واپسی کی جگہ (مقدر) ہے۔"}, {"arabic": " کَذٰلِکَ اَرۡسَلۡنٰکَ فِیۡۤ اُمَّۃٍ قَدۡ خَلَتۡ مِنۡ قَبۡلِہَاۤ اُمَمٌ لِّتَتۡلُوَا۠ عَلَیۡہِمُ الَّذِیۡۤ اَوۡحَیۡنَاۤ اِلَیۡکَ وَ ہُمۡ یَکۡفُرُوۡنَ بِالرَّحۡمٰنِ ؕ قُلۡ ہُوَ رَبِّیۡ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ عَلَیۡہِ تَوَکَّلۡتُ وَ اِلَیۡہِ مَتَابِ ﴿۳۱﴾", "english": " Thus have We sent thee to a people, before whom other peoples have passed away, that thou mayest recite to them what We have revealed to thee, yet they disbelieve in the Gracious God . Say, ‘He is my Lord; there is no God but He. In Him do I put my trust and towards Him is my return.’", "french": " C’est ainsi que Nous t’avons envoyé à un peuple que d’autres peuples, maintenant disparus, ont devancé, afin que tu puisses leur réciter ce que Nous t’avons révélé, car ils nient le Dieu Gracieux. Dis : « Il est mon Seigneur ; il n’y a de dieu que Lui. En Lui je place ma confiance, et c’est vers Lui qu’ est mon retour. »", "german": " Also haben Wir dich zu einem Volke gesandt vor dem bereits andere Völker dahingegangen sind, auf dass du ihnen verkünden mögest, was Wir dir offenbarten, und doch glauben sie nicht an den Gnädigen. Sprich: \"Er ist mein Herr; es gibt keinen Gott außer Ihm. Auf Ihn setze ich mein Vertrauen und zu Ihm ist meine Heimkehr.\"", "spanish": " Así te enviamos a un pueblo, antes del cual otros pueblos antecedieron, para que le relates lo que te hemos revelado; y sin embargo, no creen en el Dios Clemente. Diles: \"El es mi Señor; no hay otro Dios sino El. En El pongo mi confianza y hacia El será mi retorno.\"", "urdu": " اسی (قسم کا انجام پانے کے) لئے ہم نے تجھے ایک ایسی قوم میں جس سے پہلے کئی قومیں (آنے والے کی راہ دیکھتی) گذر چکی تھیں بھیجا ہے تا کہ جو (کلام) ہم نے تیری طرف وحی کیا ہے تو وہ انہیں پڑھ کر سنائے کیونکہ وہ رحمن (کے فیضان) کا انکار کر رہے ہیں تو کہہ یہ میرا رب ہے اس کے سوا کوئی معبود نہیں اسی پر میں نے بھروسا کیا ہے اور اسی کی طرف ہر آن میرا رجوع ہے۔"}, {"arabic": " وَ لَوۡ اَنَّ قُرۡاٰنًا سُیِّرَتۡ بِہِ الۡجِبَالُ اَوۡ قُطِّعَتۡ بِہِ الۡاَرۡضُ اَوۡ کُلِّمَ بِہِ الۡمَوۡتٰی ؕ بَلۡ لِّلّٰہِ الۡاَمۡرُ جَمِیۡعًا ؕ اَفَلَمۡ یَایۡـَٔسِ الَّذِیۡنَ اٰمَنُوۡۤا اَنۡ لَّوۡ یَشَآءُ اللّٰہُ لَہَدَی النَّاسَ جَمِیۡعًا ؕ وَ لَا یَزَالُ الَّذِیۡنَ کَفَرُوۡا تُصِیۡبُہُمۡ بِمَا صَنَعُوۡا قَارِعَۃٌ اَوۡ تَحُلُّ قَرِیۡبًا مِّنۡ دَارِہِمۡ حَتّٰی یَاۡتِیَ وَعۡدُ اللّٰہِ ؕ اِنَّ اللّٰہَ لَا یُخۡلِفُ الۡمِیۡعَادَ ﴿٪۳۲﴾", "english": " And if there were a Qur’an by which mountains could be moved or by which the earth could be cut asunder or by which the dead could be spoken to, they would not believe in it . Nay, the matter rests entirely with Allah. Have not the believers yet come to know that, if Allah had enforced His will, He could have surely guided all mankind? And as for those who disbelieve, disaster shall not cease to befall them for what they have wrought or to alight near their home, until the promise of Allah comes to pass. Surely, Allah fails not in His promise.", "french": " Et s’il existait un Coran par lequel des montagnes pouvaient être déplacées, ou par lequel la terre pouvait être coupée en morceaux, ou par lequel on pouvait parler aux morts, ils n’y croiraient toujours pas. En fait, la question dépend entièrement d’Allāh. Les croyants n’ont-ils pas encore réalisé que si Allāh avait imposé Sa volonté, Il aurait assurément guidé toute l’humanité ? Et quant à ceux qui ne croient pas, des malheurs ne cesseront de leur survenir pour ce qu’ils ont commis, ou de descendre tout près de leurs habitations, jusqu’à ce que la promesse d’Allāh soit réalisée. Assurément, Allāh ne manque pas à Sa promesse.", "german": " Und gäbe es auch einen Qur-ân, durch den Berge versetzt oder die Erde gespalten oder durch den zu den Toten gesprochen werden könnte (sie würden doch nicht an ihn glauben). Nein! Die Sache ruht völlig bei Allah. Haben denn die Gläubigen nicht (längst) erfahren, dass, hätte Allah Seinen Willen erzwungen, Er sicherlich der ganzen Menschheit hätte den Weg weisen können? Und das Unheil wird nicht aufhören, die Ungläubigen zu treffen um dessentwillen, was sie gewirkt, oder sich nahe bei ihren Wohnstätten niederzulassen, bis Allahs Verheißung sich erfüllt. Wahrlich, Allah versäumt die Verheißung nicht.", "spanish": " Pues aunque hubiese un Corán por el que se movieran las montañas, por el que la tierra se partiera en pedazos, o pudiera hablarse a los muertos, no creerían en él . No, el asunto está totalmente en manos de Al‑lah. ¿Aún no se han dado cuenta los creyentes que si Al‑lah hubiese ejecutado Su vo luntad, habría guiado ciertamente a toda la humanidad? En cuanto a los incrédulos, las calamidades no dejarán de azotarlos por lo que han forjado, ni dejará de caer cerca de sus hogares, hasta que se cumpla la promesa de Al‑lah. En verdad, Al‑lah no falla en Su promesa.", "urdu": " اور اگر کوئی ایسا قرآن ہو جس کے ذریعہ سے (نشان کے طور پر) پہاڑوں کو (ان کی جگہ سے ہٹا کر) چلایا گیا ہو یا اس کے ذریعہ سے زمین کو ٹکڑے (ٹکڑے) کیا گیا ہو یا اس کے ذریعہ سے مردوں سے باتیں کی گئی ہوں (تو کیا یہ لوگ اس پر ایمان لے آئیں گے؟ ہرگز نہیں) بلکہ (ایمان لانے کا) فیصلہ پورے طور پر اللہ کے ہاتھ میں ہے۔ کیا جو (لوگ) ایمان لائے ہیں انہیں (اب تک) معلوم نہیں ہوا کہ اگر اللہ چاہتا تو سب لوگوں کو ہدایت دے دیتا اور (اے رسول)! جن لوگوں نے تمہارا انکار کیا ہے ان کے اس عمل کی وجہ سے ہمیشہ کوئی (نہ کوئی) سخت آفت ان پر آتی رہے گی۔ یا ان کے گھر کے قریب نازل ہوتی رہے گی یہاں تک کہ اللہ کا (آخری) وعدہ (یعنی فتح مکہ) آجائے گا۔ اللہ اس وعدہ کے خلاف ہرگز نہیں کرے گا۔"}, {"arabic": " وَ لَقَدِ اسۡتُہۡزِیٴَ بِرُسُلٍ مِّنۡ قَبۡلِکَ فَاَمۡلَیۡتُ لِلَّذِیۡنَ کَفَرُوۡا ثُمَّ اَخَذۡتُہُمۡ ۟ فَکَیۡفَ کَانَ عِقَابِ ﴿۳۳﴾", "english": " And surely, Messengers have been mocked at before thee; but I granted respite to those who disbelieved. Then I seized them, and how was then My punishment!", "french": " Et assurément, des Messagers avant toi ont été raillés ; mais J’ai accordé du répit à ceux qui mécrurent. Puis Je les ai saisis, et quel fut terrible Mon châtiment !", "german": " Und gewiss sind schon vor dir Gesandte verspottet worden, doch Ich gewährte Frist denen, die ungläubig waren. Dann erfasste Ich sie, und wie war Meine Strafe!", "spanish": " En verdad, los Mensajeros anteriores a ti fueron objeto de burlas; mas Yo concedí un respiro a los incrédulos. Después caí sobre ellos y ¡cómo fue entonces Mi castigo!", "urdu": " اور تجھ سے پہلے رسولوں سے (بھی) استہزا کیا گیا تھا جس پر میں نے ان لوگوں کو جنہوں نے انکار کیا تھا (کچھ عرصہ تک کے لئے) ڈھیل دی پھر میں نے ان کو تباہ کر دیا۔ اب دیکھو میری سزا کیسی (سخت) تھی۔"}, {"arabic": " اَفَمَنۡ ہُوَ قَآئِمٌ عَلٰی کُلِّ نَفۡسٍۭ بِمَا کَسَبَتۡ ۚ وَ جَعَلُوۡا لِلّٰہِ شُرَکَآءَ ؕ قُلۡ سَمُّوۡہُمۡ ؕ اَمۡ تُنَبِّـُٔوۡنَہٗ بِمَا لَا یَعۡلَمُ فِی الۡاَرۡضِ اَمۡ بِظَاہِرٍ مِّنَ الۡقَوۡلِ ؕ بَلۡ زُیِّنَ لِلَّذِیۡنَ کَفَرُوۡا مَکۡرُہُمۡ وَ صُدُّوۡا عَنِ السَّبِیۡلِ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَمَا لَہٗ مِنۡ ہَادٍ ﴿۳۴﴾", "english": " Will then He, Who stands over every soul to note what it earns, let them go unpunished ? Yet, they ascribe partners to Allah. Say, ‘Name them.’ Would you inform Him of what He does not know in the earth? Or, is it a mere empty saying? Nay, but the design of the disbelievers has been made to appear beautiful in their eyes, and they have been kept back from the right way. And he whom Allah lets go astray shall have no guide.", "french": " Ainsi, Celui Qui surveille chaque âme pour noter ce qu’elle acquiert, les laissera-t-Il s’en sortir impunis ? Cependant, ils attribuent des associés à Allāh. Dis : « Nommez-les. » Ou bien, Le renseignerez-vous sur ce qu’Il ne sait pas sur la terre ? Où sont-ce des paroles pour faire voir ? Non, mais le dessein des mécréants a été embelli à leurs yeux, et ils ont été empêchés de suivre le bon chemin. Et celui qu’Allāh laisse s’égarer n’aura aucun guide.", "german": " Wird denn der, Der über allen wacht, was sie tun (sie nicht fragen)? Dennoch stellen sie Allah Götter zur Seite. Sprich: \"Nennet sie.\" Wolltet ihr Ihm etwas verkünden, was Er auf der Erde nicht kennt? Oder ist es nur leere Rede? Nein, aber der böse Plan der Ungläubigen ist ihnen schön gemacht, und sie sind abgehalten worden vom Weg. Und wen Allah zum Irrenden erklärt, der soll keinen Führer finden.", "spanish": " ¿Acaso Quien está sobre cada alma para anotar lo que se merece, los va a dejar sin castigo? Y sin embargo, adscriben partícipes a Al‑lah. Diles: “¡Nombradlos!” ¿Podéis informarle de algo que desconozca de la tierra? ¿Se trata simplemente de una forma de hablar sin sentido? No, pero se ha hecho que la intriga de los incrédulos apareciera favorable ante sus ojos y han sido apartados del camino recto. Pues aquél a quien Al‑lah deja que se extravíe no tendrá guía.", "urdu": " تو کیا وہ (خدا) جو ہر ایک شخص کے اعمال پر نگران ہے (ان سے نہ پوچھے گا) اور انہوں نے تو اللہ کے کئی ایک شریک (بھی) بنائے (ہوئے) ہیں (ان سے) کہو۔ تم ان (بناوٹی خداٶں) کے نام (تو) بتاٶ۔ یا کیا تم (لوگ) اس (خدا) کو کوئی ایسی بات بتاٶ گے جو زمین پر موجود تو ہے لیکن وہ (اسے) نہیں جانتا۔ یا تم صرف منہ سے یہ باتیں کرتے ہو بلکہ جن لوگوں نے انکار کیا ہے ان کو ان کی (اپنی ہی) فریب کاری خوبصورت (شکل میں) دکھائی گئی ہے اور انہیں درست راستہ سے ہٹا دیا گیا ہے اور جسے اللہ ہلاک کرے اسے راہ دکھانے والا کوئی نہیں (مل سکتا) ۔"}, {"arabic": " لَہُمۡ عَذَابٌ فِی الۡحَیٰوۃِ الدُّنۡیَا وَ لَعَذَابُ الۡاٰخِرَۃِ اَشَقُّ ۚ وَ مَا لَہُمۡ مِّنَ اللّٰہِ مِنۡ وَّاقٍ ﴿۳۵﴾", "english": " For them is a punishment in the present life; and, surely, the punishment of the Hereafter is harder, and they will have no defender against Allah.", "french": " Pour eux il y a un châtiment dans la vie d’ici-bas ; et, assurément, le châtiment de l’au-delà est plus dur, et ils n’auront aucun protecteur contre Allāh.", "german": " Für sie ist eine Strafe im Leben hienieden; und die Strafe des Jenseits ist gewiss härter, und sie werden keinen Beschützer haben vor Allah.", "spanish": " Para ellos hay reservado un castigo en la vida presente; mas en verdad el castigo del Más Allá es más duro, y no tendrán defensor contra Al‑lah.", "urdu": " ان کے لئے ایک عذاب (تو) اس ورلی زندگی میں (ہی مقدر) ہے۔ اور آخرت کا عذاب یقیناً اور (بھی) سخت ہوگا۔ اور انہیں اللہ (کے عذاب) سے کوئی بھی بچانے والا نہیں ہوگا۔"}, {"arabic": " مَثَلُ الۡجَنَّۃِ الَّتِیۡ وُعِدَ الۡمُتَّقُوۡنَ ؕ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ؕ اُکُلُہَا دَآئِمٌ وَّ ظِلُّہَا ؕ تِلۡکَ عُقۡبَی الَّذِیۡنَ اتَّقَوۡا ٭ۖ وَّ عُقۡبَی الۡکٰفِرِیۡنَ النَّارُ ﴿۳۶﴾", "english": " The similitude of the Heaven promised to the God-fearing is, that through it flow streams: its fruit is everlasting, and so is its shade. That is the reward of those who are righteous; and the reward of the disbelievers is Fire.", "french": " La similitude du Paradis promis à ceux qui craignent Allāh est que des ruisseaux coulent en dessous ; son fruit est perpétuel, comme l’est son ombrage. C’est là la récompense de ceux qui agissent avec droiture ; et la récompense des mécréants est le Feu.", "german": " Das Bild des Himmels, den Gottesfürchtigen verheißen: Ströme durchfließen ihn, seine Frucht ist immerwährend, wie sein Schatten. Das ist der Lohn derer, die rechtschaffen sind; und der Lohn der Ungläubigen ist das Feuer.", "spanish": " La definición del Cielo prometido a los que temen a Dios es que por l corren ríos: sus frutos son permanentes, como también su sombra. Esta es la recompensa de los justos; mas la recompensa de los incrédulos es el Fuego.", "urdu": " اس جنت کا مثالی بیان جس کا پرہیز گاروں کو وعدہ دیا گیا ہے (یہ ہے کہ) اس کے (درختوں کے سایہ) تلے نہریں بہتی ہوں گی اس کا پھل بھی ہمیشہ رہنے والا ہوگا اور اس کا سایہ (بھی) یہ ان (لوگوں) کا انجام ہوگا جنہوں نے تقویٰ اختیار کیا اور انکار کرنے والوں کا انجام (دوزخ کی) آگ ہے۔"}, {"arabic": " وَ الَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَفۡرَحُوۡنَ بِمَاۤ اُنۡزِلَ اِلَیۡکَ وَ مِنَ الۡاَحۡزَابِ مَنۡ یُّنۡکِرُ بَعۡضَہٗ ؕ قُلۡ اِنَّمَاۤ اُمِرۡتُ اَنۡ اَعۡبُدَ اللّٰہَ وَ لَاۤ اُشۡرِکَ بِہٖ ؕ اِلَیۡہِ اَدۡعُوۡا وَ اِلَیۡہِ مَاٰبِ ﴿۳۷﴾", "english": " And those to whom We have given the Book rejoice in what has been revealed to thee. And of the different parties there are some who deny a part thereof. Say, ‘I am only commanded to worship Allah and not to set up equals to Him. Unto Him do I call, and unto Him is my return.’", "french": " Et ceux à qui Nous avons donné le Livre se réjouissent de ce qui t’a été révélé. Et parmi les différents groupes, il y en a certains qui en renient une partie. Dis : « J’ai seulement reçu le commandement d’adorer Allāh, et de ne pas Lui attribuer des associés. C’est vers Lui que j’appelle et c’est vers Lui qu’ est mon retour. »", "german": " Und die, denen Wir die Schrift gegeben, freuen sich über das, was zu dir hinabgesandt ward. Und unter den Stämmen sind einige, die einen Teil davon leugnen. Sprich: \"Mir ward nur geboten, Allah zu dienen, und nicht, Ihm Götter zur Seite zu stellen. Zu Ihm rufe ich und zu Ihm ist meine Heimkehr.\"", "spanish": " Mas aquellos a quienes concedimos el Libro se regocijan de lo que e ha sido revelado. Y entre los diferentes grupos hay algunos que niegan una parte de él. Diles: \"Sólo se me ha ordenado adorar a Al‑lah y no elevar partícipes iguales a El. A El invoco y hacia El será mi retorno.\"", "urdu": " اور جن لوگوں کو ہم نے کتاب دی ہے وہ اس (کلام الٰہی) سے جو تجھ پر نازل کیا گیا ہے خوش ہوتے ہیں اور ان (مختلف) گروہوں میں سے (بعض) ایسے (بھی) ہیں جو اس کے بعض (حصہ) کا انکار کرتے ہیں۔ تم کہو‘ مجھے (تو) یہی حکم دیا گیا ہے کہ میں اللہ کی عبادت کروں اور (کسی کو) اس کا شریک نہ ٹھہراٶں۔ میں اس کی طرف (تم) کو بلاتا ہوں اور اسی طرف میں (بھی) رجوع کرتا ہوں۔"}, {"arabic": " وَ کَذٰلِکَ اَنۡزَلۡنٰہُ حُکۡمًا عَرَبِیًّا ؕ وَ لَئِنِ اتَّبَعۡتَ اَہۡوَآءَہُمۡ بَعۡدَ مَا جَآءَکَ مِنَ الۡعِلۡمِ ۙ مَا لَکَ مِنَ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا وَاقٍ ﴿٪۳۸﴾", "english": " And thus have We revealed it as a clear judgment. And if thou follow their evil desires after the knowledge that has come to thee, thou shalt have no friend nor defender against Allah.", "french": " Et ainsi l’avons-Nous révélé comme un jugement clair et explicite. Et si tu suis leurs mauvais désirs, après la connaissance qui t’est venue, tu n’auras ni ami ni protecteur contre Allāh.", "german": " Also haben Wir es hinabgesandt, als eine klare Weisung. Und wenn du ihren bösen Gelüsten folgst nach dem, was an Wissen zu dir gekommen, so sollst du keinen Freund noch Beschützer haben vor Allah.", "spanish": " De este modo lo revelamos como juicio evidente. Si sigues sus malvados deseos después de que te ha llegado el conocimiento, no tendrás amigo ni defensor contra Al‑lah.", "urdu": " اور اسی طرح ہم نے اسے ایک مفصل حکم کی صورت میں اتارا ہے اور (اے مخاطب) اگر تو نے اس علم کے بعد جو تجھے حاصل ہو چکا ہے ان (کفار) کی خواہشات کی پیروی کی‘ تو اللہ کے مقابلہ میں نہ (تو) تیرا کوئی دوست ہوگا اور نہ کوئی بچانے والا (ہوگا) ۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا رُسُلًا مِّنۡ قَبۡلِکَ وَ جَعَلۡنَا لَہُمۡ اَزۡوَاجًا وَّ ذُرِّیَّۃً ؕ وَ مَا کَانَ لِرَسُوۡلٍ اَنۡ یَّاۡتِیَ بِاٰیَۃٍ اِلَّا بِاِذۡنِ اللّٰہِ ؕ لِکُلِّ اَجَلٍ کِتَابٌ ﴿۳۹﴾", "english": " And, indeed, We sent Messengers before thee, and We gave them wives and children. And it is not possible for a Messenger to bring a Sign save by the command of Allah. For every term there is a divine decree.", "french": " Et en vérité, Nous avons envoyé des Messagers avant toi, et Nous leur avons donné des épouses et des enfants. Et il n’est pas possible à un Messager d’apporter de Signe sauf par le commandement d’Allāh. Pour chaque terme, il y a un décret divin .", "german": " Wahrlich, schon vor dir entsandten Wir Gesandte und gaben ihnen Frauen und Kinder. Und es ist nicht möglich für einen Gesandten, ein Zeichen zu bringen, es sei denn auf Allahs Geheiß. Alles geschieht nach (Seinem) Ratschluss.", "spanish": " En verdad enviamos a Mensajeros antes que a ti, y les dimos esposas e hijos. Y no es posible que un Mensajero traiga una Señal, salvo por orden de Al‑lah. Para cada plazo hay un decreto divino.", "urdu": " اور ہم نے تجھ سے پہلے (بھی) یقیناً کئی رسول بھیجے تھے اور انہیں بیویاں اور بچے بھی دئیے تھے اور کسی رسول کے لئے ممکن نہ تھا کہ وہ اللہ کے اذن کے سوا (اپنی قوم کے پاس) کوئی نشان لاتا۔ ہر ایک پروگرام کے لئے ایک میعاد مقرر ہے۔"}, {"arabic": " یَمۡحُوا اللّٰہُ مَا یَشَآءُ وَ یُثۡبِتُ ۚۖ وَ عِنۡدَہٗۤ اُمُّ الۡکِتٰبِ ﴿۴۰﴾", "english": " Allah effaces what He wills and established what He wills , and with Him is the source of all commandments.", "french": " Allāh efface ce qu’Il veut et établit ce qu’Il veut et avec Lui est la source de toutes les ordonnances.", "german": " Allah löscht aus und bestätigt, was Er will, und bei Ihm ist der Ursprung (aller) Gebote.", "spanish": " Al‑lah borra lo que quiere y confirma lo que desea, pues en El está la fuente de todos los decretos.", "urdu": " جس چیز کو اللہ چاہتا ہے مٹاتا ہے اور (جسے چاہتا ہے) قائم کرتا ہے اور اسی کے پاس (تمام) احکام کی اصل (اور جڑ) ہے۔"}, {"arabic": " وَ اِنۡ مَّا نُرِیَنَّکَ بَعۡضَ الَّذِیۡ نَعِدُہُمۡ اَوۡ نَتَوَفَّیَنَّکَ فَاِنَّمَا عَلَیۡکَ الۡبَلٰغُ وَ عَلَیۡنَا الۡحِسَابُ ﴿۴۱﴾", "english": " And whether We make thee see the fulfilment of some of the things with which We threaten them or whether We make thee die, it makes little difference , for on thee lies only the delivery of the Message, and on Us the reckoning.", "french": " Et que Nous te fassions voir, pendant ta propre vie, l’accomplissement de certaines des choses dont Nous les menaçons, ou que Nous te fassions mourir, cela fait peu de différence , car il ne t’incombe que de transmettre clairement le Message et c’est à Nous de régler les comptes.", "german": " Und ob Wir dich einen Teil von dem sehen lassen, was Wir ihnen androhen, oder ob Wir dich sterben lassen – dir obliegt nur die Verkündung und Uns die Abrechnung.", "spanish": " Tanto si te hacemos ver el cumplimiento de algunas de las osas con las que les amenazamos como si te hacemos morir, poca importancia tiene, ya que a ti corresponde únicamente la entrega del Mensaje y a Nosotros la cuenta.", "urdu": " اور جس (عذاب کے بھیجنے) کا ہم ان سے وعدہ کرتے ہیں اگر ہم اس کا کوئی حصہ تیرے سامنے بھیج کر تجھے دکھا دیں (تو تو بھی ان کا انجام دیکھ لے گا) اور (اگر) ہم (اس گھڑی سے پہلے) تجھے وفات دے دیں (تو تجھے مابعدالموت اس کی حقیقت معلوم ہو جائے گی کیونکہ) تیرے ذمہ (ہمارے حکم اور پیغام کا) صرف پہنچا دینا ہے اور ان کا حساب لینا ہمارے ذمہ ہے۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّا نَاۡتِی الۡاَرۡضَ نَنۡقُصُہَا مِنۡ اَطۡرَافِہَا ؕ وَ اللّٰہُ یَحۡکُمُ لَا مُعَقِّبَ لِحُکۡمِہٖ ؕ وَ ہُوَ سَرِیۡعُ الۡحِسَابِ ﴿۴۲﴾", "english": " Do they not see that We are visiting the land, reducing it from its outlying borders? And Allah judges; there is none to reverse His judgment. And He is swift at reckoning.", "french": " Ne voient-ils pas que Nous sommes à réduire la terre à partir de ses frontières ? Et Allāh juge ; il n’y a personne pour renverser Son jugement. Et Il est Celui Qui est prompt à régler les comptes.", "german": " Sehen sie denn nicht, dass Wir in das Land kommen und es einengen an seinen Enden? Und Allah richtet; da ist keiner, der Seinen Richtspruch umstoßen könnte. Und Er ist schnell im Abrechnen.", "spanish": " ¿Acaso no estamos reduciendo su terreno por sus fronteras?. Mas Al‑lah juzga: nadie puede revocar Su sentencia. Pues El es Rápido en la cuenta.", "urdu": " اور کیا انہوں نے دیکھا نہیں کہ ہم ملک کو اس کی تمام اطراف سے کم کرتے چلے آرہے ہیں۔ اور فیصلہ (تو) اللہ کرتا ہے۔ کوئی اس کے فیصلہ کو تبدیل کرنے والا نہیں۔ اور وہ جلد حساب لینے والا ہے۔"}, {"arabic": " وَ قَدۡ مَکَرَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ فَلِلّٰہِ الۡمَکۡرُ جَمِیۡعًا ؕ یَعۡلَمُ مَا تَکۡسِبُ کُلُّ نَفۡسٍ ؕ وَ سَیَعۡلَمُ الۡکُفّٰرُ لِمَنۡ عُقۡبَی الدَّارِ ﴿۴۳﴾", "english": " And those who were before them did also devise plans, but all effective devising of plans belongs to Allah. He knows what every soul earns; and the disbelievers shall soon know whose will be the final reward of this abode.", "french": " Et leurs devanciers aussi firent des plans, mais c’est à Allāh qu’appartient toute formulation efficace de plans. Il sait ce qu’acquiert chaque âme ; et les mécréants ne tarderont pas à savoir qui recevra la meilleure récompense de la Demeure finale .", "german": " Die vor ihnen waren, haben auch Pläne geschmiedet, doch alles Planen ist Allahs. Er weiß, was jeder verdient; und die Ungläubigen werden bald erfahren, wem der endgültige Lohn (dieser) Wohnstatt wird.", "spanish": " Quienes existieron antes de ellos idearon también planes, pero toda preparación efectiva de planes pertenece a Al‑lah. El sabe lo que se merece cada alma, y los incrédulos sabrán pronto de quién será la recompensa final de esta morada.", "urdu": " اور جو لوگ ان سے پہلے تھے‘ انہوں نے (بھی انبیاء کے خلاف) تدبیریں کی تھیں (مگر ان کی کوئی پیش نہ گئی) پس تدبیر کرنا تو کلی طور پر اللہ ہی کے اختیار میں ہے۔ ہر شخص جو کچھ (بھی) کرتا ہے وہ (اللہ) اسے جانتا ہے اور ان کافروں کو جلد ہی معلوم ہو جائے گا کہ اس آنے والے گھر کا (اچھا) انجام کس کے لئے ہے۔"}, {"arabic": " وَ یَقُوۡلُ الَّذِیۡنَ کَفَرُوۡا لَسۡتَ مُرۡسَلًا ؕ قُلۡ کَفٰی بِاللّٰہِ شَہِیۡدًۢا بَیۡنِیۡ وَ بَیۡنَکُمۡ ۙ وَ مَنۡ عِنۡدَہٗ عِلۡمُ الۡکِتٰبِ ﴿٪۴۴﴾", "english": " And those who disbelieve say, ‘Thou art not a Messenger.’ Say, ‘Sufficient is Allah as a Witness between me and you, and so is he who possesses knowledge of the Book.’", "french": " Et ceux qui ne croient pas disent : « Tu n’es pas un Messager. » Dis : « Allāh suffit comme Témoin entre moi et vous, de même que celui qui possède la connaissance du Livre. »", "german": " Die Ungläubigen sprechen: \"Du bist kein Gesandter.\" Sprich: \"Allah genügt als Zeuge zwischen mir und euch, und auch der, der Kenntnis der Schrift hat.\"", "spanish": " Mas los incrédulos dicen: \"Tú no eres Mensajero\". Diles: \"Me basta con Al‑lah como Testigo entre vosotros y yo, <em>así como </em>quien posee el conocimiento del Libro.\"", "urdu": " اور جن لوگوں نے تیرا انکار کیا ہے وہ کہتے ہیں کہ تو خدا کا بھیجا ہوا نہیں ہے تو انہیں کہہ (کہ) اللہ میرے درمیان اور تمہارے درمیان کافی گواہ ہے۔ اور (اسی طرح پر) وہ (شخص بھی گواہ) ہے جس کے پاس اس (مقدس) کتاب کا علم (آچکا) ہے۔"}], "Surah": 13}