{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " تَبٰرَکَ الَّذِیۡ بِیَدِہِ الۡمُلۡکُ ۫ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرُ ۣۙ﴿۲﴾", "english": " Blessed is He in Whose hand is the kingdom, and He has power over all things;", "french": " Béni est Celui entre les mains de Qui est le royaume, et Il a le pouvoir de faire tout ce qu’Il veut ;", "german": " Segensreich ist Der, in Dessen Hand die Herrschaft ist; und Er vermag alle Dinge zu tun.", "spanish": " Bendito sea Aquel en cuyas manos está el reino, y que tiene poder sobre todas las cosas.", "urdu": " بہت برکت والا ہے وہ (خدا) جس کے قبضہ میں بادشاہت ہے اور وہ ہر ایک ارادہ کے پورا کرنے پر قادر ہے۔"}, {"arabic": " الَّذِیۡ خَلَقَ الۡمَوۡتَ وَ الۡحَیٰوۃَ لِیَبۡلُوَکُمۡ اَیُّکُمۡ اَحۡسَنُ عَمَلًا ؕ وَ ہُوَ الۡعَزِیۡزُ الۡغَفُوۡرُ ۙ﴿۳﴾", "english": " Who has created death and life that He might try you — which of you is best in deeds; and He is the Mighty, the Most Forgiving.", "french": " Qui a créé la mort et la vie pour qu’Il vous éprouve – lequel d’entre vous est le meilleur en conduite ; et Il est le Puissant, le Très-Pardonnant,", "german": " Der den Tod erschaffen hat und das Leben, dass Er euch prüfe, wer von euch der Beste ist im Handeln; und Er ist der Allmächtige, der Allverzeihende,", "spanish": " Quien ha creado la muerte y la vida para que pueda probar cuál de vosotros es mejor en sus acciones; pues Él es el Poderoso, el Sumo Indulgente.", "urdu": " اس نے موت اور زندگی کو اس لئے پیدا کیا ہے کہ وہ تم کو آزمائے کہ تم میں سے کون زیادہ اچھا عمل کرنے والا ہے‘ اور وہ غالب (اور) بہت بخشنے والا ہے۔"}, {"arabic": " الَّذِیۡ خَلَقَ سَبۡعَ سَمٰوٰتٍ طِبَاقًا ؕ مَا تَرٰی فِیۡ خَلۡقِ الرَّحۡمٰنِ مِنۡ تَفٰوُتٍ ؕ فَارۡجِعِ الۡبَصَرَ ۙ ہَلۡ تَرٰی مِنۡ فُطُوۡرٍ ﴿۴﴾", "english": " Who has created seven heavens in harmony. No incongruity canst thou see in the creation of the Gracious God . Then look again: Seest thou any flaw?", "french": " Qui a créé sept cieux superposés. Dans la création du Dieu Gracieux, tu ne peux voir aucune discordance. Puis, regarde de nouveau ; vois-tu quelque imperfection ?", "german": " Der sieben Himmel im Einklang erschaffen hat. Keinen Fehler kannst du in der Schöpfung des Gnadenreichen sehen. So wende den Blick: siehst du irgendeinen Mangel?", "spanish": " Quien ha creado siete cielos en armonía. No puedes ver imperfección alguna en la creación del Dios Clemente. Mira de nuevo: ¿Ves alguna fisura?", "urdu": " وہی ہے جس نے سات آسمان درجہ بدرجہ بنائے ہیں (اور) تو رحمن (خدا) کی پیدائش میں کوئی رخنہ نہیں دیکھتا۔ اور تو اپنی آنکھ کو (ادھر ادھر) پھیر کر اچھی طرح سے دیکھ لے! کیا تجھے (خدا کی مخلوق میں کسی جگہ بھی) کوئی رخنہ نظر آتا ہے۔"}, {"arabic": " ثُمَّ ارۡجِعِ الۡبَصَرَ کَرَّتَیۡنِ یَنۡقَلِبۡ اِلَیۡکَ الۡبَصَرُ خَاسِئًا وَّ ہُوَ حَسِیۡرٌ ﴿۵﴾", "english": " Aye, look again, and yet again, thy sight will only return unto thee confused and fatigued.", "french": " Puis regarde de nouveau, et encore de nouveau, ton regard ne fera que retourner à toi frustré et fatigué.", "german": " So wende den Blick abermals und abermals: dein Blick wird nur zu dir zurückkehren ermüdet und geschwächt.", "spanish": " Sí, mira de nuevo, y otra vez de nuevo: tu vista sólo volverá a ti frustrada y fatigada.", "urdu": " پھر باربار نظر کو چکر دے‘ وہ آخر تیری طرف ناکام ہو کر لوٹ آئے گی‘ اور وہ تھکی ہوئی ہوگی (اور کوئی رخنہ نظر نہ آئے گا)۔"}, {"arabic": " وَ لَقَدۡ زَیَّنَّا السَّمَآءَ الدُّنۡیَا بِمَصَابِیۡحَ وَ جَعَلۡنٰہَا رُجُوۡمًا لِّلشَّیٰطِیۡنِ وَ اَعۡتَدۡنَا لَہُمۡ عَذَابَ السَّعِیۡرِ ﴿۶﴾", "english": " And verily, We have adorned the lowest heaven with lamps, and We have made them for driving away satans, and We have prepared for them the punishment of the blazing Fire.", "french": " Et en vérité, Nous avons orné le ciel le plus bas avec des lampes, et Nous les avons faites pour chasser les satans, et pour eux Nous avons préparé le châtiment de la Fournaise.", "german": " Fürwahr, Wir haben den untersten Himmel mit Lampen geschmückt, und Wir haben sie zu einem Mittel zur Vertreibung der Teufel gemacht, und für sie haben Wir die Strafe des flammenden Feuers bereitet.", "spanish": " En verdad hemos adornado el cielo más inferior con lámparas, y las hemos forjado para mantener alejados los satanes; y hemos preparado para ellos el castigo del Fuego llameante.", "urdu": " اور ہم نے نچلے آسمان کو چراغوں کے ساتھ زینت دی ہے اور ان (چراغوں) کو شیطانوں کے لئے پتھراٶ کا باعث بنایا ہے اور ہم نے ان (شیطانوں) کے لئے ایک بھڑکنے والا عذاب مقرر کیا ہے۔"}, {"arabic": " وَ لِلَّذِیۡنَ کَفَرُوۡا بِرَبِّہِمۡ عَذَابُ جَہَنَّمَ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۷﴾", "english": " And for those who disbelieve in their Lord there is the punishment of Hell, and an evil resort it is!", "french": " Et pour ceux qui refusent de croire en leur Seigneur, il y a le châtiment de l’Enfer, et quelle mauvaise destination que c’est !", "german": " Und für jene, die nicht an ihren Herrn glauben, ist die Strafe der Hölle, und eine üble Bestimmung ist das!", "spanish": " Para los que no creen en su Señor está el castigo del Infierno y ¡qué pésima morada es!", "urdu": " اور جنہوں نے اپنے رب کا انکار کیا ہے انہیں جہنم کا عذاب پہنچے گا اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " اِذَاۤ اُلۡقُوۡا فِیۡہَا سَمِعُوۡا لَہَا شَہِیۡقًا وَّ ہِیَ تَفُوۡرُ ۙ﴿۸﴾", "english": " When they are cast therein, they will hear it roaring as it boils up.", "french": " Quand ils y seront jetés, ils l’entendront ronfler pendant qu’il bouillonne.", "german": " Wenn sie hineingeworfen werden, dann werden sie sie brüllen hören, indes sie aufschäumt.", "spanish": " Cuando sean arrojados a él, oirán subir su rugido hirviente.", "urdu": " جب وہ اس (جہنم) میں ڈالے جائیں گے تو وہ اس میں اس کی ایک بڑی چیخ سنیں گے (جیسے گدھے کے رینگنے کی آواز) اور وہ (جہنم بڑے) جوش میں ہوگی۔"}, {"arabic": " تَکَادُ تَمَیَّزُ مِنَ الۡغَیۡظِ ؕ کُلَّمَاۤ اُلۡقِیَ فِیۡہَا فَوۡجٌ سَاَلَہُمۡ خَزَنَتُہَاۤ اَلَمۡ یَاۡتِکُمۡ نَذِیۡرٌ ﴿۹﴾", "english": " It would almost burst with fury. Whenever a host of disbelievers is cast into it the wardens thereof will ask them, ‘Did no Warner come to you?’", "french": " Peu s’en faudrait qu’il n’éclatât de fureur. Toutes les fois qu’une troupe de mécréants y sera jetée, les gardiens du Feu leur demanderont : « Un Avertisseur n’est-il pas venu à vous ? »", "german": " Fast möchte sie bersten vor Wut. Sooft eine Schar hineingeworfen wird, werden ihre Wächter sie fragen: \"Ist denn kein Warner zu euch gekommen?\"", "spanish": " Casi a punto de estallar con furia. Siempre que un grupo de incrédulos sea arrojado a él, sus guardianes les preguntarán: “¿Acaso no os llegó un Amonestador?”.", "urdu": " قریب ہوگا کہ وہ غصہ کے مارے پھٹ پڑے۔ جب بھی اس میں کوئی جماعت ڈالی جائے گی‘ اس (جہنم) کے دربان ان سے پوچھیں گے کہ کیا تمہارے پاس کوئی نبی نہیں آیا تھا۔"}, {"arabic": " قَالُوۡا بَلٰی قَدۡ جَآءَنَا نَذِیۡرٌ ۬ۙ فَکَذَّبۡنَا وَ قُلۡنَا مَا نَزَّلَ اللّٰہُ مِنۡ شَیۡءٍ ۚۖ اِنۡ اَنۡتُمۡ اِلَّا فِیۡ ضَلٰلٍ کَبِیۡرٍ ﴿۱۰﴾", "english": " They will say, “Yea, verily, a Warner did come to us, but we treated him as a liar, and we said: ‘Allah has not revealed anything; you are but in great error.’ ”", "french": " Ils diront : « Oui, certainement un Avertisseur est venu à nous, mais nous l ’avons traité de menteur, et nous avons dit : « Allāh n’a rien envoyé ; vous n’êtes que dans un grave égarement.’ »", "german": " Sie werden sprechen: «Doch, sicherlich, es kam ein Warner zu uns, aber wir schalten (ihn) einen Lügner und sprachen: \"Allah hat nichts herabgesandt; ihr seid bloß in schwerem Irrtum.\"»", "spanish": " Ellos responderán: “Sí, nos llegó un Amonestador, pero lo tratamos de mentiroso y dijimos: “Al-lah no ha revelado nada; estáis sólo en un gran error”.", "urdu": " وہ کہیں گے‘ ہاں ہمارے پاس نبی ضرور آیا تھا پر ہم نے اسے جھٹلا دیا تھا اور اس سے کہا تھا کہ اللہ نے کچھ بھی نہیں اتارا (سب تمہارا جھوٹ ہے) تم ایک کھلی گمراہی میں مبتلا ہو (اور اپنے خیالات کو الہام سمجھتے ہو)"}, {"arabic": " وَ قَالُوۡا لَوۡ کُنَّا نَسۡمَعُ اَوۡ نَعۡقِلُ مَا کُنَّا فِیۡۤ اَصۡحٰبِ السَّعِیۡرِ ﴿۱۱﴾", "english": " And they will say, ‘If we had but listened or possessed sense, we should not have been among the inmates of the blazing Fire.’", "french": " Et ils diront : « Si seulement nous avions écouté, ou avions raisonné, nous ne nous serions pas trouvés parmi les habitants de la Fournaise de l’Enfer . »", "german": " Sie werden sprechen: \"Hätten wir nur zugehört oder Verstand gehabt, wir wären nicht unter den Bewohnern des flammenden Feuers gewesen.\"", "spanish": " Y dirán: “Si al menos hubiésemos escuchado o hubiésemos tenido sentido común, no habríamos estado entre los moradores del Fuego llameante”.", "urdu": " اور ان لوگوں نے یہ بھی کہا کہ اگر ہم سننے کی طاقت رکھتے یا عقل رکھتے تو کبھی دوزخی نہ بنتے۔"}, {"arabic": " فَاعۡتَرَفُوۡا بِذَنۡۢبِہِمۡ ۚ فَسُحۡقًا لِّاَصۡحٰبِ السَّعِیۡرِ ﴿۱۲﴾", "english": " Then will they confess their sins; but far away are the inmates of the blazing Fire from God ’ s mercy .", "french": " Alors avoueront-ils leurs péchés ; damnés soient les habitants du Feu !", "german": " So werden sie ihre Sünden bekennen; doch fern sind die Bewohner des flammenden Feuers (der Gnade).", "spanish": " Entonces confesarán sus pecados; pero ¡condenados sean los moradores del Infierno!.", "urdu": " پس انہوں نے اپنے گناہوں کا اعتراف کر لیا‘ سو (اے فرشتو)! دوزخیوں کے لئے لعنت مقدر کردو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یَخۡشَوۡنَ رَبَّہُمۡ بِالۡغَیۡبِ لَہُمۡ مَّغۡفِرَۃٌ وَّ اَجۡرٌ کَبِیۡرٌ ﴿۱۳﴾", "english": " Verily, those who fear their Lord in secret — for them is forgiveness and a great reward.", "french": " En vérité, ceux qui craignent leur Seigneur alors qu’Il reste caché d'eux , pour eux est le pardon ainsi qu'une grande récompense.", "german": " Wahrlich, diejenigen, die ihren Herrn im geheimen fürchten, werden Vergebung und großen Lohn erhalten.", "spanish": " En verdad, quienes temen a su Señor mientras Él permanece oculto ante ellos, sepan que les espera el perdón y una gran recompensa.", "urdu": " یقیناً وہ لوگ جو کہ اپنے رب سے علیحدگی میں ڈرتے ہیں‘ ان کو مغفرت اور بڑا اجر ملے گا۔"}, {"arabic": " وَ اَسِرُّوۡا قَوۡلَکُمۡ اَوِ اجۡہَرُوۡا بِہٖ ؕ اِنَّہٗ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۱۴﴾", "english": " And whether you conceal what you say or make it public, He knows full well what is in your breasts.", "french": " Et que vous dissimuliez ce que vous dites, ou que vous le divulguiez, Il connaît très bien ce qui est dans les poitrines.", "german": " Und ob ihr euer Wort verbergt oder es offen verkündet, Er kennt die innersten Gedanken der Herzen.", "spanish": " Y tanto si ocultáis lo que decís como si lo hacéis público, Él conoce muy bien lo que hay en vuestros corazones.", "urdu": " اور (اے لوگو) تم اپنی بات کو چھپاٶ یا ظاہر کرو‘ وہ (خدا) دلوں کی بات کو بھی خوب جانتا ہے۔"}, {"arabic": " اَلَا یَعۡلَمُ مَنۡ خَلَقَ ؕ وَ ہُوَ اللَّطِیۡفُ الۡخَبِیۡرُ ﴿٪۱۵﴾", "english": " Does He Who has created you not know it ? He is the Knower of all subtleties, the All-Aware.", "french": " Celui Qui a créé ne le sait-Il pas ? Alors qu'Il est le Connaisseur de toutes les subtilités, le Très-Conscient.", "german": " Kennt denn Der nicht, Der erschaffen? Er ist scharfsinnig, allwissend.", "spanish": " ¿Acaso no lo sabe Aquel que os creó? Él, es el Conocedor de todas las sutilidades, el Omnisciente.", "urdu": " کیا ایسا ہو سکتا ہے کہ جس نے پیدا کیا ہو وہی اندر کے حال نہ جانے‘ حالانکہ وہ مخفی سے مخفی رازوں کا واقف اور بہت خبردار ہے۔"}, {"arabic": " ہُوَ الَّذِیۡ جَعَلَ لَکُمُ الۡاَرۡضَ ذَلُوۡلًا فَامۡشُوۡا فِیۡ مَنَاکِبِہَا وَ کُلُوۡا مِنۡ رِّزۡقِہٖ ؕ وَ اِلَیۡہِ النُّشُوۡرُ ﴿۱۶﴾", "english": " He it is Who has made the earth even and smooth for you; so traverse through its sides, and eat of His provision. And unto Him will be the resurrection.", "french": " C’est Lui Qui a rendu la terre dans un état de soumission pour vous ; marchez donc dans ses chemins, et mangez de Sa provision. Et vers Lui sera la Résurrection.", "german": " Er ist es, Der die Erde für euch dienstfertig gemacht hat; wandert also auf ihren Wegen und genießet Seine Versorgung. Und zu Ihm wird die Auferstehung sein.", "spanish": " Él es Quien creó para vosotros la tierra, suave y uniforme; cruzadla pues, por todos sus lados, y comed de Su provisión. Pues hacia Él será la resurrección.", "urdu": " وہی ہے جس نے تمہارے لئے زمین کو رہنے کے قابل بنایا ہے پس اس کی وادیوں میں جاٶ اور اس (خدا) کے رزق سے کھاٶ اور اسی کی طرف لوٹ کے جانا ہے۔"}, {"arabic": " ءَاَمِنۡتُمۡ مَّنۡ فِی السَّمَآءِ اَنۡ یَّخۡسِفَ بِکُمُ الۡاَرۡضَ فَاِذَا ہِیَ تَمُوۡرُ ﴿ۙ۱۷﴾", "english": " Do you feel secure from Him Who is in the heaven that He will not cause the earth to sink with you when lo! it begins to shake?", "french": " Vous sentez-vous en sécurité contre Celui Qui est au ciel, qu’Il ne vous fera pas engloutir par la terre ? Et voilà qu’elle tremble !", "german": " Fühlt ihr euch sicher vor Dem, Der im Himmel ist, dass Er nicht die Erde euch verschlingen lässt, wenn sie, siehe, zu beben beginnt?", "spanish": " ¿Os sentís seguros de que Aquel que está en el cielo no haga que la tierra se hunda con vosotros cuando ¡ay! empiece a temblar?", "urdu": " کیا تم آسمان میں رہنے والی ہستی سے اس بات سے امن میں آگئے ہو کہ وہ تم کو دنیا میں ذلیل کر دے اور تم دیکھ لو کہ وہ (زمین) چکر کھا رہی ہے (اور تم تباہی کے قریب ہو)"}, {"arabic": " اَمۡ اَمِنۡتُمۡ مَّنۡ فِی السَّمَآءِ اَنۡ یُّرۡسِلَ عَلَیۡکُمۡ حَاصِبًا ؕ فَسَتَعۡلَمُوۡنَ کَیۡفَ نَذِیۡرِ ﴿۱۸﴾", "english": " Do you feel secure from Him Who is in the heaven that He will not send against you a sandstorm? Then will you know how terrible was My warning.", "french": " Vous sentez-vous en sécurité contre Celui Qui est au ciel, qu’Il n’enverra pas un ouragan de pierres contre vous ? C’est alors que vous saurez combien terrible était Mon avertissement !", "german": " Fühlt ihr euch sicher vor Dem, Der im Himmel ist, dass Er nicht einen Sturmwind gegen euch schickt? Dann werdet ihr wissen, wie Meine Warnung war!", "spanish": " ¿Os sentís seguros de que Aquel que está en el cielo no envíe ontra vosotros una tormenta de arena? Entonces sabréis qué terrible era Mi advertencia.", "urdu": " کیا آسمان میں رہنے والی ہستی سے تم اس بات سے امن میں آگئے‘ کہ وہ تم پر پتھروں کا مینہ برسا دے‘ سو (جس شکل میں بھی میرا غضب نازل ہوگا) تم جان لو گے کہ میرا ڈرانا کیسا سخت تھا۔"}, {"arabic": " وَ لَقَدۡ کَذَّبَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ فَکَیۡفَ کَانَ نَکِیۡرِ ﴿۱۹﴾", "english": " And indeed those before them also treated My Messengers as liars; then how grievous was My punishment!", "french": " Et en vérité, leurs devanciers ont aussi traité de menteurs Mes Messagers ; alors combien terrible fut Ma réprobation !", "german": " Und schon leugneten jene, die vor ihnen waren; wie war dann (die Folge) Meiner Verleugnung!", "spanish": " En verdad, quienes os precedieron trataron también de embusteros a Mis Mensajeros; ¡qué espantoso fue entonces Mi castigo!", "urdu": " اور ان سے پہلے لوگوں نے بھی رسولوں کو جھٹلایا تھا۔ پھر (انہوں نے دیکھا یا نہ دیکھا کہ) میرا عذاب کیسا سخت تھا۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اِلَی الطَّیۡرِ فَوۡقَہُمۡ صٰٓفّٰتٍ وَّ یَقۡبِضۡنَ ؔۘؕ مَا یُمۡسِکُہُنَّ اِلَّا الرَّحۡمٰنُ ؕ اِنَّہٗ بِکُلِّ شَیۡءٍۭ بَصِیۡرٌ ﴿۲۰﴾", "english": " Have they not seen the birds above them, spreading out their wings without moving them and then drawing them in to swoop down upon the prey ? None withholds them but the Gracious God . Verily He sees all things.", "french": " N’ont-ils pas vu les oiseaux au-dessus d’eux, déployant et repliant leurs ailes ? Nul ne les retient excepté le Dieu Gracieux. En vérité, Il voit bien toutes choses.", "german": " Haben sie nicht die Vögel über sich gesehen, wie sie ihre Flügel breiten und sie dann einziehen? Keiner hält sie zurück als der Gnadenreiche. Wahrlich, Er sieht alle Dinge.", "spanish": " ¿No han visto acaso los pájaros por encima de ellos, extendiendo us alas sin mover las y después juntándolas para caer sobre la presa? Nadie los sostiene excepto el Dios Clemente. En verdad, Él ve todas las cosas.", "urdu": " کیا انہوں نے اپنے اوپر (فضاٶں میں پر پھیلائے ہوئے) صف در صف پرندوں کو نہیں دیکھا جو کبھی (نیچے اترتے ہوئے اپنے پر) سمیٹ لیتے ہیں۔ رحمان (خدا) ہی ان کو روکتا ہے وہ ہر چیز سے اچھی طرح واقف ہے۔"}, {"arabic": " اَمَّنۡ ہٰذَا الَّذِیۡ ہُوَ جُنۡدٌ لَّکُمۡ یَنۡصُرُکُمۡ مِّنۡ دُوۡنِ الرَّحۡمٰنِ ؕ اِنِ الۡکٰفِرُوۡنَ اِلَّا فِیۡ غُرُوۡرٍ ﴿ۚ۲۱﴾", "english": " Or who is he that can be an army for you to help you against the Gracious God ? The disbelievers are only in deception.", "french": " Ceux qui constituent votre armée peuvent-ils vous venir en aide contre le Dieu Gracieux ? Les mécréants ne sont que dans une illusion.", "german": " Oder wer ist es, der ein Heer für euch sein kann, euch beizustehen, gegen den Gnadenreichen? Die Ungläubigen sind in Täuschung nur.", "spanish": " O ¿quién es el que puede convertirse en ejército para ayudaros contra el Dios Clemente? Los incrédulos están sólo en el engaño.", "urdu": " کیا وہ لوگ جو تمہارا لشکر کہلاتے ہیں‘ رحمن (خدا) کے مقابلہ میں تمہاری مدد کر سکیں گے؟ کافر تو صرف دھوکے میں مبتلا ہیں۔"}, {"arabic": " اَمَّنۡ ہٰذَا الَّذِیۡ یَرۡزُقُکُمۡ اِنۡ اَمۡسَکَ رِزۡقَہٗ ۚ بَلۡ لَّجُّوۡا فِیۡ عُتُوٍّ وَّ نُفُوۡرٍ ﴿۲۲﴾", "english": " Or who is he that will provide for you, if He should withhold His provision? Nay, but they obstinately persist in rebellion and aversion.", "french": " Ou, qui est celui qui pourvoira à vos besoins s’Il devait retenir Sa provision ? Non , mais ils persistent dans la rébellion et dans l’aversion.", "german": " Oder wer ist es, der euch versorgen wird, wenn Er Seine Versorgung zurückhält? Nein, aber sie verharren in Trotz und in Widerwillen.", "spanish": " O ¿quién es el que os aprovisionará si Él retira su provisión? Nadie; pero ellos persisten obstinados en la rebelión y en la aversión.", "urdu": " کیا وہ ہستی جو تمہیں رزق دیتی ہے اگر اپنے رزق کو روک لے (تو کوئی ہے جو تم کو رزق دے؟) حقیقت یہ ہے کہ وہ سرکشی اور حق سے دور بھاگنے (کی عادت) میں بڑھ گئے ہیں۔"}, {"arabic": " اَفَمَنۡ یَّمۡشِیۡ مُکِبًّا عَلٰی وَجۡہِہٖۤ اَہۡدٰۤی اَمَّنۡ یَّمۡشِیۡ سَوِیًّا عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۲۳﴾", "english": " What! is he who walks grovelling upon his face better guided or he who walks upright on the straight path?", "french": " Comment ! est-il mieux guidé, celui qui avance en rampant sur le visage, ou celui qui marche debout sur un droit chemin ?", "german": " Wie! ist der, der gebückt auf seinem Gesicht einhergeht, besser geleitet als jener, der aufrecht wandelt auf dem geraden Weg?", "spanish": " ¡Cómo! ¿Acaso quien anda inclinado sobre su rostro va mejor guiado que quien anda erguido por el camino recto?", "urdu": " کیا وہ جو اپنے منہ کے بل اوندھا چلتا ہے زیادہ ہدایت یافتہ ہے یا وہ جو صراط مستقیم پر سیدھا چلنے والا ہے؟"}, {"arabic": " قُلۡ ہُوَ الَّذِیۡۤ اَنۡشَاَکُمۡ وَ جَعَلَ لَکُمُ السَّمۡعَ وَ الۡاَبۡصَارَ وَ الۡاَفۡـِٕدَۃَ ؕ قَلِیۡلًا مَّا تَشۡکُرُوۡنَ ﴿۲۴﴾", "english": " Say, ‘He it is Who brought you into being, and made for you ears and eyes and hearts; but little thanks do you give.’", "french": " Dis : « C’est Lui Qui vous a amenés en existence, et Qui a fait pour vous des oreilles, des yeux et un cœur ; mais vous Lui en êtes bien peu reconnaissants. »", "german": " Sprich: \"Er ist es, Der euch ins Dasein rief und Der euch Ohren und Augen und Herzen gab; (aber) wenig ist es, was ihr Dank wisset!\"", "spanish": " Diles: “Él es Quien os dio el ser, y os dio oídos, ojos y corazones; pero ¡qué poco se lo agradecéis!”.", "urdu": " تو کہہ دے کہ وہ خدا ہی ہے جس نے تم کو پیدا کیا ہے اور تمہارے لئے کان اور آنکھیں اور دل بنائے ہیں مگر تم بالکل شکر نہیں کرتے۔"}, {"arabic": " قُلۡ ہُوَ الَّذِیۡ ذَرَاَکُمۡ فِی الۡاَرۡضِ وَ اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۲۵﴾", "english": " Say, ‘He it is Who multiplied you in the earth, and unto Him will you be gathered.’", "french": " Dis : « C’est Lui Qui vous a multipliés sur la terre, et c’est auprès de Lui que vous serez rassemblés. »", "german": " Sprich: \"Er ist es, Der euch mehrte auf Erden, und zu Ihm werdet ihr versammelt werden.\"", "spanish": " Diles: “Él es Quien os multiplicó en la tierra, y hacia Él seréis reunidos”.", "urdu": " تو کہہ دے کہ وہی ہے جس نے تم کو زمین میں پیدا کیا ہے اور اسی کی طرف تم زندہ کرکے پھر لے جائے جاٶ گے۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ مَتٰی ہٰذَا الۡوَعۡدُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۲۶﴾", "english": " And they say, ‘When will this promise come to pass , if indeed you are truthful?’", "french": " Et ils disent : « Quand cette promesse s’accomplira-t-elle, si en fait vous êtes véridiques ? »", "german": " Und sie sprechen: \"Wann wird diese Verheißung (sich erfüllen), wenn ihr wahrhaftig seid?\"", "spanish": " Y dicen: “¿Cuándo ocurrirá esta promesa, si es que sois veraces?”.", "urdu": " اور وہ کہتے ہیں کہ اگرتم سچے ہوتو یہ وعدہ کب پوراہوگا۔"}, {"arabic": " قُلۡ اِنَّمَا الۡعِلۡمُ عِنۡدَ اللّٰہِ ۪ وَ اِنَّمَاۤ اَنَا نَذِیۡرٌ مُّبِیۡنٌ ﴿۲۷﴾", "english": " Say, ‘The knowledge of it is with Allah, and I am only a plain Warner.’", "french": " Dis : « La connaissance en est avec Allāh Seul, et moi, je ne suis qu’un Avertisseur qui avertit clairement. »", "german": " Sprich: \"Das Wissen (darum) ist bei Allah allein, und ich bin nur ein aufklärender Warner.\"", "spanish": " Diles: “Su conocimiento corresponde a Al-lah, pues yo no soy más que un simple Amonestador”.", "urdu": " تو کہہ دے کہ اس کا علم صرف اللہ کو ہے اور میں تو صرف ایک کھول کر ہوشیار کر دینے والا (شخص) ہوں۔"}, {"arabic": " فَلَمَّا رَاَوۡہُ زُلۡفَۃً سِیۡٓـَٔتۡ وُجُوۡہُ الَّذِیۡنَ کَفَرُوۡا وَ قِیۡلَ ہٰذَا الَّذِیۡ کُنۡتُمۡ بِہٖ تَدَّعُوۡنَ ﴿۲۸﴾", "english": " But when they see it near, the faces of those who disbelieve will become grief-stricken, and it will be said, ‘This is what you used to ask for.’", "french": " Mais lorsqu’ils la verront toute proche, le visage de ceux qui refusent de croire sera affligé, et il sera dit : « Voici ce que vous réclamiez. »", "german": " Doch wenn sie es nahe sehen, dann werden die Gesichter derer, die ungläubig sind, verzerrt sein, und es wird gesprochen werden: \"Das ist´s, was ihr zu verlangen pflegtet.\"", "spanish": " Pero cuando lo vean cerca, los rostros de los incrédulos se ensombrecerán; y se les dirá: “Esto es lo que solíais pedir”.", "urdu": " اور جب وہ اس (موعود عذاب) کو قریب آتا دیکھیں گے تو کافروں کے منہ بگڑ جائیں گے اور ان سے کہا جائے گا یہی وہ چیز ہے جس کو تم باربار بلا رہے تھے۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ اِنۡ اَہۡلَکَنِیَ اللّٰہُ وَ مَنۡ مَّعِیَ اَوۡ رَحِمَنَا ۙ فَمَنۡ یُّجِیۡرُ الۡکٰفِرِیۡنَ مِنۡ عَذَابٍ اَلِیۡمٍ ﴿۲۹﴾", "english": " Say, ‘Tell me, if Allah should destroy me and those who are with me, or have mercy on us, who will protect the disbelievers from a painful punishment?’", "french": " Dis : « Dites- moi , si Allāh devait nous anéantir, moi et ceux qui sont avec moi, ou s’Il devait nous montrer de la miséricorde, qui protégerait les mécréants contre un châtiment douloureux ? »", "german": " Sprich: \"Sagt an, wenn Allah mich vernichten sollte und die mit mir sind, oder wenn Er uns Barmherzigkeit erweisen sollte, wer wird die Ungläubigen vor qualvoller Strafe schützen?\"", "spanish": " Diles: “Decidme: si Al-lah me destruyera a mí y a los que están conmigo, o tuviese misericordia de nosotros, ¿quién protegería a los incrédulos de un doloroso castigo?”.", "urdu": " تو کہہ دے‘ مجھے بتاٶ تو سہی کہ اگر اللہ مجھے اور میرے ساتھیوں کو ہلاک کر دے یا ہم پر رحم کر دے تو بھی کافروں کو دردناک عذاب سے کون پناہ دے گا۔"}, {"arabic": " قُلۡ ہُوَ الرَّحۡمٰنُ اٰمَنَّا بِہٖ وَ عَلَیۡہِ تَوَکَّلۡنَا ۚ فَسَتَعۡلَمُوۡنَ مَنۡ ہُوَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۳۰﴾", "english": " Say, ‘He is the Gracious God ; in Him have we believed and in Him have we put our trust. And you will soon know who is in manifest error.’", "french": " Dis : « Il est le Dieu Gracieux ; en Lui avons-nous cru et en Lui avons-nous placé notre confiance. Et vous saurez bientôt qui est dans une erreur manifeste. »", "german": " Sprich: \"Er ist der Gnadenreiche; an Ihn glauben wir und auf Ihn vertrauen wir. Ihr werdet bald erfahren, wer in offenkundigem Irrtum ist.\"", "spanish": " Diles: “Él es el Dios Clemente; en Él hemos creído y en Él hemos puesto nuestra confianza. Muy pronto sabréis quién está en el error evidente”.", "urdu": " تو کہہ دے وہی رحمان ہے جس پر ہم ایمان لائے ہیں اور ہم نے اسی پر توکل کیا ہے پس تم جلدی جان لو گے کہ کون کھلی کھلی گمراہی میں مبتلا ہے۔"}], "Surah": 67}