{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ الشَّمۡسِ وَ ضُحٰہَا ۪ۙ﴿۲﴾", "english": " By the sun and its growing brightness,", "french": " Par le soleil et par le moment où il se met à rayonner,", "german": " Bei der Sonne und bei ihrem Glanz,", "spanish": " Por el sol y el momento en que comienza a irradiar,", "urdu": " میں سورج کو شہادت کے طور پر پیش کرتا ہوں‘ اور ضحی کے وقت کو‘ جب وہ طلوع ہونے کے بعد اونچا ہو جاتا ہے۔"}, {"arabic": " وَ الۡقَمَرِ اِذَا تَلٰٮہَا ۪ۙ﴿۳﴾", "english": " And by the moon when it follows it (the sun),", "french": " Et par la lune lorsqu’elle le suit,", "german": " und bei dem Mond, wenn er ihr folgt,", "spanish": " Por la luna cuando lo sigue (al sol),", "urdu": " اور چاند کو جب وہ سورج کے پیچھے آتا ہے۔"}, {"arabic": " وَ النَّہَارِ اِذَا جَلّٰٮہَا ۪ۙ﴿۴﴾", "english": " And by the day when it reveals its glory,", "french": " Et par le jour lorsqu’il révèle la gloire du soleil ,", "german": " und bei dem Tag, wenn er sie enthüllt,", "spanish": " Por el día cuando revela su gloria,", "urdu": " اور دن کو (بھی شہادت کے طور پر پیش کرتاہوں) جب وہ اس (سورج) کو ظاہر کر دیتا ہے۔"}, {"arabic": " وَ الَّیۡلِ اِذَا یَغۡشٰٮہَا ۪ۙ﴿۵﴾", "english": " And by the night when it draws a veil over it,", "french": " Et par la nuit lorsqu’elle tire un voile sur lui,", "german": " und bei der Nacht, wenn sie sie bedeckt,", "spanish": " Por la noche cuando extien­de un manto sobre él,", "urdu": " اور رات کو بھی (شہادت کے طور پر پیش کرتا ہوں) جب وہ اس (سورج) کی روشنی کو آنکھوں سے اوجھل کر دیتی ہے۔"}, {"arabic": " وَ السَّمَآءِ وَ مَا بَنٰہَا ۪ۙ﴿۶﴾", "english": " And by the heaven and its making,", "french": " Et par le ciel et la façon dont Il l’a créé !", "german": " und bei dem Himmel und seiner Erbauung,", "spanish": " Por los cielos y su creación,", "urdu": " اور آسمان کو اور اس کے بنائے جانے کو بھی۔"}, {"arabic": " وَ الۡاَرۡضِ وَ مَا طَحٰہَا ۪ۙ﴿۷﴾", "english": " And by the earth and its spreading out,", "french": " Et par la terre et la façon dont Il l’a étendue,", "german": " und bei der Erde und ihrer Ausbreitung,", "spanish": " Por la tierra y su extensión,", "urdu": " اور زمین کو بھی اور اس کے بچھائے جانے کو بھی (شہادت کے طور پر پیش کرتا ہوں)"}, {"arabic": " وَ نَفۡسٍ وَّ مَا سَوّٰٮہَا ۪ۙ﴿۸﴾", "english": " And by the soul and its perfection —", "french": " Et par l’âme et comment Il l’a façonnée !", "german": " und bei der Seele und ihrer Vollendung –", "spanish": " Y por el alma y su perfec­ción.", "urdu": " اور انسانی نفس کو بھی اور اس کے بے عیب بنائے جانے کو بھی (شہادت کے طور پر پیش کرتا ہوں)"}, {"arabic": " فَاَلۡہَمَہَا فُجُوۡرَہَا وَ تَقۡوٰٮہَا ۪ۙ﴿۹﴾", "english": " And He revealed to it what is wrong for it and what is right for it —", "french": " Et Il a implanté dans sa nature la capacité de reconnaître son impiété et sa droiture", "german": " Er gewährte ihr den Sinn für das, was für sie unrecht und was für sie recht ist.", "spanish": " Él le reveló lo que es malo y lo que es bueno para él:", "urdu": " کہ اس (اللہ) نے نفس پر اس کی بدکاری (کی راہوں کو بھی) اور اس کے تقویٰ (کے راستوں) کو بھی اچھی طرح کھول دیا ہے۔"}, {"arabic": " قَدۡ اَفۡلَحَ مَنۡ زَکّٰٮہَا ۪ۙ﴿۱۰﴾", "english": " He indeed truly prospers who purifies it,", "french": " Et en vérité, prospère vraiment celui qui développe cela - cette droiture-là ,", "german": " Gewiss, wer sie lauterer werden lässt, der wird Erfolg haben;", "spanish": " En verdad, prospera quien lo incrementa,", "urdu": " پس جس نے اس (نفس) کو پاک کیا وہ تو (سمجھو کہ) اپنے مقصود کو پاگیا۔"}, {"arabic": " وَ قَدۡ خَابَ مَنۡ دَسّٰٮہَا ﴿ؕ۱۱﴾", "english": " And he who corrupts it is ruined.", "french": " Et celui qui la corrompt est ruiné.", "german": " und wer sie in Verderbnis hinabsinken lässt, der wird zuschanden.", "spanish": " Mas quien lo suprime queda arruinado,", "urdu": " اور جس نے اسے (مٹی میں) گاڑ دیا (سمجھ لو کہ) وہ نامراد ہو گیا۔"}, {"arabic": " کَذَّبَتۡ ثَمُوۡدُ بِطَغۡوٰٮہَاۤ ﴿۪ۙ۱۲﴾", "english": " The tribe of Thamud denied the truth because of their rebelliousness.", "french": " Les Thamūd ont rejeté la vérité à cause de leur esprit de rébellion.", "german": " Die Thamûd leugneten die Wahrheit in ihrem Trotz.", "spanish": " La tribu de Zamud negó la verdad por su naturaleza rebelde.", "urdu": " ثمود نے اپنی حد سے بڑھی ہوئی سرکشی کی وجہ سے (زمانہ کے نبی کو) جھٹلایا۔"}, {"arabic": " اِذِ انۡۢبَعَثَ اَشۡقٰہَا ﴿۪ۙ۱۳﴾", "english": " When the most wretched among them got up,", "french": " Lorsque, le plus malchanceux d’entre eux de par sa dépravation se leva,", "german": " Als der Schlechteste unter ihnen aufstand,", "spanish": " Cuando se levantaron los más perversos de entre ellos,", "urdu": " اس وقت جبکہ اس کی قوم میں سے سب سے بڑا بدبخت اس (زمانہ کے نبی) کی مخالفت کے لئے کھڑا ہوا۔"}, {"arabic": " فَقَالَ لَہُمۡ رَسُوۡلُ اللّٰہِ نَاقَۃَ اللّٰہِ وَ سُقۡیٰہَا ﴿ؕ۱۴﴾", "english": " Then the Messenger of Allah said, ‘ Leave alone the she-camel of Allah, and let her drink.’", "french": " Alors le Messager d’Allāh leur dit : « N’oubliez pas la chamelle d’Allāh, et son droit de s’abreuver. «", "german": " da sprach der Gesandte Allahs: \"Haltet euch fern von der Kamelstute Allahs und von ihrer Tränke!\"", "spanish": " Entonces el Mensajero de Al­-lah dijo:” Dejad sola a la camella de Al‑lah y que beba.”", "urdu": " اس پر ان (یعنی ثمود کی قوم) کو اللہ کے رسول (صالح) نے کہا کہ اللہ کے لئے وقف شدہ اونٹنی سے بچتے رہو اور اسی طرح اس کے پانی پلانے کے معاملہ میں بھی ہر قسم کی سرکشی سے باز آٶ۔"}, {"arabic": " فَکَذَّبُوۡہُ فَعَقَرُوۡہَا ۪۬ۙ فَدَمۡدَمَ عَلَیۡہِمۡ رَبُّہُمۡ بِذَنۡۢبِہِمۡ فَسَوّٰٮہَا ﴿۪ۙ۱۵﴾", "english": " But they rejected him and hamstrung her, so their Lord destroyed them completely because of their sin, and made it (destruction) overtake all of them alike.", "french": " Mais quant au Messager , ils le rejetèrent et quant à la chamelle , ils lui coupèrent les jarrets. Alors leur Seigneur les anéantit complètement à cause de leur péché ; et quant à leur localité , Il la rasa.", "german": " Jedoch sie verwarfen ihn und schnitten ihr die Sehnen durch, darum vernichtete ihr Herr sie gänzlich für ihre Sünde und machte (die Vernichtung) allen gleich.", "spanish": " Mas la rechazaron y la desjarretaron, por lo que su Señor los destruyó totalmente por su pecado, y los aplanó.", "urdu": " لیکن انہوں نے اس (نبی) کی بات نہ مانی بلکہ اس کو جھٹلا دیا اور (وہ) اونٹنی (جس سے بچتے رہنے کا انہیں حکم دیا گیا تھا اس) کی کونچیں کاٹ دیں جس کی وجہ سے اللہ نے ان کو خاک میں ملانے کا فیصلہ کر دیا اور ایسی تدبیریں کیں کہ اسی طرح ہو بھی گیا۔"}, {"arabic": " وَ لَا یَخَافُ عُقۡبٰہَا ﴿٪۱۶﴾", "english": " And He cared not for the consequences thereof.", "french": " Alors qu'Il ne S'en souciait pas des conséquences.", "german": " Und Er fürchtet die Folgen nicht.", "spanish": " Y no se preocupó de sus consecuencias .", "urdu": " اور وہ (اسی طرح) ان (مکہ والوں) کے انجام کی بھی پروا نہیں کرے گا۔"}], "Surah": 91}