{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لیکر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " طٰسٓ ۟ تِلۡکَ اٰیٰتُ الۡقُرۡاٰنِ وَ کِتَابٍ مُّبِیۡنٍ ۙ﴿۲﴾", "english": " Ta Sin. These are verses of the Qur’an, and of an illuminating Book,", "french": " Ṭā Sīn ( Celui Qui est Pur, Qui entend très-bien). Ce sont là les versets du Coran, et d’un Livre éclairant.", "german": " Tâ Sîn. Dies sind Verse des Qur-ân und eines deutlichen Buches,", "spanish": " Ta Sin. Éstos son versícu­los del Corán, y de un Libro que ilumina,", "urdu": " طاہرؔ (اور) سمیعؔ (یعنی پاک اور دعاٶں کا سننے والا خدا اس سورۃ کا اتارنے والا ہے) اس کی آیتیں قرآن اور مدلل کتاب کا حصہ ہیں۔"}, {"arabic": " ہُدًی وَّ بُشۡرٰی لِلۡمُؤۡمِنِیۡنَ ۙ﴿۳﴾", "english": " A guidance and good tidings to those who would believe,", "french": " Une direction et une bonne nouvelle pour les croyants,", "german": " eine Führung und frohe Botschaft denen, die glauben,", "spanish": " Guía y buena nueva para quie­nes creen,", "urdu": " (جو) مومنوں کے لئے ہدایت اور بشارت (کا موجب) ہیں۔"}, {"arabic": " الَّذِیۡنَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ یُؤۡتُوۡنَ الزَّکٰوۃَ وَ ہُمۡ بِالۡاٰخِرَۃِ ہُمۡ یُوۡقِنُوۡنَ ﴿۴﴾", "english": " Who observe Prayer and pay the Zakat, and have firm faith in the Hereafter.", "french": " Qui observent la Prière et paient la Zakāt, et croient fermement à l’au-delà.", "german": " die das Gebet verrichten und die Zakât zahlen und fest auf das Jenseits vertrauen.", "spanish": " Cumplen la Oración y pagan el Zakat , y tienen una fe firme en el Más Allá.", "urdu": " (ایسے مومن) جو نماز باجماعت ادا کرتے ہیں اور زکٰوۃ ادا کرتے رہتے ہیں اور اخروی زندگی پر (اور بعد میں آنے والی موعود باتوں پر) یقین رکھتے ہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ زَیَّنَّا لَہُمۡ اَعۡمَالَہُمۡ فَہُمۡ یَعۡمَہُوۡنَ ؕ﴿۵﴾", "english": " As to those who believe not in the Hereafter, We have made their deeds appear beautiful to them, so they are wandering blindly.", "french": " Quant à ceux qui ne croient pas à l’au-delà, Nous avons embelli leurs œuvres à leurs yeux, aussi errent-ils aveuglément.", "german": " Die aber nicht an das Jenseits glauben – Wir haben ihnen ihre Werke schön erscheinen lassen; so wandern sie nur in Verwirrung.", "spanish": " En cuanto a quienes no creen en el Más Allá, hemos hecho que sus obras aparezcan bellas ante ellos, a fin de que vaguen ciegamente.", "urdu": " وہ لوگ جو اخروی زندگی پر ایمان نہیں لاتے ہم نے ان کے اعمال کو ان کے لئے خوبصورت کرکے دکھایا ہے پس وہ بہکے بہکے پھرتے ہیں۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ لَہُمۡ سُوۡٓءُ الۡعَذَابِ وَ ہُمۡ فِی الۡاٰخِرَۃِ ہُمُ الۡاَخۡسَرُوۡنَ ﴿۶﴾", "english": " It is they who shall have a grievous torment, and they alone it is who shall be the greatest losers in the Hereafter.", "french": " Ceux-là auront le pire châtiment et, dans l’au-delà, ils seront les plus grands perdants.", "german": " Das sind die, deren eine schlimme Strafe harrt, und sie allein sind es, die im Jenseits die größten Verlierer sein werden.", "spanish": " Recibirán un doloroso tor­mento, y sólo ellos serán los mayores perdedores en el Más Allá.", "urdu": " ان کے لئے دردناک عذاب ہوگا‘ اور وہ اخروی زندگی میں سب سے زیادہ گھاٹا پانے والے ہوں گے۔"}, {"arabic": " وَ اِنَّکَ لَتُلَقَّی الۡقُرۡاٰنَ مِنۡ لَّدُنۡ حَکِیۡمٍ عَلِیۡمٍ ﴿۷﴾", "english": " Verily, thou hast been given the Qur’an from the presence of One Wise, All-Knowing.", "french": " En vérité, tu reçois le Coran de la part d’un Dieu Sage, Omniscient.", "german": " Wahrlich, du empfängst den Qur-ân von einem Allweisen, Allwissenden.", "spanish": " En verdad, se te ha entregado el Corán desde la presencia del Único Sabio, Omnisciente.", "urdu": " اور تجھ کو یقیناً قرآن اُس (ہستی) کی طرف سے مل رہا ہے جو بہت حکمت والی (اور) بہت جاننے والی ہے۔"}, {"arabic": " اِذۡ قَالَ مُوۡسٰی لِاَہۡلِہٖۤ اِنِّیۡۤ اٰنَسۡتُ نَارًا ؕ سَاٰتِیۡکُمۡ مِّنۡہَا بِخَبَرٍ اَوۡ اٰتِیۡکُمۡ بِشِہَابٍ قَبَسٍ لَّعَلَّکُمۡ تَصۡطَلُوۡنَ ﴿۸﴾", "english": " Remember when Moses said to his family, ‘I perceive a fire. I will bring you from there some information, or I will bring you a flame, a burning brand, that you may warm yourselves.’", "french": " Souviens-toi quand Moïse dit à sa famille : « En vérité, j’aperçois un feu. Je vous en rapporterai quelque information, ou je vous en rapporterai un tison flambant, pour que vous puissiez vous réchauffer. »", "german": " (Denke daran) da Moses zu den Seinen sprach: \"Ich gewahre ein Feuer. Ich will euch von dort Kunde bringen, oder ich will euch eine Flamme bringen, einen Feuerbrand, auf dass ihr euch wärmen möget.\"", "spanish": " Acuérdate de cuando Moisés dijo a su familia: “Veo un uego. Os traeré alguna información de allí o una llama, una tea ardiente, para que os calentéis”.", "urdu": " (یاد کرو) جب موسیٰ نے اپنے اہل سے کہا کہ میں نے ایک آگ دیکھی ہے۔ میں یقیناً تمہارے پاس اس (آگ) سے کوئی (عظیم الشان) خبر لاٶں گا یا تمہارے پاس ایک چمکتا ہوا انگارہ لاٶں گا تا کہ تم آگ سینکو۔"}, {"arabic": " فَلَمَّا جَآءَہَا نُوۡدِیَ اَنۡۢ بُوۡرِکَ مَنۡ فِی النَّارِ وَ مَنۡ حَوۡلَہَا ؕ وَ سُبۡحٰنَ اللّٰہِ رَبِّ الۡعٰلَمِیۡنَ ﴿۹﴾", "english": " So when he came to it, he was called by a voice : ‘Blessed is he who is in the fire and also those around it; and glorified be Allah, the Lord of the worlds.", "french": " Et lorsqu’il y parvint, il fut interpellé : « Béni est celui qui est dans le feu, et aussi ceux qui sont autour, et gloire à Allāh, le Seigneur des mondes ;", "german": "", "spanish": " Pero cuando llegó, fue llamado por una voz: “Bendito sea quien está en el fuego y también los que lo rodean, y glorificado sea Al‑lah, el Señor de los mundos;", "urdu": " پھر جب وہ اس (آگ) کے پاس آئے تو ان کو آواز دی گئی کہ جو کوئی آگ میں ہے اور جو اس کے گرد ہے اس کو برکت دی گئی ہے اور اللہ رب العالمین پاک ہے۔"}, {"arabic": " یٰمُوۡسٰۤی اِنَّہٗۤ اَنَا اللّٰہُ الۡعَزِیۡزُ الۡحَکِیۡمُ ۙ﴿۱۰﴾", "english": " ‘O Moses verily I am Allah, the Mighty, the Wise.", "french": " « Ô Moïse, en vérité, Je suis Allāh, le Puissant, le Sage.", "german": " O Mose, Ich bin Allah, der Allmächtige, der Allweise.", "spanish": " “Oh Moisés, en verdad soy Al‑lah, el Poderoso, el Sabio;", "urdu": " اے موسیٰ بات یہ ہے کہ میں اللہ ہوں۔ جو غالب (اور) حکمت والا ہوں۔"}, {"arabic": " وَ اَلۡقِ عَصَاکَ ؕ فَلَمَّا رَاٰہَا تَہۡتَزُّ کَاَنَّہَا جَآنٌّ وَّلّٰی مُدۡبِرًا وَّ لَمۡ یُعَقِّبۡ ؕ یٰمُوۡسٰی لَا تَخَفۡ ۟ اِنِّیۡ لَا یَخَافُ لَدَیَّ الۡمُرۡسَلُوۡنَ ﴿٭ۖ۱۱﴾", "english": " ‘And throw down thy rod.’ And when he saw it move as though it were a serpent, he turned back retreating and did not look back. ‘O Moses, fear not. Verily I am with thee ; the Messengers need have no fear in My presence.", "french": " « Et jette ton bâton à terre . » Mais lorsqu’il le vit se remuer comme si c’était un serpent, il tourna le dos et s’enfuit sans regarder en arrière : « Ô Moïse, ne crains pas. En vérité, Je suis Celui en la présence Duquel, les Messagers ne doivent pas avoir peur.", "german": " Wirf deinen Stab hin.\" Doch da er ihn sich regen sah, als wäre er eine Schlange, da wandte er sich zur Flucht und schaute nicht zurück. \"O Mose, fürchte dich nicht. Wahrlich, Ich – in Meiner Gegenwart brauchen die Gesandten keine Furcht zu hegen;", "spanish": " “Arroja tu cayado”. Y cuan­do lo vio moverse como si fuera una serpiente, volvió la espalda en retirada y no miró atrás. “Oh, Moisés, no temas. En verdad estoy contigo; los Mensajeros no deben tener temor en Mi presencia;", "urdu": " تو اپنی لاٹھی پھینک۔ اور جب اس نے اس (لاٹھی) کو دیکھا کہ وہ ہل رہی ہے گویا کہ وہ ایک چھوٹا سانپ ہے تو وہ پیٹھ پھیر کر بھاگا اور پیچھے مڑ کر نہ دیکھا (تب ہم نے کہا) اے موسیٰ! ڈر نہیں‘ میں وہ ہوں کہ رسول میرے حضور میں ڈرا نہیں کرتے۔"}, {"arabic": " اِلَّا مَنۡ ظَلَمَ ثُمَّ بَدَّلَ حُسۡنًۢا بَعۡدَ سُوۡٓءٍ فَاِنِّیۡ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۲﴾", "english": " ‘As to those who do wrong and then substitute good for evil; to them , I am indeed Most Forgiving, Merciful.", "french": " Mais ceux qui font le mal, et ensuite remplacent le mal par le bien, pour eux Je suis en vérité Très-Pardonnant, Miséricordieux.", "german": " wer aber Unrecht tut und dann Gutes an Stelle des Bösen setzt, dann fürwahr, Ich bin allverzeihend, barmherzig.", "spanish": " “En cuanto a quienes prac­tican el mal pero más tarde susti­tuyen el mal por bien; para ellos, soy en verdad el Sumo Indulgente, Mise­ricordioso.", "urdu": " مگر جس نے ظلم کیا‘ لیکن پھر اس ظلم کو چھوڑ کر نیکی اختیار کی‘ میں (اس کے لئے) بڑا بخشنے والا (اور) باربار کرم کرنے والا ہوں۔"}, {"arabic": " وَ اَدۡخِلۡ یَدَکَ فِیۡ جَیۡبِکَ تَخۡرُجۡ بَیۡضَآءَ مِنۡ غَیۡرِ سُوۡٓءٍ ۟ فِیۡ تِسۡعِ اٰیٰتٍ اِلٰی فِرۡعَوۡنَ وَ قَوۡمِہٖ ؕ اِنَّہُمۡ کَانُوۡا قَوۡمًا فٰسِقِیۡنَ ﴿۱۳﴾", "english": " ‘And put thy hand into thy bosom; it will come forth white without any disease. This is among the nine Signs unto Pharaoh and his people; for they are a rebellious people.’", "french": " Et insère ta main dans l’ouverture de ta tunique ; elle en sortira blanche, sans être atteinte d' aucun mal. Ceci est un des neuf Signes destinés à Pharaon et à son peuple : car c’est un peuple rebelle. »", "german": "", "spanish": " “Mete tu mano en tu pecho, dentro de tu manto; saldrá blanca sin mancha alguna. Éste es uno de los nueve Signos para el Faraón y su pueblo; pues son un pueblo re­belde”.", "urdu": " اور تو اپنا ہاتھ اپنے گریبان میں ڈال وہ بغیر کسی بیماری کے سفید نکلے گا۔ یہ ان نو نشانوں میں سے ہے جو فرعون اور اس کی قوم کی طرف بھیجے جانے والے ہیں۔ وہ اطاعت سے نکل جانے والی قوم ہے۔"}, {"arabic": " فَلَمَّا جَآءَتۡہُمۡ اٰیٰتُنَا مُبۡصِرَۃً قَالُوۡا ہٰذَا سِحۡرٌ مُّبِیۡنٌ ﴿ۚ۱۴﴾", "english": " But when Our sight giving Signs came to them, they said, ‘This is plain magic.’", "french": " Mais lorsque Nos Signes éclairants leur vinrent, ils dirent : « Ceci est de la magie manifeste. »", "german": " Doch als Unsere erleuchtenden Zeichen zu ihnen kamen, sprachen sie: \"Das ist offenkundige Zauberei.\"", "spanish": " Pero cuando les llegaron nues­tros Signos evidentes, dijeron: “Es pura magia”.", "urdu": " پس جب ان کے پاس ہمارے نشانات جو آنکھیں کھول دینے والے تھے آئے تو انہوں نے کہا یہ تو ایک کھلا کھلا جادو ہے۔"}, {"arabic": " وَ جَحَدُوۡا بِہَا وَ اسۡتَیۡقَنَتۡہَاۤ اَنۡفُسُہُمۡ ظُلۡمًا وَّ عُلُوًّا ؕ فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ الۡمُفۡسِدِیۡنَ ﴿٪۱۵﴾", "english": " And they rejected them wrongfully and arrogantly, while their souls were convinced of them. See then, how evil was the end of those who acted corruptly!", "french": " Et ils les rejetèrent injustement et avec arrogance, alors que leur âme en était convaincue. Vois donc combien mauvaise était la fin de ceux qui avaient agi avec corruption.", "german": " Und sie verwarfen sie in Ungerechtigkeit und Hochmut, während ihre Seelen doch von ihnen überzeugt waren. Sieh nun, wie das Ende derer war, die verderbt handelten!", "spanish": " Y los rechazaron inicua y arrogantemente, aunque sus almas estaban convencidas de ellos. ¡Ved pues qué malo fue el destino de los que actuaron corruptamente!", "urdu": " اور انہوں نے اصرار سے ظلم اور تکبر کرتے ہوئے ان (نشانوں) کا انکار کیا‘ حالانکہ ان کے دل ان پر یقین لا چکے تھے۔ پس دیکھ کہ فساد کرنے والوں کا انجام کیسا ہوا کرتا ہے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا دَاوٗدَ وَ سُلَیۡمٰنَ عِلۡمًا ۚ وَ قَالَا الۡحَمۡدُ لِلّٰہِ الَّذِیۡ فَضَّلَنَا عَلٰی کَثِیۡرٍ مِّنۡ عِبَادِہِ الۡمُؤۡمِنِیۡنَ ﴿۱۶﴾", "english": " And We gave knowledge to David and Solomon, and they said, ‘All praise belongs to Allah, Who has exalted us above many of His believing servants.’", "french": " Et Nous donnâmes la connaissance à David et à Salomon, et ils dirent : « Toutes les louanges appartiennent à Allāh, Qui nous a élevés au-dessus de beaucoup de Ses serviteurs croyants. »", "german": " Und Wir gaben David und Salomo Wissen, und sie sprachen: \"Aller Preis gebührt Allah, Der uns erhöht hat über viele Seiner gläubigen Diener.\"", "spanish": " Y dimos a David y Salomón el conocimiento, y dijeron: “Toda alabanza corresponde a Al­-lah, Quien nos ensalzó por encima de muchos de Sus siervos creyentes”.", "urdu": " اور ہم نے داٶد اور سلیمان کو علم عطا کیا اور دونوں نے کہا‘ اللہ ہی سب تعریف کا مالک ہے جس نے ہم کو اپنے بہت سے مومن بندوں پر فضیلت دی ہے۔"}, {"arabic": " وَ وَرِثَ سُلَیۡمٰنُ دَاوٗدَ وَ قَالَ یٰۤاَیُّہَا النَّاسُ عُلِّمۡنَا مَنۡطِقَ الطَّیۡرِ وَ اُوۡتِیۡنَا مِنۡ کُلِّ شَیۡءٍ ؕ اِنَّ ہٰذَا لَہُوَ الۡفَضۡلُ الۡمُبِیۡنُ ﴿۱۷﴾", "english": " And Solomon was heir to David. And he said, ‘O ye people, we have been taught the language of birds; and we have had everything bestowed upon us. This indeed is God ’ s manifest grace.’", "french": " Et Salomon fut l’héritier de David. Et il dit : « Ô vous les gens, le langage des oiseaux nous a été enseigné, et toutes choses nous ont été accordées. Ceci est certainement la grâce manifeste d’Allāh . »", "german": " Salomo ward Davids Erbe, und er sprach: \"O ihr Menschen, der Vögel Sprache ist uns gelehrt worden; und alles ward uns beschert. Das ist fürwahr die offenbare Huld.\"", "spanish": " Salomón fue el heredero de David. Y dijo: “Oh, pueblo mío, se nos ha enseñado el lenguaje de las aves; y se nos han concedido todas las cosas. Esto es en verdad un don manifiesto de Dios ”.", "urdu": " اور سلیمان داٶد کا وارث بنا اور اس نے کہا اے لوگو! ہمیں پرندوں کی زبان سکھائی گئی ہے اور ہر ضروری چیز (یعنی تعلیم) ہم کو دی گئی ہے یہ کھلا کھلا فضل ہے۔"}, {"arabic": " وَ حُشِرَ لِسُلَیۡمٰنَ جُنُوۡدُہٗ مِنَ الۡجِنِّ وَ الۡاِنۡسِ وَ الطَّیۡرِ فَہُمۡ یُوۡزَعُوۡنَ ﴿۱۸﴾", "english": " And there were gathered together unto Solomon his hosts of Jinn and men and birds, and they were formed into separate divisions,", "french": " Et étaient rassemblés devant Salomon ses armées de djinns, d’hommes et d’oiseaux et ils étaient groupés en divisions séparées,", "german": " Und versammelt wurden dort vor Salomo dessen Heerscharen der Jinn und Menschen und Vögel, und sie waren in geschlossene Abteilungen geordnet,", "spanish": " Y se reunieron ante Salomón sus ejércitos de Yinn, hombres y aves, y se dispusieron en grupos separados.", "urdu": " اور (ایک دفعہ) سلیمان کے سامنے جنوں اور انسانوں اور پرندوں میں سے اس کے لشکر ترتیب وار اکٹھے کیے گئے (پھر ان کو کوچ کا حکم ملا) ۔"}, {"arabic": " حَتّٰۤی اِذَاۤ اَتَوۡا عَلٰی وَادِ النَّمۡلِ ۙ قَالَتۡ نَمۡلَۃٌ یّٰۤاَیُّہَا النَّمۡلُ ادۡخُلُوۡا مَسٰکِنَکُمۡ ۚ لَا یَحۡطِمَنَّکُمۡ سُلَیۡمٰنُ وَ جُنُوۡدُہٗ ۙ وَ ہُمۡ لَا یَشۡعُرُوۡنَ ﴿۱۹﴾", "english": " Until when they came to the Valley of Al-Naml, one woman of the tribe of the Naml said, ‘O ye Naml, enter your habitations, lest Solomon and his hosts crush you, while they know not.’", "french": " Jusqu’à ce que lorsqu’ils atteignirent la Vallée d’Al-Naml, une femme namlite dit : « Ô vous les Naml, rentrez dans vos habitations, pour que Salomon et ses armées ne vous écrasent sans le savoir. »", "german": " bis dann, als sie zum Tale Naml kamen, ein Weib der Naml sprach: \"O ihr Naml, geht hinein in eure Wohnungen, damit nicht Salomo und seine Heerscharen euch zertreten, ohne dass sie es merken.\"", "spanish": " Hasta que, una vez llegados al Valle de Naml, una mujer namlita dijo: “Oh, vosotros, Naml, entrad en vuestras viviendas, no sea que Salomón y sus ejércitos os aplasten sin saberlo”.", "urdu": " یہاں تک کہ جب وہ وادی نملہ میں پہنچے تو نملہ قوم میں سے ایک شخص نے کہا‘ اے نملہ قوم اپنے اپنے گھروں میں چلے جاٶ۔ ایسا نہ ہو کہ سلیمان اور اس کے لشکر (تمہارے حالات کو) نہ جانتے ہوئے تمہیں پیروں کے نیچے مسل دیں۔"}, {"arabic": " فَتَبَسَّمَ ضَاحِکًا مِّنۡ قَوۡلِہَا وَ قَالَ رَبِّ اَوۡزِعۡنِیۡۤ اَنۡ اَشۡکُرَ نِعۡمَتَکَ الَّتِیۡۤ اَنۡعَمۡتَ عَلَیَّ وَ عَلٰی وَالِدَیَّ وَ اَنۡ اَعۡمَلَ صَالِحًا تَرۡضٰٮہُ وَ اَدۡخِلۡنِیۡ بِرَحۡمَتِکَ فِیۡ عِبَادِکَ الصّٰلِحِیۡنَ ﴿۲۰﴾", "english": " Thereupon he smiled, laughing at her words, and said, ‘My Lord, grant me the will and power to be grateful for Thy favour which Thou hast bestowed upon me and upon my parents, and to do such good works as would please Thee, and admit me, by Thy mercy, among Thy righteous servants.’", "french": " Sur quoi il sourit, ses paroles le faisant rire, et dit : « Mon Seigneur, accorde-moi la capacité d’être reconnaissant envers Toi pour Ta grâce que Tu m’as accordée ainsi qu’à mes parents, et de faire de telles bonnes œuvres qui Te plaisent ; et par Ta miséricorde, admets-moi parmi Tes serviteurs justes. »", "german": " Da lächelte er heiter über ihre Worte und sprach: \"Mein Herr, gib mir ein, dankbar zu sein für Deine Gnade, die Du mir und meinen Eltern gewährt hast, und Gutes zu tun, das Dir wohlgefällig sei, und nimm mich, durch Deine Barmherzigkeit, unter Deine rechtschaffenen Diener auf.\"", "spanish": " Ante lo cual sonrió, rién­dose de sus palabras, y dijo: “Señor mío, capacítame para ser agradecido por Tus favores, que Tú nos has concedido a mí y a mis padres, y para hacer las buenas obras que te agraden, y admíteme, por Tu misericordia, entre Tus siervos justos”.", "urdu": " پس سلیمان اس کی بات سن کر ہنس پڑا اور کہا‘ اے میرے رب! مجھے توفیق دے کہ تیری نعمت کا جو تو نے مجھ پر اور میرے والدین پر کی ہے شکریہ ادا کر سکوں اور ایسا مناسب عمل کروں جسے تو پسند فرمائے اور (اے خدا) اپنے رحم کے ساتھ تو مجھے اپنے بزرگ بندوں میں داخل کر۔"}, {"arabic": " وَ تَفَقَّدَ الطَّیۡرَ فَقَالَ مَا لِیَ لَاۤ اَرَی الۡہُدۡہُدَ ۫ۖ اَمۡ کَانَ مِنَ الۡغَآئِبِیۡنَ ﴿۲۱﴾", "english": " And he reviewed the birds, and said, ‘How is it that I do not see Hudhud? Is he among the absentees?", "french": " Et il passa les oiseaux en revue, et dit : « Comment se fait-il que je ne vois pas Hudhud ? Est-il parmi les absents ?", "german": " Und er musterte die Vögel und sprach: \"Wie kommt es, dass ich den Hudhud nicht sehe? Ist er unter den Abwesenden?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:21&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:21&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic22\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic22\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:22' style='text-decoration:underline'>27:22</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(22)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control22\"></i></button> <audio id=\"player22\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَاُعَذِّبَنَّہٗ عَذَابًا شَدِیۡدًا اَوۡ لَاَاذۡبَحَنَّہٗۤ اَوۡ لَیَاۡتِیَنِّیۡ بِسُلۡطٰنٍ مُّبِیۡنٍ ﴿۲۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘I will surely punish him with a severe punishment or I will slay him, unless he bring me a clear reason <em>for his absence</em>.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘I will surely punish<sup class='ref'>[<a class='ref' data-id='ref_27_22_2160' href='#'>2160</a>]</sup> him with a severe punishment or I will slay him, unless he brings me a clear reason <i>for his absence</i>.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_27_22_2160'>2160</span></div> <div><a name='2160'></a><div class='reference' data-id='ref_27_22_2160' style='display:none'> <p><b>2160.</b> Contrary to popular belief, based on fable and fiction, Hud-hud was not a bird employed by Solomon as his message-bearer since (a) it was inconsistent with Solomon’s dignity as a great monarch and a Divine Prophet to be so angry with a small bird as to be prepared to inflict severe punishment upon it or even to kill it. (b) Hud-hud seems to be well-acquainted with the rules and requirements of States and also well-versed in the knowledge about Divine Unity (vv. 25, 26) which birds are not. (c) Hud-hud, being not a migratory bird, cannot fly long distances and therefore could not have been selected for the journey to Sheba and back (v. 23). It follows from these facts that Hud-hud was not a bird but a man, even a very responsible officer of State or a general who had been entrusted with an important political mission by Solomon to the Queen of Sheba. The practice of exchange of envoys seems to have been quite popular in Solomon’s time. Moreover, it is a known fact that men are named after birds and animals. Hud-hud was a popular name among Solomon’s people. The word seems to be the Arabicised form of Hudad, a biblical name. It appears to have been the name of several Edomite kings. A son of Ishmael, too, bore this name. Similarly, an Edomite prince who fled to Egypt for fear of Jacob’s massacre was known by this name (1 Kings <a href='/quran/11:14' target=_blank>11:14</a>). The name appeared to be so popular and is so frequently used in the Old Testament that when used without a qualifying word it means, 'a man of the Edomite family' (Jew. Enc.). Hud-hud is also said to be the name of the father of Bilqis, the Queen of Sheba (Muntahal-Arab). (<a href='javascript:void(0)' data-id='ref_27_22_2160' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">میں ضرور اسے سخت عذاب دوں گا یا پھر اسے ضرور ذبح کردوں گا یا وہ (اپنے دفاع میں) میرے پاس کوئی کھلی کھلی دلیل لے کر آئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">میں اس کو یقیناً سخت سزا دوں گا‘ یا اسے قتل کر دوں گا۔ یا وہ میرے سامنے کوئی کھلی دلیل (اپنی غیر حاضری کی) پیش کرے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Je le châtierai assurément d’un châtiment rigoureux, ou je le tuerai, à moins qu’il ne m’apporte une raison claire <em>pour expliquer son absence</em>. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Lo someteré a un severo castigo o le mataré, salvo que me presente una razón clara <em>de su ausencia”.</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ich will ihn gewisslich strafen mit strenger Strafe oder ich will ihn töten, es sei denn, er bringt mir einen triftigen Grund vor.\"", "spanish": " Y examinó a las aves y dijo: “¿Cómo es que no veo a Hudhud? ¿Está entre los ausentes?", "urdu": " اور اس نے سب پرندوں کی حاضری لی۔ پھر کہا مجھے کیا ہوا ہے کہ میں ہدہد کو نہیں دیکھتا‘ یا وہ (جان بوجھ کر) غیر حاضر ہے۔"}, {"arabic": " فَمَکَثَ غَیۡرَ بَعِیۡدٍ فَقَالَ اَحَطۡتُّ بِمَا لَمۡ تُحِطۡ بِہٖ وَ جِئۡتُکَ مِنۡ سَبَاٍۭ بِنَبَاٍ یَّقِیۡنٍ ﴿۲۳﴾", "english": " And he did not tarry long before Hudhud came and said, ‘I have encompassed that which thou hast not encompassed; and I have come to thee from Saba’ with sure tidings.", "french": " Et il n’eût pas à attendre longtemps avant que Hudhud ne vînt et dit : « J’ai compris ce que tu n’as pas compris ; et je suis venu à toi de Saba avec une nouvelle sûre.", "german": "", "spanish": " Y no se demoró mucho antes de que llegara Hudhud, diciendo: “He comprendido lo que tú no has com­prendido; y he venido aquí desde Saba con noticias ciertas;", "urdu": " پس کچھ دیر وہ ٹھہرا (اتنے میں ہدہد حاضر ہوا) اور اس نے کہا کہ میں نے اس چیز کا علم حاصل کیا ہے جو تجھے حاصل نہیں اور میں سبا (کی قوم کے علاقہ) سے تیرے پاس (آیا ہوںاور)ایک یقینی خبر لایا ہوں۔"}, {"arabic": " اِنِّیۡ وَجَدۡتُّ امۡرَاَۃً تَمۡلِکُہُمۡ وَ اُوۡتِیَتۡ مِنۡ کُلِّ شَیۡءٍ وَّ لَہَا عَرۡشٌ عَظِیۡمٌ ﴿۲۴﴾", "english": " ‘I found a woman ruling over them, and she has been given everything, and she has a mighty throne.", "french": " En vérité, j’ai trouvé une femme régnant sur eux, et tout lui a été accordé, et elle a un trône magnifique.", "german": " Ich fand eine Frau über sie herrschen, und ihr ist alles beschert worden, und sie hat einen mächtigen Thron.", "spanish": " “Encontré a una mujer que los gobierna, a la que se le ha concedido de todo y tiene un trono poderoso;", "urdu": " (جو یہ ہے کہ) میں نے (وہاں) ایک عورت کو دیکھا جو ان (کی ساری قوم) پر حکومت کر رہی ہے اور ہر نعمت اسے حاصل ہے اور اس کا ایک بڑا تخت ہے۔"}, {"arabic": " وَجَدۡتُّہَا وَ قَوۡمَہَا یَسۡجُدُوۡنَ لِلشَّمۡسِ مِنۡ دُوۡنِ اللّٰہِ وَ زَیَّنَ لَہُمُ الشَّیۡطٰنُ اَعۡمَالَہُمۡ فَصَدَّہُمۡ عَنِ السَّبِیۡلِ فَہُمۡ لَا یَہۡتَدُوۡنَ ﴿ۙ۲۵﴾", "english": " ‘I found her and her people worshipping the sun instead of Allah; and Satan has made their works look beautiful to them, and has thus hindered them from the right way, so that they follow not guidance;", "french": " Je l’ai trouvée, elle et son peuple adorant le soleil au lieu d’Allāh, et Satan a embelli leurs œuvres à leurs yeux, et les a empêchés de suivre la bonne voie, de sorte qu’ils ne sont pas bien guidés ;", "german": " Ich fand sie und ihr Volk die Sonne anbeten statt Allah; und Satan hat ihnen ihre Werke ausgeschmückt und hat sie abgehalten von dem Weg, so dass sie dem Weg nicht folgen;", "spanish": " “Encontré a ella y a su pueblo adorando al sol en lugar de a Al‑lah; y Satanás hizo que sus obras aparecieran bellas a sus ojos, desviándolos así del camino recto, para que no siguieran la guía;", "urdu": " اور میں نے اس کو اور اس کی قوم کو اللہ کے سوا سورج کے آگے سجدہ کرتے دیکھا اور شیطان نے ان کے عمل ان کو خوبصورت کرکے دکھائے ہیں اور ان کے سچے راستہ سے روک دیا ہے جس کی وجہ سے وہ ہدایت نہیں پاتے۔"}, {"arabic": " اَلَّا یَسۡجُدُوۡا لِلّٰہِ الَّذِیۡ یُخۡرِجُ الۡخَبۡءَ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ وَ یَعۡلَمُ مَا تُخۡفُوۡنَ وَ مَا تُعۡلِنُوۡنَ ﴿۲۶﴾", "english": " ‘ And Satan has bidden them not to worship Allah, Who brings to light that which is hidden in the heavens and the earth, and Who knows what you conceal and what you make known.", "french": " Et Satan leur a commandé de ne pas adorer Allāh, Qui met à jour ce qui est caché dans les cieux et sur la terre, et Qui sait ce que vous cachez et ce que vous révélez.", "german": " (und Satan hat sie geheißen) nicht Allah zu verehren, Der ans Licht bringt, was verborgen ist in den Himmeln und auf Erden, und Der weiß, was ihr verhehlt und was ihr offenbart.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:26&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:26&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic27\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic27\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:27' style='text-decoration:underline'>27:27</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(27)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control27\"></i></button> <audio id=\"player27\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ ﴿ٛ۲۷﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Allah! there is no God but He, the Lord of the Mighty Throne.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Allah! there is no god but He, the Lord of the Mighty Throne.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اللہ وہ ہے کہ کوئی معبود نہیں مگر وہی عرشِ عظیم کا ربّ۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(حالانکہ) اللہ وہ ہے جس کے سوا کوئی معبود نہیں (وہ) ایک بڑے تخت کا مالک ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Allāh ! Il n’y a de dieu que Lui, le Seigneur du Trône Puissant. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em></em>“¡Al‑lah! no hay ningún dios fuera de Él, el Señor del Trono Po­deroso”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Allah! es gibt keinen Gott außer Ihm, dem Herrn des erhabenen Throns.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:27&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:27&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic28\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic28\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:28' style='text-decoration:underline'>27:28</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(28)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control28\"></i></button> <audio id=\"player28\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ سَنَنۡظُرُ اَصَدَقۡتَ اَمۡ کُنۡتَ مِنَ الۡکٰذِبِیۡنَ ﴿۲۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\"><I> Solomon </I>said, ‘We shall see whether thou hast spoken the truth or whether thou art one of those who lie.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <i>Thereupon Solomon </i>said, ‘We shall see whether thou hast spoken the truth or whether thou art a liar;’<sup class='ref'>[<a class='ref' data-id='ref_27_28_2164' href='#'>2164</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_27_28_2164'>2164</span></div> <div><a name='2164'></a><div class='reference' data-id='ref_27_28_2164' style='display:none'> <p><b>2164.</b> Birds are never known to speak the truth or tell lies. The verse affords yet one more proof of Hud-hud being not a bird but an important official in Solomon’s government. (<a href='javascript:void(0)' data-id='ref_27_28_2164' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا ہم جائزہ لیں گے کہ کیا تُو نے سچ کہا ہے یا تُو جھوٹوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اس پر سلیمان نے) کہا کہ ہم دیکھیں گے کہ تو نے سچ بولا ہے یا تو جھوٹوں میں سے ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Salomon</em> dit : « Nous verrons si tu as dit la vérité, ou si tu es de ceux qui mentent.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em> Salomón </em>dijo: 'Veremos si has dicho la verdad o si eres uno de los que mienten;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">(Salomo) sprach: \"Wir werden sehen, ob du die Wahrheit gesprochen hast oder ob du ein Lügner bist.", "spanish": " “Y Satanás les impuso no adorar a Al‑lah, que es Quien saca a la luz lo que está oculto en los cielos y la tierra, y sabe lo que ocultáis y manifestáis.", "urdu": " (اور مصر ہیں) کہ اللہ کو سجدہ نہ کریں جو کہ آسمانوں اور زمین کی ہر پوشیدہ تقدیر کو ظاہر کرتا ہے اور جو کچھ تم چھپاتے اور ظاہر کرتے ہو ان (تدبیروں) کو بھی جانتا ہے۔"}, {"arabic": " اِذۡہَبۡ بِّکِتٰبِیۡ ہٰذَا فَاَلۡقِہۡ اِلَیۡہِمۡ ثُمَّ تَوَلَّ عَنۡہُمۡ فَانۡظُرۡ مَا ذَا یَرۡجِعُوۡنَ ﴿۲۹﴾", "english": " ‘Go thou, with this letter of mine, and lay it before them; then withdraw from them and see what answer they return.’", "french": " Va avec ma lettre que voici, et présente-la devant eux ; ensuite retire-toi et vois quelle réponse ils rendront. »", "german": " Geh mit diesem Briefe von mir und lege ihn vor sie hin; dann ziehe dich von ihnen zurück und schau, was sie erwidern.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:29&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:29&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic30\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic30\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:30' style='text-decoration:underline'>27:30</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(30)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control30\"></i></button> <audio id=\"player30\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَتۡ یٰۤاَیُّہَا الۡمَلَؤُا اِنِّیۡۤ اُلۡقِیَ اِلَیَّ کِتٰبٌ کَرِیۡمٌ ﴿۳۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\"><I> The Queen </I>said, “Ye chiefs, there has been delivered to me a noble letter.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <i>The Queen </i>said, ‘Ye chiefs, there has been delivered to me a noble letter;’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">(یہ خط دیکھ کر) اس (ملکہ) نے کہا اے سردارو! میری طرف یقیناً ایک معزز خط بھیجا گیا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(جب اس نے ایسا کیا) تو وہ (ملکہ) بولی۔ اے میرے درباریو! میرے سامنے ایک معزز خط رکھا گیا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>La Reine</em> dit : « Ô chefs, une lettre noble m’a été remise.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>La Reina </em>dijo: “Oh, jefes, se me ha entregado una carta noble;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">(Die Königin) sprach: «Ihr Häupter, ein ehrenvoller Brief ist mir überbracht worden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:30&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:30&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic31\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic31\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:31' style='text-decoration:underline'>27:31</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(31)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control31\"></i></button> <audio id=\"player31\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّہٗ مِنۡ سُلَیۡمٰنَ وَ اِنَّہٗ بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ ﴿ۙ۳۱﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">“It is from Solomon, and it is: ‘In the name of Allah, the Gracious, the Merciful;</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> “It is from Solomon, and it is: ‘In the name of Allah, the Gracious, the Merciful;<sup class='ref'>[<a class='ref' data-id='ref_27_31_2166' href='#'>2166</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_27_31_2166'>2166</span></div> <div><a name='2166'></a><div class='reference' data-id='ref_27_31_2166' style='display:none'> <p><b>2166.</b> Some Christian orientalists, as is their practise, have vainly sought to impugn the Divine origin of the Qur’an by trying to show that the expression <i>Bismillah </i>has been borrowed from earlier Scriptures. Wherry in his \"Commentary\" says that it has been borrowed from Zend-Avesta. Sale has expressed an identical view, while Rodwell is of the opinion that pre-Islamic Arabs borrowed it from Jews and subsequently it was incorporated in the Qur’an by the Holy Prophet. To say that because this expression is found in some former Scriptures, therefore it must have necessarily been borrowed from one of them by the Qur’an is evidently a flimsy inference. If anything, it only proves that the Qur’an has originated from the same Source from which those Scriptures had originated. Moreover, no other Scripture has used this expression in the form and manner in which the Qur’an has done. Also, the pre-Islamic Arabs had never used it before it was revealed in the Qur’an. On the contrary, they had a special aversion for the use of the Divine attribute <i>Ar-Rahman </i>(<a href='/quran/25:61' target=_blank>25:61</a>), which forms an integral part of <i>Bismillah</i>. See also <a href='/quran/1:1' target=_blank>1:1</a>. (<a href='javascript:void(0)' data-id='ref_27_31_2166' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً وہ سلیمان کی طرف سے ہے اور وہ یہ ہے: اللہ کے نام کے ساتھ جو بے انتہا رحم کرنے والا، بِن مانگے دینے والا (ا ور) بار بار رحم کرنے والا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(جس کا مضمون یہ ہے کہ) یہ خط سلیمان کی طرف سے ہے اور اس میں بتایا گیا ہے کہ اللہ جو بے انتہا رحم کرنے والا (اور) باربار کرم کرنے والا ہے‘ اس کے نام سے ہم شروع کرتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Elle est de Salomon, et elle se lit : « Au nom d’Allāh, le Gracieux, le Miséricordieux ;</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Es de Salomón, y dice: “En el nombre de Al‑lah, el Clemente, el Misericordioso;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er ist von Salomo, und er ist: \"Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " “Ve con esta carta mía y pre­séntasela; apártate luego de ellos y comprueba qué respuesta dan”.", "urdu": " تو میرا یہ خط لے جا اور اسے ان کے (یعنی سبا کی قوم کے) سامنے پھینک دے پھر (ادب سے) پیچھے ہٹ (کر کھڑا ہو) جا اور دیکھ کہ وہ کیا جواب دیتے ہیں۔"}, {"arabic": " اَلَّا تَعۡلُوۡا عَلَیَّ وَ اۡتُوۡنِیۡ مُسۡلِمِیۡنَ ﴿٪۳۲﴾", "english": " ‘Behave not proudly towards me, but come to me in submission.’”", "french": " Ne soyez pas arrogants envers moi, et venez à moi en toute soumission. »", "german": "", "spanish": " “No os comportéis orgullosa­mente ante mí; antes bien venid a mí sumisos”,", "urdu": " (اور کہتے ہیں) کہ ہم پر زیادتی نہ کرو اور ہمارے حضور میں فرمانبردار بن کر حاضر ہو جاٶ۔"}, {"arabic": " قَالَتۡ یٰۤاَیُّہَا الۡمَلَؤُا اَفۡتُوۡنِیۡ فِیۡۤ اَمۡرِیۡ ۚ مَا کُنۡتُ قَاطِعَۃً اَمۡرًا حَتّٰی تَشۡہَدُوۡنِ ﴿۳۳﴾", "english": " She said, ‘Ye chiefs, advise me in the matter that is before me. I never decide any matter until you are present with me and give me your advice .’", "french": " Elle dit : « Ô chefs, conseillez-moi dans l’affaire devant moi. Je ne décide jamais une affaire tant que vous n’êtes pas présents avec moi pour me conseiller. »", "german": " Sie sprach: «O ihr Häupter, ratet mir in meiner Sache. Ich entscheide keine Angelegenheit, solange ihr nicht zugegen seid.»", "spanish": " Ella dijo: “Oh, jefes, aconsejadme en el asunto que se me plantea. Nunca he decidido asunto alguno mientras no me hayáis presentado vuestras observaciones”.", "urdu": " پھر اس (ملکہ) نے کہا۔ اے سردارو! میرے معاملہ میں اپنی پختہ رائے دو۔ کیونکہ میں کبھی کوئی فیصلہ نہیں کرتی۔ جب تک کہ تم میرے پاس حاضر نہ ہو (اور مشورہ نہ دے لو)"}, {"arabic": " قَالُوۡا نَحۡنُ اُولُوۡا قُوَّۃٍ وَّ اُولُوۡا بَاۡسٍ شَدِیۡدٍ ۬ۙ وَّ الۡاَمۡرُ اِلَیۡکِ فَانۡظُرِیۡ مَاذَا تَاۡمُرِیۡنَ ﴿۳۴﴾", "english": " They replied, ‘We possess power and we possess great prowess in war, but it is for thee to command; therefore consider thou what thou wilt command.’", "french": " Ils répondirent : « Nous sommes puissants et nous possédons une grande hardiesse guerrière, mais c’est à toi de commander ; considère donc ce que tu veux commander. »", "german": " Sie antworteten: \"Wir besitzen Kraft und besitzen starke Kriegsmacht, aber dir obliegt der Befehl; sieh nun zu, was du befehlen willst.\"", "spanish": " Respondieron: “Poseemos po­der. Y somos guerreros implacables, pero a ti corresponde de­cidir; considera pues lo que has de ordenarnos”.", "urdu": " (درباریوں نے) کہا ہم بڑی طاقت والے ہیں اور بڑے جنگجو ہیں اور (آخری) معاملہ آپ کے ہاتھ میں ہے پس غور کر لیں کہ آپ کیا حکم دینا چاہتی ہیں (ہم اس کی اتباع کریں گے)"}, {"arabic": " قَالَتۡ اِنَّ الۡمُلُوۡکَ اِذَا دَخَلُوۡا قَرۡیَۃً اَفۡسَدُوۡہَا وَ جَعَلُوۡۤا اَعِزَّۃَ اَہۡلِہَاۤ اَذِلَّۃً ۚ وَ کَذٰلِکَ یَفۡعَلُوۡنَ ﴿۳۵﴾", "english": " She said, ‘Surely, kings, when they enter a country, despoil it, and turn the highest of its people into the lowest. And thus will they do.", "french": " Elle dit : « Assurément, les rois, lorsqu’ils entrent dans un pays, ils y créent le désordre, et font des plus honorables de ses habitants les plus bas. Et c’est ainsi qu’ils agissent.", "german": " Sie sprach: \"Fürwahr, wenn Könige in ein Land eindringen, verwüsten sie es und machen die höchsten unter seinen Bewohnern zu den niedrigsten. So verfahren sie.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:35&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:35&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic36\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic36\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:36' style='text-decoration:underline'>27:36</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(36)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control36\"></i></button> <audio id=\"player36\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِنِّیۡ مُرۡسِلَۃٌ اِلَیۡہِمۡ بِہَدِیَّۃٍ فَنٰظِرَۃٌۢ بِمَ یَرۡجِعُ الۡمُرۡسَلُوۡنَ ﴿۳۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘But I am going to send them a present and wait to see what <em>answer</em> the envoys bring back.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> But I am going to send them a present and wait to see what <i>answer </i>the envoys bring back.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ضرور میں ان کی طرف ایک تحفہ بھیجنے لگی ہوں۔ پھر میں دیکھوں گی کہ ایلچی کیا جواب لاتے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور (میں نے فیصلہ کیا ہے کہ) میں ان کی طرف ایک تحفہ بھیجوں گی۔ پھر دیکھوں گی کہ میرے ایلچی کیا جواب لے کر واپس آتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Mais je vais leur envoyer un présent, et j’attendrai de voir avec quelle <em>réponse</em> reviendront les envoyés. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Pero voy a enviarles un pre­sente y a esperar qué <em>respuesta </em>traen de nuevo los emisarios”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ich aber will ihnen ein Geschenk schicken und will abwarten, was die Boten zurückbringen \"", "spanish": " Ella respondió: “En verdad, cuando los reyes entran en un país, lo despojan y convierten en misera­bles a quienes ocupan los puestos más altos entre ellos. Y así actuarán;", "urdu": " اس نے کہا کہ جب بادشاہ کسی ملک میں داخل ہوتے ہیں تو اسے تباہ کردیتے ہیں اور اس کے باشندوں میں سے معزز لوگوں کو ذلیل کر دیا کرتے ہیں اور وہ اسی طرح کرتے چلے آئے ہیں۔"}, {"arabic": " فَلَمَّا جَآءَ سُلَیۡمٰنَ قَالَ اَتُمِدُّوۡنَنِ بِمَالٍ ۫ فَمَاۤ اٰتٰٮنِۦَ اللّٰہُ خَیۡرٌ مِّمَّاۤ اٰتٰٮکُمۡ ۚ بَلۡ اَنۡتُمۡ بِہَدِیَّتِکُمۡ تَفۡرَحُوۡنَ ﴿۳۷﴾", "english": " So when the Queen ’ s ambassador came to Solomon, he said, ‘Do you mean to help me with your wealth? But that which Allah has given me is better than that which He has given you. Nay, but you rejoice in your gift.", "french": " Alors, quand l’envoyé de la Reine arriva auprès de Salomon, celui-ci dit : « Avez-vous l’intention de m’aider avec votre richesse ? Mais ce qu’Allāh m’a donné est meilleur que ce qu’Il vous a donné. Mais vous êtes fiers de votre présent.", "german": " Als nun (ihr Botschafter) zu Salomo kam, sprach (dieser): \"Schüttet ihr Reichtümer über mich aus? Jedoch was Allah mir gegeben hat, ist besser als das, was Er euch gegeben. Nein, ihr seid es, die sich ihrer Gabe freuen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:37&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:37&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic38\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic38\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:38' style='text-decoration:underline'>27:38</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(38)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control38\"></i></button> <audio id=\"player38\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِرۡجِعۡ اِلَیۡہِمۡ فَلَنَاۡتِیَنَّہُمۡ بِجُنُوۡدٍ لَّا قِبَلَ لَہُمۡ بِہَا وَ لَنُخۡرِجَنَّہُمۡ مِّنۡہَاۤ اَذِلَّۃً وَّ ہُمۡ صٰغِرُوۡنَ ﴿۳۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Go back to them, for we shall surely come to them with hosts against which they will have no power, and we shall drive them out from there disgraced, and they will be humbled.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Go back to them, for we shall surely come to them with hosts against which they will have no power <i>of resistance</i>,<sup class='ref'>[<a class='ref' data-id='ref_27_38_2170' href='#'>2170</a>]</sup> and we shall drive them out <i>of their land </i>disgraced, and they will be humbled.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_27_38_2170'>2170</span></div> <div><a name='2170'></a><div class='reference' data-id='ref_27_38_2170' style='display:none'> <p><b>2170.</b> <i>Qibal </i>means, power, strength, authority. They say <i>mali bihi Qibalun</i>, i.e. I have no power against him (Aqrab). (<a href='javascript:void(0)' data-id='ref_27_38_2170' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اُن کی طرف لوٹ جا۔ پس ہم ضرور اُن کے پاس ایسے لشکروں کے ساتھ آئیں گے جن کا کوئی مقابلہ ان کےلئے ممکن نہیں اور ہم انہیں ضرور اس (بستی) سے ذلیل بناتے ہوئے نکال دیں گے اور وہ بے بس ہوں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اے ہدہد)! تو ان کی طرف لوٹ جا اور (ان سے کہدے کہ) میں ایک بڑے لشکر کے ساتھ ان کے پاس آٶں گا ایسا لشکر کہ اس کے مقابلہ کی ان کو طاقت نہ ہوگی اورمیں ان کو اس (ملک) سے (مفتوح ہونے کے بعد) ایسی حالت میں نکال دوں گا کہ (وہ بادشاہت کی) عزت کھوچکے ہوں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Retourne vers eux, car nous viendrons assurément à eux avec des armées, contre lesquelles ils n’auront aucun pouvoir ; et nous les chasserons de là, couverts de déshonneur et ils seront humiliés. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Vuelve a ellos, pues en ver­dad iremos a ellos con ejércitos con­tra los que no tendrán poder al­guno y los expulsaremos de allí envilecidos, y serán humillados”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Kehre zu ihnen zurück, denn wir werden ganz gewiss mit Heerscharen zu ihnen kommen, gegen die sie keine Macht haben werden, und wir werden sie von dort austreiben in Schmach, und sie werden sich gedemütigt fühlen.\"", "spanish": " Así, cuando llegó a Salomón ­ el embajador de la Reina, dijo: “¿Pre­tendéis ayudarme con vuestra riqueza? Pero lo que Al‑lah me ha dado es mejor que lo que os ha dado a vosotros. No, pero os rego­cijáis con vuestro regalo;", "urdu": " پھر جب وہ تحفہ سلیمان کے سامنے لاکر رکھا گیا تو اس نے کہا کیا تم مال کے ذریعہ سے میری مدد کرنا چاہتے ہو (اگر یہ بات ہے تو یاد رکھو کہ) اللہ نے جو کچھ مجھے دیا ہے وہ اس سے بہت بہتر ہے جو تم کو دیا ہے اور (معلوم ہوتا ہے کہ) تم اپنے تحفہ پر بڑے نازاں ہو۔"}, {"arabic": " قَالَ یٰۤاَیُّہَا الۡمَلَؤُا اَیُّکُمۡ یَاۡتِیۡنِیۡ بِعَرۡشِہَا قَبۡلَ اَنۡ یَّاۡتُوۡنِیۡ مُسۡلِمِیۡنَ ﴿۳۹﴾", "english": " He said, ‘O nobles, which of you will bring me a throne for her before they come to me, submitting?’", "french": " Il dit : « Ô nobles, lequel d’entre vous m’apportera une réplique de son trône avant qu’ils ne viennent m’offrant la soumission ? »", "german": " Er sprach: \"O ihr Häupter, wer von euch bringt mir ihren Thron, bevor sie zu mir kommen in Ergebenheit?\"", "spanish": " Dijo: “Oh, nobles, ¿cuál de vosotros me traerá su trono antes de que me lleguen sometidos?”.", "urdu": " (اس کے بعد) اس نے (اپنے درباریوں سے مخاطب ہو کر) کہا۔ اے درباریو! تم میں سے کون اس کے تخت کو میرے پاس لے آئے گا پیشتر اس کے کہ وہ (لوگ) فرمانبردار ہو کر میری خدمت میں حاضر ہوں۔"}, {"arabic": " قَالَ عِفۡرِیۡتٌ مِّنَ الۡجِنِّ اَنَا اٰتِیۡکَ بِہٖ قَبۡلَ اَنۡ تَقُوۡمَ مِنۡ مَّقَامِکَ ۚ وَ اِنِّیۡ عَلَیۡہِ لَقَوِیٌّ اَمِیۡنٌ ﴿۴۰﴾", "english": " Said a stalwart from among the Jinn: ‘I will bring it to thee before thou rise from thy camp; and indeed I possess power therefore and I am trustworthy.’", "french": " Un chef puissant de parmi les djinns dit : « Je te l’apporterai avant que tu ne lèves ton camp ; et assurément j’ai le pouvoir de le faire, et je suis digne de confiance. »", "german": " Da sprach ein Kraftvoller unter den Jinn: \"Ich will ihn dir bringen, ehe du dich von deinem Feldlager erhebst; wahrlich, ich habe die Stärke dazu und bin vertrauenswürdig.\"", "spanish": " Uno de los más fornidos de entre los Yinn dijo: “Te lo presentaré antes de que te levantes de tu cam­pamento; Pues en verdad poseo poder para ello y soy digno de con­fianza”.", "urdu": " (پہاڑی قوموں میں سے) ایک سرکش سردار نے کہا۔ آپ کے (اس) مقام سے جانے سے پہلے میں وہ (عرش) لے آٶں گا اور میں اس بات پر بڑی قدرت رکھنے والا (اور) امانت دار ہوں۔"}, {"arabic": " قَالَ الَّذِیۡ عِنۡدَہٗ عِلۡمٌ مِّنَ الۡکِتٰبِ اَنَا اٰتِیۡکَ بِہٖ قَبۡلَ اَنۡ یَّرۡتَدَّ اِلَیۡکَ طَرۡفُکَ ؕ فَلَمَّا رَاٰہُ مُسۡتَقِرًّا عِنۡدَہٗ قَالَ ہٰذَا مِنۡ فَضۡلِ رَبِّیۡ ۟ۖ لِیَبۡلُوَنِیۡۤ ءَاَشۡکُرُ اَمۡ اَکۡفُرُ ؕ وَ مَنۡ شَکَرَ فَاِنَّمَا یَشۡکُرُ لِنَفۡسِہٖ ۚ وَ مَنۡ کَفَرَ فَاِنَّ رَبِّیۡ غَنِیٌّ کَرِیۡمٌ ﴿۴۱﴾", "english": " Said one who had knowledge of the Book, ‘I will bring it to thee before thy noble messengers return to thee.’ And when he saw it set before him, he said, ‘This is by the grace of my Lord, that He may try me whether I am grateful or ungrateful. And whosoever is grateful is grateful for the good of his own soul; but whosoever is ungrateful, truly my Lord is Self- Sufficient, Generous.’", "french": " Un d’entre eux qui avait une bonne connaissance du Livre dit : « Je te l’apporterai avant que tu n'aies cligné de l'oeil. » Et lorsqu’il le vit placé devant lui, il dit : « Ceci est de la grâce de mon Seigneur, afin qu’Il m’éprouve pour découvrir si je suis reconnaissant ou ingrat. Et quiconque est reconnaissant est reconnaissant pour le bien de sa propre âme ; mais quiconque est ingrat, en vérité mon Seigneur Se suffit à Lui-Même, et Il est Généreux. »", "german": " Da sprach einer, der Kenntnis von der Schrift hatte: \"Ich bringe ihn dir, ehe dein Blick zu dir zurückkehrt.\" Und da er ihn vor sich stehen sah, sprach er: \"Dies ist durch die Gnade meines Herrn, dass Er mich prüfen möge, ob ich dankbar oder undankbar bin. Und wer dankbar ist, der ist dankbar zum Heil seiner eigenen Seele; wer aber undankbar ist – siehe, mein Herr ist Sich Selbst genügend, freigebig.\"", "spanish": " Dijo uno que tenía conocimiento del Libro: “Te lo traeré en menos de un abrir y cerrar de ojos”. Y cuando lo vio ante él, dijo: “Esto es por la gracia de mi Señor, para probarme si soy agradecido o ingrato. ues quien es agradecido lo es ciertamente para el bien de su propia alma; mas quien es desagra­decido, sepa que, en verdad, mi Señor es Auto‑Suficiente, Generoso”.", "urdu": " (اس پر) اس شخص نے جس کو (الٰہی) کتاب کا علم حاصل تھا کہا کہ میں تیرے پاس اس (تخت) کو تیرے آنکھ جھپکنے سے پہلے لے آٶں گا۔ پس جب (سلیمان نے) اس کو پاس رکھا ہوا دیکھا تو اس نے کہا۔ یہ میرے رب کے فضل کی وجہ سے ہوا ہے تا کہ وہ مجھے آزمائے کہ میں شکر کرتا ہوں یا ناشکری کرتا ہوں اور جو شکر کرے وہ اپنی جان کے فائدہ کے لئے ایسا کرتا ہے اور جو ناشکری کرے تو یقیناً میرا رب بے نیاز (اور) بڑی سخاوت کرنے والا ہے۔"}, {"arabic": " قَالَ نَکِّرُوۡا لَہَا عَرۡشَہَا نَنۡظُرۡ اَتَہۡتَدِیۡۤ اَمۡ تَکُوۡنُ مِنَ الَّذِیۡنَ لَا یَہۡتَدُوۡنَ ﴿۴۲﴾", "english": " He said, ‘Make her throne unrecognizable to her, and let us see whether she follows the right way or whether she is one of those who follow not the right way.’", "french": " Il dit : « Faites de sorte que son trône paraisse très ordinaire à ses yeux, et voyons si elle suit le bon chemin, ou si elle est de ceux qui ne suivent pas le bon chemin. »", "german": " Er sprach: \"Lasst ihr ihren Thron gering erscheinen; wir wollen sehen, ob sie dem rechten Weg folgt oder ob sie zu denen gehört, die nicht dem rechten Wege folgen.\"", "spanish": " Dijo: “Haced que su trono aparezca corriente para ella, y veamos si sigue el camino recto o si es una de quienes no siguen el ca­mino recto”.", "urdu": " (پھر) اس نے کہا اس (ملکہ) کے لئے اس کا عرش حقیر کرکے دکھاٶ (ہم دیکھیں گے کہ) کیا وہ ہدایت پاتی ہے یا ان لوگوں میں سے بنتی ہے جو ہدایت نہیں پاتے۔"}, {"arabic": " فَلَمَّا جَآءَتۡ قِیۡلَ اَہٰکَذَا عَرۡشُکِ ؕ قَالَتۡ کَاَنَّہٗ ہُوَ ۚ وَ اُوۡتِیۡنَا الۡعِلۡمَ مِنۡ قَبۡلِہَا وَ کُنَّا مُسۡلِمِیۡنَ ﴿۴۳﴾", "english": " And when she came, it was said, ‘Is thy throne like this?’ She replied, ‘It is as though it were the same. And we had been given knowledge before this, and we have already submitted.’", "french": " Et lorsqu’elle vint, il lui fut dit : « Ton trône ressemble-t-il à celui-ci. » Elle répondit : « C’est comme si c’était le même. Et la connaissance nous avait déjà été accordée avant ceci, et nous nous sommes déjà soumis. »", "german": " Als sie kam, da ward gesprochen: \"Ist dein Thron wie dieser?\" Sie antwortete: \"Es ist als wäre er ein und derselbe. Und uns ward schon vordem Kenntnis verliehen, und wir hatten uns bereits ergeben.\"", "spanish": " Y cuando ella hubo llegado, se le dijo: “¿Es tu trono como éste?” Ella respondió: “Es como se fuese el mismo. Nos había llegado el conocimiento antes de esto, y ya nos hemos sometido”.", "urdu": " پس جب وہ آگئی تو کہا گیا‘ کیا تیرا تخت ایسا ہی ہے؟ اس پر اس نے کہا۔ کہ یوں معلوم ہوتا ہے یہ وہی ہے اور ہم کو اس سے پہلے ہی علم حاصل ہو چکا تھا اور ہم (تیرے) فرمانبردار بن چکے تھے۔"}, {"arabic": " وَ صَدَّہَا مَا کَانَتۡ تَّعۡبُدُ مِنۡ دُوۡنِ اللّٰہِ ؕ اِنَّہَا کَانَتۡ مِنۡ قَوۡمٍ کٰفِرِیۡنَ ﴿۴۴﴾", "english": " And that which she used to worship beside Allah had stopped her from believing ; for she came of a disbelieving people.", "french": " Et ce qu’elle avait été habituée à adorer en dehors d’Allāh l’avait empêchée de croire ; car elle venait d’un peuple mécréant. .", "german": " Und er hielt sie ab von dem, was sie statt Allah zu verehren pflegte, denn sie gehörte zu einem ungläubigen Volk.", "spanish": " Mas lo que ella solía adorar fuera de Al‑lah le había impedido creer; pues procedía de un pueblo incrédulo.", "urdu": " اور سلیمان نے ملکہ کو اللہ کے سوا پرستش کرنے سے روکا۔ وہ یقیناً کافر قوم میں سے تھی۔"}, {"arabic": " قِیۡلَ لَہَا ادۡخُلِی الصَّرۡحَ ۚ فَلَمَّا رَاَتۡہُ حَسِبَتۡہُ لُجَّۃً وَّ کَشَفَتۡ عَنۡ سَاقَیۡہَا ؕ قَالَ اِنَّہٗ صَرۡحٌ مُّمَرَّدٌ مِّنۡ قَوَارِیۡرَ ۬ؕ قَالَتۡ رَبِّ اِنِّیۡ ظَلَمۡتُ نَفۡسِیۡ وَ اَسۡلَمۡتُ مَعَ سُلَیۡمٰنَ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ﴿٪۴۵﴾", "english": " It was said to her, ‘Enter the palace.’ And when she saw it, she thought it to be a great expanse of water, and she uncovered her shanks. Solomon said, ‘It is a palace paved smooth with slabs of glass.’ She said, ‘My Lord, I indeed wronged my soul; and I submit myself with Solomon to Allah, the Lord of the worlds.’", "french": " Il lui fut dit : « Entre dans le palais : » Et lorsqu’elle le vit, elle crut que c’était de l’eau profonde, et elle découvrit ses jambes. Salomon lui dit : « C’est un palais pavé de plaques de verre. » Elle dit : « Mon Seigneur, en vérité j’ai injustement traité mon âme ; et je me soumets, avec Salomon, à Allāh, le Seigneur des mondes. »", "german": " Es ward zu ihr gesprochen: \"Tritt ein in den Palast.\" Und da sie ihn sah, hielt sie ihn für einen Wasserspiegel und entblößte ihre Schenkel. (Salomo) sprach: \"Es ist ein Palast, getäfelt und gepflastert mit geglättetem Glas.\" Sie sprach: \"Mein Herr, ich habe fürwahr wider meine eigene Seele gesündigt; und ich ergebe mich, mit Salomo, Allah, dem Herrn der Welten.\"", "spanish": " Se le dijo: “Entra en el pa­lacio”. Y cuando ella lo vio, creyó que ra una gran extensión de agua y se descubrió las piernas. Salomón dijo: “Es un palacio pavimentado con losas de cristal”. Ella dijo: “Mi Señor, en verdad he sido injusta con mi alma; ahora me someto con Sa­lomón a Al‑lah, el Señor de los mundos”.", "urdu": " اور اسے کہا گیا کہ محل میں داخل ہو جاٶ۔ پس جب اس نے اس (محل) کو دیکھا تو اس کو گہرا پانی سمجھا اور گھبرا گئی۔ تب سلیمان نے کہا یہ تو محل ہے جس میں شیشہ کے ٹکڑے لگائے گئے ہیں۔ تب وہ (ملکہ) بولی۔ اے میرے رب! میں نے اپنی جان پر ظلم کیا اور میں سلیمان کے ساتھ رب العالمین خدا پر ایمان لاتی ہوں۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَاۤ اِلٰی ثَمُوۡدَ اَخَاہُمۡ صٰلِحًا اَنِ اعۡبُدُوا اللّٰہَ فَاِذَا ہُمۡ فَرِیۡقٰنِ یَخۡتَصِمُوۡنَ ﴿۴۶﴾", "english": " And We sent to Thamud their brother Salih, who said , ‘Worship Allah.’ But behold, they became two parties contending with each other.", "french": " Et Nous envoyâmes aux Thamūd leur frère Ṣāliḥ, qui leur dit : « Adorez Allāh. » Mais ils se séparèrent en deux groupes se querellant entre eux.", "german": " Wir entsandten zu den Thamûd ihren Bruder Sâleh (der sprach): \"Verehret Allah!\" Doch siehe, sie wurden zwei Parteien, die miteinander stritten.", "spanish": " Enviamos a los Zamud a su hermano Salih, quien dijo: “Adorad a Al‑lah”. Pero he aquí se dividieron en dos grupos que disputaban entre sí.", "urdu": " اور ہم نے ثمود کی طرف ان کے بھائی صالح کو ضرور رسول بنا کر بھیجا تھا‘ (یہ کہتے ہوئے) کہ اللہ کی عبادت کرو۔ پس وہ (سنتے ہی) دو گروہ ہو گئے جو آپس میں جھگڑنے لگے۔"}, {"arabic": " قَالَ یٰقَوۡمِ لِمَ تَسۡتَعۡجِلُوۡنَ بِالسَّیِّئَۃِ قَبۡلَ الۡحَسَنَۃِ ۚ لَوۡ لَا تَسۡتَغۡفِرُوۡنَ اللّٰہَ لَعَلَّکُمۡ تُرۡحَمُوۡنَ ﴿۴۷﴾", "english": " He said, ‘O my people, why do you wish to hasten on the evil rather than the good? Wherefore do you not ask forgiveness of Allah that you may be shown mercy?’", "french": " Il dit : « Ô mon peuple, pourquoi désirez-vous hâter le mal plutôt que le bien ? Pour quelle raison ne demandez-vous pas pardon à Allāh, afin que la miséricorde vous soit faite ? »", "german": " Er sprach: \"O mein Volk, weshalb wollt ihr lieber das Böse beschleunigt sehen als das Gute? Warum bittet ihr nicht Allah um Verzeihung, damit euch Barmherzigkeit zuteil werde?\"", "spanish": " Él dijo: “Oh, pueblo mío, ¿por qué deseas apresurarte al mal en vez de hacerlo al bien?, ¿Por qué no pedís pues perdón a Al‑lah para que se os muestre misericordia?”.", "urdu": " اس (صالح) نے کہا‘ اے میری قوم! تم خوشحالی کے آنے سے پہلے خراب حالی کے لئے کیوں جلدی کرتے ہو کیا تم خدا سے اپنے گناہوں پر استغفار نہیں کرتے تا کہ تم پر رحم کیا جائے۔"}, {"arabic": " قَالُوا اطَّیَّرۡنَا بِکَ وَ بِمَنۡ مَّعَکَ ؕ قَالَ طٰٓئِرُکُمۡ عِنۡدَ اللّٰہِ بَلۡ اَنۡتُمۡ قَوۡمٌ تُفۡتَنُوۡنَ ﴿۴۸﴾", "english": " They said, ‘We auger evil from thee and from those that are with thee.’ He said, ‘ The cause of your evil fortune is with Allah. Nay, but you are a people who are on trial.’", "french": " Ils dirent : « Nous augurons du mal de toi et de ceux qui sont avec toi. » Il dit : « La vraie raison de votre mauvaise fortune est avec Allāh. Mais vous êtes un peuple qui est en train d’être éprouvé. »", "german": " Sie sprachen: \"Wir ahnen Böses von dir und von denen, die mit dir sind.\" Er sprach: \"Euer Unheil ist bereits bei Allah. Nein, ihr seid ein Volk, das geprüft wird.\"", "spanish": " Respondieron: “Te auguramos el mal a ti y a quienes están contigo”. Él respondió: “ La causa de vuestra mala fortuna está en Al‑lah. Así es, pues no sois más que un pueblo que está a prueba”.", "urdu": " انہوں نے کہا (اے صالح) ہم نے (جتنا سوچا ہے) تجھے اور تیرے ساتھیوں کو منحوس ہی پایا ہے۔ صالح نے کہا تمہاری نحوست کا سبب تو اللہ کے پاس ہے بلکہ حقیقت یہ ہے کہ تم ایک ایسی قوم ہو جس کو آزمائش میں ڈالا گیا ہے۔"}, {"arabic": " وَ کَانَ فِی الۡمَدِیۡنَۃِ تِسۡعَۃُ رَہۡطٍ یُّفۡسِدُوۡنَ فِی الۡاَرۡضِ وَ لَا یُصۡلِحُوۡنَ ﴿۴۹﴾", "english": " And there were in the city a party of nine persons who made mischief in the land, and would not reform.", "french": " Et il y avait dans la ville un groupe de neuf personnes qui créaient le désordre dans le pays, et n’ y apportaient pas la réforme.", "german": " Und es waren in der Stadt neun Leute, die Unheil im Lande stifteten, und sie wollten sich nicht bessern.", "spanish": " Y había en la ciudad un grupo de nueve personas que corrompían el país y no estaban dispuestas a reformarse.", "urdu": " اور شہر میں نو آدمی تھے جو ملک میں فساد کرتے تھے۔ اور اصلاح نہیں کرتے تھے۔"}, {"arabic": " قَالُوۡا تَقَاسَمُوۡا بِاللّٰہِ لَنُبَیِّتَنَّہٗ وَ اَہۡلَہٗ ثُمَّ لَنَقُوۡلَنَّ لِوَلِیِّہٖ مَا شَہِدۡنَا مَہۡلِکَ اَہۡلِہٖ وَ اِنَّا لَصٰدِقُوۡنَ ﴿۵۰﴾", "english": " They said, “Swear to each other by Allah that we will surely attack him and his family by night, and then we will say to his heir, ‘We witnessed not the destruction of his family, and most surely we are truthful.’”", "french": " Ils dirent : « Jurons par Allāh que nous l’attaquerons assurément de nuit, lui et sa famille, et ensuite nous dirons à son héritier : « Nous n’avons pas été témoins de la destruction de sa famille, et nous sommes sûrement véridiques. »", "german": " Sie sprachen: «Schwöret einander bei Allah zu, dass wir gewisslich ihn (Sâleh) und seine Angehörigen nachts überfallen wollen, und dann wollen wir zu seinem Hinterlassenen sagen: \"Wir waren nicht Zeugen beim Untergang seiner Familie, und wir reden bestimmt die Wahrheit.\"»", "spanish": " Dijeron: “Juraos mutuamente por Al‑lah que lo atacaremos ciertamente a él y a su familia por la noche, y después diremos a su here­dero: “No hemos sido testigos de la destrucción de su familia, y en verdad somos veraces”.", "urdu": " انہوں نے کہا تم سب اس پر اللہ کی قسم کھاٶ کہ ہم اس کے اور اس کے گھر والوں پر رات کے وقت حملہ کریں گے پھر جو بھی اس کے خون کا مطالبہ کرنے آئے گا ہم اس سے کہیں گے کہ ہم نے اس کے اہل کی ہلاکت (کے واقعہ) کو نہیں دیکھا اور ہم سچے ہیں۔"}, {"arabic": " وَ مَکَرُوۡا مَکۡرًا وَّ مَکَرۡنَا مَکۡرًا وَّ ہُمۡ لَا یَشۡعُرُوۡنَ ﴿۵۱﴾", "english": " And they planned a plan, and We planned a plan, but they perceived it not.", "french": " Et ils firent un plan, et Nous aussi Nous fîmes un plan en guise de contre-mesure , mais ils ne s’ en aperçurent pas.", "german": " Sie schmiedeten einen Plan, auch Wir schmiedeten einen Plan, aber sie gewahrten es nicht.", "spanish": " Y tramaron un plan pero Nosotros preparamos nuestro plan en contra , aunque no se percataron de ello.", "urdu": " اور انہوں نے ایک تدبیر کی اور ہم نے بھی ایک تدبیر کی اور وہ جانتے نہیں تھے۔"}, {"arabic": " فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ مَکۡرِہِمۡ ۙ اَنَّا دَمَّرۡنٰہُمۡ وَ قَوۡمَہُمۡ اَجۡمَعِیۡنَ ﴿۵۲﴾", "english": " Then see how evil was the end of their plan! Verily, We utterly destroyed them and their people all together.", "french": " Vois donc comment leur plan a mal tourné, et en vérité Nous les avons complètement anéantis, eux et leur peuple, tous ensemble.", "german": " Sieh nun, wie der Ausgang ihres Planes war, denn Wir vernichteten sie und all ihr Volk ganz und gar.", "spanish": " ¡Ved pues qué malo fue el resultado de su plan! En verdad, los destruimos totalmente, a ellos y a su pueblo, todos juntos.", "urdu": " پھر دیکھ کہ ان کی تدبیر کا نتیجہ کیا نکلا۔ ہم نے ان کو اور ان کی قوم کو سب کو تباہ کرکے رکھ دیا۔"}, {"arabic": " فَتِلۡکَ بُیُوۡتُہُمۡ خَاوِیَۃًۢ بِمَا ظَلَمُوۡا ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۵۳﴾", "english": " And yonder are their houses empty, because of their wrongdoing. In that, verily, is a Sign for a people who possess knowledge.", "french": " Et là-bas se trouvent leurs maisons désertes, parce qu’ils furent injustes. En vérité, il y a en cela un Signe pour un peuple qui possède de la connaissance.", "german": " Und dort sind ihre Häuser, verfallen ob ihres Frevelns. Hierin ist wahrlich ein Zeichen für Leute, die wissen,", "spanish": " Y allá yacen sus casas en ruinas, debido a sus malas acciones. Ahí hay en verdad un Signo para un pueblo que posea conocimiento.", "urdu": " پس (دیکھ) یہ ان کے گھر ہیں جو ان کے ظلموں کی وجہ سے گرے ہوئے ہیں۔ اس میں علم والی قوم کے لئے بڑا نشان ہے۔"}, {"arabic": " وَ اَنۡجَیۡنَا الَّذِیۡنَ اٰمَنُوۡا وَ کَانُوۡا یَتَّقُوۡنَ ﴿۵۴﴾", "english": " And We saved those who believed and feared God.", "french": " Et Nous sauvâmes ceux qui croyaient et craignaient Allāh .", "german": " und Wir erretteten jene, die glaubten und gottesfürchtig waren.", "spanish": " Y salvamos a quienes cre­yeron en Dios y lo temieron.", "urdu": " اور ہم نے ان لوگوں کو جو ایمان لائے اور تقویٰ کرتے تھے نجات دی۔"}, {"arabic": " وَ لُوۡطًا اِذۡ قَالَ لِقَوۡمِہٖۤ اَتَاۡتُوۡنَ الۡفَاحِشَۃَ وَ اَنۡتُمۡ تُبۡصِرُوۡنَ ﴿۵۵﴾", "english": " And remember Lot, when he said to his people, ‘Do you commit abomination while you see the evil thereof ?", "french": " Et Nous envoyâmes Lot en tant que Messager , lorsqu’il dit à son peuple : « Commettez-vous l’indécence alors que vous en voyez le mal clairement ?", "german": " Und (gedenke) Lots, da er zu seinem Volke sprach: \"Wollt ihr geflissentlich Schändlichkeit begehen?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:55&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:55&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic56\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic56\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:56' style='text-decoration:underline'>27:56</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(56)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control56\"></i></button> <audio id=\"player56\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَئِنَّکُمۡ لَتَاۡتُوۡنَ الرِّجَالَ شَہۡوَۃً مِّنۡ دُوۡنِ النِّسَآءِ ؕ بَلۡ اَنۡتُمۡ قَوۡمٌ تَجۡہَلُوۡنَ ﴿۵۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">What! do you approach men lustfully rather than women? Nay, you are indeed an ignorant people.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_27_56_b' href='#'>b</a>]</sup>‘What! do you approach men lustfully rather than women? Nay, you are indeed an ignorant people.” <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_27_56_b'>b</span></div> <div><div class='reference' data-id='ref_27_56_b' style='display:none'> <p><b>b.</b> <a href='/quran/7:82' target=_blank>7:82</a>; <a href='/quran/26:166' target=_blank>26:166</a>, <a href='/quran/26:167' target=_blank>167</a>; <a href='/quran/29:30' target=_blank>29:30</a>. (<a href='javascript:void(0)' data-id='ref_27_56_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\"> کیا تم ضرور شہوت مٹانے کے لئے عورتوں کو چھوڑ کر مَردوں کے پاس آتے ہو؟ بلکہ تم تو ایک جاہل قوم ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا تم عورتوں کو چھوڑ کر مردوں کے پاس شہوت کی نیت سے آتے ہو حقیقت یہ ہے کہ تم ایک جاہل قوم ہو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Comment ! Vous approchez-vous lascivement des hommes plutôt que des femmes ? <em>Non</em>, mais, vous êtes en vérité un peuple indifférent <em>aux conséquences</em>. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡Cómo! ¿Os acercáis con lu­juria a los hombres en vez de a las mujeres? No, en verdad, sois un pue­blo inconsciente de las consecuencias”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wollt ihr euch wirklich Männern in Begierde nähern statt Frauen? Nein, ihr seid ein unwissendes Volk.\"", "spanish": " Acuérdate de Lot, cuando dijo a su pueblo: “¿Seguís cometiendo abominaciones aunque veis su maldad?", "urdu": " اور (ہم نے) لوط کو (بھی رسول بنا کر بھیجا) جبکہ اس نے اپنی قوم سے کہا کیا تم بدیاں کرتے ہوں اور تم دیکھ رہے ہوتے ہو۔"}, {"arabic": " فَمَا کَانَ جَوَابَ قَوۡمِہٖۤ اِلَّاۤ اَنۡ قَالُوۡۤا اَخۡرِجُوۡۤا اٰلَ لُوۡطٍ مِّنۡ قَرۡیَتِکُمۡ ۚ اِنَّہُمۡ اُنَاسٌ یَّتَطَہَّرُوۡنَ ﴿۵۷﴾", "english": " But the answer of his people was naught save that they said, ‘Drive out Lot’s family from your city. They are a people who would keep clean.’", "french": " Mais la réponse de son peuple ne fut autre que : « Chassez la famille de Lot de votre ville ; ce sont des gens qui prétendent être purs. »", "german": " Doch die Antwort seines Volkes war nur, dass sie sprachen: \"Treibet Lots Familie hinaus aus eurer Stadt; denn sie sind Leute, die rein sein möchten.\"", "spanish": " Mas la respuesta de su pueblo no fue otra que incitar a la gente y decir: “Ex­pulsad de vuestra ciudad a los seguidores de Lot. Son, en verdad, gente que pretende ser pura”.", "urdu": " پس اس قوم کا جواب صرف یہ تھا کہ (اے لوگو) لوط کے خاندان کو اپنے شہر سے نکال دو۔ وہ ایسے لوگ ہیں جو بڑا نیک بننا چاہتے ہیں۔"}, {"arabic": " فَاَنۡجَیۡنٰہُ وَ اَہۡلَہٗۤ اِلَّا امۡرَاَتَہٗ ۫ قَدَّرۡنٰہَا مِنَ الۡغٰبِرِیۡنَ ﴿۵۸﴾", "english": " So We saved him and his family, except his wife; her We decreed to be of those who stayed behind.", "french": " Nous l’avons donc sauvé, lui ainsi que sa famille, excepté sa femme, car nous l’avons comptée au nombre de ceux qui resteraient en arrière.", "german": " Also erretteten Wir ihn und die Seinen, bis auf seine Frau; sie ließen Wir unter denen sein, die zurückblieben.", "spanish": " Por eso lo salvamos a él y a su familia, excepto a su esposa; pues decretamos que fuese de los que que­daron detrás.", "urdu": " نتیجہ یہ ہوا کہ ہم نے اس (لوط) کو اور اس کے خاندان کے لوگوں کو سوائے اس کی بیوی کے نجات دی۔ ہم نے اس (بیوی) کو پیچھے رہنے والوں میں گن چھوڑا تھا۔"}, {"arabic": " وَ اَمۡطَرۡنَا عَلَیۡہِمۡ مَّطَرًا ۚ فَسَآءَ مَطَرُ الۡمُنۡذَرِیۡنَ ﴿٪۵۹﴾", "english": " And We rained upon them a rain; and evil was the rain for those who were warned.", "french": " Et Nous avons fait pleuvoir sur eux une pluie ; et mauvaise fut la pluie pour ceux qui avaient été avertis.", "german": " Und Wir ließen einen Regen auf sie niederregnen; und schlimm war der Regen den Gewarnten.", "spanish": " Y desencadenamos sobre ellos un aguacero; y la lluvia fue muy mala para los que habían sido adver­tidos.", "urdu": " اور ہم نے ان پر ایک بارش برسائی اور جن کو عذاب کا پیغام پہنچ چکا ہو‘ ان کی بارش بہت بری ہوتی ہے۔"}, {"arabic": " قُلِ الۡحَمۡدُ لِلّٰہِ وَ سَلٰمٌ عَلٰی عِبَادِہِ الَّذِیۡنَ اصۡطَفٰی ؕ آٰللّٰہُ خَیۡرٌ اَمَّا یُشۡرِکُوۡنَ ﴿ؕ۶۰﴾", "english": " Say, ‘All praise belongs to Allah, and peace be upon those servants of His whom He has chosen. Is Allah better or what they associate with Him ?’", "french": " Dis : « Toutes les louanges appartiennent à Allāh, et la paix soit sur ceux de Ses serviteurs qu’Il a choisis ! Est-ce Allāh Qui est meilleur, ou ce qu’ils Lui associent ? »", "german": " Sprich: \"Aller Preis gebührt Allah, und Frieden sei über jenen von Seinen Dienern, die Er auserwählt hat. Ist Allah besser oder das, was sie anbeten?\"", "spanish": " Di: “Toda alabanza corres­ponde a Al‑lah, y la paz sea con los siervos Suyos a quienes Él ha ele­gido. ¿Es mejor Al‑lah o lo que asocian a Él? ”.", "urdu": " تو کہہ دے ہر تعریف کا اللہ (ہی) مستحق ہے اور اس کے وہ بندے جن کو اس نے چن لیا ہو ان پر ہمیشہ سلامتی نازل ہوتی ہے۔ کیا اللہ بہتر ہے یا وہ چیزیں جن کو وہ (اس کا) شریک قرار دیتے ہیں؟"}, {"arabic": " اَمَّنۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ اَنۡزَلَ لَکُمۡ مِّنَ السَّمَآءِ مَآءً ۚ فَاَنۡۢبَتۡنَا بِہٖ حَدَآئِقَ ذَاتَ بَہۡجَۃٍ ۚ مَا کَانَ لَکُمۡ اَنۡ تُنۡۢبِتُوۡا شَجَرَہَا ؕ ءَ اِلٰہٌ مَّعَ اللّٰہِ ؕ بَلۡ ہُمۡ قَوۡمٌ یَّعۡدِلُوۡنَ ﴿ؕ۶۱﴾", "english": " Or, Who created the heavens and the earth, and Who sent down water for you from the sky wherewith We cause to grow beautiful orchards? You could not cause their trees to grow. Is there a God besides Allah? Nay, they are a people who deviate from the right path .", "french": " Ou, Qui a créé les cieux et la terre, et Qui a fait descendre du ciel pour vous l’eau avec laquelle Nous faisons croître des vergers resplendissants ? Vous n’auriez pas pu faire croître leurs arbres. Y-a-t-il un dieu avec Allāh ? Non, mais c’est un peuple qui s'écarte du droit chemin .", "german": " Wer hat denn Himmel und Erde geschaffen, und wer sendet Wasser für euch vom Himmel nieder, durch das Wir Gärten, in Schönheit prangend, sprießen lassen? Ihr vermöchtet nicht, ihre Bäume sprießen zu lassen. Ist wohl ein Gott neben Allah? Nein, sie sind ein Volk, das Götter neben Gott stellt.", "spanish": " O, ¿quién creó los cielos y la tierra, y quién os envió agua desde el cielo con la que hacemos que crezcan huertos espléndidos? Vosotros no podríais hacer que sus árboles crecieran. ¿Existe acaso algún dios fuera de Al‑lah? No; son un pueblo que atribuyen partícipes a Al‑lah.", "urdu": " (بتاٶ تو) آسمانوں اور زمین کو کس نے پیدا کیا ہے؟ اور (کس نے) تمہارے لئے بادل سے پانی اتارا ہے پھر اس (پانی) کے ذریعہ سے ہم نے خوبصورت باغ نکالے ہیں تم ان باغوں کے درخت نہیں اگا سکتے تھے۔ کیا اللہ کے ساتھ اور بھی معبود ہے؟ (جو سب کائنات عالم کا انتظام کر رہا ہے) لیکن یہ (کافر) ایسی قوم ہیں جو اس کے شریک بنارہے ہیں۔"}, {"arabic": " اَمَّنۡ جَعَلَ الۡاَرۡضَ قَرَارًا وَّ جَعَلَ خِلٰلَہَاۤ اَنۡہٰرًا وَّ جَعَلَ لَہَا رَوَاسِیَ وَ جَعَلَ بَیۡنَ الۡبَحۡرَیۡنِ حَاجِزًا ؕ ءَ اِلٰہٌ مَّعَ اللّٰہِ ؕ بَلۡ اَکۡثَرُہُمۡ لَا یَعۡلَمُوۡنَ ﴿ؕ۶۲﴾", "english": " Or, Who made the earth a place of rest, and placed rivers in its midst, and placed upon it firm mountains, and put a barrier between the two waters? Is there a God besides Allah? Nay, most of them know not.", "french": " Ou, Qui a fait de la terre un lieu de repos, et a placé des rivières à travers elle, et lui a assigné des montagnes solidement ancrées, et a mis une barrière entre les deux mers ? Y-a-t-il un dieu avec Allāh ? Non , mais la plupart d’entre eux ne savent pas.", "german": " Wer hat denn die Erde zu einer Ruhestatt gemacht und Flüsse durch ihre Mitte geführt und feste Berge auf ihr errichtet und eine Schranke zwischen die beiden Meere gesetzt? Ist wohl ein Gott neben Allah? Nein, die meisten von ihnen wissen es nicht.", "spanish": " O, ¿Quién hizo de la tierra un lugar de descanso, colocó ríos en su mitad y dispuso en ella firmes mon­tañas, ubicando una barrera entre las dos aguas? ¿Existe algún dios fuera de Al‑lah? No, la mayoría de ellos no lo saben.", "urdu": " بتاٶ تو) کس نے زمین کو ٹھہرنے کی جگہ بنایا ہے؟ اور اس کے بیچ میں دریا چلائے ہیں اور اس کے (فائدہ کے) لئے پہاڑ بنائے ہیں اور دو سمندروں کے درمیان (جن میں سے ایک میٹھا اور ایک کھاری ہوتا ہے) ایک روک بنائی ہے۔ کیا اللہ کے سوا کوئی اور معبود ہے؟ لیکن حقیقت یہ ہے کہ ان میں سے اکثر جانتے نہیں۔"}, {"arabic": " اَمَّنۡ یُّجِیۡبُ الۡمُضۡطَرَّ اِذَا دَعَاہُ وَ یَکۡشِفُ السُّوۡٓءَ وَ یَجۡعَلُکُمۡ خُلَفَآءَ الۡاَرۡضِ ؕ ءَ اِلٰہٌ مَّعَ اللّٰہِ ؕ قَلِیۡلًا مَّا تَذَکَّرُوۡنَ ﴿ؕ۶۳﴾", "english": " Or, Who answers the distressed person when he calls upon Him, and removes the evil, and makes you successors in the earth? Is there a God besides Allah? Little is it that you reflect.", "french": " Ou, Qui répond à l’appel de celui qui est en détresse lorsqu’il L’invoque, et lui enlève le mal, et fait de vous les héritiers de la terre ? Y-a-t-il un dieu avec Allāh ? Vous réfléchissez bien peu !", "german": " Wer antwortet denn dem Bedrängten, wenn er Ihn anruft, und nimmt das Übel hinweg und macht euch zu Nachfolgern auf Erden? Ist wohl ein Gott neben Allah? Gering ist, wessen ihr gedenkt.", "spanish": " O, ¿Quién responde a la per­sona afligida cuando Le invoca? ¿ quién os libra del mal y os convierte en sucesores en la tierra? ¿Existe acaso algún dios fuera de Al‑lah? Qué poco es lo que reflexionáis.", "urdu": " (نیز بتاٶ تو) کون کسی بے کس کی دعا سنتا ہے۔ جب وہ اس (خدا) سے دعا کرتا ہے اور (اس کی) تکلیف کو دور کر دیتا ہے اور وہ تم (دعا کرنے والے انسانوں) کو (ایک دن) ساری زمین کا وارث بنا دے گا۔ کیا (اس قادر مطلق) اللہ کے سوا کوئی معبود ہے؟ تم بالکل نصیحت حاصل نہیں کرتے۔"}, {"arabic": " اَمَّنۡ یَّہۡدِیۡکُمۡ فِیۡ ظُلُمٰتِ الۡبَرِّ وَ الۡبَحۡرِ وَ مَنۡ یُّرۡسِلُ الرِّیٰحَ بُشۡرًۢا بَیۡنَ یَدَیۡ رَحۡمَتِہٖ ؕ ءَ اِلٰہٌ مَّعَ اللّٰہِ ؕ تَعٰلَی اللّٰہُ عَمَّا یُشۡرِکُوۡنَ ﴿ؕ۶۴﴾", "english": " Or, Who guides you in every kind of darkness of the land and of the sea, and Who sends the winds as glad tidings before His mercy? Is there a God besides Allah? Exalted is Allah above what they associate with Him .", "french": " Ou, Qui vous guide dans toutes sortes d ’obscurités de la terre et de la mer, et Qui envoie les vents comme une bonne annonce, en avant de Sa miséricorde ? Y-a-t-il un dieu avec Allāh ? Exalté est Allāh bien au-dessus de ce qu’ils Lui associent.", "german": " Wer leitet euch in den Finsternissen zu Land und Meer, und wer sendet die Winde als Herolde froher Botschaft Seiner Barmherzigkeit voraus? Ist wohl ein Gott neben Allah? Hoch erhaben ist Allah über das, was sie anbeten.", "spanish": " O, ¿Quién os guía en toda clase de tinieblas de la tierra y del mar, y Quién envía los vientos como buena nueva antes de Su mise­ricordia? ¿Existe algún dios fuera de Al‑lah? Ensalzado sea Al‑lah por encima de lo que Le asocian.", "urdu": " (بتاٶ تو) خشکیوں اور سمندروں کی مصیبتوں میں کون تم کو نجات کی راہ دکھاتا ہے اور کون اپنی رحمت (یعنی بارش) سے پہلے خوش خبری کے طور پر ہواٶں کو بھیجتا ہے کیا اللہ کے سوا کوئی اور معبود ہے؟ اللہ تمہاری شرک کی باتوں سے بہت بلند ہے۔"}, {"arabic": " اَمَّنۡ یَّبۡدَؤُا الۡخَلۡقَ ثُمَّ یُعِیۡدُہٗ وَ مَنۡ یَّرۡزُقُکُمۡ مِّنَ السَّمَآءِ وَ الۡاَرۡضِ ؕ ءَ اِلٰہٌ مَّعَ اللّٰہِ ؕ قُلۡ ہَاتُوۡا بُرۡہَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۶۵﴾", "english": " Or, Who originates creation, and then repeats it and Who provides for you from the heaven and the earth? Is there a God besides Allah? Say, ‘Bring forward your proof if you are truthful.’", "french": " Ou, Qui commence la création, et ensuite la répète, et Qui vous approvisionne du ciel et de la terre ? Y-a-t-il un dieu avec Allāh ? Dis : « Produisez votre preuve, si vous êtes véridiques. »", "german": " Wer ruft denn Schöpfung hervor und lässt sie dann wieder erstehen, und wer versorgt euch vom Himmel und von der Erde? Ist wohl ein Gott neben Allah? Sprich: \"Bringt euren Beweis herbei, wenn ihr wahrhaftig seid.\"", "spanish": " O ¿Quién origina la creación, repitiéndola después y Quién os provee del cielo y de la tierra? ¿Existe algún dios fuera de Al‑lah? Diles: “Presentad vuestra prueba, si sois veraces”.", "urdu": " (بتاٶ تو کہ) وہ جو پہلی دفعہ پیدا کرتا ہے اور پھر (پیدائش کے) سلسلہ کو جاری کرتا ہے اور جو بادلوں اور زمین سے تمہیں رزق دیتا ہے۔ کیا (اس قادر مطلق) اللہ کے سوا کوئی اور معبود بھی ہے؟ تو کہہ دے کہ اگر تم سچے ہو تو اپنی دلیل پیش کرو (کہ اس کے ثانی اور بھی ہیں)"}, {"arabic": " قُلۡ لَّا یَعۡلَمُ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ الۡغَیۡبَ اِلَّا اللّٰہُ ؕ وَ مَا یَشۡعُرُوۡنَ اَیَّانَ یُبۡعَثُوۡنَ ﴿۶۶﴾", "english": " Say, ‘None in the heavens and the earth knows the unseen save Allah; and they do not know when they will be raised up.’", "french": " Dis : « Nul, ni aux cieux ni sur la terre, ne connaît l’invisible sauf Allāh ; et ils ne savent pas quand ils seront ressuscités. »", "german": " Sprich: \"Niemand in den Himmeln und auf Erden kennt das Ungesehene, außer Allah; und sie wissen nicht, wann sie auferweckt werden.\"", "spanish": " Diles: “Nadie en los cielos y en la tierra conoce lo oculto, salvo Al‑lah; e ignoran cuándo serán resu­citados”.", "urdu": " (پھر تو) کہہ دے کہ آسمانوں اور زمین میں جو مخلوق بھی ہے خدا کے سوا (ان میں سے کوئی) غیب کو نہیں جانتی اور ان میں سے کوئی یہ بھی نہیں سمجھتا کہ ان کو کب زندہ کرکے اٹھایا جائے گا۔"}, {"arabic": " بَلِ ادّٰرَکَ عِلۡمُہُمۡ فِی الۡاٰخِرَۃِ ۟ بَلۡ ہُمۡ فِیۡ شَکٍّ مِّنۡہَا ۫۟ بَلۡ ہُمۡ مِّنۡہَا عَمُوۡنَ ﴿٪۶۷﴾", "english": " Nay, their knowledge has reached its end respecting the Hereafter; nay, they are indeed in doubt about it; nay, they are blind to it.", "french": " Non , mais leur connaissance sur l’au-delà a atteint sa limite ; non , mais ils sont dans le doute là-dessus ; non , mais ils sont aveugles à cet égard.", "german": " Nein, ihr Wissen über das Jenseits hat gänzlich versagt; nein, sie sind im Zweifel darüber; nein, sie sind ihm gegenüber blind.", "spanish": " ¡No! su conocimiento ha lle­gado a su fin respecto al Más Allá; ¡No! en verdad, dudan sobre él; ¡No! son ciegos respecto a él.", "urdu": " بلکہ حقیقت یہ ہے کہ اخروی زندگی کے بارہ میں ان کا علم بالکل ختم ہو گیا ہے بلکہ وہ اس کے بارہ میں شک میں پڑے ہوئے ہیں۔ بلکہ وہ اس کے بارہ میں بالکل اندھے ہیں۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡۤا ءَ اِذَا کُنَّا تُرٰبًا وَّ اٰبَآؤُنَاۤ اَئِنَّا لَمُخۡرَجُوۡنَ ﴿۶۸﴾", "english": " And those who disbelieve say, ‘What! when we and our fathers have become dust, shall we indeed be brought forth again ?", "french": " Et ceux qui ne croient pas disent : « Comment ! Quand nous et nos pères serons devenus poussière, serons-nous réellement ramenés à la vie ?", "german": " Und jene, die ungläubig sind, sagen: \"Wie! wenn wir und unsere Väter Staub geworden sind, sollen wir dann wirklich wieder hervorgebracht werden?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=27:68&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=27:68&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic69\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic69\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/27:69' style='text-decoration:underline'>27:69</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(69)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control69\"></i></button> <audio id=\"player69\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَقَدۡ وُعِدۡنَا ہٰذَا نَحۡنُ وَ اٰبَآؤُنَا مِنۡ قَبۡلُ ۙ اِنۡ ہٰذَاۤ اِلَّاۤ اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿۶۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘We were surely promised this before — we and our fathers; this is nothing but tales of the ancients.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_27_69_b' href='#'>b</a>]</sup>‘We were surely promised this before—we and our fathers; this is nothing but tales of the ancients.” <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_27_69_b'>b</span></div> <div><div class='reference' data-id='ref_27_69_b' style='display:none'> <p><b>b.</b> <a href='/quran/23:84' target=_blank>23:84</a>. (<a href='javascript:void(0)' data-id='ref_27_69_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً یہ وعدہ ہمیں اور ہمارے آباءو اجداد کو پہلے بھی دیا گیا تھا۔ یہ تو پہلے لوگوں کی کہانیوں کے سواکچھ نہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ہم اور ہمارے باپ دادوں سے اس سے پہلے بھی ایسا ہی وعدہ کیا گیا تھا۔ مگریہ صرف پہلے لوگوں کی باتیں ہیں (جو کبھی پوری نہیں ہوتیں) </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ceci nous a certes été promis auparavant – à nous et à nos pères ; ce ne sont que des fables des anciens. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“En verdad se nos prometió esto antes: a nosotros y a nuestros padres; no son sino historias de los antiguos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Verheißen ward uns dies zuvor – uns und unseren Vätern; dies sind ja nur Fabeln der Alten.\"", "spanish": " Mas los incrédulos dicen: “¡Cómo! ¿Cuando nosotros y nues­tros adres nos hayamos convertido en polvo seremos realmente resuci­tados de nuevo?", "urdu": " اور کافر کہتے ہیں کہ کیا جب ہم اور ہمارے باپ دادے مٹی ہو جائیں گے تو کیا ہم پھر (زمین سے) زندہ کرکے نکالے جائیں گے۔"}, {"arabic": " قُلۡ سِیۡرُوۡا فِی الۡاَرۡضِ فَانۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الۡمُجۡرِمِیۡنَ ﴿۷۰﴾", "english": " Say, ‘Travel in the earth and see how evil was the end of the sinful!’", "french": " Dis : « Parcourez la terre, et voyez comme a été mauvaise la fin des coupables !", "german": " Sprich: \"Reiset umher auf der Erde und seht, wie der Ausgang der Sündigen war!\"", "spanish": " Diles: “¡Viajad por la tierra y ved qué malo fue el fin de los pe­cadores!”.", "urdu": " تو کہہ دے کہ زمین میں پھرو اور دیکھو کہ مجرموں کا انجام کیسا ہوا تھا۔"}, {"arabic": " وَ لَا تَحۡزَنۡ عَلَیۡہِمۡ وَ لَا تَکُنۡ فِیۡ ضَیۡقٍ مِّمَّا یَمۡکُرُوۡنَ ﴿۷۱﴾", "english": " And grieve thou not for them, nor be thou in distress at what they plot.", "french": " Et ne t’afflige pas pour eux, et ne sois pas angoissé à cause de ce qu’ils complotent.", "german": " Betrübe dich nicht um sie, noch sei bedrängt ob dessen, was sie an Ränken schmieden.", "spanish": " No te aflijas por ellos ni te angusties por lo que traman.", "urdu": " اور تو اُن پر غم نہ کھا۔ اور اُن کی تدبیروں کی وجہ سے تنگی محسوس نہ کر۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ مَتٰی ہٰذَا الۡوَعۡدُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۷۲﴾", "english": " And they say, ‘When will this promise be fulfilled , if you are truthful?’", "french": " Et ils disent : « Quand cette promesse sera-t-elle accomplie , si vous êtes véridiques ? »", "german": " Und sie sagen: \"Wann wird diese Verheißung (erfüllt werden), wenn ihr die Wahrheit redet?\"", "spanish": " Mas dicen: “¿Cuándo se cumplirá esta promesa, si sois ve­races?”.", "urdu": " اور وہ کہتے ہیں اگر تم سچے ہو تو یہ (عذاب کا) وعدہ کب پورا ہوگا؟"}, {"arabic": " قُلۡ عَسٰۤی اَنۡ یَّکُوۡنَ رَدِفَ لَکُمۡ بَعۡضُ الَّذِیۡ تَسۡتَعۡجِلُوۡنَ ﴿۷۳﴾", "english": " Say, ‘It may be that a part of that which you would hasten on may be close behind you.’", "french": " Dis : « Il se peut qu’une partie de cette punition promise que vous cherchez à hâter d’une manière arrogante soit déjà sur vos talons. »", "german": " Sprich: \"Vielleicht ist ein Teil von dem, was ihr beschleunigen möchtet, schon nahe an euch herangekommen.\"", "spanish": " Diles: “Podría ocurrir que, una parte del castigo prometido que arrogantemente demandáis que os sobrevenga, ya esté tras vuestros talones”.", "urdu": " تو کہہ دے کہ ممکن ہے کہ وہ (عذاب) جس کے لئے تم جلدی کر رہے ہو اس کا کچھ حصہ تمہارے پیچھے پیچھے چلا آرہا ہو۔"}, {"arabic": " وَ اِنَّ رَبَّکَ لَذُوۡ فَضۡلٍ عَلَی النَّاسِ وَ لٰکِنَّ اَکۡثَرَہُمۡ لَا یَشۡکُرُوۡنَ ﴿۷۴﴾", "english": " And, truly, thy Lord is gracious to mankind, but most of them are not grateful.", "french": " Et, en vérité, ton Seigneur est Possesseur de grâce envers les hommes, mais la plupart d’entre eux ne sont pas reconnaissants.", "german": " Und fürwahr, dein Herr ist huldreich gegen die Menschen, doch die meisten von ihnen sind nicht dankbar.", "spanish": " En verdad, tu Señor es Cle­mente con los humanos, pero la ma­yoría de ellos no son agradecidos.", "urdu": " اور تیرا رب لوگوں پر فضل کرنے والا ہے۔ لیکن ان میں سے اکثر شکر نہیں کرتے۔"}, {"arabic": " وَ اِنَّ رَبَّکَ لَیَعۡلَمُ مَا تُکِنُّ صُدُوۡرُہُمۡ وَ مَا یُعۡلِنُوۡنَ ﴿۷۵﴾", "english": " And, surely, thy Lord knows what their bosoms conceal and what they reveal.", "french": " Et, assurément ton Seigneur sait tout ce que cachent leurs poitrines, et tout ce qu’ils révèlent.", "german": " Und dein Herr kennt wohl, was ihre Herzen verhehlen und was sie offenkund tun.", "spanish": " En verdad, tu Señor sabe lo que ocultan sus pechos y lo que manifiestan.", "urdu": " اور تیرا رب ان چیزوں کو بھی جانتا ہے جن کو ان کے سینے چھپا رہے ہیں اور جن کو وہ ظاہر کر رہے ہیں۔"}, {"arabic": " وَ مَا مِنۡ غَآئِبَۃٍ فِی السَّمَآءِ وَ الۡاَرۡضِ اِلَّا فِیۡ کِتٰبٍ مُّبِیۡنٍ ﴿۷۶﴾", "english": " And there is nothing hidden in the heaven and the earth, but it is recorded in a clear Book.", "french": " Et il n’y a rien de caché ni dans les cieux ni sur la terre, qui ne soit inscrit dans un Livre clair.", "german": " Und nichts Verborgenes ist im Himmel oder auf Erden, das nicht in einem deutlichen Buch stünde.", "spanish": " Pues no hay nada oculto en el cielo y en la tierra que no esté re­gistrado en un Libro manifiesto.", "urdu": " اور آسمانوں اور زمین میں جو کوئی بھی چھپی ہوئی چیز ہے ایک بیان کرنے والی کتاب میں (محفوظ) ہے۔"}, {"arabic": " اِنَّ ہٰذَا الۡقُرۡاٰنَ یَقُصُّ عَلٰی بَنِیۡۤ اِسۡرَآءِیۡلَ اَکۡثَرَ الَّذِیۡ ہُمۡ فِیۡہِ یَخۡتَلِفُوۡنَ ﴿۷۷﴾", "english": " Verily, this Qur’an explains to the children of Israel most of that concerning which they differ.", "french": " En vérité, ce Coran explique aux Enfants d’lsraël la plupart de ces points sur lesquels ils diffèrent.", "german": " Wahrlich, dieser Qur-ân erklärt den Kindern Israels das meiste von dem, worüber sie uneins sind.", "spanish": " Ciertamente este Corán ex­plica a los Hijos de Israel la mayoría de aquello en lo que disputan.", "urdu": " یہ قرآن بنی اسرائیل کے سامنے اکثر وہ باتیں سناتا ہے جن میں وہ اختلاف کر رہے ہیں۔"}, {"arabic": " وَ اِنَّہٗ لَہُدًی وَّ رَحۡمَۃٌ لِّلۡمُؤۡمِنِیۡنَ ﴿۷۸﴾", "english": " And verily, it is a guidance and a mercy to the believers.", "french": " Et en vérité c’est une direction et une miséricorde pour les croyants.", "german": " Und er ist fürwahr eine Führung und eine Barmherzigkeit für die Gläubigen.", "spanish": " En verdad, es una guía y una misericordia para los creyentes.", "urdu": " اور وہ ضرور مومنوں کے لئے ہدایت اور رحمت ہے۔"}, {"arabic": " اِنَّ رَبَّکَ یَقۡضِیۡ بَیۡنَہُمۡ بِحُکۡمِہٖ ۚ وَ ہُوَ الۡعَزِیۡزُ الۡعَلِیۡمُ ﴿ۙۚ۷۹﴾", "english": " Verily, thy Lord will decide between them by His judgment, and He is the Mighty, the All-knowing.", "french": " En vérité, ton Seigneur décidera entre eux par Son jugement, et Il est le Puissant, l’Omniscient.", "german": " Dein Herr wird zwischen ihnen entscheiden durch Seinen Spruch, und Er ist der Allmächtige, der Allwissende.", "spanish": " Tu Señor decidirá ciertamente entre ellos con Su juicio, pues Él es el Poderoso, el Omnisciente.", "urdu": " تیرا رب ان (بنی اسرائیل) کے درمیان اپنے حکم (یعنی قرآن) کے ساتھ (سچا) فیصلہ کرتا ہے۔ اور وہ غالب (اور) بہت بڑے علم والا ہے ۔"}, {"arabic": " فَتَوَکَّلۡ عَلَی اللّٰہِ ؕ اِنَّکَ عَلَی الۡحَقِّ الۡمُبِیۡنِ ﴿۸۰﴾", "english": " So put thy trust in Allah; surely, thou standest on manifest truth.", "french": " Mets donc ta confiance en Allāh ; assurément, tu te fondes sur la vérité manifeste.", "german": " Vertraue also auf Allah, denn du ruhst in lauterer Wahrheit.", "spanish": " Deposita pues tu confianza en Al‑lah; en verdad estás apoyado en una verdad manifiesta.", "urdu": " پس اللہ پر توکل کر‘ تو یقیناً ایک مدلل حق پر قائم ہے۔"}, {"arabic": " اِنَّکَ لَا تُسۡمِعُ الۡمَوۡتٰی وَ لَا تُسۡمِعُ الصُّمَّ الدُّعَآءَ اِذَا وَلَّوۡا مُدۡبِرِیۡنَ ﴿۸۱﴾", "english": " Verily, thou canst not make the dead to hear, nor canst thou make the deaf to hear the call, when they turn back retreating.", "french": " En vérité, tu ne peux faire les morts entendre, et tu ne peux non plus faire les sourds entendre l’appel, lorsqu’ils tournent le dos et s’en vont.", "german": " Du kannst die Toten nicht hörend machen, noch kannst du bewirken, dass die Tauben den Anruf hören, wenn sie den Rücken kehren;", "spanish": " Por cierto que no puedes hacer que los muertos oigan, ni puedes hacer que los sordos escuchen la llamada, cuando dan la espalda en retirada.", "urdu": " تو ہرگز مردوں کو نہیں سنا سکتا اور نہ بہروں کو ہی (اپنی) آواز سنا سکتا ہے۔ (خصوصاً) جبکہ وہ پیٹھ پھیر کر چلے جاتے ہیں۔"}, {"arabic": " وَ مَاۤ اَنۡتَ بِہٰدِی الۡعُمۡیِ عَنۡ ضَلٰلَتِہِمۡ ؕ اِنۡ تُسۡمِعُ اِلَّا مَنۡ یُّؤۡمِنُ بِاٰیٰتِنَا فَہُمۡ مُّسۡلِمُوۡنَ ﴿۸۲﴾", "english": " And thou canst not guide the blind out of their error. Thou canst make only those to hear who believe in Our Signs, for they submit.", "french": " Et tu ne peux pas guider les aveugles et les tirer de leur erreur. Tu peux faire entendre seulement ceux qui croient à Nos Signes, et alors ils deviennent obéissants.", "german": " noch kannst du die Blinden aus ihrem Irrtum leiten. Du kannst nur die hörend machen, die an Unsere Zeichen glauben und die sich ergeben.", "spanish": " Tampoco puedes guiar al ciego sacándolo de su error. Sólo puedes hacer que te escuchen quienes creen en Nuestros Signos, y se hacen obedientes.", "urdu": " اور تو اندھوں کو بھی ان کی گمراہی سے بچا کر ہدایت نہیں دے سکتا۔ تو تو صرف انہی کو سناتا ہے جو ہماری آیتوں پر ایمان لاتے ہیں اور وہ (عملاً بھی) فرمانبردار ہوتے ہیں۔"}, {"arabic": " وَ اِذَا وَقَعَ الۡقَوۡلُ عَلَیۡہِمۡ اَخۡرَجۡنَا لَہُمۡ دَآبَّۃً مِّنَ الۡاَرۡضِ تُکَلِّمُہُمۡ ۙ اَنَّ النَّاسَ کَانُوۡا بِاٰیٰتِنَا لَا یُوۡقِنُوۡنَ ﴿٪۸۳﴾", "english": " And when the sentence is passed against them, We shall bring forth for them a germ out of the earth, which shall wound them because people did not believe in Our Signs.", "french": " Et quand la parole Divine concernant leur destruction se réalisera, Nous ferons sortir pour eux de la terre une créature qui les blessera, parce que les gens n’avaient pas cru en Nos Signes.", "german": " Und wenn der Spruch gegen sie fällt, dann werden Wir für sie einen Keim aus der Erde hervorbringen, der sie stechen soll, weil die Menschen an Unsere Zeichen nicht glaubten.", "spanish": " Mas cuando se dicte sentencia contra ellos, haremos brotar para ellos una criatura de la tierra, que los herirá porque las gentes no cre­yeron en Nuestros Signos.", "urdu": " اور جب ان کی تباہی کی پیشگوئی پوری ہو جائے گی تو ہم ان کے لئے زمین سے ایک کیڑا نکالیں گے جو ان کو کاٹے گا۔ اس وجہ سے کہ لوگ ہمارے نشانات پر یقین نہیں رکھتے تھے۔"}, {"arabic": " وَ یَوۡمَ نَحۡشُرُ مِنۡ کُلِّ اُمَّۃٍ فَوۡجًا مِّمَّنۡ یُّکَذِّبُ بِاٰیٰتِنَا فَہُمۡ یُوۡزَعُوۡنَ ﴿۸۴﴾", "english": " And remind them of the day when We shall gather together from every people a party from among those who rejected Our Signs, and they shall be placed in separate bands.", "french": " Et rappelle-leur le jour où Nous rassemblerons hors de chaque peuple un groupe de ceux qui auront rejeté Nos Signes, et ils seront placés en bandes séparées ,", "german": " Und (mahne sie an) den Tag, da Wir aus jedem Volke eine Schar derer versammeln werden, die Unsere Zeichen verwarfen, und sie sollen in Reih und Glied gehalten werden,", "spanish": " Recuérdales el día en el que reuniremos de cada uno de los pueblos a un grupo de entre aquellos que recha­zaron Nuestros Signos, y serán colo­cados en bandas separadas.", "urdu": " اور اس دن (کو یاد کرو) جب ہر (اس) قوم میں سے جو ہمارے نشانات کا انکار کرتی رہی ہوگی ہم ایک بڑا گروہ کھڑا کریں گے۔ پھر اس (گروہ) کو (جواب دہی کے لئے) مختلف گروہوں میں تقسیم کر دیا جائے گا۔"}, {"arabic": " حَتّٰۤی اِذَا جَآءُوۡ قَالَ اَکَذَّبۡتُمۡ بِاٰیٰتِیۡ وَ لَمۡ تُحِیۡطُوۡا بِہَا عِلۡمًا اَمَّا ذَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۸۵﴾", "english": " Till, when they come, He will say, ‘Did you reject My Signs, while you did not embrace them in your knowledge? Or what was it that you were doing?’", "french": " Jusqu’à ce que, quand ils seront arrivés, Il dira : « Avez-vous rejeté Mes Signes sans réfléchir , alors que vous n’en aviez pas pleine connaissance ? Sinon, que faisiez-vous, alors ?", "german": " bis, wenn sie kommen, Er sprechen wird: \"Habt ihr Meine Zeichen verworfen, obwohl ihr sie nicht mit Wissen umfasst habt? Oder was war es, das ihr tatet?\"", "spanish": " Hasta que, cuando lleguen, Él les diga: “¿Rechazasteis rápidamente Mis Signos, sin haber logrado pleno conocimiento de los mismos? Si no es así ¿qué es lo que estabais haciendo?”.", "urdu": " اور جب وہ اس کے پاس پہنچیں گے۔ وہ ان سے کہے گا۔ کیا تم نے میرے نشانات کا اس کے باوجود انکارکیا تھا کہ تم نے علم کے ذریعہ سے ان کی پوری واقفیت حاصل نہیں کی تھی یایہ بتاٶکہ تم (اسلام کے خلاف کیا) کیاسازشیں کیاکرتے تھے۔"}, {"arabic": " وَ وَقَعَ الۡقَوۡلُ عَلَیۡہِمۡ بِمَا ظَلَمُوۡا فَہُمۡ لَا یَنۡطِقُوۡنَ ﴿۸۶﴾", "english": " And the sentence shall fall upon them because they did wrong, and they will be speechless.", "french": " Et la sentence tombera sur eux parce qu’ils ont injustement agi, et ils seront incapables de parler.", "german": " Und der Spruch wird gegen sie fallen ob ihres Frevelns, und sie werden nicht reden.", "spanish": " Y la sentencia caerá sobre ellos porque obraron injustamente, y no serán capaces de hablar.", "urdu": " اور ان کے ظلموں کی وجہ سے ان کے خلاف کی گئی پیشگوئی پوری ہو جائے گی۔ اور وہ کچھ بات نہ کر سکیں گے۔"}, {"arabic": " اَلَمۡ یَرَوۡا اَنَّا جَعَلۡنَا الَّیۡلَ لِیَسۡکُنُوۡا فِیۡہِ وَ النَّہَارَ مُبۡصِرًا ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۸۷﴾", "english": " Have they not seen that We have made the night that they may rest therein, and the day sight-giving? In that verily are Signs for a people who believe.", "french": " N’ont-ils pas vu que Nous avons fait la nuit afin qu’ils puissent s’y reposer, et le jour qui permet de voir ? En vérité, il y a en cela des Signes pour un peuple qui croit.", "german": " Haben sie denn nicht gesehen, dass Wir die Nacht geschaffen haben, damit sie darin ruhen möchten, und den Tag zum Sehen? Hierin sind wahrlich Zeichen für Leute, die glauben.", "spanish": " ¿No han visto acaso que he­mos hecho la noche para que puedan descansar en ella, y el día que da la vista? En eso hay ciertamente Signos para los hombres que creen.", "urdu": " کیا ان کو معلوم نہیں کہ ہم نے رات کو اس لئے بنایا ہے کہ وہ اس میں آرام حاصل کریں اور دن کو دیکھنے کی طاقت دینے والا بنایا۔ اس میں یقیناً مومن قوم کے لئے بڑے نشان ہیں۔"}, {"arabic": " وَ یَوۡمَ یُنۡفَخُ فِی الصُّوۡرِ فَفَزِعَ مَنۡ فِی السَّمٰوٰتِ وَ مَنۡ فِی الۡاَرۡضِ اِلَّا مَنۡ شَآءَ اللّٰہُ ؕ وَ کُلٌّ اَتَوۡہُ دٰخِرِیۡنَ ﴿۸۸﴾", "english": " And on the day when the trumpet will be blown, whoever is in the heavens and whoever is in the earth will be struck with terror, save him whom Allah pleases. And all shall come unto Him, humbled.", "french": " Et le jour où l’on sonnera de la trompe, quiconque est aux cieux aussi bien que quiconque est sur la terre sera frappé de terreur, sauf celui qu’Allāh veut. Et tous viendront à Lui, en s’humiliant.", "german": " Und an dem Tage, wenn in die Posaune gestoßen wird, dann wird, wer in den Himmeln und wer auf Erden ist, mit Schrecken geschlagen werden, ausgenommen der, den Allah will. Und alle sollen demütig zu Ihm kommen.", "spanish": " El día en el que suene la trompeta; quienes se encuentren en los cielos y en la tierra serán presa del terror, salvo aquel a quien Al‑lah le agrade. Y todos comparecerán ante Él, humillados.", "urdu": " اور (اس دن کو بھی یاد کرو) جس دن بگل میں ہوا پھونکی جائے گی۔ جس کے نتیجہ میں آسمانوں اور زمین میں جو کوئی بھی ہے گھبرا اٹھے گا۔ سوائے اس کے جس کے متعلق اللہ چاہے گا (کہ وہ گھبراہٹ سے محفوظ رہے) اور سب کے سب اس (خدا) کے حضور مطیع و فرمانبردار ہو کر آئیں گے۔"}, {"arabic": " وَ تَرَی الۡجِبَالَ تَحۡسَبُہَا جَامِدَۃً وَّ ہِیَ تَمُرُّ مَرَّ السَّحَابِ ؕ صُنۡعَ اللّٰہِ الَّذِیۡۤ اَتۡقَنَ کُلَّ شَیۡءٍ ؕ اِنَّہٗ خَبِیۡرٌۢ بِمَا تَفۡعَلُوۡنَ ﴿۸۹﴾", "english": " And thou seest the mountains which thou thinkest to be firmly fixed, but they shall pass away like the passing of the clouds — the work of Allah Who has made everything perfect. Verily, He knows full well what you do.", "french": " Et tu vois les montagnes que tu crois figées, mais elles flottent comme flottent les nuages : telle est l’œuvre d’Allāh Qui a rendu toute chose ferme et résistante. En vérité, Il est très conscient de ce que vous faites.", "german": " Und du siehst die Berge, die du fest gegründet glaubst, doch sie bewegen sich wie die Bewegung der Wolken: das Wirken Allahs, Der alles vollendet hat. Wahrlich, Er weiß wohl, was ihr tut.", "spanish": " Y ves las montañas imaginando que están quietas, pero flotan como flotan las nubes. Así es la obra de Al‑lah, Quien lo ha hecho todo firme y fuerte. En verdad, Él sabe muy bien lo que hacéis.", "urdu": " اور تو پہاڑوں کو اس صورت میں دیکھتا ہے کہ وہ اپنی جگہ ٹھہرے ہوئے ہیں حالانکہ وہ بادلوں کی طرح چل رہے ہیں۔ یہ اللہ کی صنعت ہے جس نے ہر چیز کو مضبوط بنایا ہے وہ تمہارے اعمال سے خوب خبردار ہے ۔"}, {"arabic": " مَنۡ جَآءَ بِالۡحَسَنَۃِ فَلَہٗ خَیۡرٌ مِّنۡہَا ۚ وَ ہُمۡ مِّنۡ فَزَعٍ یَّوۡمَئِذٍ اٰمِنُوۡنَ ﴿۹۰﴾", "english": " Whoever does a good deed, shall have a better reward than that, and such will be secure from terror that day.", "french": " Quiconque fait une bonne œuvre aura une meilleure récompense que celle-là, et, ce jour-là, ceux-là seront à l’abri de la terreur.", "german": " Wer Gutes vollbringt, dem wird Besseres als das; und sie werden sicher sein vor Schrecken an jenem Tage.", "spanish": " Quien haga una buena ac­ción tendrá una recompensa mejor que ésa, y estará libre del terror en ese día.", "urdu": " جو کوئی نیکی کرے گا اس کو اس سے بہتر بدلہ ملے گا اور ایسے لوگ اس دن خوف سے (جس کا ذکر اوپر ہو چکا ہے) محفوظ رہیں گے۔"}, {"arabic": " وَ مَنۡ جَآءَ بِالسَّیِّئَۃِ فَکُبَّتۡ وُجُوۡہُہُمۡ فِی النَّارِ ؕ ہَلۡ تُجۡزَوۡنَ اِلَّا مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۹۱﴾", "english": " And those who do evil, shall be thrown down on their faces into the Fire: ‘Are you not rewarded for what you have been doing?’", "french": " Et ceux qui font le mal seront précipités sur leur visage dans le Feu ; et il leur sera dit : « N’êtes-vous pas récompensés pour ce que vous faisiez ? »", "german": " Und die Schlechtes vollbringen, derer Anführer sollen ins Feuer gestürzt werden: \"Euch ist gelohnt worden nur nach dem, was ihr gewirkt.\"", "spanish": " Mas quienes practiquen el mal serán arrojados de bruces al Fuego: “¿No sois acaso retribuidos por lo que habéis hecho?”.", "urdu": " اور جو لوگ برے عمل لے کر خدا کی خدمت میں حاضر ہوں گے ان کے سرداروں کو دوزخ میں اوندھا کرکے گرا دیا جائے گا اور کہا جائے گا کہ کیا تمہاری جزا تمہارے عمل کے مطابق نہیں۔"}, {"arabic": " اِنَّمَاۤ اُمِرۡتُ اَنۡ اَعۡبُدَ رَبَّ ہٰذِہِ الۡبَلۡدَۃِ الَّذِیۡ حَرَّمَہَا وَ لَہٗ کُلُّ شَیۡءٍ ۫ وَّ اُمِرۡتُ اَنۡ اَکُوۡنَ مِنَ الۡمُسۡلِمِیۡنَ ﴿ۙ۹۲﴾", "english": " Say , ‘I am commanded only to serve the Lord of this city which He has made sacred, and to Him belong all things; and I am commanded to be of those who submit to God ;", "french": " Dis : « Il m’est commandé seulement d’adorer le Seigneur de cette cité - la Mecque -, qu’Il a sanctifiée, et c’est à Lui qu’appartiennent toutes choses ; et il m’est commandé d’être de ceux qui se soumettent à Lui ;", "german": "", "spanish": " Diles: “Se me ha ordenado únicamente servir al Señor de esta ciudad que Él ha hecho sagrada, y a Él pertenecen todas las cosas; y se me ha ordenado ser de aquellos que se someten a Dios,", "urdu": " مجھے تو صرف یہ حکم دیا گیا ہے کہ میں اس شہر (مکہ) کے رب کی جس کو اس (رب) نے معزز بنا دیا ہے عبادت کروں اور ہر چیز اسی کے قبضہ میں ہے اور مجھے حکم دیا گیا ہے کہ میں فرمانبرداروں میں سے ہو جاٶں۔"}], "Surah": 27}