{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)۔"}, {"arabic": " اَلرَّحۡمٰنُ ۙ﴿۲﴾", "english": " It is God , the Gracious", "french": " C’est Dieu , le Gracieux.", "german": " Er ist der Gnadenreiche,", "spanish": " Es Dios , el Clemente.", "urdu": " (وہ) رحمن (خدا) ہی ہے۔"}, {"arabic": " عَلَّمَ الۡقُرۡاٰنَ ؕ﴿۳﴾", "english": " Who has taught the Qur’an.", "french": " Il a enseigné le Coran.", "german": " der den Qur-ân gelehrt hat.", "spanish": " Quien ha enseñado el Corán.", "urdu": " جس نے قرآن سکھایا ہے۔"}, {"arabic": " خَلَقَ الۡاِنۡسَانَ ۙ﴿۴﴾", "english": " He has created man.", "french": " Il a créé l’homme.", "german": " Er hat den Menschen erschaffen.", "spanish": " Ha creado al hombre.", "urdu": " اس نے انسان کو بنایا۔"}, {"arabic": " عَلَّمَہُ الۡبَیَانَ ﴿۵﴾", "english": " He has taught him plain speech.", "french": " Il lui a enseigné l’art de s’exprimer.", "german": " Er hat ihm klare Rede gegeben.", "spanish": " Le enseñó la elocuencia.", "urdu": " اور اسے فصاحت و بیان بخشا۔"}, {"arabic": " اَلشَّمۡسُ وَ الۡقَمَرُ بِحُسۡبَانٍ ﴿۪۶﴾", "english": " The sun and the moon run their courses according to a fixed reckoning.", "french": " Le soleil et la lune suivent leurs cours selon un calcul fixé .", "german": " Die Sonne und der Mond (laufen ihre Bahn) nach dem Maße,", "spanish": " El sol y la luna recorren sus órbitas de acuerdo con un cálculo fijo.", "urdu": " سورج اور چاند ایک مقررہ قاعدہ کے مطابق چل رہے ہیں۔"}, {"arabic": " وَّ النَّجۡمُ وَ الشَّجَرُ یَسۡجُدٰنِ ﴿۷﴾", "english": " And the stemless plants and the trees humbly submit to His will .", "french": " Et les plantes sans tige et les arbres se soumettent humblement à Sa volonté .", "german": " und die Gräser und Bäume ergeben sich demütig (Seinem Willen).", "spanish": " Las hierbas y árboles se someten humildemente a Su voluntad.", "urdu": " اور جڑی بوٹیاں اور درخت بھی خدا کے آگے سرنگوں ہیں۔"}, {"arabic": " وَ السَّمَآءَ رَفَعَہَا وَ وَضَعَ الۡمِیۡزَانَ ۙ﴿۸﴾", "english": " And the heaven He has raised high and set up a measure,", "french": " Et le ciel, quelle splendeur ! Il l’a élevé très haut, et Il a établi une mesure,", "german": " Und den Himmel wölbte Er in der Höhe und bestimmte das Maß,", "spanish": " Y ha elevado el cielo muy alto estableciendo una medida,", "urdu": " اور آسمان کو اس نے اونچا کیا ہے اور (بنی نوع انسان کے لئے) توازن کا اصول مقرر کر دیا ہے۔"}, {"arabic": " اَلَّا تَطۡغَوۡا فِی الۡمِیۡزَانِ ﴿۹﴾", "english": " That you may not transgress the measure.", "french": " Afin que vous ne transgressiez pas la mesure,", "german": " dass ihr das Maß nicht überschreiten möget.", "spanish": " Para que no traspaséis la medida.", "urdu": " (یہ کہتے ہوئے) کہ عدل کے ترازو کو کبھی نہ جھکاٶ۔"}, {"arabic": " وَ اَقِیۡمُوا الۡوَزۡنَ بِالۡقِسۡطِ وَ لَا تُخۡسِرُوا الۡمِیۡزَانَ ﴿۱۰﴾", "english": " So weigh all things in justice and fall not short of the measure.", "french": " Pesez donc toutes choses avec justice et ne faussez pas la pesée.", "german": " So macht gerechtes Maß und kürzt das Maß nicht.", "spanish": " Pesad, pues, todas las cosas con justicia y no merméis en la medida.", "urdu": " اور وزن کو انصاف کے ساتھ قائم کرو‘ اور تول کو کم نہ کرو۔"}, {"arabic": " وَ الۡاَرۡضَ وَضَعَہَا لِلۡاَنَامِ ﴿ۙ۱۱﴾", "english": " And He has set the earth for His creatures;", "french": " Et la terre, quelle splendeur ! Il l’a faite comme un soutien pour Ses créatures ;", "german": " Und Er hat die Erde für die Schöpfung gemacht;", "spanish": " Pues Él ha dispuesto la tierra para Sus criaturas.", "urdu": " اور اس (خدا) نے زمین کو تمام مخلوق کے فائدہ کے لئے بنایا ہے۔"}, {"arabic": " فِیۡہَا فَاکِہَۃٌ ۪ۙ وَّ النَّخۡلُ ذَاتُ الۡاَکۡمَامِ ﴿ۖ۱۲﴾", "english": " Therein are all kinds of fruit and palm-trees with sheaths,", "french": " Il s’y trouve des fruits de toutes espèces et des dattiers aux fruits enveloppés,", "german": " in ihr sind Früchte und Palmen mit Knospenbüscheln,", "spanish": " En ella hay toda clase de frutas y palmeras con vainas,", "urdu": " اس میں پھل بھی ہیں اور غلاف دار پھل والی کھجوروں کے درخت بھی (ہیں) ۔"}, {"arabic": " وَ الۡحَبُّ ذُو الۡعَصۡفِ وَ الرَّیۡحَانُ ﴿ۚ۱۳﴾", "english": " And grain with its husk and fragrant plants.", "french": " Et le grain dans son enveloppe et des plantes aromatiques.", "german": " und Korn in Hülsen und duftende Blumen.", "spanish": " Granos con sus cáscaras y plantas fragantes.", "urdu": " اور اس (زمین) میں دانے بھی ہیں جن پر خول بھی ہوتا ہے اور خوشبودار پھول بھی ہیں۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۱۴﴾", "english": " Which, then, of the favours of your Lord will you twain deny, O men and Jinn ?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux , ô hommes et djinns ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos, ¡Oh! hombres y Yinn?", "urdu": " سو بتاٶ تو سہی کہ تم دونوں (یعنی جن و انس) اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " خَلَقَ الۡاِنۡسَانَ مِنۡ صَلۡصَالٍ کَالۡفَخَّارِ ﴿ۙ۱۵﴾", "english": " He created man from dry ringing clay which is like baked pottery.", "french": " Il a créé l’homme d’argile sèche et sonnante qui est pareille à de la poterie cuite.", "german": " Er hat den Menschen aus trockenem Lehm erschaffen, der klingt (und ausschaut) wie ein Tongefäß.", "spanish": " Creó al hombre de arcilla sonora y seca, que es como cerámica cocida.", "urdu": " انسان کو اس نے بجتی ہوئی خشک مٹی سے پیدا کیا ہے۔"}, {"arabic": " وَ خَلَقَ الۡجَآنَّ مِنۡ مَّارِجٍ مِّنۡ نَّارٍ ﴿ۚ۱۶﴾", "english": " And the Jinn He created from the flame of fire.", "french": " Et Il a créé les djinns de la flamme du feu.", "german": " Und die Jinn schuf Er aus der Flamme des Feuers.", "spanish": " Creó a los Yinn de la llama del fuego.", "urdu": " اور جنوں کو آگ کے شعلہ سے پیدا کیا ہے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۱۷﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پس بولو‘ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " رَبُّ الۡمَشۡرِقَیۡنِ وَ رَبُّ الۡمَغۡرِبَیۡنِ ﴿ۚ۱۸﴾", "english": " The Lord of the two Easts and the Lord of the two Wests!", "french": " Le Seigneur des deux Orients et le Seigneur des deux Occidents.", "german": " Der Herr der beiden Osten und der Herr der beiden Westen!", "spanish": " ¡El Señor de los dos Orientes y el Señor de los dos Occidentes!", "urdu": " وہ دونوں مشرقوں کا بھی رب ہے اور دونوں مغربوں کا بھی رب ہے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۱۹﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel, donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " مَرَجَ الۡبَحۡرَیۡنِ یَلۡتَقِیٰنِ ﴿ۙ۲۰﴾", "english": " He has made the two bodies of water flow. They will one day meet.", "french": " Il a laissé la voie libre aux deux mers ; elles se rencontreront un jour .", "german": " Er hat freien Lauf gelassen den beiden Gewässern, die (einst) einander begegnen werden.", "spanish": " Verdaderamente Él fusionará los dos océanos, uniéndolos conjuntamente.", "urdu": " اس نے دو سمندروں کو اس طرح چلایا ہے کہ وہ ایک وقت میں مل جائیں گے۔"}, {"arabic": " بَیۡنَہُمَا بَرۡزَخٌ لَّا یَبۡغِیٰنِ ﴿ۚ۲۱﴾", "english": " Between them is now a barrier; they encroach not one upon the other .", "french": " Entre elles, il y a maintenant une barrière ; elles n’empiètent pas l’une sur l’autre .", "german": " Zwischen ihnen ist eine Scheidewand, so dass sie nicht ineinander laufen können.", "spanish": " Entre ellos hay ahora una barrera; no se invaden mutuamente.", "urdu": " (سردست) ان کے درمیان ایک پردہ ہے جس کی وجہ سے وہ ایک دوسرے میں داخل نہیں ہو سکتے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۲۲﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " یَخۡرُجُ مِنۡہُمَا اللُّؤۡلُؤُ وَ الۡمَرۡجَانُ ﴿ۚ۲۳﴾", "english": " There come out from them pearls and coral.", "french": " Il en sort des perles et des coraux.", "german": " Perlen kommen aus beiden hervor und Korallen.", "spanish": " De ellos proceden las perlas y el coral.", "urdu": " ان دونوں سمندروں میں سے موتی اور مونگے نکلتے ہیں۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۲۴﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پھر بولو کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " وَ لَہُ الۡجَوَارِ الۡمُنۡشَئٰتُ فِی الۡبَحۡرِ کَالۡاَعۡلَامِ ﴿ۚ۲۵﴾", "english": " And His are the lofty ships reared aloft on the sea like mountains.", "french": " Et à Lui appartiennent les navires qui se dressent sur la mer hauts comme des montagnes.", "german": " Und Sein sind die hohen Schiffe auf dem Meer, die gleich Bergen ragen.", "spanish": " Suyas son las airosas naves que se elevan en el mar como montañas.", "urdu": " اور اس کی بنائی ہوئی کشتیاں (بھی ہیں) اور (اس کے بنائے ہوئے) جہاز بھی ہیں جو سمندروں میں پہاڑوں کی طرح دکھائی دیتے ہیں۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿٪۲۶﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " سو بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں کس کس کا انکار کرو گے۔"}, {"arabic": " کُلُّ مَنۡ عَلَیۡہَا فَانٍ ﴿ۚۖ۲۷﴾", "english": " All that is on it (earth) will pass away.", "french": " Tout ce qui est sur cette terre est transitoire.", "german": " Alles, was auf (Erden) ist, wird vergehen.", "spanish": " Todo lo que hay en ella ( la tierra ) desaparecerá.", "urdu": " اس (یعنی زمین) پر جو کوئی بھی ہے آخر ہلاک ہونے والا ہے۔"}, {"arabic": " وَّ یَبۡقٰی وَجۡہُ رَبِّکَ ذُو الۡجَلٰلِ وَ الۡاِکۡرَامِ ﴿ۚ۲۸﴾", "english": " And there will remain only the Person of thy Lord, Master of Glory and Honour.", "french": " Il ne subsistera pour toujours que le Rang et la Dignité de ton Seigneur, le Maître de la Gloire et de l’Honneur.", "german": " Aber es bleibt das Angesicht deines Herrn – der Herr der Majestät und der Ehre.", "spanish": " Excepto la gracia de tu Señor, Dueño de la Gloria y el Honor.", "urdu": " اور صرف وہ بچتا ہے جس کی طرف تیرے جلال اور عزت والے خدا کی توجہ ہو۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۲۹﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " یَسۡـَٔلُہٗ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ کُلَّ یَوۡمٍ ہُوَ فِیۡ شَاۡنٍ ﴿ۚ۳۰﴾", "english": " Of Him do beg all that are in the heavens and the earth. Every day He reveals Himself in a different state.", "french": " C’est Lui que supplient tous ceux qui sont dans les cieux et sur la terre. Chaque jour Il Se manifeste dans un nouvel état.", "german": " Ihn bitten alle, die in den Himmeln und auf Erden sind. Jeden Augenblick offenbart Er Sich in neuem Glanz.", "spanish": " A Él implora cuanto hay en los cielos y la tierra. En cada momento se manifiesta a Sí mismo en una gloria diferente.", "urdu": " آسمانوں اور زمین میں جو کوئی بھی ہے‘ وہ اسی سے اپنی ضرورتیں طلب کرتا ہے۔ وہ ہر وقت ایک نئی حالت میں ہوتا ہے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۳۱﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " سو بولو کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " سَنَفۡرُغُ لَکُمۡ اَیُّہَ الثَّقَلٰنِ ﴿ۚ۳۲﴾", "english": " Soon shall We attend to you, O ye two big groups!", "french": " Bientôt, ô vous deux grandes puissances, Nous Nous occuperons de vous !", "german": " Bald werden Wir Uns mit euch befassen, ihr beiden Mächte!", "spanish": " Pronto nos ocuparemos de vosotros, ¡Oh, los dos grupos poderosos!", "urdu": " اے دونوں زبردست طاقتو! ہم تم دونوں کے لئے فارغ ہو رہے ہیں۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۳۳﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پھر بولو کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " یٰمَعۡشَرَ الۡجِنِّ وَ الۡاِنۡسِ اِنِ اسۡتَطَعۡتُمۡ اَنۡ تَنۡفُذُوۡا مِنۡ اَقۡطَارِ السَّمٰوٰتِ وَ الۡاَرۡضِ فَانۡفُذُوۡا ؕ لَا تَنۡفُذُوۡنَ اِلَّا بِسُلۡطٰنٍ ﴿ۚ۳۴﴾", "english": " O company of Jinn and men! if you have power to go beyond the confines of the heavens and the earth, then do go. But you cannot go save with authority.", "french": " Ô compagnie de djinns et d’hommes ! Si vous êtes capables de dépasser les confins des cieux et de la terre, allez- y donc ; mais vous ne pouvez y aller qu’avec un raisonnement déductif puissant.", "german": " O Versammlung von Jinn und Menschen! wenn ihr imstande seid, über die Grenzen der Himmel und der Erde hinauszugehen, dann gehet. Doch ihr werdet nicht imstande sein zu gehen, außer mit Ermächtigung.", "spanish": " ¡Oh asamblea de Yinn y hombres! Si tenéis poder para ir más allá de los límites de los cielos y la tierra, id, pues. Pero no podréis ir sino con autoridad.", "urdu": " اے جن و انس کے گروہ! اگر تم طاقت رکھتے ہو کہ آسمانوں اور زمین کے کناروں سے نکل بھاگو‘ تو نکل کر دکھا دو۔ تم دلیل کے بغیر ہرگز نہیں نکل سکتے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۳۵﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " سو بتاٶ! کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " یُرۡسَلُ عَلَیۡکُمَا شُوَاظٌ مِّنۡ نَّارٍ ۬ۙ وَّ نُحَاسٌ فَلَا تَنۡتَصِرٰنِ ﴿ۚ۳۶﴾", "english": " There shall be sent against you a flame of fire, and smoke; and you shall not be able to help yourselves.", "french": " Il sera envoyé contre vous une langue de feu sans fumée et une colonne de fumée sans feu ; et vous ne pourrez pas vous entraider.", "german": " Entsandt werden soll wider euch eine Feuerflamme und ein Qualm, dann werdet ihr beide nicht obsiegen.", "spanish": " Se lanzará contra vosotros una lengua de fuego sin humo y una columna de humo sin llama; y no podréis ayudaros el uno al otro.", "urdu": " تم پر آگ کا ایک شعلہ گرایا جائے گا اور تانبا بھی (گرایا جائے گا) پس تم دونوں ہرگز غالب نہیں آسکتے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۳۷﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں کس کس کا انکار کرو گے۔"}, {"arabic": " فَاِذَا انۡشَقَّتِ السَّمَآءُ فَکَانَتۡ وَرۡدَۃً کَالدِّہَانِ ﴿ۚ۳۸﴾", "english": " And when the heaven is rent asunder, and becomes red like red hide —", "french": " Et lorsque le ciel sera fendu et deviendra rouge comme le cuir teint rouge –", "german": " Und wenn der Himmel sich spaltet und rosig wird gleich rotem Leder –", "spanish": " Cuando el cielo se rompa en pedazos y enrojezca como el cuero rojo,", "urdu": " جب آسمان پھٹ جائے گا اور سرخ چمڑے کی طرح ہو جائے گا (وہ آخری فیصلہ کی گھڑی ہوگی) ۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۳۹﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب تم بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فَیَوۡمَئِذٍ لَّا یُسۡـَٔلُ عَنۡ ذَنۡۢبِہٖۤ اِنۡسٌ وَّ لَا جَآنٌّ ﴿ۚ۴۰﴾", "english": " On that day neither man nor Jinn will be asked about his sin.", "french": " Ce jour-là ni homme, ni djinn ne seront questionnés sur leurs péchés.", "german": " An jenem Tage wird weder Mensch noch Jinn nach seiner Sünde befragt werden.", "spanish": " En ese día no se interrogará ni al hombre ni al Yinn sobre su pecado.", "urdu": " اس فیصلہ کے دن نہ انسان سے اس کے گناہ کے متعلق پوچھا جائے گا نہ جن سے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۴۱﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب تم دونوں بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " یُعۡرَفُ الۡمُجۡرِمُوۡنَ بِسِیۡمٰہُمۡ فَیُؤۡخَذُ بِالنَّوَاصِیۡ وَ الۡاَقۡدَامِ ﴿ۚ۴۲﴾", "english": " The guilty will be known by their marks, and they will be seized by the forelocks and the feet.", "french": " Les coupables seront reconnus à leurs marques, et ils seront saisis par les toupets et par les pieds.", "german": " Die Schuldigen werden erkannt werden an ihren Merkmalen, und erfasst werden sie an ihren Stirnlocken und Füßen.", "spanish": " A los culpables se les reconocerá por sus marcas y serán atrapados por el mechón de pelos de su frente y por los pies.", "urdu": " مجرم اپنے چہروں کی علامتوں سے پہچان لئے جائیں گے۔ اور اپنے ماتھے کے بالوں اور قدموں سے پکڑ لئے جائیں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۴۳﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب تم بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " ہٰذِہٖ جَہَنَّمُ الَّتِیۡ یُکَذِّبُ بِہَا الۡمُجۡرِمُوۡنَ ﴿ۘ۴۴﴾", "english": " This is the Hell which the guilty deny,", "french": " Ceci est l’Enfer que nient les coupables.", "german": " Das ist die Hölle, die die Schuldigen leugnen,", "spanish": " Éste es el Infierno que niegan los culpables,", "urdu": " یہ وہ جہنم ہے جس کا مجرم انکار کرتے ہیں۔"}, {"arabic": " یَطُوۡفُوۡنَ بَیۡنَہَا وَ بَیۡنَ حَمِیۡمٍ اٰنٍ ﴿ۚ۴۵﴾", "english": " Between it and fierce boiling water will they go round.", "french": " Ils tourneront en rond entre le Feu et de l’eau extrêmement bouillante,", "german": " zwischen ihr und siedend heißem Wasser werden sie die Runde machen.", "spanish": " Rondarán entre él y agua intensamente hirviente.", "urdu": " (جب اس میں داخل ہونے کا دن آئے گا) وہ اس (دوزخ) کے درمیان اور ابلتے ہوئے پانی کے درمیان گھوم رہے ہوں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿٪۴۶﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " اب بولو تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے!"}, {"arabic": " وَ لِمَنۡ خَافَ مَقَامَ رَبِّہٖ جَنَّتٰنِ ﴿ۚ۴۷﴾", "english": " But for him who fears to stand before his Lord there are two Gardens —", "french": " Mais pour celui qui redoute le rang élevé de son Seigneur, il y a deux Jardins –", "german": " Für den aber, der sich vor der Gegenwart seines Herrn fürchtet, werden zwei Gärten sein –", "spanish": " Mas para quien se sobrecoja ante la elevada majestad de su Señor, hay dos Jardines-", "urdu": " اور جو شخص اپنے رب کی شان سے ڈرتا ہے اس کے لئے دو جنتیں مقرر ہیں (دنیوی بھی اور اخروی بھی)"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۙ۴۸﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen? –,", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?–", "urdu": " پھر بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " ذَوَاتَاۤ اَفۡنَانٍ ﴿ۚ۴۹﴾", "english": " Having many varieties of trees .", "french": " Les deux comportant beaucoup de branches.", "german": " Mit vielerlei (Bäumen).", "spanish": " Ambos con muchas ramas.", "urdu": " دونوں جنتیں بہت سی ٹہنیوں والی ہونگی (یعنی ان کے درخت بڑے گھنے ہوں گے) ۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۵۰﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پھر بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فِیۡہِمَا عَیۡنٰنِ تَجۡرِیٰنِ ﴿ۚ۵۱﴾", "english": " In both of them there are two fountains flowing free .", "french": " Dans chacun d’eux, il y a deux sources courantes.", "german": " In beiden werden zwei fließende Brunnen sein.", "spanish": " En los dos habrá dos fuentes que correrán libremente .", "urdu": " ان دونوں میں دو چشمے (پانی کی کثرت سے) بہہ رہے ہوں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۵۲﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پھر بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فِیۡہِمَا مِنۡ کُلِّ فَاکِہَۃٍ زَوۡجٰنِ ﴿ۚ۵۳﴾", "english": " Therein will be every kind of fruit in pairs.", "french": " Il s’y trouvera toute espèce de fruits par paires.", "german": " Darinnen wird es jegliche Art Frucht in Paaren geben.", "spanish": " Allí habrá toda clase de fruta en parejas.", "urdu": " ان دونوں میں ہر قسم کے میوے دو دو قسم کے ہوں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۵۴﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پھر بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " مُتَّکِـِٕیۡنَ عَلٰی فُرُشٍۭ بَطَآئِنُہَا مِنۡ اِسۡتَبۡرَقٍ ؕ وَ جَنَا الۡجَنَّتَیۡنِ دَانٍ ﴿ۚ۵۵﴾", "english": " They will recline on couches above carpets, the linings of which will be of thick brocade. And the ripe fruit of the two Gardens will be within easy reach.", "french": " Ils seront accoudés sur des coussins posés sur des tapis, dont les doublures seront de brocart lourd . Et les fruits mûrs des deux Jardins seront à leur portée.", "german": " Sie werden ruhen auf Kissen, deren Futter dicker Brokat ist. Und die Früchte der beiden Gärten werden nahe zur Hand sein.", "spanish": " Se reclinarán en lechos sobre alfombras, cuyos forros serán de grueso brocado. Y el fruto maduro de los dos Jardines estará a su alcance.", "urdu": " (جنتی لوگ) فرش پر (ایسے) تکیے لگائے ہوئے ہونگے جن کے استر تافتے کے ہونگے اور دونوں باغوں کے پھل (بوجھ سے) جھکے ہوئے ہوں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۵۶﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿ Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " سو بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فِیۡہِنَّ قٰصِرٰتُ الطَّرۡفِ ۙ لَمۡ یَطۡمِثۡہُنَّ اِنۡسٌ قَبۡلَہُمۡ وَ لَا جَآنٌّ ﴿ۚ۵۷﴾", "english": " Therein will also be chaste maidens of modest gaze, whom neither man nor Jinn will have touched before them —", "french": " Il s’y trouvera aussi des jeunes filles chastes , les regards baissés par modestie , que ni homme ni djinn n’auront touchées avant eux –", "german": " Darinnen werden (Keusche) sein mit züchtigem Blick, die weder Mensch noch Jinn vor ihnen berührt hat –", "spanish": " Allí habrá también doncellas castas de mirada recatada, a quienes ni el hombre ni el Yinn habrán tocado antes que ellos –", "urdu": " ان جنتوں میں نیچی نگاہوں والی عورتیں ہونگی۔ جن سے نہ تو ان (جنتیوں) سے پہلے انسانوں نے تعلق رکھا ہوگا‘ نہ جنوں نے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۚ۵۸﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen? –,", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos? –", "urdu": " پس بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " کَاَنَّہُنَّ الۡیَاقُوۡتُ وَ الۡمَرۡجَانُ ﴿ۚ۵۹﴾", "english": " As if they were rubies and small pearls.", "french": " Comme si elles étaient des rubis et de petites perles.", "german": " Als wären sie Rubinen und Korallen.", "spanish": " Como si fueran rubíes y pequeñas perlas.", "urdu": " گویا کہ وہ عورتیں یاقوت اور مرجان ہوں گی۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۶۰﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " سو تم بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " ہَلۡ جَزَآءُ الۡاِحۡسَانِ اِلَّا الۡاِحۡسَانُ ﴿ۚ۶۱﴾", "english": " The reward of goodness is nothing but goodness.", "french": " La récompense de la bonté peut-elle être autre chose que de la bonté ?", "german": " Kann der Lohn für Güte anderes sein als Güte?", "spanish": " ¿Puede acaso recompensarse el favor por algo que no sea favor?", "urdu": " کیا احسان کی جزا احسان کے سوا کچھ اور بھی ہو سکتی ہے؟"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۶۲﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پس بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے ۔"}, {"arabic": " وَ مِنۡ دُوۡنِہِمَا جَنَّتٰنِ ﴿ۚ۶۳﴾", "english": " And besides these two, there are two other Gardens —", "french": " Et outre ces deux-là, il y a deux autres Jardins –", "german": " Und neben diesen beiden sind noch zwei andere Gärten –", "spanish": " Y además de esos dos, habrá otros dos Jardines,", "urdu": " اور ان دونوں جنتوں کے سوا دو اور جنتیں بھی ہوں گی۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۙ۶۴﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen? –,", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پس بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " مُدۡہَآ مَّتٰنِ ﴿ۚ۶۵﴾", "english": " Dark green with foliage.", "french": " Vert foncé à cause du feuillage dense .", "german": " Mit Blattwerk dunkelgrün.", "spanish": " Verdes oscuros, con espesura.", "urdu": " (یہ دونوں جنتیں) گہری سبز ہونگی۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۚ۶۶﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux.", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پس بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فِیۡہِمَا عَیۡنٰنِ نَضَّاخَتٰنِ ﴿ۚ۶۷﴾", "english": " Therein also will be two springs gushing forth with water.", "french": " Il s’y trouvera aussi deux fontaines déversant de l’eau en abondance.", "german": " Darinnen werden zwei Quellen sein, reichlich Wasser spendende.", "spanish": " Allí habrá también dos manantiales de los que brotará agua.", "urdu": " ان دونوں (جنتوں) میں دو چشمے بڑے جوش سے پھوٹ رہے ہوں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۶۸﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " سو بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فِیۡہِمَا فَاکِہَۃٌ وَّ نَخۡلٌ وَّ رُمَّانٌ ﴿ۚ۶۹﴾", "english": " In both of them there will be all kinds of fruit, and dates and pomegranates.", "french": " Dans tous deux, il y aura toute espèce de fruits, et des dattes et des grenades.", "german": " In beiden werden Früchte sein, und Datteln und Granatäpfel.", "spanish": " En ambos habrá toda clase de frutas, dátiles y granadas.", "urdu": " ان میں میوے بھی ہوں گے اور کھجوریں اور انار بھی۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۚ۷۰﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پھر بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " فِیۡہِنَّ خَیۡرٰتٌ حِسَانٌ ﴿ۚ۷۱﴾", "english": " Therein will be maidens , good and beautiful —", "french": " Il s’y trouvera des jeunes filles vertueuses et belles –", "german": " Darinnen werden (Mädchen) sein, gut und schön -", "spanish": " Allí habrá doncellas , buenas y bellas –", "urdu": " ان باغوں میں نیک اور خوبصورت عورتیں ہوں گی۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۚ۷۲﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen? –,", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?–", "urdu": " سو بتاٶ کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " حُوۡرٌ مَّقۡصُوۡرٰتٌ فِی الۡخِیَامِ ﴿ۚ۷۳﴾", "english": " Fair maidens with lovely black eyes, well-guarded in pavilions —", "french": " De belles jeunes filles aux beaux yeux noirs, bien gardées dans des pavillons –", "german": " Holdselige mit herrlichen schwarzen Augen, wohlbehütet in Zelten –", "spanish": " Doncellas hermosas con bellos ojos negros, bien guardadas en sus pabellones–", "urdu": " وہ عورتیں کالی آنکھوں والی ہوں گی (اور) خیموں کے اندر رکھی گئی ہوں گی۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۚ۷۴﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen? –,", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?–", "urdu": " پس بتاٶ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " لَمۡ یَطۡمِثۡہُنَّ اِنۡسٌ قَبۡلَہُمۡ وَ لَا جَآنٌّ ﴿ۚ۷۵﴾", "english": " Whom neither man nor Jinn will have touched before them —", "french": " Que ni homme ni djinn n’auront touchées avant eux.", "german": " Die weder Mensch noch Jinn vor ihnen berührt hat –", "spanish": " A quienes ni el hombre ni el Yinn habrán tocado antes que ellos-", "urdu": " نہ تو (ان کو جنت میں داخل ہونے والے جن و انس سے) پہلے کسی انسان نے چھوا ہوگا‘ نہ جن نے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿ۚ۷۶﴾", "english": " Which, then, of the favours of your Lord will you twain deny? —", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen? –,", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?–", "urdu": " پس بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " مُتَّکِـِٕیۡنَ عَلٰی رَفۡرَفٍ خُضۡرٍ وَّ عَبۡقَرِیٍّ حِسَانٍ ﴿ۚ۷۷﴾", "english": " Reclining on green cushions and beautiful carpets.", "french": " Ils seront accoudés sur des coussins verts allongés sur de beaux tapis.", "german": " Ruhend auf grünen Kissen und schönen Teppichen.", "spanish": " Reclinadas en cojines verdes y bellas alfombras.", "urdu": " وہ (جنتی) خیمہ کے بڑھے ہوئے سبز فرشوں پر جو نہایت اعلیٰ ہوں گے‘ اور خوبصورت ہونگے تکیہ لگائے بیٹھے ہوں گے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکُمَا تُکَذِّبٰنِ ﴿۷۸﴾", "english": " Which, then, of the favours of your Lord will you twain deny?", "french": " Lequel donc, des bienfaits de votre Seigneur nierez-vous, vous deux ?", "german": " Welche der Wohltaten eures Herrn wollt ihr beide da leugnen?", "spanish": " ¿Cuál, pues, de los favores de vuestro Señor negaréis ambos?", "urdu": " پس بتاٶ تو سہی کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کا انکار کرو گے۔"}, {"arabic": " تَبٰرَکَ اسۡمُ رَبِّکَ ذِی الۡجَلٰلِ وَ الۡاِکۡرَامِ ﴿٪۷۹﴾", "english": " Blessed is the name of thy Lord, Master of Glory and Honour.", "french": " Béni est le nom de ton Seigneur, le Maître de la Gloire et de l’Honneur.", "german": " Segensreich ist der Name deines Herrn, des Herrn der Majestät und Ehre.", "spanish": " Bendito sea el nombre de tu Señor, Dueño de la Gloria y el Honor.", "urdu": " تیرے جلال اور عزت والے رب کا نام بڑی برکت والا ہے۔"}], "Surah": 55}