{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ الَّیۡلِ اِذَا یَغۡشٰی ۙ﴿۲﴾", "english": " By the night when it covers up!", "french": " Par la nuit lorsqu’elle recouvre,", "german": " Bei der Nacht, wenn sie überschattet,", "spanish": " ¡Por la noche cuando lo cubre todo!", "urdu": " میں رات کو شہادت کے طور پر پیش کرتا ہوں جب وہ ڈھانک لے۔"}, {"arabic": " وَ النَّہَارِ اِذَا تَجَلّٰی ۙ﴿۳﴾", "english": " And by the day when it brightens up,", "french": " Et par le jour lorsqu’il resplendit,", "german": " und bei dem Tag, wenn er strahlend erscheint,", "spanish": " Por el día cuando resplandece ,", "urdu": " اور دن کو بھی (میں شہادت کے طور پر پیش کرتا ہوں) جب وہ خوب روشن ہوجائے۔"}, {"arabic": " وَ مَا خَلَقَ الذَّکَرَ وَ الۡاُنۡثٰۤی ۙ﴿۴﴾", "english": " And by the creating of the male and the female,", "french": " Et par la création du mâle et de la femelle,", "german": " und bei der Erschaffung von Mann und Weib,", "spanish": " Y por la creación del macho y la hembra,", "urdu": " اور نر اور مادہ کی پیدائش کو بھی (شہادت کے طور پر پیش کرتا ہوں)"}, {"arabic": " اِنَّ سَعۡیَکُمۡ لَشَتّٰی ؕ﴿۵﴾", "english": " Surely, your strivings are diverse.", "french": " Assurément, vos efforts sont variés,", "german": " fürwahr, eure Aufgabe ist in der Tat verschieden.", "spanish": " En verdad, vuestros esfuerzos son diversos.", "urdu": " کہ تمہاری کوششیں یقیناً مختلف ہیں۔"}, {"arabic": " فَاَمَّا مَنۡ اَعۡطٰی وَ اتَّقٰی ۙ﴿۶﴾", "english": " Then as for him who gives and is righteous,", "french": " Alors, quant à celui qui donne dans la voie de la vérité et qui est vertueux,", "german": " Jener aber, der gibt und sich vor Unrecht hütet", "spanish": " Mas para quien da y es justo,", "urdu": " پس جس نے (خدا کی راہ میں) دیا اور تقویٰ اختیار کیا۔"}, {"arabic": " وَ صَدَّقَ بِالۡحُسۡنٰی ۙ﴿۷﴾", "english": " And testifies to the truth of what is right,", "french": " Et qui témoigne de tout ce qui est bien,", "german": " und an das Beste glaubt,", "spanish": " Y da testimonio de todo que es bueno,", "urdu": " اور نیک بات کی تصدیق کی۔"}, {"arabic": " فَسَنُیَسِّرُہٗ لِلۡیُسۡرٰی ؕ﴿۸﴾", "english": " We will facilitate for him every facility.", "french": " Nous lui faciliterons toutes les facilités pour le bien .", "german": " Wir wollen es ihm leicht machen.", "spanish": " Le otorgaremos toda faci­lidad .", "urdu": " اسے تو ہم ضرور آسانی (کے مواقع) بہم پہنچائیں گے۔"}, {"arabic": " وَ اَمَّا مَنۡۢ بَخِلَ وَ اسۡتَغۡنٰی ۙ﴿۹﴾", "english": " But as for him who is niggardly and is disdainfully indifferent,", "french": " Mais quant à celui qui est avare et qui est dédaigneusement indifférent,", "german": " Jener aber, der geizt und gleichgültig ist", "spanish": " Mas en cuanto a aquel que es mez­quino y d esdeñosamente indiferente,", "urdu": " اور ایسا (شخص) جس نے بخل سے کام لیا اور بے پروائی کا اظہار کیا۔"}, {"arabic": " وَ کَذَّبَ بِالۡحُسۡنٰی ۙ﴿۱۰﴾", "english": " And rejects what is right,", "french": " Et rejette ce qui est juste,", "german": " und das Beste leugnet,", "spanish": " Y que rechaza lo que es recto,", "urdu": " اور نیک بات کو جھٹلایا۔"}, {"arabic": " فَسَنُیَسِّرُہٗ لِلۡعُسۡرٰی ﴿ؕ۱۱﴾", "english": " We will make easy for him the path to distress.", "french": " Nous lui rendrons facile le chemin de la détresse.", "german": " Ihm wollen Wir den Weg zur Drangsal leicht machen.", "spanish": " Le facilitaremos el camino ha­cia la desgracia.", "urdu": " اسے ہم تکلیف (کا سامان) بہم پہنچائیں گے۔"}, {"arabic": " وَ مَا یُغۡنِیۡ عَنۡہُ مَا لُہٗۤ اِذَا تَرَدّٰی ﴿ؕ۱۲﴾", "english": " And his wealth shall not avail him when he perishes.", "french": " Et quand il périra, ses richesses ne lui serviront à rien.", "german": " Und sein Reichtum soll ihm nichts nützen, wenn er zugrunde geht.", "spanish": " Y su riqueza no le servirá de nada cuando perezca.", "urdu": " اور جب وہ ہلاک ہوگا تو اس کا مال اسے کوئی فائدہ نہ پہنچائے گا۔"}, {"arabic": " اِنَّ عَلَیۡنَا لَلۡہُدٰی ﴿۫ۖ۱۳﴾", "english": " Surely it is for Us to guide;", "french": " En vérité, c’est à Nous de guider ;", "german": " Wahrlich, Uns obliegt die Führung;", "spanish": " En verdad, a Nosotros nos corresponde guiar;", "urdu": " ہدایت دینا یقیناً ہمارے ہی ذمے ہے۔"}, {"arabic": " وَ اِنَّ لَنَا لَلۡاٰخِرَۃَ وَ الۡاُوۡلٰی ﴿۱۴﴾", "english": " And to Us belongs the Hereafter as well as the present world.", "french": " Et à Nous appartient l’au-delà aussi bien que ce monde,", "german": " und Unser ist die kommende wie diese Welt.", "spanish": " Y a Nosotros nos pertenece el Más Allá, así como el mundo ac­tual.", "urdu": " اور ہر بات کی انتہا اور ابتدا بھی یقیناً ہمارے ہی اختیار میں ہے۔"}, {"arabic": " فَاَنۡذَرۡتُکُمۡ نَارًا تَلَظّٰی ﴿ۚ۱۵﴾", "english": " So I warn you of a flaming Fire.", "french": " Je vous avertis donc d’un Feu flambant.", "german": " Darum warne Ich euch vor einem flammenden Feuer,", "spanish": " Os advierto, pues, de un Fue­go llameante.", "urdu": " پس (یاد رکھو کہ) میں نے (تو) تم کو ایک بھڑکتی ہوئی آگ سے ہوشیار کر دیا ہے۔"}, {"arabic": " لَا یَصۡلٰٮہَاۤ اِلَّا الۡاَشۡقَی ﴿ۙ۱۶﴾", "english": " None shall enter it but the most wicked one,", "french": " Nul n’y entrera excepté le plus malchanceux de par sa dépravation ,", "german": " keiner soll dort eingehen als der Bösewicht,", "spanish": " Nadie entrará en él salvo el más perverso.", "urdu": " اس میں سوائے کسی بڑے بدبخت کے کوئی داخل نہ ہوگا۔"}, {"arabic": " الَّذِیۡ کَذَّبَ وَ تَوَلّٰی ﴿ؕ۱۷﴾", "english": " Who rejects the truth and turns his back.", "french": " Celui qui rejette la vérité et tourne le dos.", "german": " der da leugnet und den Rücken kehrt.", "spanish": " Que rechaza la verdad y da la espalda.", "urdu": " (ایسا بدبخت) جس نے (حق کو) جھٹلایا اور (سچ سے) منہ پھیر لیا۔"}, {"arabic": " وَ سَیُجَنَّبُہَا الۡاَتۡقَی ﴿ۙ۱۸﴾", "english": " But the righteous one shall be kept away from it,", "french": " Mais le plus vertueux en sera tenu à l’écart,", "german": " Doch weit ferne von ihm wird der Gerechte sein,", "spanish": " Mas el justo será mantenido lejos de él,", "urdu": " اور جو بڑا متقی ہوگا وہ ضرور اس سے دور رکھا جائے گا۔"}, {"arabic": " الَّذِیۡ یُؤۡتِیۡ مَالَہٗ یَتَزَکّٰی ﴿ۚ۱۹﴾", "english": " Who gives his wealth to become purified.", "french": " Qui donne ses biens afin qu’il soit purifié,", "german": " der seinen Reichtum dahingibt, um sich zu läutern.", "spanish": " Aquél que da sus bienes para purificarse.", "urdu": " (ایسا متقی) جو اپنا مال (اس لئے خدا کی راہ میں) دیتا ہے کہ (اس سے) تزکیہ حاصل کرے۔"}, {"arabic": " وَ مَا لِاَحَدٍ عِنۡدَہٗ مِنۡ نِّعۡمَۃٍ تُجۡزٰۤی ﴿ۙ۲۰﴾", "english": " And he owes no favour to anyone, which is to be repaid,", "french": " Et non pas parce qu’il doit à qui que ce soit une faveur qui doit être repayée.", "german": " Und er schuldet keinem eine Gunst, die zurückgezahlt werden müsste;", "spanish": " Y no debe favor a nadie, que deba ser devuelto,", "urdu": " اور کسی کا اس پر کوئی احسان نہیں ہوتا جس کا بدلہ اتارنے کا اس کو خیال ہو۔"}, {"arabic": " اِلَّا ابۡتِغَآءَ وَجۡہِ رَبِّہِ الۡاَعۡلٰی ﴿ۚ۲۱﴾", "english": " Except that he gives his wealth to seek the pleasure of his Lord, the Most High.", "french": " Sauf qu’il donne ses richesses pour rechercher le plaisir de son Seigneur, le Plus-Haut.", "german": " dennoch (gibt er seinen Reichtum hin) im Trachten nach dem Wohlgefallen seines Herrn, des Höchsten.", "spanish": " Excepto que entrega su rique­za para buscar el agrado de su Señor, el Altísimo.", "urdu": " ہاں مگر اپنے عالی شان رب کی خوشنودی حاصل کرنا (اس کا مقصود ہوتا ہے)"}, {"arabic": " وَ لَسَوۡفَ یَرۡضٰی ﴿٪۲۲﴾", "english": " And soon will He be well pleased with him .", "french": " Et certainement Il sera très satisfait de lui .", "german": " Und bald wird Er (mit ihm) wohlzufrieden sein.", "spanish": " Y Él pronto se sentirá com­placido con él.", "urdu": " اور وہ (خدا) ضرور اس سے راضی ہو جائے گا۔"}], "Surah": 92}