{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَلَمۡ تَرَ کَیۡفَ فَعَلَ رَبُّکَ بِاَصۡحٰبِ الۡفِیۡلِ ؕ﴿۲﴾", "english": " Hast thou not seen how thy Lord dealt with the People of the Elephant?", "french": " N’as-tu pas vu comment ton Seigneur S’est chargé du peuple de l’Eléphant ?", "german": " Hast du nicht gesehen, wie dein Herr mit den Besitzern des Elefanten verfuhr?", "spanish": " ¿No has visto cómo trató tu Señor al Pueblo del Elefante?", "urdu": " (اے محمد)! کیا تمہیں معلوم نہیں کہ تمہارے رب نے ہاتھی (استعمال کرنے) والوں کے ساتھ کیسا سلوک کیا۔"}, {"arabic": " اَلَمۡ یَجۡعَلۡ کَیۡدَہُمۡ فِیۡ تَضۡلِیۡلٍ ۙ﴿۳﴾", "english": " Did He not cause their plan to miscarry?", "french": " Ne causa-t-Il pas l’échec de leurs stratagèmes ?", "german": " Machte Er nicht ihren Anschlag zunichte?", "spanish": " ¿Acaso no confundió su planes?", "urdu": " کیا (ان کو حملہ سے قبل ہلاک کرکے) ان کے منصوبہ کو باطل نہیں کر دیا۔"}, {"arabic": " وَّ اَرۡسَلَ عَلَیۡہِمۡ طَیۡرًا اَبَابِیۡلَ ۙ﴿۴﴾", "english": " And He sent against them swarms of birds,", "french": " Et Il envoya contre eux des nuées d’oiseaux,", "german": " Und Er sandte Schwärme von Vögeln wider sie,", "spanish": " Y envió contra ellos bandadas de pájaros,", "urdu": " اور (اس کے بعد) ان (کی لاشوں) پر جھنڈ کے جھنڈ پرندے بھیجے‘"}, {"arabic": " تَرۡمِیۡہِمۡ بِحِجَارَۃٍ مِّنۡ سِجِّیۡلٍ ۪ۙ﴿۵﴾", "english": " Which ate their carrion , striking them against stones of clay.", "french": " Qui dévorèrent leurs charognes en les frappant contre des pierres d’argile.", "german": " die (ihr Aas fraßen und) sie herumwarfen gegen Steine von Ton;", "spanish": " Que se comieron su carroña, golpeándoles contra piedras de arcilla.", "urdu": " (جو) ان (کے گوشت) کو سخت قسم کے پتھروں پر مارتے (اور نوچتے) تھے۔"}, {"arabic": " فَجَعَلَہُمۡ کَعَصۡفٍ مَّاۡکُوۡلٍ ٪﴿۶﴾", "english": " And thus made them like broken straw, eaten up.", "french": " Et Il les rendit ainsi comme de la paille coupée et mangée.", "german": " und Er machte sie gleich abgeweideten Halmen.", "spanish": " Y así los redujo como a paja rota, consumida.", "urdu": " سو اس کے نتیجہ میں اس نے انہیں ایسا بھوسا کی طرح کر دیا جسے جانوروں نے کھا لیا ہو۔"}], "Surah": 105}