{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " تَنۡزِیۡلُ الۡکِتٰبِ مِنَ اللّٰہِ الۡعَزِیۡزِ الۡحَکِیۡمِ ﴿۲﴾", "english": " The revelation of this Book is from Allah, the Mighty, the Wise.", "french": " La révélation de ce Livre est d’Allāh, le Puissant, le Sage.", "german": " Die Offenbarung des Buches ist von Allah, dem Allmächtigen, dem Allweisen.", "spanish": " La revelación de este Libro procede de Al‑lah, el Poderoso, el Sabio.", "urdu": " اس کتاب کا اترنا اللہ کی طرف سے ہے جو غالب (اور) سب کام حکمتوں کے ماتحت کرنے والاہے۔"}, {"arabic": " اِنَّاۤ اَنۡزَلۡنَاۤ اِلَیۡکَ الۡکِتٰبَ بِالۡحَقِّ فَاعۡبُدِ اللّٰہَ مُخۡلِصًا لَّہُ الدِّیۡنَ ؕ﴿۳﴾", "english": " Surely it is We Who have revealed the Book to thee with truth; so worship Allah, being sincere to Him in obedience.", "french": " Assurément, c’est Nous Qui t’avons révélé le Livre avec vérité ; adore donc Allāh, étant sincère envers Lui dans ta foi.", "german": " Wahrlich, Wir haben dir das Buch mit der Wahrheit hinabgesandt; so diene denn Allah, in lauterem Gehorsam gegen Ihn.", "spanish": " Por cierto que somos Nosotros quienes te hemos revelado el Libro con verdad; adora pues a Al‑lah, dedicándole tu fe con toda sinceridad.", "urdu": " ہم نے تیری طرف یہ کتاب (یعنی قرآن) کامل سچائیوں پر مشتمل اتاری ہے‘ پس تو اطاعت کو اللہ کے لئے خالص کرتے ہوئے اس کی عبادت کر۔"}, {"arabic": " اَلَا لِلّٰہِ الدِّیۡنُ الۡخَالِصُ ؕ وَ الَّذِیۡنَ اتَّخَذُوۡا مِنۡ دُوۡنِہٖۤ اَوۡلِیَآءَ ۘ مَا نَعۡبُدُہُمۡ اِلَّا لِیُقَرِّبُوۡنَاۤ اِلَی اللّٰہِ زُلۡفٰی ؕ اِنَّ اللّٰہَ یَحۡکُمُ بَیۡنَہُمۡ فِیۡ مَا ہُمۡ فِیۡہِ یَخۡتَلِفُوۡنَ ۬ؕ اِنَّ اللّٰہَ لَا یَہۡدِیۡ مَنۡ ہُوَ کٰذِبٌ کَفَّارٌ ﴿۴﴾", "english": " Hearken, it is to Allah alone that sincere obedience is due. And those who take for protectors others beside Him say , ‘We serve them only that they may bring us near to Allah in station.’ Surely, Allah will judge between them concerning that wherein they differ. Surely, Allah guides not him who is an ungrateful liar.", "french": " Ecoutez, c’est uniquement à Allāh qu’est due l’obéissance sincère. Et ceux qui en prennent d’autres en dehors de Lui pour protecteurs disent : « Nous les servons seulement pour qu’ils nous rapprochent d’Allāh. » Assurément, Allāh jugera entre eux à propos de ce sur quoi ils étaient en désaccord. Assurément, Allāh ne guide pas celui qui est un menteur ingrat.", "german": " Fürwahr, Allah (allein) gebührt lauterer Gehorsam. Und diejenigen, die sich andere zu Beschützern nehmen statt Ihn (sprechen): \"Wir dienen ihnen nur, damit sie uns Allah nahebringen.\" Allah wird zwischen ihnen richten über das, worin sie uneins sind. Wahrlich, Allah weist nicht dem den Weg, der ein Lügner, ein Undankbarer ist.", "spanish": " Escuchad: sólo a Al‑lah se le debe sincera obediencia. Y quienes toman por protectores a otros distintos de Él, dicen: “Los servimos única­mente para que nos lleven a un nivel próximo a Al‑lah”. En verdad, Al‑lah juzgará entre ellos en cuanto a lo que disputan. Ciertamente Al­-lah no guía al mentiroso desagra­decido.", "urdu": " سنو‘ اطاعت خالص اللہ ہی کا حق ہے اور جو لوگ اس کے سوا اور ہستیوں کو دوست بناتے ہیں (یہ کہتے ہوئے) کہ ہم ان کی عبادت صرف اس لئے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں۔ اللہ ان کے درمیان ان باتوں کے متعلق جن میں وہ اختلاف رکھتے ہیں فیصلہ کرے گا۔ اللہ یقیناً جھوٹے اور ناشکر گذار کو کامیابی کا راستہ نہیں دکھاتا۔"}, {"arabic": " لَوۡ اَرَادَ اللّٰہُ اَنۡ یَّتَّخِذَ وَلَدًا لَّاصۡطَفٰی مِمَّا یَخۡلُقُ مَا یَشَآءُ ۙ سُبۡحٰنَہٗ ؕ ہُوَ اللّٰہُ الۡوَاحِدُ الۡقَہَّارُ ﴿۵﴾", "english": " If Allah had desired to take to Himself a son, He could have chosen whom He pleased out of what He creates. Holy is He! He is Allah, the One, the Most Supreme.", "french": " Si Allāh avait voulu S'attribuer un fils, Il aurait pu choisir qui Il voulait parmi ce qu’Il crée. Saint est-Il ! Il est Allāh, I’Unique, le Tout-Dominant de par Sa majesté et Sa gloire .", "german": " Hätte Allah Sich einen Sohn zugesellen wollen, Er hätte wählen können, was Ihm beliebte, von dem, was Er erschafft. Preis Ihm! Er ist Allah, der Einige, der Allbezwingende.", "spanish": " Si Al‑lah hubiese querido to­mar un Hijo, hubiera elegido a quien le gustara de lo creado por Él ¡Santo es Él! Él es Al‑lah, el Único, el Dominante.", "urdu": " اگر اللہ بیٹا بنانے کا ارادہ رکھتا تو اپنی مخلوق میں سے جس کو چاہتا چن لیتا وہ (حقیقی بیٹے کے نقص سے) پاک ہے۔ بات یہ ہے کہ اللہ ایک ہے (اور) غالب ہے۔"}, {"arabic": " خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ ۚ یُکَوِّرُ الَّیۡلَ عَلَی النَّہَارِ وَ یُکَوِّرُ النَّہَارَ عَلَی الَّیۡلِ وَ سَخَّرَ الشَّمۡسَ وَ الۡقَمَرَ ؕ کُلٌّ یَّجۡرِیۡ لِاَجَلٍ مُّسَمًّی ؕ اَلَا ہُوَ الۡعَزِیۡزُ الۡغَفَّارُ ﴿۶﴾", "english": " He created the heavens and the earth in accordance with the requirements of wisdom. He makes the night to cover the day, and He makes the day to cover the night; and He has pressed the sun and the moon into service; each pursues its course until an appointed time. Hearken, it is He alone Who is the Mighty, the Great Forgiver.", "french": " Il a créé les cieux et la terre en toute vérité. Il fait que la nuit enveloppe le jour, et Il fait que le jour enveloppe la nuit ; et Il a mis en service le soleil et la lune ; chacun flotte sur son orbite jusqu’à un moment déterminé. Ecoutez, c’est Lui Seul Qui est le Puissant, le Grand Pardonneur.", "german": " Er schuf die Himmel und die Erde in Weisheit. Er faltet die Nacht über den Tag und faltet den Tag über die Nacht; und Er hat die Sonne und den Mond dienstbar gemacht; ein jedes verfolgt seine Bahn zu einem bestimmten Ziel. Fürwahr, Er allein ist der Allmächtige, der Allverzeihende.", "spanish": " Creó los cielos y la tierra de acuerdo con los requisitos de la sa­biduría. Hace que la noche cubra el día y que el día cubra la noche; ha puesto en servicio al sol y a la luna; cada uno sigue su curso hasta el momento señalado. Escuchad, sólo Él es Poderoso, el Gran Perdonador.", "urdu": " اس نے آسمانوں اور زمین کو ایک کامل مصلحت کے ساتھ پیدا کیا ہے وہ رات کو دن پر اڑھا دیتا ہے اور دن کو رات پر اُڑھا دیتا ہے اور سورج اور چاند کو اس نے ایک (قانون کا پابند بنا کر) کام پر لگا رکھا ہے دونوں (میں سے ہر ایک) مقررہ مدت کے لئے ایک راستہ پر چل رہے ہیں۔ سنو! وہ بڑا غالب اور بڑا بخشنے والا ہے۔"}, {"arabic": " خَلَقَکُمۡ مِّنۡ نَّفۡسٍ وَّاحِدَۃٍ ثُمَّ جَعَلَ مِنۡہَا زَوۡجَہَا وَ اَنۡزَلَ لَکُمۡ مِّنَ الۡاَنۡعَامِ ثَمٰنِیَۃَ اَزۡوَاجٍ ؕ یَخۡلُقُکُمۡ فِیۡ بُطُوۡنِ اُمَّہٰتِکُمۡ خَلۡقًا مِّنۡۢ بَعۡدِ خَلۡقٍ فِیۡ ظُلُمٰتٍ ثَلٰثٍ ؕ ذٰلِکُمُ اللّٰہُ رَبُّکُمۡ لَہُ الۡمُلۡکُ ؕ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ فَاَنّٰی تُصۡرَفُوۡنَ ﴿۷﴾", "english": " He created you from a single being; then from that He made its mate; and He has sent down for you eight head of cattle in pairs. He creates you in the wombs of your mothers, creation after creation, in threefold darkness. This is Allah, your Lord. His is the kingdom. There is no God but He. Whither then are you being turned away?", "french": " Il vous créa d’un seul être ; ensuite de cet être Il fit son autre moitié ; et Il a fait descendre pour vous huit têtes de bétail par paires. Il vous crée dans la matrice de votre mère, création après création, en trois niveaux d’obscurité. Tel est Allāh, votre Seigneur. A Lui est le royaume. Il n’y a de dieu que Lui. Vers où donc vous détournez-vous ?", "german": " Er schuf euch aus einem einzigen Wesen; dann machte Er aus diesem seine Gattin; und Er erschuf für euch acht Haustiere in Paaren. Er erschafft euch in den Schößen eurer Mütter, Schöpfung nach Schöpfung, in dreifacher Finsternis. Das ist Allah, euer Herr. Sein ist das Reich. Es gibt keinen Gott außer Ihm. Wie lasst ihr euch da abwendig machen?", "spanish": " Él os creó de un solo ser; y a partir de él creó a su compañera; y os ha enviado ocho cabezas de ganado en parejas. Os crea en los vientres de vuestras madres, creación tras creación, en tres grados de ti­nieblas. Éste es Al‑lah, vuestro Señor. Suyo es el Reino. No existe ningún dios sino Él. ¿Incluso así os apartáis?", "urdu": " تم کو اس نے ایک جان سے پیدا کیا ہے۔ پھر اُس نے اسی جنس میں سے اُس کا جوڑا بنایا اور تمہارے لئے چار پایوں میں سے اس نے آٹھ جوڑے بنائے ہیں وہ تم کو تمہاری ماٶں کے پیٹوں میں پیدا کرتا ہے (یعنی) ایک پیدائش کے بعد دوسری پیدائش میں بدلتے ہوئے تین ظلمتوں میں سے گذار کر۔ یہ اللہ تمہارا رب ہے‘ بادشاہت اسی کے قبضہ میں ہے صرف وہی ایک معبود ہے پس تم کہاں پھیرے جاتے ہو۔"}, {"arabic": " اِنۡ تَکۡفُرُوۡا فَاِنَّ اللّٰہَ غَنِیٌّ عَنۡکُمۡ ۟ وَ لَا یَرۡضٰی لِعِبَادِہِ الۡکُفۡرَ ۚ وَ اِنۡ تَشۡکُرُوۡا یَرۡضَہُ لَکُمۡ ؕ وَ لَا تَزِرُ وَازِرَۃٌ وِّزۡرَ اُخۡرٰی ؕ ثُمَّ اِلٰی رَبِّکُمۡ مَّرۡجِعُکُمۡ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ؕ اِنَّہٗ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۸﴾", "english": " If you are ungrateful, surely Allah is Self-Sufficient being independent of you. And He is not pleased with ingratitude in His servants. But if you show gratefulness, He likes it in you. And no bearer of burden shall bear the burden of another. Then to your Lord is your return; And He will inform you of what you have been doing. Surely, He knows full well all that is hidden in the breasts.", "french": " Si vous êtes ingrats, assurément Allāh Se suffit à Lui-Même et est indépendant de vous. Et Il n’approuve pas l’ingratitude de la part de Ses serviteurs. Mais si vous êtes reconnaissants, cela Lui plaît en vous. Et aucune âme porteuse de fardeau ne portera le fardeau d’une autre. Ensuite vers votre Seigneur sera votre retour ; et Il vous informera de ce que vous faisiez. Assurément, Il sait très bien tout ce qui est caché dans les poitrines.", "german": " Wenn ihr ungläubig seid, so ist Allah euer nicht bedürftig. Doch Ihm gefällt Unglauben an Seinen Dienern nicht. Seid ihr aber dankbar, so gefällt Ihm das an euch. Und keine Lasttragende kann die Last einer anderen tragen. Danach ist zu eurem Herrn eure Heimkehr; und Er wird euch verkünden, was ihr zu tun pflegtet. Fürwahr, Er weiß wohl, was in den Herzen ist.", "spanish": " Si sois desagradecidos, en ver­dad Al‑lah es Autosuficiente, por ser independiente de vosotros. Mas Él no aprueba la ngratitud en Sus siervos. Pero si mostráis gratitud, le agrada verla en vosotros. Ningún portador de carga llevará la carga de otro. Después volveréis a vuestro Señor; Él os informará lo que habéis estado haciendo. En verdad, Él co­noce muy bien lo que hay oculto en los pechos.", "urdu": " اگر تم کفر کرو تو اللہ تمہارا محتاج نہیں‘ اور وہ اپنے بندوں کے لئے کفر کو کبھی پسند نہیں کرتا‘ اور اگر شکر کرو تو وہ اس کو تمہارے لئے پسند کرتا ہے اور کوئی بوجھ اٹھانے والی ہستی دوسرے کے بوجھ کو نہیں اٹھا سکتی اور تم سب کو اپنے رب کی طرف ہی لوٹ کر جانا ہوگا۔ تب وہ تمہیں تمہارے اعمال سے خبردار کرے گا وہ سینوں کے اندر کی چھپی ہوئی باتوں کو جاننے والا ہے۔"}, {"arabic": " وَ اِذَا مَسَّ الۡاِنۡسَانَ ضُرٌّ دَعَا رَبَّہٗ مُنِیۡبًا اِلَیۡہِ ثُمَّ اِذَا خَوَّلَہٗ نِعۡمَۃً مِّنۡہُ نَسِیَ مَا کَانَ یَدۡعُوۡۤا اِلَیۡہِ مِنۡ قَبۡلُ وَ جَعَلَ لِلّٰہِ اَنۡدَادًا لِّیُضِلَّ عَنۡ سَبِیۡلِہٖ ؕ قُلۡ تَمَتَّعۡ بِکُفۡرِکَ قَلِیۡلًا ٭ۖ اِنَّکَ مِنۡ اَصۡحٰبِ النَّارِ ﴿۹﴾", "english": " And when an affliction befalls a man, he calls upon his Lord, turning penitently to Him. Then, when He confers upon him a favour from Himself, he forgets what he used to pray for before, and begins to assign rivals to Allah, that he may lead men astray from His way. Say, ‘Benefit thyself with thy disbelief a little while; thou art surely of the inmates of the Fire.’", "french": " Et lorsqu’une affliction touche un homme, il invoque son Seigneur, en se tournant vers Lui contrit . Ensuite, quand Allāh lui accorde une faveur de Sa part, il oublie ce qu’il implorait auparavant, et il se met à attribuer des rivaux à Allāh, afin d’égarer les gens de Sa voie. Dis : « Jouis de ta mécréance pour quelque temps ; tu es assurément du nombre des habitants du Feu. »", "german": " Wenn den Menschen ein Unglück trifft, so fleht er zu seinem Herrn, sich zu Ihm wendend. Dann aber, wenn Er ihm eine Gnade von Sich aus gewährt hat, vergisst er, um was er zuvor zu Ihm zu bitten pflegte, und setzt Allah Götter zur Seite, dass er (die Menschen) von Seinem Wege ab in die Irre führe. Sprich: \"Vergnüge dich mit deinem Unglauben für eine kleine Weile; denn du gehörst zu den Bewohnern des Feuers.\"", "spanish": " Mas cuando la aflicción cae sobre el hombre, acude a su Señor, volviendo a Él, con penitencia. Des­pués, cuando Él le otorga Su favor, olvida lo que solía implorar antes y empieza a asignar rivales a Al‑lah, para apartar a los hombres de Su Camino. Dile: “Aprovéchate algún tiempo de tu incredulidad; en verdad eres de los habitantes del Fuego”.", "urdu": " اور جب کبھی انسان کو کوئی تکلیف پہنچتی ہے وہ اپنے رب کی طرف متوجہ ہوتے ہوئے اسے پکارتا ہے پھر جب وہ انسان کو اپنی طرف سے نعمت عطا کر دیتا ہے تو انسان اس غرض کو بھول جاتا ہے جس کے لئے وہ خدا کو پکارتا تھا اور خدا کے شریک مقرر کر دیتا ہے تا کہ اس کے راستہ سے (لوگوں کو) گمراہ کر دے۔ تو کہہ دے (اے انسان) کچھ دیر اپنے کفر کی وجہ سے فائدہ اٹھالے۔ آخر کار تو دوزخ میں پڑنے والا ہے۔"}, {"arabic": " اَمَّنۡ ہُوَ قَانِتٌ اٰنَآءَ الَّیۡلِ سَاجِدًا وَّ قَآئِمًا یَّحۡذَرُ الۡاٰخِرَۃَ وَ یَرۡجُوۡا رَحۡمَۃَ رَبِّہٖ ؕ قُلۡ ہَلۡ یَسۡتَوِی الَّذِیۡنَ یَعۡلَمُوۡنَ وَ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ ؕ اِنَّمَا یَتَذَکَّرُ اُولُوا الۡاَلۡبَابِ ٪﴿۱۰﴾", "english": " Is he who prays devoutly to God in the hours of the night, prostrating himself and standing, and fears the Hereafter and hopes for the mercy of his Lord, like him who does not do so ? Say, ‘Are those who know equal to those who know not?’ Verily, only those endowed with understanding will take heed.", "french": " Celui qui prie Allāh avec dévotion pendant les heures de la nuit, se prosternant et se tenant debout, et qui craint l’au-delà, et qui espère la miséricorde de son Seigneur, est-il pareil à celui qui ne fait pas tout cela ? Dis : « Ceux qui savent peuvent-ils être égaux à ceux qui ne savent pas ? » En vérité, seuls ceux qui sont doués d’intelligence prendront garde.", "german": " Ist etwa jener, der zu Gott betet in den Stunden der Nacht, kniefällig und stehend, der sich vor dem Jenseits fürchtet und auf die Barmherzigkeit seines Herrn hofft (einem Ungehorsamen gleich)? Sprich: \"Sind solche, die wissen, denen gleich, die nicht wissen?\" Allein nur die mit Verstand Begabten lassen sich warnen.", "spanish": " ¿Acaso quien ora con devo­ción a Dios en las horas de la noche, postrado y de pie, teme el Más Allá y espera la misericordia de u Señor, puede equipararse a quien no actúa así? Di : “¿Son acaso iguales quienes conocen y quienes no conocen?”. En verdad, sólo caerán en la cuenta los dotados de conocimiento.", "urdu": " کیا جو شخص رات کی گھڑیوں میں سجدہ اور قیام کی صورت میں فرمانبرداری کا نمونہ دکھاتا ہے اور آخرت سے ڈرتا ہے اور اپنے رب کی رحمت کی امید رکھتا ہے (وہ نافرمان کی طرح ہو سکتا ہے) تو کہہ دے کیا علم والے لوگ اور جاہل برابر ہو سکتے ہیں؟ نصیحت تو صرف عقل مند لوگ حاصل کیا کرتے ہیں۔"}, {"arabic": " قُلۡ یٰعِبَادِ الَّذِیۡنَ اٰمَنُوا اتَّقُوۡا رَبَّکُمۡ ؕ لِلَّذِیۡنَ اَحۡسَنُوۡا فِیۡ ہٰذِہِ الدُّنۡیَا حَسَنَۃٌ ؕ وَ اَرۡضُ اللّٰہِ وَاسِعَۃٌ ؕ اِنَّمَا یُوَفَّی الصّٰبِرُوۡنَ اَجۡرَہُمۡ بِغَیۡرِ حِسَابٍ ﴿۱۱﴾", "english": " Say, ‘O ye My servants who believe, fear your Lord. There is good for those who do good in this life. And Allah’s earth is spacious. Verily the steadfast will have their reward without measure.’", "french": " Dis : « Ô Mes serviteurs qui croyez, craignez votre Seigneur. Pour ceux qui font le bien dans cette vie-ci, il y a le bien. Et la terre d’Allāh est vaste. En vérité, les endurants auront leur récompense sans mesure. »", "german": " Sprich: \"O Meine Diener, die ihr gläubig seid, fürchtet euren Herrn. Für diejenigen, die in dieser Welt Gutes tun, ist Gutes. Und Allahs Erde ist weit. Wahrlich, den Standhaften wird ihr Lohn gewährt werden ohne zu rechnen.\"", "spanish": " Diles: “Oh vosotros, Mis sier­vos creyentes, temed a vuestro Señor. Hay una recompensa excelente para quienes practican el bien en esta vida. Y la tierra de Al‑lah es vasta. En verdad, los perseverantes ten­drán su recompensa sin medida”.", "urdu": " (اسی طرح) کہہ دے کہ اے میرے مومن بندو! اپنے رب کا تقویٰ اختیار کرو۔ وہ لوگ جو اس دنیا میں (الٰہی) احکام کو پوری طرح ادا کرتے ہیں ان کے لئے (اگلے جہان میں) نیک بدلہ مقرر ہے اور اللہ کی زمین بہت وسیع ہے۔ صابروں کو ان کا اجر بغیر حساب کے پورا پورا دیا جائے گا۔"}, {"arabic": " قُلۡ اِنِّیۡۤ اُمِرۡتُ اَنۡ اَعۡبُدَ اللّٰہَ مُخۡلِصًا لَّہُ الدِّیۡنَ ﴿ۙ۱۲﴾", "english": " Say, ‘Verily I am commanded to worship Allah, being sincere to Him in religion.", "french": " Dis : « En vérité, il m’est commandé d’adorer Allāh en étant sincère envers Lui dans ma foi.", "german": " Sprich: \"Mir ward geheißen, Allah zu dienen, in lauterem Gehorsam gegen Ihn.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=39:12&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=39:12&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic13\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic13\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/39:13' style='text-decoration:underline'>39:13</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(13)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control13\"></i></button> <audio id=\"player13\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اُمِرۡتُ لِاَنۡ اَکُوۡنَ اَوَّلَ الۡمُسۡلِمِیۡنَ ﴿۱۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And I am commanded to be the first of those who submit <em>to Him</em>.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And I am commanded to be the foremost of those who submit <i>to Him</i>.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور مجھے حکم دیا گیا ہے کہ میں سب فرمانبرداروں میں سے پہلا ہو جاؤں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور مجھے یہ حکم دیا گیا ہے کہ میں سب سے بڑا فرمانبردار بنوں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et il m’est commandé d’être le premier de ceux qui se soumettent <em>à Lui</em>. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y se me ha ordenado que sea el primero de los que se someten <em>a Él”.</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und mir ward geheißen, der erste der Gottergebenen zu sein.\"", "spanish": " Diles: “En verdad, se me ha ordenado que adore a Al‑lah, ofre­ciéndole una sincera devoción en la fe.", "urdu": " تو کہہ دے کہ مجھے حکم دیا گیا ہے کہ میں اللہ کی اس طرح عبادت کروں کہ اطاعت صرف اسی کے لئے مخصوص کردوں۔"}, {"arabic": " قُلۡ اِنِّیۡۤ اَخَافُ اِنۡ عَصَیۡتُ رَبِّیۡ عَذَابَ یَوۡمٍ عَظِیۡمٍ ﴿۱۴﴾", "english": " Say, ‘Indeed I fear, if I disobey my Lord, the punishment of the great day.’", "french": " Dis : « En vérité, je crains le châtiment d’un Jour Énorme si je désobéis à mon Seigneur. »", "german": " Sprich: \"Siehe, ich fürchte die Strafe eines schrecklichen Tages, wenn ich meinem Herrn ungehorsam wäre.\"", "spanish": " Diles: “En verdad temo, si desobedezco a mi Señor, el castigo del gran día”.", "urdu": " کہہ‘ اگر میں اپنے رب کی نافرمانی کروں‘ تو میں ایک بڑے دن کے عذاب سے ڈرتاہوں۔"}, {"arabic": " قُلِ اللّٰہَ اَعۡبُدُ مُخۡلِصًا لَّہٗ دِیۡنِیۡ ﴿ۙ۱۵﴾", "english": " Say, ‘It is Allah I worship, being sincere to Him in my religion.", "french": " Dis : « C’est Allāh que j’adore en étant sincère envers Lui dans ma religion.’", "german": " Sprich: \"Allah ist es, Dem ich diene, in meinem lauteren Gehorsam gegen Ihn.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=39:15&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=39:15&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic16\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic16\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/39:16' style='text-decoration:underline'>39:16</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(16)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control16\"></i></button> <audio id=\"player16\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَاعۡبُدُوۡا مَا شِئۡتُمۡ مِّنۡ دُوۡنِہٖ ؕ قُلۡ اِنَّ الۡخٰسِرِیۡنَ الَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ وَ اَہۡلِیۡہِمۡ یَوۡمَ الۡقِیٰمَۃِ ؕ اَلَا ذٰلِکَ ہُوَ الۡخُسۡرَانُ الۡمُبِیۡنُ ﴿۱۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘So worship what you like beside Him.’ Say, ‘Surely the losers will be those who ruin their souls and <em>ruin </em>their families on the Day of Resurrection.’ Beware! that will surely be the manifest loss.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘<i>As to you</i>, worship what you like beside Him.’ Say, ‘Surely, the <i>real </i>losers are they who ruin their souls and their families on the Day of Resurrection.’ Beware! that is, surely, the manifest loss. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس تم اُسے چھوڑ کر جس کی چاہو عبادت کرتے پھرو۔ تُو کہہ دے کہ یقیناً حقیقی گھاٹا پانے والے وہ ہیں جنہوں نے اپنی جانوں اور اپنے اہل و عیال کو قیامت کے دن گھاٹے میں ڈالا۔ خبردار یہی بہت کھلا کھلا گھاٹاہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(باقی رہے تم) سو تم اللہ کے سوا جس کی چاہو عبادت کرو (اور یہ بھی) کہہ دے کہ پوری طرح گھاٹے میں پڑنے والے لوگ وہی ہیں جنہوں نے اپنے آپ کو بھی اور اپنے رشتہ داروں کو بھی قیامت کے دن گھاٹے میں ڈال دیا۔ سنو! یہی کھلا کھلا گھاٹا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« Adorez donc ce que vous voudrez en dehors de Lui. » Dis : « Assurément, les perdants seront ceux qui causeront leur propre perte et <em>aussi celle de</em> leurs familles au Jour de la Résurrection. » Prenez garde ! Cela sera assurément la perte manifeste.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Adorad pues a lo que queráis fuera de El”. Diles: “En verdad los perdedores serán quienes arruinen a sus almas y a sus familias en el Día de la Resurrección”.¡Cuidado! ésa será ciertamente la pérdida manifiesta.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Verehret nur, was ihr wollt, statt Ihn.\" Sprich: \"Fürwahr, die Verlierenden werden jene sein, die sich selbst und die Ihren verlieren am Tage der Auferstehung.\" Hütet euch! das ist ein offenkundiger Verlust.", "spanish": " Diles: “A Al‑lah es a Quien adoro, siendo sincero ante Él en mi religión.", "urdu": " (اور پھر) کہہ دے کہ میں اللہ کی عبادت اپنی اطاعت کو صرف اس کے لئے وابستہ کرتے ہوئے کرتا ہوں۔"}, {"arabic": " لَہُمۡ مِّنۡ فَوۡقِہِمۡ ظُلَلٌ مِّنَ النَّارِ وَ مِنۡ تَحۡتِہِمۡ ظُلَلٌ ؕ ذٰلِکَ یُخَوِّفُ اللّٰہُ بِہٖ عِبَادَہٗ ؕ یٰعِبَادِ فَاتَّقُوۡنِ ﴿۱۷﴾", "english": " They will have over them coverings of fire, and beneath them similar coverings. It is this against which Allah warns His servants. ‘O My servants, take Me, then, for your Protector.’", "french": " Ils auront au-dessus d’eux des couches de feu, et en dessous d’eux des couches semblables . C’est contre cela qu’Allāh met en garde Ses serviteurs. « Ô Mes serviteurs, donc craignez-Moi Seul . »", "german": " Sie werden über sich Schichten von Feuer haben, und unter sich (ebensolche) Schichten. Das ist´s, wovor Allah Seine Diener warnt: \"O Meine Diener, nehmet drum Mich zu eurem Beschützer.\"", "spanish": " Tendrán sobre ellos capas de fuego, y debajo de ellos, otras similares. Contra esto es contra lo que Al‑lah advierte a Sus siervos: “Oh, siervos Míos, temedme sólo a Mí”.", "urdu": " اُن کے اُوپر بھی آگ کے سائے ہونگے اور نیچے بھی آگ کے سائے ہوں گے یہ وہ چیز ہے جس سے اللہ اپنے بندوں کو ڈراتا ہے۔ اے میرے بندو! میرا تقویٰ اختیار کرو۔"}, {"arabic": " وَ الَّذِیۡنَ اجۡتَنَبُوا الطَّاغُوۡتَ اَنۡ یَّعۡبُدُوۡہَا وَ اَنَابُوۡۤا اِلَی اللّٰہِ لَہُمُ الۡبُشۡرٰی ۚ فَبَشِّرۡ عِبَادِ ﴿ۙ۱۸﴾", "english": " And those who shun false gods lest they worship them and turn to Allah — for them is glad tidings. So give glad tidings to My servants,", "french": " Et ceux qui fuient les idoles de peur de les adorer et se tournent vers Allāh – pour eux il y a la bonne nouvelle. Annonce donc la bonne nouvelle à Mes serviteurs,", "german": " Und diejenigen, die Götter anzubeten scheuen und sich zu Allah wenden, für sie ist frohe Botschaft. Gib denn frohe Botschaft Meinen Dienern.", "spanish": " Mas quienes se apartan de los falsos dioses para no adorarles y vuelven a Al‑lah: Para ellos hay una buena nueva. Da pues la buena nueva a Mis siervos.", "urdu": " اور جو لوگ سرکش ہستیوں کی فرمانبرداری سے بچتے ہیں اور اللہ کی طرف جھکتے ہیں ان کے لئے بڑی خوشخبری ہے۔ پس تو میرے ان بندوں کو خوش خبری دے۔"}, {"arabic": " الَّذِیۡنَ یَسۡتَمِعُوۡنَ الۡقَوۡلَ فَیَتَّبِعُوۡنَ اَحۡسَنَہٗ ؕ اُولٰٓئِکَ الَّذِیۡنَ ہَدٰٮہُمُ اللّٰہُ وَ اُولٰٓئِکَ ہُمۡ اُولُوا الۡاَلۡبَابِ ﴿۱۹﴾", "english": " Who listen to the Word and follow the best thereof. It is they whom Allah has guided, and it is they who are men of understanding.", "french": " Qui écoutent la Parole et en suivent ce qu’Elle contient de meilleur. Ceux-là qu’Allāh a guidés, et ce sont eux qui sont doués d’intelligence.", "german": " Die auf das Wort hören und dem Besten von ihm folgen. Sie sind es, denen Allah den Weg gewiesen hat, und sie sind es, die mit Verstand begabt sind.", "spanish": " Que escuchan la Palabra y siguen lo mejor de ella. Ellos son los guiados por Al‑lah y ellos son los hombres del entendimiento.", "urdu": " جو ہماری بات کو سنتے ہیں اور پھر اس میں سے سب سے بہتر حکم کی اتباع کرتے ہیں وہی لوگ ہیں جنہیں اللہ نے ہدایت دی اور وہی لوگ عقل مند ہیں۔"}, {"arabic": " اَفَمَنۡ حَقَّ عَلَیۡہِ کَلِمَۃُ الۡعَذَابِ ؕ اَفَاَنۡتَ تُنۡقِذُ مَنۡ فِی النَّارِ ﴿ۚ۲۰﴾", "english": " Is he, then, against whom the sentence of punishment has become due fit to be rescued ? Canst thou rescue him who is in the Fire?", "french": " Celui contre lequel la condamnation du châtiment est venue à échéance est-il donc digne d’être sauvé ? Peux-tu sauver celui qui est dans le Feu ?", "german": " Ist denn der, gegen den das Strafurteil fällig geworden ist (in der Lage, gerettet zu werden)? Kannst du etwa den retten, der im Feuer ist?", "spanish": " ¿Podrá ser rescatado, pues, aquel contra quien se ha dictado la sentencia del castigo? ¿Puedes res­catar a quien está en el Fuego?", "urdu": " کیا وہ شخص جس پر عذاب کی پیشگوئی پوری ہوگئی (اُسے کوئی بچا سکتا ہے؟ اور) کیا تو آگ میں پڑنے والوں کو بچا سکتا ہے۔"}, {"arabic": " لٰکِنِ الَّذِیۡنَ اتَّقَوۡا رَبَّہُمۡ لَہُمۡ غُرَفٌ مِّنۡ فَوۡقِہَا غُرَفٌ مَّبۡنِیَّۃٌ ۙ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ۬ؕ وَعۡدَ اللّٰہِ ؕ لَا یُخۡلِفُ اللّٰہُ الۡمِیۡعَادَ ﴿۲۱﴾", "english": " But for them who fear their Lord there are lofty mansions built over lofty mansions, beneath which rivers flow. Allah has made that promise; and Allah breaks not His promise.", "french": " Mais pour ceux qui craignent leur Seigneur, il y a des demeures élevées sur lesquelles d’autres demeures élevées sont construites et sous lesquelles coulent des rivières. Allāh a fait cette promesse ; et Allāh ne manque pas à Sa promesse.", "german": " Für die jedoch, die ihren Herrn fürchten, sind Hochgemächer, über Hochgemächern erbaut, unter denen Ströme fließen. Eine Verheißung Allahs – Allah bricht das Versprechen nicht.", "spanish": " Pero para los que temen a su Señor hay mansiones elevadas y otras construidas aún más elevadas, por debajo de las cuales fluyen ríos. Al‑lah ha hecho esa promesa; y Al‑lah no rompe Su promesa.", "urdu": " لیکن وہ لوگ جو اپنے رب کا تقویٰ اختیار کرتے ہیں ان کو کئی منزل والے مکان عطا ہونگے جن کے اوپر اور منزلیں مضبوطی کے ساتھ بنی ہوں گی۔ ان کے نیچے نہریں بہتی ہونگی یہ اللہ کا ایک پختہ عہد ہے (اور) اللہ اپنے وعدوں کو توڑا نہیں کرتا۔"}, {"arabic": " اَلَمۡ تَرَ اَنَّ اللّٰہَ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَسَلَکَہٗ یَنَابِیۡعَ فِی الۡاَرۡضِ ثُمَّ یُخۡرِجُ بِہٖ زَرۡعًا مُّخۡتَلِفًا اَلۡوَانُہٗ ثُمَّ یَہِیۡجُ فَتَرٰٮہُ مُصۡفَرًّا ثُمَّ یَجۡعَلُہٗ حُطَامًا ؕ اِنَّ فِیۡ ذٰلِکَ لَذِکۡرٰی لِاُولِی الۡاَلۡبَابِ ﴿٪۲۲﴾", "english": " Hast thou not seen that Allah sends down water from the sky, and causes it to flow in the form of streamlets in the earth and then brings forth thereby herbage, varying in its colours? Then it dries up and thou seest it turn yellow; then He reduces it to broken straw. In that verily is a reminder for men of understanding.", "french": " N’as-tu pas vu qu’Allāh fait descendre de l’eau du ciel, et la fait couler comme des sources sur la terre, et ensuite produit par là des pâturages variant dans leurs couleurs ? Ensuite, ils se dessèchent et tu les vois jaunir ; puis Il les réduit en paille brisée. En vérité, il se trouve en cela un rappel pour ceux doués d’intelligence.", "german": " Hast du nicht gesehen, dass Allah Wasser niedersendet vom Himmel und es als Quellen in die Erde dringen lässt und dadurch Gewächs hervorbringt, mannigfach an Farben? Dann wird es reif, und du siehst es gelb werden; dann lässt Er es in Stücke zerbrechen. Hierin ist wahrlich eine Mahnung für Leute von Einsicht.", "spanish": " ¿No has visto que Al‑lah envía el agua del cielo, y hace que fluya en forma de pequeños arroyuelos en la tierra, produciendo en­tonces con ella vegetación de di­versos colores? Después se seca y la ves ponerse amarilla; más tarde se convierte en desperdicio. Aquí hay en verdad un recordatorio para los hombres que entienden.", "urdu": " کیا تم نے نہیں دیکھا کہ اللہ نے آسمان سے پانی اتارا ہے۔ پھر اس کو زمین میں سے چشمے بنا کر چلایا ہے۔ پھر وہ اس کے ذریعہ سے مختلف رنگوں کی کھیتی اگاتا ہے۔ پھر وہ پکنے پر آجاتی ہے تو تو اسے زرد زرد دیکھتا ہے۔ پھر اللہ اس کو خس و خاشاک کی طرح کر دیتا ہے اس میں عقل مندوں کے لئے بڑی نصیحت ہے۔"}, {"arabic": " اَفَمَنۡ شَرَحَ اللّٰہُ صَدۡرَہٗ لِلۡاِسۡلَامِ فَہُوَ عَلٰی نُوۡرٍ مِّنۡ رَّبِّہٖ ؕ فَوَیۡلٌ لِّلۡقٰسِیَۃِ قُلُوۡبُہُمۡ مِّنۡ ذِکۡرِ اللّٰہِ ؕ اُولٰٓئِکَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۲۳﴾", "english": " Is he then whose bosom Allah has opened for the acceptance of Islam, so that he possesses a light from his Lord, like him who is groping in the darkness of disbelief ? Woe, then, to those whose hearts are hardened against the remembrance of Allah! They are in manifest error.", "french": " Celui donc, dont Allāh a préparé le cœur pour l’acceptation de l’Islam de sorte qu’il est établi sur une lumière de la part de son Seigneur, est-il pareil à celui qui est perdu dans l’obscurité de la mécréance ? Malheur donc à ceux dont le cœur est endurci contre le souvenir d’Allāh ! Ceux-là sont dans une erreur manifeste.", "german": " Ist denn der, dem Allah das Herz geweitet hat für den Islam, so dass er ein Licht von seinem Herrn empfängt (einem Ungläubigen gleich)? Wehe drum denen, deren Herzen verhärtet sind gegen den Gedanken an Allah! Sie sind es, die in offenkundigem Irrtum sind.", "spanish": " ¿Acaso es aquel cuyo seno ha abierto Al‑lah para la aceptación del Islam, a fin de que sea guiado por una luz procedente de su Señor, como quien anda a tientas en las tinieblas de la incredulidad? ¡Ay, pues, de aquellos cuyos corazones están endurecidos contra el recuerdo de Al‑lah! Están en un error evidente.", "urdu": " کیا جس کا سینہ اللہ فرمانبرداری کے لئے کھول دے اور اس کو اپنے رب کی طرف سے نور بھی ملا ہو (وہ اس کے برابر ہو سکتا ہے جو ایسا نہیں) پس افسوس ان پر جن کے دل اللہ کے ذکر سے سختی محسوس کرتے ہیں۔ وہ بڑی کھلی گمراہی میں ہیں۔"}, {"arabic": " اَللّٰہُ نَزَّلَ اَحۡسَنَ الۡحَدِیۡثِ کِتٰبًا مُّتَشَابِہًا مَّثَانِیَ ٭ۖ تَقۡشَعِرُّ مِنۡہُ جُلُوۡدُ الَّذِیۡنَ یَخۡشَوۡنَ رَبَّہُمۡ ۚ ثُمَّ تَلِیۡنُ جُلُوۡدُہُمۡ وَ قُلُوۡبُہُمۡ اِلٰی ذِکۡرِ اللّٰہِ ؕ ذٰلِکَ ہُدَی اللّٰہِ یَہۡدِیۡ بِہٖ مَنۡ یَّشَآءُ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَمَا لَہٗ مِنۡ ہَادٍ ﴿۲۴﴾", "english": " Allah has sent down the best Message in the form of a Book, whose verses are mutually supporting and repeated in diverse forms at which do creep the skins of those who fear their Lord; then their skins and their hearts soften to the remembrance of Allah. Such is the guidance of Allah; He guides therewith whom He pleases. And he whom Allah adjudges astray — he shall have no guide.", "french": " Allāh a révélé le meilleur Message sous la forme d’ un Livre, dont les versets se supportent mutuellement, et sont répétés sous diverses formes. La récitation de ce Livre fait frissonner ceux qui craignent leur Seigneur ; ensuite leur peau et leur cœur s’adoucissent au souvenir d’Allāh. Telle est la direction d’Allāh ; c’est par cela qu’Il guide qui Il veut. Et celui qu’Allāh juge égaré – il n’aura aucun guide.", "german": " Allah hat die schönste Botschaft, ein Buch, hinabgesandt, ein im Einklang (mit anderen Schriften) stehendes, oft wiederholtes, vor dem denen, die ihren Herrn fürchten, die Haut erschauert, dann erweicht sich ihre Haut und ihr Herz zum Gedenken, Allahs. Das ist die Führung Allahs; Er leitet damit, wen Er will. Und wen Allah zum Irrenden erklärt, der soll keinen Führer haben.", "spanish": " Al‑lah ha revelado el mejor Mensaje en forma de un libro, cuyos versículos se apoyan mutuamente, y se repiten en diversas formas. Ante él se estremece la piel de quienes temen a su Señor. Después su piel y sus corazones se ablandan ante el recuerdo de Al‑lah; Así es la guía de Al‑lah; con ella encamina a quien Le agrada. Mas a quien Al‑lah sentencia como extraviado... no tendrá guía alguna .", "urdu": " اللہ وہ ہے جس نے بہتر سے بہتر بات یعنی وہ کتاب اتاری ہے‘ جو متشابہ بھی ہے۔ اور اس کے مضمون نہایت اعلیٰ ہیں۔ جو لوگ اپنے رب سے ڈرتے ہیں ان کے جسموں کے رونگٹے اس کے پڑھنے سے کھڑے ہو جاتے ہیں۔ پھر ان کے چمڑے اور دل نرم ہو کر اللہ کے ذکر کی طرف جھک جاتے ہیں۔ یہ (قرآن) اللہ کی ہدایت ہے (یعنی قرآن جس ہدایت کا مالک ہے وہ اللہ کی ہدایت ہے) جس کے ذریعہ سے وہ جس کو چاہتا ہے ہدایت دیتا ہے اور جس کو اللہ گمراہ قرار دے دے اس کو کوئی ہدایت نہیں دے سکتا۔"}, {"arabic": " اَفَمَنۡ یَّتَّقِیۡ بِوَجۡہِہٖ سُوۡٓءَ الۡعَذَابِ یَوۡمَ الۡقِیٰمَۃِ ؕ وَ قِیۡلَ لِلظّٰلِمِیۡنَ ذُوۡقُوۡا مَا کُنۡتُمۡ تَکۡسِبُوۡنَ ﴿۲۵﴾", "english": " Is he, then, who has nothing but his own face to protect him with from the evil punishment on the Day of Resurrection like him who is secure ? And it will be said to the wrongdoers, ‘Taste ye what you used to earn.’", "french": " Celui qui n’a que son visage pour se protéger contre le pire châtiment du Jour de la Résurrection, est-il donc pareil à celui qui est en sécurité ? Il sera dit aux injustes : « Goûtez ce que vous aviez l'habitude d'acquérir. »", "german": " Ist denn der, der mit seinem Angesicht Schutz sucht vor der schrecklichen Strafe am Tage der Auferstehung (dem gleich, der sicher ist)? Zu den Frevlern wird gesprochen werden: \"Kostet nun, was ihr verdientet.\"", "spanish": " ¿Acaso aquel que, no tiene más que su propia fe para pro­tegerlo el severo castigo del Día de la Resurrección es como el que se siente seguro? Mas se dirá a los inicuos: “probad lo que solíais ganar”.", "urdu": " کیا وہ شخص جو اپنے منہ کو قیامت کے دن سخت عذاب (یعنی دوزخ) سے بچنے کے لئے ڈھال بناتا ہے (وہ جنت میں جانے والے کے برابر ہو سکتا ہے) اور ظالموں سے کہا جائے گا کہ اپنے عملوں کا نتیجہ چکھو۔"}, {"arabic": " کَذَّبَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ فَاَتٰٮہُمُ الۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُوۡنَ ﴿۲۶﴾", "english": " Those who were before them rejected Our Messengers , so the punishment came upon them whence they knew not.", "french": " Ceux qui les ont devancés rejetèrent Nos Messagers ; alors le châtiment est tombé sur eux d’où ils ne pourraient imaginer.", "german": " Es leugneten jene, die vor ihnen waren; da kam die Strafe über sie, von wannen sie es nicht ahnten.", "spanish": " Quienes existieron antes que ellos rechazaron a Nuestros Mensa­jeros, por lo que el castigo les sobre­vino de donde no esperaban.", "urdu": " اُن سے پہلے لوگ بھی جھٹلا چکے ہیں (پھر اس کے نتیجہ میں) اُن کے اوپر عذاب ایسی ایسی طرفوں سے آیا جن کو وہ سمجھتے نہیں تھے۔"}, {"arabic": " فَاَذَاقَہُمُ اللّٰہُ الۡخِزۡیَ فِی الۡحَیٰوۃِ الدُّنۡیَا ۚ وَ لَعَذَابُ الۡاٰخِرَۃِ اَکۡبَرُ ۘ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۲۷﴾", "english": " So Allah made them taste humiliation in the present life and the punishment of the Hereafter will certainly be greater, if they but knew!", "french": " Allāh leur a donc fait goûter l’ignominie dans la vie de ce monde ; mais le châtiment de l’au-delà sera certainement plus grand, si seulement ils savaient !", "german": " Und Allah ließ sie Schande kosten im irdischen Leben; doch die Strafe im Jenseits wird gewiss größer sein, wenn sie es nur wüssten!", "spanish": " Al‑lah les ha hecho, pues, probar la humillación en la presente vida y el castigo del Más Allá será ciertamente mayor; ¡ojalá lo su­pieran!", "urdu": " اور اللہ نے ان کو دنیوی زندگی کی ذلت بھی دی اور آخرت میں جو عذاب آئے گا اگر وہ سمجھیں تو وہ اس سے بھی بڑا ہوگا۔"}, {"arabic": " وَ لَقَدۡ ضَرَبۡنَا لِلنَّاسِ فِیۡ ہٰذَا الۡقُرۡاٰنِ مِنۡ کُلِّ مَثَلٍ لَّعَلَّہُمۡ یَتَذَکَّرُوۡنَ ﴿ۚ۲۸﴾", "english": " And, indeed, We have set forth to men all kinds of parables in this Qur’an that they may take heed.", "french": " Et, en vérité, dans ce Coran, Nous avons proposé toutes sortes de paraboles aux hommes afin qu’ils prennent garde.", "german": " Wir haben den Menschen in diesem Qur-ân allerlei Gleichnisse aufgestellt, damit sie ermahnt sein möchten.", "spanish": " En verdad en este Corán hemos presentado a los hombres toda clase de parábolas, para que caigan en la cuenta.", "urdu": " اور ہم نے اس قرآن میں ہر قسم کی باتیں بیان کر دی ہیں‘ تاکہ وہ (یعنی کفار) نصیحت حاصل کریں۔"}, {"arabic": " قُرۡاٰنًا عَرَبِیًّا غَیۡرَ ذِیۡ عِوَجٍ لَّعَلَّہُمۡ یَتَّقُوۡنَ ﴿۲۹﴾", "english": " We have revealed the Qur’an in Arabic wherein there is no deviation from rectitude, that they may become righteous.", "french": " Un Coran un Livre souvent récité , en arabe une langue claire et éloquente et , où il n’existe rien de tordu afin qu’ils deviennent pieux.", "german": " Den Qur-ân auf arabisch, ohne irgendwelche Krümme, auf dass sie rechtschaffen würden.", "spanish": " Hemos revelado el Corán manifiestamente claro y sin torci­miento alguno, para que puedan llegar a ser justos.", "urdu": " ہم نے اس کو قرآن بنایا ہے جو اپنا مطلب کھول کر بیان کرنے والا ہے اس میں کوئی کجی نہیں (یہ اس لئے اترا ہے) تا لوگ تقویٰ اختیار کریں۔"}, {"arabic": " ضَرَبَ اللّٰہُ مَثَلًا رَّجُلًا فِیۡہِ شُرَکَآءُ مُتَشٰکِسُوۡنَ وَ رَجُلًا سَلَمًا لِّرَجُلٍ ؕ ہَلۡ یَسۡتَوِیٰنِ مَثَلًا ؕ اَلۡحَمۡدُ لِلّٰہِ ۚ بَلۡ اَکۡثَرُہُمۡ لَا یَعۡلَمُوۡنَ ﴿۳۰﴾", "english": " Allah sets forth a parable: a man belonging to several partners, disagreeing with one another, and a man belonging wholly to one man. Are they both equal in condition? All praise belongs to Allah. But most of them know not.", "french": " Allāh propose une parabole – un homme appartenant à plusieurs associés en désaccord entre eux, et un homme appartenant exclusivement à un seul homme. Les deux sont-ils égaux en exemple ? Toutes les louanges appartiennent à Allāh. Mais la plupart d’entre eux ne savent pas.", "german": " Allah setzt ein Gleichnis: Ein Mann, der mehreren Herren gehört, die unter sich im Zwiespalt sind, und ein Mann, der einem einzigen Herrn gehört. Sind sie beide einander gleich? Aller Preis gebührt Allah. Jedoch die meisten von ihnen wissen es nicht.", "spanish": " Al‑lah presenta una parábola: un hombre perteneciente a varios socios, que están mutuamente en desacuerdo, y otro hombre que per­tenece exclusivamente a un solo hombre. ¿Es igual el ejemplo de ambos? Toda alabanza perte­nece a Al‑lah. Pero la mayoría de ellos lo desconocen.", "urdu": " اللہ اس شخص کی حالت کو (عبرت کے لئے) بیان کرتا ہے جس کے کئی مالک ہیں جو آپس میں اختلاف بھی رکھتے ہیں اور ایک شخص پورا کا پورا ایک آدمی کی ملکیت ہے۔ کیا یہ دونوں شخص اپنے حال میں برابر ہو سکتے ہیں؟ سب تعریف اللہ ہی کی ہے لیکن ان میں سے اکثر جانتے نہیں۔"}, {"arabic": " اِنَّکَ مَیِّتٌ وَّ اِنَّہُمۡ مَّیِّتُوۡنَ ﴿۫۳۱﴾", "english": " Surely thou wilt die, and surely they too will die.", "french": " Assurément, tu mourras, et assurément eux aussi , mourront.", "german": " Wahrlich, du wirst sterben und auch sie werden sterben.", "spanish": " Ciertamente morirás, y cier­tamente ellos morirán también.", "urdu": " تو بھی ایک دن مرنے والا ہے اور وہ بھی مرنے والے ہیں۔"}, {"arabic": " ثُمَّ اِنَّکُمۡ یَوۡمَ الۡقِیٰمَۃِ عِنۡدَ رَبِّکُمۡ تَخۡتَصِمُوۡنَ ﴿٪۳۲﴾", "english": " Then surely on the Day of Resurrection you will dispute with one another before your Lord.", "french": " Puis, assurément, au Jour de la Résurrection vous vous disputerez entre vous devant votre Seigneur.", "german": " Am Tage der Auferstehung dann werdet ihr miteinander rechten vor eurem Herrn.", "spanish": " Y después, en el Día de la Resurrección, disputaréis mutuamen­te ante vuestro Señor.", "urdu": " پھر تم سب کے سب قیامت کے دن اپنے رب کے سامنے اپنے اپنے عقائد اور اعمال کو پیش کرو گے۔"}, {"arabic": " فَمَنۡ اَظۡلَمُ مِمَّنۡ کَذَبَ عَلَی اللّٰہِ وَ کَذَّبَ بِالصِّدۡقِ اِذۡ جَآءَہٗ ؕ اَلَیۡسَ فِیۡ جَہَنَّمَ مَثۡوًی لِّلۡکٰفِرِیۡنَ ﴿۳۳﴾", "english": " Who, then, is more unjust than he who lies against Allah or he who rejects the truth when it comes to him? Is there not in Hell an abode for the disbelievers?", "french": " Qui donc commet une plus grande injustice que celui qui ment contre Allāh, et qui rejette la vérité lorsqu’elle vient à lui ? N’y a-t-il pas en Enfer une demeure pour les mécréants ?", "german": " Wer begeht also größeres Unrecht als einer, der Lügen wider Allah vorbringt, oder einer, der die Wahrheit verwirft, wenn sie zu ihm kommt? Ist nicht in der Hölle eine Wohnstatt für die Ungläubigen?", "spanish": " ¿Quién es, pues, más injusto que quien miente contra Al‑lah y rechaza la verdad cuando le llega? ¿No hay acaso en el Infierno una morada para los incrédulos?", "urdu": " اور اس سے زیادہ ظالم کون ہو سکتا ہے جو اللہ پر جھوٹ باندھے اور (خدا کی طرف سے آنے والے) سچ کو جب وہ اس کے پاس آئے جھٹلائے۔ کیا کافروں کا ٹھکانا جہنم نہیں ہے؟"}, {"arabic": " وَ الَّذِیۡ جَآءَ بِالصِّدۡقِ وَ صَدَّقَ بِہٖۤ اُولٰٓئِکَ ہُمُ الۡمُتَّقُوۡنَ ﴿۳۴﴾", "english": " But he who has brought the truth, and he who testifies to it as such — these it is who are the righteous.", "french": " Mais celui qui a apporté la vérité, et celui qui l’atteste comme telle – ceux-là sont les pieux.", "german": " Und der, der die Wahrheit bringt, und (der, welcher) sie bestätigt – das sind die Gerechten.", "spanish": " Mas quien ha traído la verdad, y quien da testimonio de ella como tal: ésos son los justos.", "urdu": " اور (ہر) وہ شخص جو خدا کی طرف سے سچی تعلیم لائے اور (ہر) وہ شخص جو ایسی تعلیم کی تصدیق کرے ایسے لوگ ہی متقی ہوتے ہیں۔"}, {"arabic": " لَہُمۡ مَّا یَشَآءُوۡنَ عِنۡدَ رَبِّہِمۡ ؕ ذٰلِکَ جَزٰٓوٴُا الۡمُحۡسِنِیۡنَ ﴿ۚۖ۳۵﴾", "english": " They will have with their Lord whatever they desire; that is the reward of those who do good.", "french": " Ils auront auprès de leur Seigneur tout ce qu’ils désireront ; voilà la récompense de ceux qui font le bien ;", "german": " Sie werden alles, was sie wünschen, bei ihrem Herrn haben. Das ist der Lohn derer, die Gutes tun:", "spanish": " Tendrán con su Señor cuanto deseen; ésa es la recompensa de los que practican el bien.", "urdu": " وہ جو کچھ چاہیں گے ان کو اپنے رب کے ہاں مل جائے گا۔ محسنوں کا بدلہ ایسا ہی ہوتا ہے۔"}, {"arabic": " لِیُکَفِّرَ اللّٰہُ عَنۡہُمۡ اَسۡوَاَ الَّذِیۡ عَمِلُوۡا وَ یَجۡزِیَہُمۡ اَجۡرَہُمۡ بِاَحۡسَنِ الَّذِیۡ کَانُوۡا یَعۡمَلُوۡنَ ﴿۳۶﴾", "english": " So that Allah will remove from them the evil consequences of what they did, and will give them their reward according to the best of their actions.", "french": " De sorte qu’Allāh leur enlèvera les mauvaises conséquences de leurs pires actions, et leur donnera leur récompense selon la meilleure de leurs œuvres.", "german": " Dass Allah von ihnen das Schlimmste hinwegnehmen wird von dem, was sie getan, und ihnen ihren Lohn geben wird gemäß dem Besten, das sie zu tun pflegten.", "spanish": " Por lo que Al‑lah retirará de ellos las consecuencias nefastas de lo que hicieron, y les concederá su recompensa de acuerdo con lo mejor de lo que hicieron.", "urdu": " تا کہ اللہ ان کے اعمال کے بدپہلوٶں کو ڈھانک دے اور اُن کا بدلہ اُن کے اعمال میں سے جو سب سے اچھے اعمال ہوں ان کے مطابق دے دے۔"}, {"arabic": " اَلَیۡسَ اللّٰہُ بِکَافٍ عَبۡدَہٗ ؕ وَ یُخَوِّفُوۡنَکَ بِالَّذِیۡنَ مِنۡ دُوۡنِہٖ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَمَا لَہٗ مِنۡ ہَادٍ ﴿ۚ۳۷﴾", "english": " Is not Allah sufficient for His servant? And yet they would frighten thee with those beside Him. And he whom Allah adjudges astray — for him there is no guide.", "french": " Allāh ne suffit-Il pas à Son serviteur ? Néanmoins ils voudraient t’effrayer avec ceux qui sont en dehors de Lui. Et celui qu’Allāh déclare égaré – pour lui il n’y a aucun guide.", "german": " Genügt Allah nicht für Seinen Diener? Und doch möchten sie dich in Furcht setzen mit jenen neben Ihm. Und für einen, den Allah zum Irrenden erklärt, gibt es keinen Führer.", "spanish": " ¿No es Al‑lah suficiente para Sus siervos? Sin embargo ellos inten­tarán atemorizarte con lo que colocan en Su lugar. Mas a quien Al‑lah sentencia como perdido: para él no habrá guía.", "urdu": " کیا اللہ اپنے بندہ کے لئے کافی نہیں؟ اور وہ لوگ تجھے ان سے ڈراتے ہیں جو اس (خدا) کے علاوہ ہیں اور جس کو اللہ گمراہ سمجھے اس کو ہدایت دینے والا کوئی نہیں۔"}, {"arabic": " وَ مَنۡ یَّہۡدِ اللّٰہُ فَمَا لَہٗ مِنۡ مُّضِلٍّ ؕ اَلَیۡسَ اللّٰہُ بِعَزِیۡزٍ ذِی انۡتِقَامٍ ﴿۳۸﴾", "english": " And he whom Allah guides — there is none to lead him astray. Is not Allah the Mighty, the Lord of retribution?", "french": " Et celui qu’Allāh guide – il ne peut y avoir personne pour l’égarer. Allāh n’est-Il pas Puissant et Maître de la Rétribution ?", "german": " Und für einen, den Allah richtig führt, gibt es keinen, der ihn irreführte. Ist Allah nicht allmächtig, der Herr der Vergeltung?", "spanish": " Y a quien Al‑lah guía, no hay nadie que pueda extraviarlo. ¿Acaso no es Al‑lah el Poderoso, el Señor de la retribución?", "urdu": " اور جس کو اللہ ہدایت دے اس کو کوئی گمراہ نہیں کر سکتا۔ کیا اللہ غالب (اور) بدلہ لینے پر قادر نہیں ہے؟"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ مَّنۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ لَیَقُوۡلُنَّ اللّٰہُ ؕ قُلۡ اَفَرَءَیۡتُمۡ مَّا تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ اِنۡ اَرَادَنِیَ اللّٰہُ بِضُرٍّ ہَلۡ ہُنَّ کٰشِفٰتُ ضُرِّہٖۤ اَوۡ اَرَادَنِیۡ بِرَحۡمَۃٍ ہَلۡ ہُنَّ مُمۡسِکٰتُ رَحۡمَتِہٖ ؕ قُلۡ حَسۡبِیَ اللّٰہُ ؕ عَلَیۡہِ یَتَوَکَّلُ الۡمُتَوَکِّلُوۡنَ ﴿۳۹﴾", "english": " And if thou ask them, ‘Who created the heavens and the earth?’, they will surely say, ‘Allah.’ Say, ‘What think ye, if Allah intends to do me an injury, will those whom you call upon beside Allah be able to remove the injury inflicted by Him? Or if He wills to show me mercy, could they withhold His mercy?’ Say, ‘Allah is sufficient for me. In Him trust those who would trust.’", "french": " Et si tu leur demandes : « Qui a créé les cieux et la terre ? » ils diront assurément : « Allāh ». Dis : « Savez-vous donc ce que vous invoquez en dehors d’Allāh ? Si Allāh me veut quelque mal, ceux que vous invoquez en dehors d’Allāh peuvent-ils m’ enlever ce mal infligé par Lui ? Où s’Il veut me montrer quelque miséricorde, pourront-ils retenir Sa miséricorde ? » Dis : « Allāh me suffit. En Lui placent leur confiance ceux qui veulent faire confiance. »", "german": " Und wenn du sie fragst: \"Wer schuf die Himmel und die Erde?\", so werden sie sicherlich antworten: \"Allah\". Sprich: \"Wisst ihr dann, was ihr außer Allah anruft? Wenn Allah für mich Unglück will, können sie dessen Schaden entfernen? Oder wenn Er Barmherzigkeit für mich will, können sie Seine Barmherzigkeit hemmen?\" Sprich: \"Allah ist meine Genüge. Auf Ihn vertrauen die Vertrauenden.\"", "spanish": " Y si les preguntas: “¿Quién creó los cielos y la tierra?” dirán ciertamente: “Al‑lah”. Diles: “¿Pensáis vosotros que si Al‑lah qui­siera hacerme algún daño, aquellos a quienes invocáis fuera de Al‑lah po­drán evitar el daño infligido por Él? O, si Él deseara mostrarme Su mise­ricordia, ¿podrían ellos privarme de Su misericordia?”. Diles: “Al‑lah me basta. En Él confían quienes están dispuestos a confiar”.", "urdu": " اور اگر تو ان سے پوچھے کہ آسمانوں اور زمین کو کس نے پیدا کیا ہے؟ تو وہ ضرور کہیں گے کہ اللہ نے۔ تو کہہ دے کیا تم کو معلوم ہے کہ تم اللہ کے سوا کس کو پکارتے ہو؟ اگر اللہ مجھے نقصان پہنچانا چاہے تو کیا وہ (جھوٹے معبود) اس کے نقصان کو دور کر سکتے ہیں؟ یا اگر اللہ مجھے رحمت پہنچانا چاہے تو کیا وہ (معبود) اس کی رحمت کو روک سکتے ہیں؟ تو کہہ دے مجھے اللہ کافی ہے۔ سب (سچے) متوکل اسی پر توکل کرتے ہیں۔"}, {"arabic": " قُلۡ یٰقَوۡمِ اعۡمَلُوۡا عَلٰی مَکَانَتِکُمۡ اِنِّیۡ عَامِلٌ ۚ فَسَوۡفَ تَعۡلَمُوۡنَ ﴿ۙ۴۰﴾", "english": " Say, ‘O my people, act as best you can; I too am acting; soon shall you know,", "french": " Dis : « Ô mon peuple agissez au mieux de votre capacité ; moi aussi j’agis ; mais bientôt vous saurez", "german": "", "spanish": " Diles: “Oh, pueblo Mío, ac­tuad del mejor modo posible; Yo también actúo. Pronto sabréis,", "urdu": " تو کہہ دے‘ اے میری قوم! تم اپنی اپنی جگہوں پر عمل کرو‘ میں بھی (اپنی جگہ پر) عمل کروں گا۔ پس تم ضرور جان لو گے۔"}], "Surah": 39}