{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَلۡہٰکُمُ التَّکَاثُرُ ۙ﴿۲﴾", "english": " Mutual rivalry in seeking worldly increase diverts you from God", "french": " Les rivalités mutuelles dans la recherche de l’augmentation des biens vous ont rendus oublieux,", "german": " Der Wettstreit um die Mehrung lenkt euch ab,", "spanish": " La mutua competición por amasar riqueza os ha distraído,", "urdu": " تم کو ایک دوسرے سے بڑھنے کی خواہش نے غفلت میں ڈال دیا (اور تم اسی طرح غافل رہو گے)"}, {"arabic": " حَتّٰی زُرۡتُمُ الۡمَقَابِرَ ؕ﴿۳﴾", "english": " Till you reach the graves.", "french": " Même que vous soyez arrivés au cimetière.", "german": " bis ihr die Gräber erreicht.", "spanish": " Incluso llegasteis a las tumbas.", "urdu": " یہاں تک کہ تم مقبروں میں جا پہنچو گے۔"}, {"arabic": " کَلَّا سَوۡفَ تَعۡلَمُوۡنَ ۙ﴿۴﴾", "english": " Nay! you will soon come to know.", "french": " Non, mais vous saurez bientôt.", "german": " Nein! ihr werdet es bald erfahren.", "spanish": " ¡No! Muy pronto llegaréis a saberlo.", "urdu": " (خوب یاد رکھو کہ) تم لوگ عنقریب (قرآن کریم کی بیان کردہ حقیقت کو) جان لوگے۔"}, {"arabic": " ثُمَّ کَلَّا سَوۡفَ تَعۡلَمُوۡنَ ؕ﴿۵﴾", "english": " Nay again! you will soon come to know.", "french": " Encore une fois, non, mais vous saurez bientôt.", "german": " Wiederum nein! ihr werdet es bald erfahren.", "spanish": " ¡No, de nuevo! Llegaréis a sa­berlo.", "urdu": " پھر (ہم کہتے ہیں کہ تمہاری حالت اس طرح نہیں جس طرح تم سمجھتے ہو اور) عنقریب تم کو معلوم ہو جائے گا (کہ تمہاری اندرونی حالت حقیقتہً وہی ہے جو قرآن کریم نے بیان کی ہے)"}, {"arabic": " کَلَّا لَوۡ تَعۡلَمُوۡنَ عِلۡمَ الۡیَقِیۡنِ ؕ﴿۶﴾", "english": " Nay! if you only knew with certain knowledge,", "french": " Non, mais si seulement vous aviez la connaissance certaine,", "german": " Nein! wüßtet ihr´s nur mit gesichtertem Wissen,", "spanish": " ¡No! Si percibieseis el conocimiento seguro,", "urdu": " (اصل حقیقت تمہارے خیالات کے مطابق) ہرگز نہیں (ہے) کاش تم اصل حقیقت علم یقین کی مدد سے جان سکتے۔"}, {"arabic": " لَتَرَوُنَّ الۡجَحِیۡمَ ۙ﴿۷﴾", "english": " You will surely see Hell in this very life .", "french": " Vous verriez sûrement la Fournaise de l’Enfer dans cette vie même .", "german": " ihr müsstet die Hölle (schon in diesem Leben) sehen.", "spanish": " Veríais ciertamente el Infierno­ en esta misma vida .", "urdu": " (تب تم کو معلوم ہو جاتا کہ) تم ضرور جہنم کو (اسی دنیا میں) دیکھو گے۔"}, {"arabic": " ثُمَّ لَتَرَوُنَّہَا عَیۡنَ الۡیَقِیۡنِ ۙ﴿۸﴾", "english": " Aye, you will surely see it with the eye of certainty.", "french": " Oui, assurément dans l’au-delà vous la verrez avec l’œil de la certitude.", "german": " Ja doch, ihr sollt sie sicherlich sehen mit dem Auge der Gewissheit.", "spanish": " ¡Ay!, ciertamente lo veréis con la mirada de la certeza.", "urdu": " اور اس کے بعد تم اسے یقین کی آنکھ سے (آخرت میں) بھی دیکھ لو گے۔"}, {"arabic": " ثُمَّ لَتُسۡـَٔلُنَّ یَوۡمَئِذٍ عَنِ النَّعِیۡمِ ٪﴿۹﴾", "english": " Then, on that day you shall be called to account about the worldly favours.", "french": " Alors, ce jour-là , on vous demandera certainement des comptes sur les faveurs qui vous ont été octroyées dans ce monde.", "german": " Dann, an jenem Tage, werdet ihr über die Glücksgüter befragt werden.", "spanish": " Entonces, en ese día, seréis llamados a dar cuenta en relación con los placeres mundanos.", "urdu": " پھر (یہ بھی یاد رکھو کہ) تم سے اس دن (ہر بڑی) نعمت کے متعلق سوال کیا جائے گا (کہ تم نے اس کا شکر ادا کیا ہے یا نہیں کیا)"}], "Surah": 102}