{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں۔)"}, {"arabic": " الٓمَّٓ ۙ﴿۲﴾", "english": " Alif Lam Mim.", "french": " Alif Lām Mīm (Je suis Allāh, le Plus-Savant).", "german": " Alif Lâm Mîm.", "spanish": " Alif Lam Mim.", "urdu": " میں اللہ سب سے زیادہ جاننے والا ہوں۔"}, {"arabic": " اللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَ ۙ الۡحَیُّ الۡقَیُّوۡمُ ؕ﴿۳﴾", "english": " Allah is He beside Whom there is no God, the Living, the Self-Subsisting and All-Sustaining.", "french": " Allāh – il n’y a de dieu que Lui, le Vivant, Celui Qui existe de Lui-Même et Qui soutient tout.", "german": " Allah – es gibt keinen Gott außer Ihm, dem Lebendigen, dem aus Sich Selbst Seienden und Allerhaltenden.", "spanish": " Al-lah es Aquél fuera del cual no hay otro Dios, el Viviente, el que Subsiste por Sí mismo y todo lo sostiene.", "urdu": " اللہ (ایسی ذات ہے کہ اس) کے سوا کوئی پرستش کا مستحق نہیں۔ کامل حیات والا (اپنی ذات میں) قائم اور (سب کو) قائم رکھنے والا ہے۔"}, {"arabic": " نَزَّلَ عَلَیۡکَ الۡکِتٰبَ بِالۡحَقِّ مُصَدِّقًا لِّمَا بَیۡنَ یَدَیۡہِ وَ اَنۡزَلَ التَّوۡرٰٮۃَ وَ الۡاِنۡجِیۡلَ ۙ﴿۴﴾", "english": " He has sent down to thee the Book containing the truth and fulfilling that which precedes it; and He sent down the Torah and the Gospel", "french": " Il a fait descendre sur toi le Livre contenant la vérité et confirmant ce qui le précède ; et Il a fait descendre la Torah et l’Evangile", "german": " Er hat herabgesandt zu dir das Buch mit der Wahrheit, bestätigend das, was ihm vorausging; und vordem sandte Er herab die Thora und das Evangelium als eine Richtschnur für die Menschen; und Er hat herabgesandt das Entscheidende.", "spanish": " Él ha hecho descender sobre ti el Libro que contiene la verdad y confirma lo que le precede; y Él hizo descender la Torah y el Evangelio antes de esto, como guía del pueblo; y Él hizo descender la verdad incontrovertible.", "urdu": " اس نے تجھ پر یہ کتاب حق پر مشتمل اتاری ہے جو اس (وحی) کو جو اس (کتاب) سے پہلے (آئی) تھی پورا کرنے والی ہے اور اس نے لوگوں کو ہدایت دینے کے لئے اس سے پہلے تورات اور انجیل کو نازل کیا تھا اور (نیز) اس نے فیصلہ کن نشان نازل کیا ہے۔"}, {"arabic": " مِنۡ قَبۡلُ ہُدًی لِّلنَّاسِ وَ اَنۡزَلَ الۡفُرۡقَانَ ۬ؕ اِنَّ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِ اللّٰہِ لَہُمۡ عَذَابٌ شَدِیۡدٌ ؕ وَ اللّٰہُ عَزِیۡزٌ ذُو انۡتِقَامٍ ﴿۵﴾", "english": " Before this , as a guidance to the people; and He has sent down the Discrimination. Surely, those who deny the Signs of Allah shall have a severe punishment. And Allah is Mighty, Possessor of the power to requite.", "french": " avant ceci pour guider les hommes. Et Il a fait descendre le Furqân. Assurément, ceux qui nient les Signes d’Allāh seront sévèrement punis ; et Allāh est Puissant, Détenteur du pouvoir de châtier.", "german": " Die Allahs Zeichen leugnen, ihnen wird strenge Strafe; und Allah ist allmächtig, Besitzer der Vergeltungsgewalt.", "spanish": " En verdad, aquellos que no crean en los Signos de Al-lah tendrán un severo castigo. Y Al-lah es Poderoso, poseedor del poder de retribución.", "urdu": " جن لوگوں نے اللہ کے نشانات کا انکار کیا ہے ان کے لئے یقیناً سخت عذاب (مقدر) ہے۔ اور اللہ غالب (اور) سزا دینے والا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ لَا یَخۡفٰی عَلَیۡہِ شَیۡءٌ فِی الۡاَرۡضِ وَ لَا فِی السَّمَآءِ ؕ﴿۶﴾", "english": " Surely, nothing in the earth or in the heaven is hidden from Allah.", "french": " Assurément, rien sur la terre ou dans les cieux n’est caché à Allāh.", "german": " Nichts ist verborgen vor Allah, weder auf Erden noch im Himmel.", "spanish": " En verdad, no hay nada en la tierra ni en el cielo oculto para Al-lah.", "urdu": " اللہ سے ہرگز کوئی چیز مخفی نہیں۔ (نہ) زمین میں اور نہ آسمان میں۔"}, {"arabic": " ہُوَ الَّذِیۡ یُصَوِّرُکُمۡ فِی الۡاَرۡحَامِ کَیۡفَ یَشَآءُ ؕ لَاۤ اِلٰہَ اِلَّا ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۷﴾", "english": " He it is Who fashions you in the wombs as He wills; there is no God but He, the Mighty, the Wise.", "french": " C’est Lui Qui vous donne forme dans le sein comme Il veut. Il n’y a de dieu que Lui, le Puissant, le Sage.", "german": " Er ist es, Der euch im Mutterleib bildet, wie Er will; es ist kein Gott außer Ihm, dem Allmächtigen, dem Allweisen.", "spanish": " Él es quien os moldea en los senos maternos como desea; no hay otro Dios sino Él, el Poderoso, el Sabio.", "urdu": " وہی ہے جو رحموں میں جیسی چاہتا ہے تمہیں صورت دیتا ہے۔ اس کے سوا کوئی پرستش کا مستحق نہیں۔ وہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَنۡزَلَ عَلَیۡکَ الۡکِتٰبَ مِنۡہُ اٰیٰتٌ مُّحۡکَمٰتٌ ہُنَّ اُمُّ الۡکِتٰبِ وَ اُخَرُ مُتَشٰبِہٰتٌ ؕ فَاَمَّا الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ زَیۡغٌ فَیَتَّبِعُوۡنَ مَا تَشَابَہَ مِنۡہُ ابۡتِغَآءَ الۡفِتۡنَۃِ وَ ابۡتِغَآءَ تَاۡوِیۡلِہٖ ۚ؃ وَ مَا یَعۡلَمُ تَاۡوِیۡلَہٗۤ اِلَّا اللّٰہُ ۘؔ وَ الرّٰسِخُوۡنَ فِی الۡعِلۡمِ یَقُوۡلُوۡنَ اٰمَنَّا بِہٖ ۙ کُلٌّ مِّنۡ عِنۡدِ رَبِّنَا ۚ وَ مَا یَذَّکَّرُ اِلَّاۤ اُولُوا الۡاَلۡبَابِ ﴿۸﴾", "english": " He it is Who has sent down to thee the Book; in it there are verses that are decisive in meaning — they are the basis of the Book — and there are others that are susceptible of different interpretations. But those in whose hearts is perversity pursue such thereof as are susceptible of different interpretations, seeking discord and seeking wrong interpretation of it. And none knows its right interpretation except Allah and those who are firmly grounded in knowledge; they say, ‘We believe in it; the whole is from our Lord.’ — And none heed except those gifted with understanding. —", "french": " C’est Lui Qui a fait descendre sur toi le Livre qui renferme des versets dont le sens est décisif. Ils constituent la base-même du Livre. Et il s’y trouve d’autres versets susceptibles d’être interprétés de diverses manières. Mais ceux qui ont le cœur pervers s’appuieront sur ceux qui se prêtent à diverses interprétations pour chercher à semer la discorde en y donnant une fausse interprétation, alors que personne n’en connaît l’interprétation exacte du Livre hormis Allāh et ceux qui sont profondément enracinés dans la connaissance ; ils disent : « Nous y croyons ; tout émane de notre Seigneur. » Mais personne n’ y prête attention, sauf ceux doués de compréhension.", "german": " Er ist es, Der das Buch zu dir herabgesandt hat; darin sind Verse von entscheidender Bedeutung – sie sind die Grundlage des Buches – und andere, die unterschiedlich gedeutet werden können. Die aber, in deren Herzen Verderbnis wohnt, suchen gerade jene heraus, die verschiedener Deutung fähig sind, im Trachten nach Zwiespalt und im Trachten nach Deutelei. Doch keiner kennt ihre Deutung außer Allah und diejenigen, die fest gegründet im Wissen sind, die sprechen: \"Wir glauben daran; das Ganze ist von unserem Herrn\" – und niemand beherzigt es, außer den mit Verständnis Begabten -", "spanish": " Él es Quien ha hecho que descienda a ti el Libro; en él hay versículos decisivos en su significado –ellos son la esencia del Libro- y hay otros que permiten diferentes interpretaciones. Pero aquellos en cuyos corazones anida la maldad siguen los que permiten diversas nterpretaciones, buscando la discordia y la interpretación errónea de los mismos. Y nadie conoce su interpretación correcta sino Al-lah y quienes están firmemente basados en el conocimiento; dicen: “Creemos en él; todo él procede de nuestro Señor”. –Y ninguno reflexiona excepto los dotados de entendimiento-.", "urdu": " وہی ہے جس نے تجھ پر یہ کتاب نازل کی ہے جس کی بعض (آیتیں تو) محکم آیتیں ہیں جو اس کتاب کی جڑ ہیں اور کچھ اور (ہیں جو) متشابہ ہیں۔ پس جن لوگوں کے دلوں میں کجی ہے وہ تو فتنہ کی غرض سے اور اس (کتاب) کو (اس کی حقیقت سے) پھیر دینے کے لئے ان (آیات) کے پیچھے پڑ جاتے ہیں جو اس (کتاب) میں سے متشابہ ہیں۔ حالانکہ اس کی تفسیر کو سوائے اللہ کے اور علم میں کامل دستگاہ رکھنے والوں کے (کہ) جو کہتے ہیں (کہ) ہم اس (کلام) پر ایمان رکھتے ہیں (اور جو کہتے ہیں کہ یہ) سب ہمارے رب کی طرف سے ہی ہے کوئی نہیں جانتا اور عقل مندوں کے سوا کوئی بھی نصیحت حاصل نہیں کرتا۔"}, {"arabic": " رَبَّنَا لَا تُزِغۡ قُلُوۡبَنَا بَعۡدَ اِذۡ ہَدَیۡتَنَا وَ ہَبۡ لَنَا مِنۡ لَّدُنۡکَ رَحۡمَۃً ۚ اِنَّکَ اَنۡتَ الۡوَہَّابُ ﴿۹﴾", "english": " ‘Our Lord, let not our hearts become perverse after Thou hast guided us; and bestow on us mercy from Thyself; surely, Thou alone art the Bestower.", "french": " »Notre Seigneur, ne laisse pas dévier nos cœurs après que Tu nous aies guidés, et accorde-nous Ta miséricorde ; en vérité, Toi Seul es le Grand Donateur.", "german": " „Unser Herr, lass unsere Herzen nicht verderbt werden, nachdem Du uns geleitet hast, und gewähre uns Gnade von Dir; gewiss, Du allein bist der Gewährende.", "spanish": " “Señor nuestro, no permitas que nuestros corazones se perviertan después de que nos has guiado; y concédenos Tu misericordia; en verdad, sólo Tú eres el Donador por excelencia.", "urdu": " اے ہمارے رب! تو ہمیں ہدایت دینے کے بعد ہمارے دلوں کو کج نہ کر اور ہمیں اپنے پاس سے رحمت (کے سامان) عطا کر۔ یقیناً تو ہی بہت عطا کرنے والا ہے۔"}, {"arabic": " رَبَّنَاۤ اِنَّکَ جَامِعُ النَّاسِ لِیَوۡمٍ لَّا رَیۡبَ فِیۡہِ ؕ اِنَّ اللّٰہَ لَا یُخۡلِفُ الۡمِیۡعَادَ ﴿۱۰﴾٪", "english": " ‘Our Lord, Thou wilt certainly assemble mankind together on the Day about which there is no doubt; surely, Allah breaks not His promise.’", "french": " Notre Seigneur, Tu rassembleras certainement les hommes le Jour au sujet duquel il n’existe aucun doute ; assurément, Allāh ne manque jamais à Sa promesse. »", "german": "", "spanish": " “Señor nuestro, reunirás ciertamente a la humanidad en el Día sobre el cual no hay duda alguna; en verdad, Al-lah no incumple Sus promesas.”", "urdu": " اے ہمارے رب! تو یقیناً سب لوگوں کو اس دن جس (کی آمد) میں کوئی شک (وشبہ) نہیں جمع کرے گا۔ اللہ ہرگز وعدہ خلافی نہیں کرتا۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا لَنۡ تُغۡنِیَ عَنۡہُمۡ اَمۡوَالُہُمۡ وَ لَاۤ اَوۡلَادُہُمۡ مِّنَ اللّٰہِ شَیۡئًا ؕ وَ اُولٰٓئِکَ ہُمۡ وَقُوۡدُ النَّارِ ﴿ۙ۱۱﴾", "english": " Those who disbelieve — their possessions and their children shall not avail them at all against Allah; and it is they that are the fuel of the Fire.", "french": " Ceux qui ne croient pas, leurs enfants et leurs biens ne leur serviront à rien contre Allāh ; ceux-là mêmes serviront de combustible au Feu.", "german": " Die ungläubig sind, ihr Besitz und ihre Kinder werden ihnen nicht im geringsten nützen gegen Allah; und sie sind des Feuers Nahrung –", "spanish": " En cuanto a los incrédulos, ni sus posesiones ni sus hijos les servirán frente a Al-lah; y son ellos el combustible del Fuego.", "urdu": " جو لوگ کافر ہیں ان کے اموال اور ان کی اولادیں خدا کے مقابلہ میں کچھ بھی کام نہیں آئیں گی اور یہی لوگ دوزخ کا ایندھن ہیں۔"}, {"arabic": " کَدَاۡبِ اٰلِ فِرۡعَوۡنَ ۙ وَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ کَذَّبُوۡا بِاٰیٰتِنَا ۚ فَاَخَذَہُمُ اللّٰہُ بِذُنُوۡبِہِمۡ ؕ وَ اللّٰہُ شَدِیۡدُ الۡعِقَابِ ﴿۱۲﴾", "english": " Their case is like the case of the people of Pharaoh and those before them; they rejected Our Signs; so Allah punished them for their sins, and Allah is severe in punishing.", "french": " Leur cas est comme le cas du peuple de Pharaon et ceux qui furent avant eux ; ils rejetèrent Nos Signes ; Allāh les a punis pour leurs péchés et Allāh est sévère dans Son châtiment.", "german": " nach der Art der Leute Pharaos und derer, die vor ihnen waren; sie verwarfen Unsere Zeichen; also ergriff sie Allah für ihre Sünden, und Allah ist streng im Strafen.", "spanish": " Con ellos ocurre como con las gentes del Faraón y de quienes les precedieron; rechazaron Nuestros Signos; y, así, Al-lah los castigó por sus pecados, y Al-lah es severo en el castigo.", "urdu": " (ان کا طریق) فرعون کے اتباع اور ان لوگوں کے طریق کے مطابق (ہے) جو ان سے پہلے تھے! انہوں نے ہمارے نشانات کو جھٹلایا تھا اس پر اللہ نے ان کے قصوروں کے بدلہ میں انہیں پکڑ لیا اور اللہ کا عذاب سخت (ہوتا) ہے۔"}, {"arabic": " قُلۡ لِّلَّذِیۡنَ کَفَرُوۡا سَتُغۡلَبُوۡنَ وَ تُحۡشَرُوۡنَ اِلٰی جَہَنَّمَ ؕ وَ بِئۡسَ الۡمِہَادُ ﴿۱۳﴾", "english": " Say to those who disbelieve, ‘You shall be overcome and gathered unto Hell; and an evil place of rest it is.’", "french": " Dis aux mécréants : « Vous serez vaincus et rassemblés en Enfer ; et quel mauvais lieu de repos ! »", "german": " Sprich zu denen, die ungläubig sind: \"Ihr sollt übermannt und in der Hölle versammelt werden; und schlimm ist die Ruhestatt!\"", "spanish": " Di a los que no creen: “Seréis vencidos y reunidos en el infierno; y es un mal lugar de reposo”.", "urdu": " جو لوگ کافر ہیں انہیں کہہ دے کہ تمہیں ضرور مغلوب کیا جائے گا اور جہنم کی طرف اکٹھے کرکے لے جایا جائے گا اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " قَدۡ کَانَ لَکُمۡ اٰیَۃٌ فِیۡ فِئَتَیۡنِ الۡتَقَتَا ؕ فِئَۃٌ تُقَاتِلُ فِیۡ سَبِیۡلِ اللّٰہِ وَ اُخۡرٰی کَافِرَۃٌ یَّرَوۡنَہُمۡ مِّثۡلَیۡہِمۡ رَاۡیَ الۡعَیۡنِ ؕ وَ اللّٰہُ یُؤَیِّدُ بِنَصۡرِہٖ مَنۡ یَّشَآءُ ؕ اِنَّ فِیۡ ذٰلِکَ لَعِبۡرَۃً لِّاُولِی الۡاَبۡصَارِ ﴿۱۴﴾", "english": " Certainly there was for you a Sign in the two armies that encountered each other, one army fighting in the cause of Allah and the other disbelieving, whom they saw to be twice as many as themselves, actually with their eyes. Thus Allah strengthens with His aid whomsoever He pleases. In that surely is a lesson for those who have eyes.", "french": " Certainement pour vous il y a eu un Signe dans la rencontre des deux armées, l’une se battant pour la cause d’Allāh, et l’autre composée de mécréants qu’ils virent de leurs yeux deux fois aussi nombreux qu’eux-mêmes. C’est ainsi qu’Allāh fortifie de Son aide qui Il veut. Voilà donc assurément une leçon pour ceux qui ont des yeux.", "german": " Wahrlich, es ward euch ein Zeichen in den zwei Heeren, die aufeinander trafen, das eine Heer kämpfend in Allahs Sache, das andere ungläubig; und sie sahen sie mit sehenden Augen doppelt so viel wie sie selber. Also stärkt Allah mit Seinem Beistand, wen Er will. Darin liegt wahrlich eine Lehre für die, die Augen haben.", "spanish": " Ciertamente hubo un Signo para vosotros en los dos ejércitos que se nfrentaron: uno que luchaba por la causa de Al-lah y el otro formado por incrédulos, quienes les vieron con sus propios ojos en número doble del suyo. Así Al-lah fortalece con Su ayuda a quien Le place. Ahí hay en verdad una lección para los clarividentes.", "urdu": " ان دو گروہوں میں جو ایک دوسرے سے برسر پیکار تھے تمہارے لئے یقیناً ایک نشان تھا (ان میں سے) ایک گروہ تو اللہ کے راستہ میں جنگ کرتا تھا اور دوسرا منکر تھا وہ (مسلمان) ان (کافروں) کو (اپنی انہی) آنکھوں سے اپنے سے دو چند دیکھ رہے تھے اور اللہ جسے چاہتا ہے اپنی مدد دیکر قوت بخشتا ہے۔ اس (بات) میں آنکھوں والوں کے لئے یقیناً ایک نصیحت ہے۔"}, {"arabic": " زُیِّنَ لِلنَّاسِ حُبُّ الشَّہَوٰتِ مِنَ النِّسَآءِ وَ الۡبَنِیۡنَ وَ الۡقَنَاطِیۡرِ الۡمُقَنۡطَرَۃِ مِنَ الذَّہَبِ وَ الۡفِضَّۃِ وَ الۡخَیۡلِ الۡمُسَوَّمَۃِ وَ الۡاَنۡعَامِ وَ الۡحَرۡثِ ؕ ذٰلِکَ مَتَاعُ الۡحَیٰوۃِ الدُّنۡیَا ۚ وَ اللّٰہُ عِنۡدَہٗ حُسۡنُ الۡمَاٰبِ ﴿۱۵﴾", "english": " Beautified for men is the love of desired things — women and children, and stored-up heaps of gold and silver, and pastured horses and cattle and crops. That is the provision of the present life; but it is Allah with Whom is an excellent home.", "french": " L’amour des choses désirées est embelli pour les gens – femmes, enfants, trésors amassés d’or et d’argent, chevaux marqués, bestiaux et récoltes. Telle est la provision de la vie d’ici-bas ; mais c’est auprès d’Allāh qu’il y a un excellent endroit de retour.", "german": " Verschönt ist den Menschen die Liebe zu den Begehrten, Frauen und Kindern und aufgespeicherten Haufen von Gold und Silber und wohlgezüchteten Pferden und Viehherden und Ackerfrucht. Das ist die Versorgung für dieses Leben; doch Allah ist es, bei Dem die schönste Heimstatt ist.", "spanish": " Se ha hecho hermoso para los hombres el amor por las cosas deseadas: mujeres e hijos, montones atesorados de oro y plata, caballos que pastan, rebaños y cultivos. Ésas son las provisiones para esta vida; pero es junto a Al-lah donde se encuentra una morada excelente.", "urdu": " لوگوں کو (عام طور پر) پسند کی جانے والی چیزوں کی یعنی عورتوں اور بیٹوں اور سونے اور چاندی کے محفوظ خزانوں اور خوبصورت گھوڑوں اور مویشیوں اور کھیتی کی محبت اچھی شکل میں دکھائی گئی ہے۔ یہ دنیوی زندگی کا سامان ہے اور اللہ (تو) وہ (ذات) ہے جس کے پاس نہایت عمدہ ٹھکانا ہے۔"}, {"arabic": " قُلۡ اَؤُنَبِّئُکُمۡ بِخَیۡرٍ مِّنۡ ذٰلِکُمۡ ؕ لِلَّذِیۡنَ اتَّقَوۡا عِنۡدَ رَبِّہِمۡ جَنّٰتٌ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا وَ اَزۡوَاجٌ مُّطَہَّرَۃٌ وَّ رِضۡوَانٌ مِّنَ اللّٰہِ ؕ وَ اللّٰہُ بَصِیۡرٌۢ بِالۡعِبَادِ ﴿ۚ۱۶﴾", "english": " Say, ‘Shall I inform you of something better than that?’ For those who fear God, there are Gardens with their Lord, beneath which rivers flow; therein shall they abide; and pure spouses and Allah’s pleasure. And Allah is Mindful of His servants,", "french": " Dis : « Vous parlerai-je de quelque chose valant mieux que tout cela ? » Pour ceux qui craignent Allāh, se trouvent auprès de leur Seigneur des Jardins sous lesquels coulent des rivières ; ils y demeureront éternellement ; il s’y trouvera aussi des conjoints/es purifiés/es par Allāh ainsi que le plaisir d’Allāh. Et Allāh veille bien sur Ses serviteurs.", "german": " Sprich: \"Soll ich euch von etwas Besserem Kunde geben als diesem?\" Für jene, die Gott fürchten, sind Gärten bei ihrem Herrn, die Ströme durchfließen – dort sollen sie wohnen –, und reine Gattinnen und Allahs Wohlgefallen. Und Allah achtet wohl der Diener,", "spanish": " Diles: “¿Puedo informaros de algo mejor que eso?” Para los que temen a Dios hay jardines junto a su Señor por los cuales corren ríos; allí morarán; también habrán cónyuges, purificados por Al-lah, y el agrado de Al-lah. Y Al-lah tiene siempre presentes a Sus siervos.", "urdu": " تو کہہ (کہ) کیا میں تمہیں اس سے (بھی) بہتر چیز بتاٶں؟ جو لوگ تقویٰ اختیار کریں‘ ان کے لئے ان کے رب کے پاس ایسے باغ ہیں جن کے نیچے نہریں بہتی ہیں (وہ) ان میں بسیں گے اور (نیز ان کے لئے) پاک بیویاں اور اللہ کی رضا (مقدر) ہے اور اللہ اپنے بندوں کو دیکھ رہا ہے۔"}, {"arabic": " اَلَّذِیۡنَ یَقُوۡلُوۡنَ رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَ قِنَا عَذَابَ النَّارِ ﴿ۚ۱۷﴾", "english": " Those who say, ‘Our Lord, we do believe; forgive us, therefore, our sins and save us from the punishment of the Fire;’", "french": " Qui disent : « Notre Seigneur, nous croyons vraiment en Toi ; pardonne-nous donc nos péchés et protège-nous du châtiment du Feu. »", "german": " die da sprechen: \"Unser Herr, siehe, wir glauben, vergib uns drum unsere Sünden und bewahre uns vor der Strafe des Feuers.\"", "spanish": " Los que dicen: “Señor nuestro, ciertamente creemos; perdónanos, pues, nuestros pecados y sálvanos del castigo del Fuego”;", "urdu": " جو کہتے ہیں (کہ) اے ہمارے رب! ہم یقیناً ایمان لے آئے ہیں۔ اس لئے تو ہمارے قصور ہمیں معاف کر دے اور ہمیں دوزخ کے عذاب سے بچا لے۔"}, {"arabic": " اَلصّٰبِرِیۡنَ وَ الصّٰدِقِیۡنَ وَ الۡقٰنِتِیۡنَ وَ الۡمُنۡفِقِیۡنَ وَ الۡمُسۡتَغۡفِرِیۡنَ بِالۡاَسۡحَارِ ﴿۱۸﴾", "english": " The steadfast, and the truthful, and the humble, and those who spend in the way of God, and those who seek forgiveness in the latter part of the night.", "french": " Ces Jardins sont pour les constants, les véridiques, les obéissants et ceux qui dépensent dans la voie d’Allāh et ceux qui implorent le pardon dans la dernière partie de la nuit.", "german": " Die Standhaften und die Wahrhaften, die Gehorsamen und die Spendenden und die in der späteren Hälfte der Nacht um Verzeihung Bittenden.", "spanish": " Los constantes, los sinceros, los humildes y los que gastan en la causa de Dios, y los que piden perdón en la última parte de la noche.", "urdu": " جو صبر کرنے والے اور سچ بولنے والے اور فرمانبردار اور (خدا کے لئے اپنے اموال) خرچ کرنے والے اور راتوں کے آخری حصوں میں استغفار کرنے والے ہیں۔"}, {"arabic": " شَہِدَ اللّٰہُ اَنَّہٗ لَاۤ اِلٰہَ اِلَّا ہُوَ ۙ وَ الۡمَلٰٓئِکَۃُ وَ اُولُوا الۡعِلۡمِ قَآئِمًۢا بِالۡقِسۡطِ ؕ لَاۤ اِلٰہَ اِلَّا ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ؕ﴿۱۹﴾", "english": " Allah bears witness that there is no God but He — and also do the angels and those possessed of knowledge — Maintainer of justice; there is no God but He, the Mighty, the Wise.", "french": " Allāh atteste – et les anges, ainsi que tous les hommes éclairés et doués de savoir – qu’il n’y a de dieu que Lui, Ferme en justice. Il n’y a de dieu que Lui, le Puissant, le Sage.", "german": " Allah bezeugt, in Wahrung der Gerechtigkeit, dass es keinen Gott gibt außer Ihm – ebenso die Engel und jene, die Wissen besitzen; es gibt keinen Gott außer Ihm, dem Allmächtigen, dem Allweisen.", "spanish": " Al-lah es testigo de que no hay dios sino Él, –y también lo son los ángeles y quienes poseen sabiduría- Mantenedor de la justicia; no hay más Dios que Él, el Poderoso, el Sabio.", "urdu": " اللہ انصاف کے مطابق یہ گواہی دیتا ہے کہ حقیقت یہی ہے کہ اس کے سوا (اور) کوئی معبود نہیں اور فرشتے بھی اور علم والے بھی (یہی گواہی دیتے ہیں) کہ اس کے سوا پرستش کا کوئی (بھی) مستحق نہیں۔ وہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " اِنَّ الدِّیۡنَ عِنۡدَ اللّٰہِ الۡاِسۡلَامُ ۟ وَ مَا اخۡتَلَفَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ اِلَّا مِنۡۢ بَعۡدِ مَا جَآءَہُمُ الۡعِلۡمُ بَغۡیًۢا بَیۡنَہُمۡ ؕ وَ مَنۡ یَّکۡفُرۡ بِاٰیٰتِ اللّٰہِ فَاِنَّ اللّٰہَ سَرِیۡعُ الۡحِسَابِ ﴿۲۰﴾", "english": " Surely, the true religion with Allah is Islam (complete submission). And those who were given the Book did not disagree but after knowledge had come to them, out of mutual envy. And whoso denies the Signs of Allah, then surely, Allah is quick at reckoning.", "french": " Assurément, la vraie religion aux yeux d’Allāh, c’est l’Islam la soumission totale . Et ceux qui avaient reçu le Livre ne se disputèrent qu’après avoir été éclairés et par suite d’une jalousie mutuelle. Et pour ceux qui renieront les Signes d’Allāh, alors assurément, Allāh est prompt à leur demander compte.", "german": " Wahrlich, die Religion vor Allah ist Islam. Und die, denen das Buch gegeben ward, wurden uneins, erst nachdem das Wissen zu ihnen gekommen war, aus gegenseitigem Neid. Und wer die Zeichen Allahs leugnet - dann, wahrlich, ist Allah schnell im Abrechnen.", "spanish": " En verdad, ante Al-lah la verdadera religión es el Islam (sumisión completa). Y aquellos a quienes se entregó el Libro no discreparon sino después de llegarles el conocimiento, por pura envidia entre sí. Y quien niegue los Signos de Al-lah, sepa que en verdad, Al-lah es rápido en rendir cuentas.", "urdu": " اللہ کے نزدیک اصل دین یقیناً کامل فرمانبرداری ہے اور صرف انہی لوگوں نے جنہیں کتاب دی گئی تھی اس کے بعد کہ ان کے پاس علم آچکا تھا آپس کے فساد کی وجہ سے اختلاف کیا اور جو اللہ کے نشانات کا انکار کرے (وہ یاد رکھے کہ) اللہ یقیناً جلد حساب کرنے والا ہے۔"}, {"arabic": " فَاِنۡ حَآجُّوۡکَ فَقُلۡ اَسۡلَمۡتُ وَجۡہِیَ لِلّٰہِ وَ مَنِ اتَّبَعَنِ ؕ وَ قُلۡ لِّلَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ وَ الۡاُمِّیّٖنَ ءَاَسۡلَمۡتُمۡ ؕ فَاِنۡ اَسۡلَمُوۡا فَقَدِ اہۡتَدَوۡا ۚ وَ اِنۡ تَوَلَّوۡا فَاِنَّمَا عَلَیۡکَ الۡبَلٰغُ ؕ وَ اللّٰہُ بَصِیۡرٌۢ بِالۡعِبَادِ ﴿٪۲۱﴾", "english": " But if they dispute with thee, say, ‘I have submitted myself to Allah, and also those who follow me.’ And say to those who have been given the Book and to the unlearned, ‘Have you submitted?’ If they submit, then they will surely be guided; but if they turn back, then thy duty is only to convey the message. And Allah is Watchful of His servants.", "french": " Mais, s’ils argumentent contre toi, dis- leur : « Je me suis soumis à la volonté d’Allāh, moi et ceux qui me suivent. » Et dis à ceux à qui le Livre a été donné, ainsi qu’aux illettrés : « Vous êtes-vous soumis ? » S’ils se soumettent, alors ils seront sûrement guidés ; mais s’ils tournent le dos, alors ton devoir n’est que de transmettre clairement le Message. Et Allāh veille bien sur Ses serviteurs.", "german": " Streiten sie aber mit dir, so sprich: \"Ich habe mich Allah ergeben und ebenso die, die mir folgen.\" Und sprich zu jenen, denen das Buch gegeben ward, und zu den Analphabeten: \"Habt ihr euch ergeben?\" Haben sie sich ergeben, dann sind sie sicher auf dem rechten Weg, wenden sie sich aber zurück, dann obliegt dir nur die Verkündigung; und Allah achtet wohl der Diener.", "spanish": " Mas si disputan contigo, diles: “Me he sometido a Al-lah, como también los que me siguen”. Y di a quienes se les ha entregado el Libro y a los ignorantes: “¿Os habéis sometido?”. Si se someten, serán ciertamente guiados, pero si vuelven sobre sus pasos, debes saber que tu única obligación es la de transmitir el mensaje. Y Al-lah está siempre atento a Sus siervos.", "urdu": " اب اگر یہ (لوگ) تجھ سے جھگڑیں تو تو (ان سے) کہدے کہ میں نے اور ان لوگوں نے جو میرے پیرو ہیں اپنے آپ کو اللہ کی فرمانبرداری میں لگا دیا ہے اور جن لوگوں کو کتاب دی گئی ہے (ان کو) اور (نیز) امیوں کو کہہ دے کہ کیا تم (بھی) فرمانبردار ہوتے ہو۔ پس اگر وہ فرمانبردار ہو جائیں تو (سمجھو کہ) وہ ہدایت پا گئے۔ اور اگر وہ منہ پھیر لیں تو تیرے ذمہ صرف پہنچا دینا ہے اور اللہ بندوں کو دیکھ رہا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یَکۡفُرُوۡنَ بِاٰیٰتِ اللّٰہِ وَ یَقۡتُلُوۡنَ النَّبِیّٖنَ بِغَیۡرِ حَقٍّ ۙ وَّ یَقۡتُلُوۡنَ الَّذِیۡنَ یَاۡمُرُوۡنَ بِالۡقِسۡطِ مِنَ النَّاسِ ۙ فَبَشِّرۡہُمۡ بِعَذَابٍ اَلِیۡمٍ ﴿۲۲﴾", "english": " Surely, those who deny the Signs of Allah and seek to kill the Prophets unjustly, and seek to kill such men as enjoin equity — announce to them a painful punishment.", "french": " Assurément, quant à ceux qui renient les Signes d’Allāh et qui cherchent à tuer injustement les Prophètes et qui cherchent à tuer les gens qui enjoignent la justice, annonce-leur un châtiment douloureux.", "german": " Die Allahs Zeichen leugnen und die Propheten grundlos morden möchten und morden möchten diejenigen unter den Menschen, die Gerechtigkeit predigen – künde ihnen schmerzliche Strafe an.", "spanish": " En verdad, a quienes niegan los Signos de Al-lah y traman matar injustamente a los Profetas y procuran matar a los hombres que predican la justicia: anúnciales un doloroso castigo.", "urdu": " جو لوگ اللہ کی آیات کا انکار کرتے ہیں اور بلاوجہ نبیوں کو قتل کرنا چاہتے ہیں اور (نیز) لوگوں میں سے جو انصاف کی ہدایت کرتے ہیں انہیں (بھی) قتل کرنا چاہتے ہیں تو انہیں دردناک عذاب کی خبر دے۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ حَبِطَتۡ اَعۡمَالُہُمۡ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۫ وَ مَا لَہُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿۲۳﴾", "english": " Those are they whose deeds shall come to naught in this world and in the next, and they shall have no helpers.", "french": " Ce sont eux dont les actions n’aboutiront à rien dans ce monde comme dans l’autre, et personne ne leur viendra en aide.", "german": " Sie sind es, deren Werke nichtig sein sollen in dieser und in jener Welt, und keine Helfer werden sie finden.", "spanish": " Son aquellos cuyas acciones serán nulas en este mundo y en el futuro, y no tendrán defensores.", "urdu": " یہ وہ (لوگ) ہیں کہ جن کے اعمال اس دنیا (میں بھی) اور آخرت میں (بھی) ضائع ہو جائیں گے اور ان کا کوئی بھی مددگار نہیں ہوگا۔"}, {"arabic": " اَلَمۡ تَرَ اِلَی الَّذِیۡنَ اُوۡتُوۡا نَصِیۡبًا مِّنَ الۡکِتٰبِ یُدۡعَوۡنَ اِلٰی کِتٰبِ اللّٰہِ لِیَحۡکُمَ بَیۡنَہُمۡ ثُمَّ یَتَوَلّٰی فَرِیۡقٌ مِّنۡہُمۡ وَ ہُمۡ مُّعۡرِضُوۡنَ ﴿۲۴﴾", "english": " Dost thou not know of those who have been given their portion of the Book? They are called to the Book of Allah that it may judge between them, but a party of them turn away in aversion.", "french": " N’as-tu pas entendu parler de ceux qui ont reçu leur partie du livre ? Ils sont appelés au Livre d’Allāh afin qu’il puisse juger entre eux leurs différends ; mais quelques-uns d’entre eux tournent le dos avec répugnance.", "german": " Hast du nicht von jenen Kenntnis, denen ein Teil von der Schrift gegeben ward? Sie sind berufen zum Buche Allahs, dass es richten möge zwischen ihnen, doch ein Teil von ihnen wendet sich ab in Widerwillen.", "spanish": " ¿No conoces a quienes se les ha dado su parte del Libro? Son llamados al Libro de Al-lah para que el Libro juzgue entre ellos, pero una parte de ellos se aparta con aversión.", "urdu": " کیا تجھے ان لوگوں کا علم نہیں جنہیں شریعت کا ایک حصہ دیا گیا ہے (کہ جب) انہیں اللہ کی کتاب کی طرف بلایا جاتا ہے تا کہ وہ ان کے درمیان فیصلہ کر دے تو ان میں سے کچھ لوگ (اس سے) اعراض کرتے ہوئے منہ پھیر لیتے ہیں۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمۡ قَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَیَّامًا مَّعۡدُوۡدٰتٍ ۪ وَ غَرَّہُمۡ فِیۡ دِیۡنِہِمۡ مَّا کَانُوۡا یَفۡتَرُوۡنَ ﴿۲۵﴾", "english": " That is because they say, ‘The Fire shall not touch us, except for a limited number of days.’ And what they used to forge has deceived them regarding their religion.", "french": " C’est parce qu’ils disent : « Le Feu ne nous touchera que pour quelques jours comptés. » Et ce qu’ils avaient pris l’habitude d’inventer les a trompés dans leur religion.", "german": " Dies, weil sie sagen: \"Das Feuer soll uns nicht berühren, außer an einigen Tagen.\" Und was sie selber erdichten, hat sie über ihren Glauben getäuscht.", "spanish": " Eso es porque dicen: “El Fuego sólo nos tocará durante un número reducido de días.” Y lo que solían falsificar les ha engañado respecto a su religión.", "urdu": " یہ (اعراض) اس وجہ سے ہے کہ وہ کہتے ہیں کہ سوائے چند گنتی کے دنوں کے ہمیں آگ ہرگز نہیں چھوئے گی اور جو کچھ وہ افترا باندھتے ہیں اس نے انہیں ان کے دین (کے معاملہ) میں دھوکہ دیا (ہوا) ہے۔"}, {"arabic": " فَکَیۡفَ اِذَا جَمَعۡنٰہُمۡ لِیَوۡمٍ لَّا رَیۡبَ فِیۡہِ ۟ وَ وُفِّیَتۡ کُلُّ نَفۡسٍ مَّا کَسَبَتۡ وَ ہُمۡ لَا یُظۡلَمُوۡنَ ﴿۲۶﴾", "english": " How will they fare when We will gather them together on the Day about which there is no doubt; and when every soul shall be paid in full what it has earned, and they shall not be wronged?", "french": " Comment se comporteront-ils quand Nous les rassemblerons le Jour au sujet duquel il n’y a pas de doute, et que chaque âme sera payée intégralement selon ce qu’elle aura acquis. Et ils ne seront pas lésés ?", "german": " Wie! wenn Wir sie versammeln an dem Tage, über den kein Zweifel ist, und wenn jeder voll erhält, was er verdient; und sie werden nicht Unrecht erleiden!", "spanish": " ¿Cómo les irá cuando los reunamos en el Día acerca del cual no hay duda alguna; y cuando se pague a cada alma todo lo que ha ganado, y no sean perjudicados?", "urdu": " جب ہم اس دن کہ جس (کی آمد) میں کوئی شک (وشبہ) نہیں انہیں جمع کریں گے تو ان کا کیا حال ہوگا اور ہر شخص نے جو کچھ کمایا ہوگا (اس دن) وہ اسے پورا پورا دے دیا جائے گا اور ان پر (کچھ بھی) ظلم نہیں کیا جائے گا۔"}, {"arabic": " قُلِ اللّٰہُمَّ مٰلِکَ الۡمُلۡکِ تُؤۡتِی الۡمُلۡکَ مَنۡ تَشَآءُ وَ تَنۡزِعُ الۡمُلۡکَ مِمَّنۡ تَشَآءُ ۫ وَ تُعِزُّ مَنۡ تَشَآءُ وَ تُذِلُّ مَنۡ تَشَآءُ ؕ بِیَدِکَ الۡخَیۡرُ ؕ اِنَّکَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۲۷﴾", "english": " Say, ‘O Allah, Lord of sovereignty, Thou givest sovereignty to whomsoever Thou pleasest; and Thou takest away sovereignty from whomsoever Thou pleasest. Thou exaltest whomsoever Thou pleasest and Thou abasest whomsoever Thou pleasest. In Thy hand is all good. Thou surely hast power to do all things.", "french": " Dis : « Ô Allāh, Maître de la Souveraineté, Tu accordes la souveraineté à qui Tu veux et Tu ôtes la souveraineté de qui Tu veux. Tu élèves qui Tu veux et Tu humilies qui Tu veux. Tu détiens dans Ta main tout ce qui est bon. En vérité, Tu as le pouvoir de faire tout ce que Tu veux.", "german": " Sprich: \"O Allah, Herr der Herrschaft, Du gibst die Herrschaft, wem Du willst, und Du nimmst die Herrschaft, wem Du willst. Du erhöhst, wen Du willst, und erniedrigst, wen Du willst. In Deiner Hand ist alles Gute. Wahrlich, Du hast Macht über alle Dinge.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:27&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:27&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic28\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic28\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:28' style='text-decoration:underline'>3:28</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(28)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control28\"></i></button> <audio id=\"player28\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">تُوۡلِجُ الَّیۡلَ فِی النَّہَارِ وَ تُوۡلِجُ النَّہَارَ فِی الَّیۡلِ ۫ وَ تُخۡرِجُ الۡحَیَّ مِنَ الۡمَیِّتِ وَ تُخۡرِجُ الۡمَیِّتَ مِنَ الۡحَیِّ ۫ وَ تَرۡزُقُ مَنۡ تَشَآءُ بِغَیۡرِ حِسَابٍ ﴿۲۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Thou makest the night pass into the day and makest the day pass into the night. And Thou bringest forth the living from the dead and bringest forth the dead from the living. And Thou givest to whomsoever Thou pleasest without measure.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_3_28_c' href='#'>c</a>]</sup>‘Thou makest the night pass into the day and makest the day pass into the night.<sup class='ref'>[<a class='ref' data-id='ref_3_28_393' href='#'>393</a>]</sup> And <sup class='ref'>[<a class='ref' data-id='ref_3_28_d' href='#'>d</a>]</sup>Thou bringest forth the living from the dead and bringest forth the dead from the living. And Thou givest to whomsoever Thou pleasest without measure.’<sup class='ref'>[<a class='ref' data-id='ref_3_28_394' href='#'>394</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_28_c'>c</span><span class='collapsible plus' data-id='ref_3_28_393'>393</span><span class='collapsible plus' data-id='ref_3_28_d'>d</span><span class='collapsible plus' data-id='ref_3_28_394'>394</span></div> <div><div class='reference' data-id='ref_3_28_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:55' target=_blank>7:55</a>; <a href='/quran/13:4' target=_blank>13:4</a>; <a href='/quran/22:62' target=_blank>22:62</a>; <a href='/quran/35:14' target=_blank>35:14</a>; <a href='/quran/39:6' target=_blank>39:6</a>; <a href='/quran/57:7' target=_blank>57:7</a>. (<a href='javascript:void(0)' data-id='ref_3_28_c' class='ref'>close</a>)</p> </div> </div><div><a name='393'></a><div class='reference' data-id='ref_3_28_393' style='display:none'> <p><b>393.</b> \"The day\" may here represent the prosperity and power of a people and \"the night\" their decline and degradation. (<a href='javascript:void(0)' data-id='ref_3_28_393' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_3_28_d' style='display:none'> <p><b>d.</b> <a href='/quran/6:96' target=_blank>6:96</a>; <a href='/quran/10:32' target=_blank>10:32</a>; <a href='/quran/30:20' target=_blank>30:20</a>. (<a href='javascript:void(0)' data-id='ref_3_28_d' class='ref'>close</a>)</p> </div> </div><div><a name='394'></a><div class='reference' data-id='ref_3_28_394' style='display:none'> <p><b>394.</b> This and the preceding verse point to the immutable Divine law that nations rise and fall as they conform to, or defy, the Will of God, Who is the Source of all power and glory. (<a href='javascript:void(0)' data-id='ref_3_28_394' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\"> تُو رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے۔ اور تُو مُردہ سے زندہ نکالتا ہے اور زندہ سے مُردہ نکالتا ہے۔ اور تُو جسے چاہتا ہے بغیرحساب کے رزق عطا کرتا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">تو رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے اور بے جان سے جان دار نکالتا ہے اور جان دار سے بے جان نکالتا ہے اور جسے چاہتا ہے بے حساب دیتا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Tu fais pénétrer la nuit dans le jour et Tu fais pénétrer le jour dans la nuit. Des morts, Tu fais sortir les vivants et des vivants, Tu fais sortir les morts. Et Tu accordes Tes dons <em>et richesses</em> sans compter à qui Tu veux. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Tú haces que la noche se convierta en día y que el día se convierta en noche. Y Tú haces salir lo vivo de lo muerto y lo muerto de lo vivo. Y Tú das a quien Te agrada, sin medida.”</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Du lässest die Nacht übergehen in den Tag und lässest den Tag übergehen in die Nacht. Du lässest das Lebendige hervorgehen aus dem Toten und lässest das Tote hervorgehen aus dem Lebendigen. Und Du gibst, wem Du willst, ohne zu rechnen.\"", "spanish": " Di: “¡Oh Al-lah, Señor de la soberanía!”, Tú das la autoridad a quien Te place y retiras el poder de quien quieres; Tú ensalzas a quien deseas y humillas a quien Te place. En Tu mano está todo el bien. Tú, en verdad, tienes el poder de hacer todas las cosas.", "urdu": " تو کہہ اے اللہ جو سلطنت کا مالک ہے تو جسے چاہتا ہے سلطنت دیتا ہے اور جس سے چاہتا ہے سلطنت لے لیتا ہے۔ جسے چاہتا ہے غلبہ بخشتا ہے اور جسے چاہتا ہے ذلیل کر دیتا ہے۔ سب بھلائی تیرے ہی ہاتھ میں ہے اور تو یقیناً ہر ایک چیز پر قادر ہے۔"}, {"arabic": " لَا یَتَّخِذِ الۡمُؤۡمِنُوۡنَ الۡکٰفِرِیۡنَ اَوۡلِیَآءَ مِنۡ دُوۡنِ الۡمُؤۡمِنِیۡنَ ۚ وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ فَلَیۡسَ مِنَ اللّٰہِ فِیۡ شَیۡءٍ اِلَّاۤ اَنۡ تَتَّقُوۡا مِنۡہُمۡ تُقٰٮۃً ؕ وَ یُحَذِّرُکُمُ اللّٰہُ نَفۡسَہٗ ؕ وَ اِلَی اللّٰہِ الۡمَصِیۡرُ ﴿۲۹﴾", "english": " Let not the believers take disbelievers for friends in preference to believers — and whoever does that has no connection with Allah — except that you cautiously guard against them. And Allah cautions you against His punishment; and to Allah is the returning.", "french": " Que les croyants ne se lient pas d’amitié avec les mécréants plutôt qu’avec les croyants – quiconque le fait n’a rien à voir avec Allāh – à moins d’être sur vos gardes contre eux. Et Allāh vous met en garde contre Son châtiment, car c’est à Allāh qu’est le retour.", "german": " Die Gläubigen sollen sich nicht Ungläubige zu Freunden nehmen vor den Gläubigen – und wer das tut, hat nichts mit Allah –, es sei denn, dass ihr euch vorsichtig vor ihnen hütet. Allah warnt euch vor Seiner Strafe, und zu Allah ist die Heimkehr.", "spanish": " Que los creyentes no tomen por amigos a los incrédulos, prefiriéndolos a los creyentes –y quien haga eso no tiene relación alguna con Al-lah- salvo que os protejáis prudentemente de ellos. Y Al-lah os advierte que no debéis tomaros libertades contra Él; y a Al-lah será el retorno.", "urdu": " مومن مومنوں کو چھوڑ کر کافروں کو دوست نہ بنائیں۔ صرف ان سے پوری طرح بچ کر رہنا تمہارے لئے جائز ہے اور (تم میں سے) جو شخص ایسا کرے اس کا اللہ سے کسی بات میں بھی (کوئی تعلق) نہ ہوگا اور اللہ تمہیں اپنے عذاب سے ڈراتا ہے اور اللہ ہی کی طرف (تمہیں) لوٹنا ہوگا۔"}, {"arabic": " قُلۡ اِنۡ تُخۡفُوۡا مَا فِیۡ صُدُوۡرِکُمۡ اَوۡ تُبۡدُوۡہُ یَعۡلَمۡہُ اللّٰہُ ؕ وَ یَعۡلَمُ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۳۰﴾", "english": " Say, ‘Whether you conceal what is in your breasts or reveal it, Allah knows it; and He knows whatever is in the heavens and whatever is in the earth. And Allah has power to do all things.’", "french": " Dis : « Que vous dissimuliez ce qui est dans vos poitrines ou que vous le dévoiliez, Allāh le sait ; et Il sait tout ce qui est dans les cieux et tout ce qui est sur la terre ; et Allāh a le pouvoir de faire tout ce qu’Il veut. »", "german": " Sprich: \"Ob ihr verbergt, was in euren Herzen ist, oder ob ihr es kundtut, Allah weiß es; Er weiß, was in den Himmeln ist und was auf Erden; und Allah hat Macht über alle Dinge.\"", "spanish": " Diles. “Tanto si ocultáis lo que hay en vuestros corazones como si lo reveláis, Al-lah lo conoce; y Él sabe todo lo que hay en los cielos y en la tierra. Y Al-lah tiene poder para hacer todas las cosas”.", "urdu": " تو (ان سے) کہہ دے (کہ) جو (کچھ) تمہارے سنیوں میں ہے اسے خواہ چھپاٶ یا اسے ظاہر کرو (بہرحال) اللہ اسے جان لے گا۔ اور جو کچھ (بھی) آسمانوں میں ہے وہ اسے اور جو کچھ زمین میں ہے اسے (بھی) جانتا ہے۔ اور اللہ ہر ایک چیز پر بڑا قادر ہے۔"}, {"arabic": " یَوۡمَ تَجِدُ کُلُّ نَفۡسٍ مَّا عَمِلَتۡ مِنۡ خَیۡرٍ مُّحۡضَرًا ۚۖۛ وَّ مَا عَمِلَتۡ مِنۡ سُوۡٓءٍ ۚۛ تَوَدُّ لَوۡ اَنَّ بَیۡنَہَا وَ بَیۡنَہٗۤ اَمَدًۢا بَعِیۡدًا ؕ وَ یُحَذِّرُکُمُ اللّٰہُ نَفۡسَہٗ ؕ وَ اللّٰہُ رَءُوۡفٌۢ بِالۡعِبَادِ ﴿٪۳۱﴾", "english": " Beware of the Day when every soul shall find itself confronted with all the good it has done and all the evil it has done. It will wish there were a great distance between it and that evil . And Allah cautions you against His punishment. And Allah is Most Compassionate to His servants.", "french": " Prenez garde au Jour où chaque âme se trouvera confrontée à tout le bien qu’elle aura fait et à tout le mal qu’elle aura fait. Elle souhaitera qu’il y ait entre elle et ce mal une longue distance. Et Allāh vous met en garde contre Son châtiment, et Allāh est Compatissant envers Ses serviteurs.", "german": " (Denkt) an den Tag, wo jeder vor sich versammelt finden wird, was er an Gutem getan und was er an Bösem getan. Wünschen wird er, dass ein großer Abstand wäre zwischen ihm und jenem (Bösen). Allah warnt euch vor Seiner Strafe. Und Allah ist mild und gütig gegen die Diener.", "spanish": " No olvidéis el Día en el que cada alma se encontrará frente a todo el bien que ha hecho y todo el mal que ha ometido. Desearía que hubiera una gran distancia entre ella y ese mal . Y Al-lah os previene de Su castigo. Y Al-lah es el Sumo Compasivo con Sus siervos", "urdu": " (اس دن سے ڈرو) جس دن ہر شخص ہر نیکی کو جو اس نے کی ہوگی (اپنے) سامنے موجود پائے گا اور جو بدی اس نے کی ہوگی اسے بھی۔ وہ خواہش کرے گا کہ کاش اس (بدی) کے اور اس کے درمیان لمبا فاصلہ ہوتا۔ اور اللہ تمہیں اپنے عذاب سے ڈراتا ہے اور اللہ بندوں پر شفقت کرنے والا ہے۔"}, {"arabic": " قُلۡ اِنۡ کُنۡتُمۡ تُحِبُّوۡنَ اللّٰہَ فَاتَّبِعُوۡنِیۡ یُحۡبِبۡکُمُ اللّٰہُ وَ یَغۡفِرۡ لَکُمۡ ذُنُوۡبَکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۳۲﴾", "english": " Say, ‘If you love Allah, follow me: then will Allah love you and forgive you your faults. And Allah is Most Forgiving, Merciful.’", "french": " Dis : « Si vous aimez Allāh, alors suivez-moi, Allāh vous aimera et vous pardonnera vos péchés, et Allāh est Très-Pardonnant, Miséricordieux. »", "german": " Sprich: \"Liebt ihr Allah, so folget mir; (dann) wird Allah euch lieben und euch eure Fehler verzeihen; denn Allah ist allverzeihend, barmherzig.\"", "spanish": " Diles: “Si amáis a Al-lah, seguidme; entonces Al-lah os amará y os perdonará vuestros pecados. Y Al-lah es el Sumo Indulgente, el Misericordioso.”", "urdu": " تو کہہ کہ (اے لوگو) اگر تم اللہ سے محبت رکھتے ہو تو میری اتباع کرو (اس صورت میں) وہ (بھی) تم سے محبت کرے گا اور تمہارے قصور تمہیں بخش دے گا اور اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " قُلۡ اَطِیۡعُوا اللّٰہَ وَ الرَّسُوۡلَ ۚ فَاِنۡ تَوَلَّوۡا فَاِنَّ اللّٰہَ لَا یُحِبُّ الۡکٰفِرِیۡنَ ﴿۳۳﴾", "english": " Say, ‘Obey Allah and the Messenger;’ but if they turn away, then remember that Allah loves not the disbelievers.", "french": " Dis. « Obéissez à Allāh et au Messager. » Mais s’ils tournent le dos, alors souvenez-vous qu’ assurément Allāh n’aime pas les mécréants.", "german": " Sprich: \"Gehorchet Allah und dem Gesandten\"; doch wenn sie sich abkehren, dann (bedenke), dass Allah die Ungläubigen nicht liebt.", "spanish": " Diles: “Obedeced a Al-lah y al Mensajero;” pero si vuelven la espalda , recordad que Al-lah no ama a los incrédulos.", "urdu": " تو کہہ (کہ) تم اللہ اور اس رسول کی اطاعت کرو (اس پر) اگر وہ منہ پھیر لیں تو (یاد رکھو کہ) اللہ کافروں سے ہر گز محبت نہیں کرتا۔"}, {"arabic": " اِنَّ اللّٰہَ اصۡطَفٰۤی اٰدَمَ وَ نُوۡحًا وَّ اٰلَ اِبۡرٰہِیۡمَ وَ اٰلَ عِمۡرٰنَ عَلَی الۡعٰلَمِیۡنَ ﴿ۙ۳۴﴾", "english": " Allah did choose Adam and Noah and the family of Abraham and the family of ‘Imran above all peoples —", "french": " Allāh a choisi Adam et Noé et la famille d’Abraham et la famille de ‘Imrān par-dessus tous les peuples de leur époque.", "german": " Allah erwählte Adam und Noah und das Haus Abrahams und das Haus Imrâns vor den Völkern,", "spanish": " Al-lah escogió a Adán, a Noé, a la familia de Abraham y a la familia de ‘Imrán por encima de todos los pueblos.", "urdu": " اللہ نے آدم اور نوح (کو) اور ابراہیم کے خاندان اور عمران کے خاندان کو یقیناً سب جہانوں پر فضیلت دی تھی۔"}, {"arabic": " ذُرِّیَّۃًۢ بَعۡضُہَا مِنۡۢ بَعۡضٍ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿ۚ۳۵﴾", "english": " A race, co-related with one another. And Allah is All-Hearing, All-Knowing.", "french": " Une race dont les membres sont de la même famille ; et Allāh entend tout et sait tout.", "german": " ein Geschlecht, die einen von den anderen; und Allah ist allhörend, allwissend.", "spanish": " Una raza mutuamente relacionada. Y Al-lah es quien todo lo oye, el Omnisciente.", "urdu": " (اس نے) ایک ایسی نسل کو (فضیلت دی) جو ایک دوسرے سے پوری مطابقت رکھنے والی تھی اور اللہ بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " اِذۡ قَالَتِ امۡرَاَتُ عِمۡرٰنَ رَبِّ اِنِّیۡ نَذَرۡتُ لَکَ مَا فِیۡ بَطۡنِیۡ مُحَرَّرًا فَتَقَبَّلۡ مِنِّیۡ ۚ اِنَّکَ اَنۡتَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۳۶﴾", "english": " Remember when the woman of ‘Imran said, ‘My Lord, I have vowed to Thee what is in my womb to be dedicated to Thy service. So do accept it of me; verily, Thou alone art All-Hearing, All-Knowing.’", "french": " Souvenez-vous quand la femme de la famille d‘Imrān dit : « Mon Seigneur, certainement je T’ai voué ce que je porte en mon sein, il est libéré de toute entrave séculière . Donc accepte cela de ma part. En vérité, Tu es Celui Qui entend tout et Qui sait tout. »", "german": " (Denke daran) wie Imrâns Frau sprach: \"Mein Herr, ich habe Dir geweiht – als Befreiten –, was in meinem Schoße ist. So nimm (es) an von mir; wahrlich, Du allein bist der Allhörende, der Allwissende.\"", "spanish": " Y acordaos de cuando la mujer de ´Imrán dijo: “Mi Señor, Te he prometido lo que hay en mi vientre para que se consagre a Tu servicio. Acéptamelo, pues. En verdad, sólo Tú eres el que todo lo oye, el Omnisciente.", "urdu": " (یاد رکھو) جب (آل) عمران کی عورت نے کہا کہ اے میرے رب! جو کچھ میرے پیٹ میں ہے (اسے) آزاد کرکے میں نے تیری نذر کر دیا ہے۔ پس تو (اسے) میری طرف سے جس طرح ہو قبول فرما۔ یقیناً تو ہی بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " فَلَمَّا وَضَعَتۡہَا قَالَتۡ رَبِّ اِنِّیۡ وَضَعۡتُہَاۤ اُنۡثٰی ؕ وَ اللّٰہُ اَعۡلَمُ بِمَا وَضَعَتۡ ؕ وَ لَیۡسَ الذَّکَرُ کَالۡاُنۡثٰی ۚ وَ اِنِّیۡ سَمَّیۡتُہَا مَرۡیَمَ وَ اِنِّیۡۤ اُعِیۡذُہَا بِکَ وَ ذُرِّیَّتَہَا مِنَ الشَّیۡطٰنِ الرَّجِیۡمِ ﴿۳۷﴾", "english": " But when she was delivered of it, she said, ‘My Lord, I am delivered of a female’ — and Allah knew best what she had brought forth and the male she was thinking of was not like the female she had brought forth — ‘and I have named her Mary, and I commit her and her offspring to Thy protection from Satan, the rejected.’", "french": " Mais après avoir accouché d’elle, elle dit : « Mon Seigneur, j’ai mis une fille au monde » – tandis qu’Allāh savait le mieux ce dont elle avait accouché – et le garçon qu’elle attendait n’était pas comme la fille qu’elle avait mise au monde - « et je lui ai donné le nom de Marie, et je la confie ainsi que sa progéniture à Ta protection contre Satan, le renié. »", "german": " Doch als sie es geboren hatte, sprach sie: \"Mein Herr, ich habe ein Mädchen geboren\" – und Allah wusste am besten, was sie zur Welt gebracht hatte und dass der (erwartete) Knabe nicht gleich dem (geborenen) Mädchen war – \"und ich habe es Maria genannt, und ich empfehle sie und ihre Nachkommen Deiner Hut vor Satan dem Verworfenen.\"", "spanish": " Pero cuando hubo dado a luz, dijo: “Mi Señor, he dado a luz una niña” –aunque Al-lah sabía mejor que ella lo que había parido que el varón en que ella pensaba no era como la hembra que dio a luz- “y le he puesto por nombre María, y pongo a ella y a su progenie bajo Tu protección contra Satanás, el rechazado.”", "urdu": " پھر جب وہ اسے جن کر فارغ ہوئی اس نے کہا کہ اے میرے رب! میں نے تو اسے لڑکی کی شکل میں جنا ہے اور جو کچھ اس نے جنا تھا اسے اللہ (سب سے) زیادہ جانتا تھا اور (اس کا ذہنی) لڑکا (اس) لڑکی کی طرح نہیں (ہوسکتا) اور (کہا کہ) میں نے اس کا نام مریم رکھا ہے اور میں اسے اور اس کی اولاد کو مردود شیطان (کے حملہ) سے تیری پناہ میں دیتی ہوں۔"}, {"arabic": " فَتَقَبَّلَہَا رَبُّہَا بِقَبُوۡلٍ حَسَنٍ وَّ اَنۡۢبَتَہَا نَبَاتًا حَسَنًا ۙ وَّ کَفَّلَہَا زَکَرِیَّا ۚؕ کُلَّمَا دَخَلَ عَلَیۡہَا زَکَرِیَّا الۡمِحۡرَابَ ۙ وَجَدَ عِنۡدَہَا رِزۡقًا ۚ قَالَ یٰمَرۡیَمُ اَنّٰی لَکِ ہٰذَا ؕ قَالَتۡ ہُوَ مِنۡ عِنۡدِ اللّٰہِ ؕ اِنَّ اللّٰہَ یَرۡزُقُ مَنۡ یَّشَآءُ بِغَیۡرِ حِسَابٍ ﴿۳۸﴾", "english": " So her Lord accepted her with a gracious acceptance and caused her to grow an excellent growth and made Zachariah her guardian. Whenever Zachariah visited her in the chamber, he found with her provisions. He said, ‘O Mary, whence hast thou this?’ She replied, ‘It is from Allah.’ Surely, Allah gives to whomsoever He pleases without measure.", "french": " Son Seigneur accepta donc l’enfant d’une gracieuse acceptation et la fit grandir d’une belle croissance. Il la mit sous la tutelle de Zacharie. Toutes les fois que Zacharie lui rendait visite dans la chambre, il trouvait auprès d’elle des provisions. Il demanda : « Ô Marie, d’où as-tu eu cela ? » Elle répondit : « Cela vient d’Allāh. » Assurément, Allāh approvisionne sans compter qui Il veut.", "german": " So nahm ihr Herr sie gnädig an und ließ sie wachsen zu holdem Wuchs und berief den Zacharias zu ihrem Pfleger. Sooft Zacharias zu ihr in die Kammer trat, fand er Speise bei ihr. Er sprach: \"O Maria, woher hast du dies?\" Sie antwortete: \"Es ist von Allah.\" Allah gibt, wem Er will, ohne zu rechnen.", "spanish": " Y su Señor la aceptó con benevolencia y la hizo crecer con hermoso crecimiento, y convirtió a Zacarías en su tutor. Cada vez que Zacarías la visitaba en su habitación, la encontraba con provisiones. Dijo: “¡Oh, María! ¿De dónde viene todo esto?”. Ella respondió: “Procede de Al-lah.” En verdad, Al-lah da sin medida a quien Le place.", "urdu": " تب اس کے رب نے اسے بہت اچھی طرح قبول کیا اور اسے عمدہ طور پر بڑھایا اور زکریا اس کا مربی بنا۔ جب کبھی بھی زکریا گھر کے بہترین حصہ میں اس کے پاس جاتا (تو) اس کے پاس کوئی (نہ کوئی) کھانا پاتا۔ (چنانچہ ایک روز ایسا دیکھ کر) اس نے کہا کہ اے مریم! یہ تیرے لئے کہاں سے آیا ہے؟ اس نے کہا کہ اللہ کی جناب سے۔ اللہ جسے چاہتا ہے یقیناً بے حساب دیتا ہے۔"}, {"arabic": " ہُنَالِکَ دَعَا زَکَرِیَّا رَبَّہٗ ۚ قَالَ رَبِّ ہَبۡ لِیۡ مِنۡ لَّدُنۡکَ ذُرِّیَّۃً طَیِّبَۃً ۚ اِنَّکَ سَمِیۡعُ الدُّعَآءِ ﴿۳۹﴾", "english": " There and then did Zachariah pray to his Lord, saying, ‘My Lord, grant me from Thyself pure offspring; surely, Thou art the Hearer of prayer.’", "french": " Sur ce, Zacharie adressa une prière à son Seigneur en disant : « Mon Seigneur, accorde-moi de Ta part une descendance pure ; assurément Tu es Celui Qui entend les prières. »", "german": " Daselbst betete Zacharias zu seinem Herrn und sprach: \"Mein Herr, gewähre mir Du einen reinen Sprössling; wahrlich, Du bist der Erhörer des Gebets.\"", "spanish": " Allí y entonces rogó Zacarías a Su Señor, diciendo: “Mi Señor, concédeme de Ti mismo una descendencia pura; en verdad, Tú eres quien escucha la oración”.", "urdu": " تب زکریا نے اپنے رب کو پکارا (اور) کہا کہ اے میرے رب! تو مجھے (بھی) اپنی جناب سے پاک اولاد بخش۔ تو یقیناً دعاٶں کو بہت قبول کرنے والا ہے۔"}, {"arabic": " فَنَادَتۡہُ الۡمَلٰٓئِکَۃُ وَ ہُوَ قَآئِمٌ یُّصَلِّیۡ فِی الۡمِحۡرَابِ ۙ اَنَّ اللّٰہَ یُبَشِّرُکَ بِیَحۡیٰی مُصَدِّقًۢا بِکَلِمَۃٍ مِّنَ اللّٰہِ وَ سَیِّدًا وَّ حَصُوۡرًا وَّ نَبِیًّا مِّنَ الصّٰلِحِیۡنَ ﴿۴۰﴾", "english": " And the angels called to him as he stood praying in the chamber: ‘Allah gives thee glad tidings of Yahya, who shall testify to the truth of a word from Allah — noble and chaste and a Prophet, from among the righteous.’", "french": " Et les anges l’appelèrent pendant que, debout, il priait dans la chambre. « Allāh t’annonce la bonne nouvelle de Yahya qui rendra témoignage de la vérité d’une parole d’Allāh – noble, chaste et un Prophète d’entre les justes. »", "german": " Da riefen ihm die Engel zu, während er betend in der Kammer stand: \"Allah gibt dir frohe Kunde von Yahya (Johannes dem Täufer), der bestätigen soll ein Wort von Allah – edel und rein und ein Prophet, der Rechtschaffenen einer.\"", "spanish": " Y los ángeles lo llamaron mientras oraba en el aposento: “Al-lah te da la buena nueva de Yahyá, quien dará testimonio de la verdad de una palabra de Al-lah -noble y casto- y un Profeta, de entre los justos.”", "urdu": " اس پر فرشتوں نے اسے جبکہ وہ گھر کے بہترین حصہ میں نماز پڑھ رہا تھا آواز دی کہ اللہ تجھے یحیٰ کی بشارت دیتا ہے جو اللہ کی ایک بات کو پورا کرنے والا ہوگا اور (نیز) سردار اور (گناہوں سے) روکنے والا اور نیکوں میں سے (ترقی کرکے) نبی ہوگا۔"}, {"arabic": " قَالَ رَبِّ اَنّٰی یَکُوۡنُ لِیۡ غُلٰمٌ وَّ قَدۡ بَلَغَنِیَ الۡکِبَرُ وَ امۡرَاَتِیۡ عَاقِرٌ ؕ قَالَ کَذٰلِکَ اللّٰہُ یَفۡعَلُ مَا یَشَآءُ ﴿۴۱﴾", "english": " He said, ‘My Lord, how shall I have a son, when age has overtaken me, and my wife is barren?’ He answered, ‘Such is the way of Allah: He does what He pleases.’", "french": " Il dit : « Seigneur, comment aurais-je un fils alors que la vieillesse m’a atteint et que ma femme est stérile ? » Il répondit : « C’est ainsi ce que Allāh veut Il le fait. »", "german": " Er sprach: \"Mein Herr, wie soll mir ein Sohn werden, wo das Alter mich überkommen hat und mein Weib unfruchtbar ist?\" Er antwortete: \"So ist Allahs (Weg), Er tut, wie es Ihm gefällt.\"", "spanish": " Dijo: “¡Mi Señor!, ¿cómo voy a tener un hijo, si la vejez se ha poderado de mí, y mi mujer es estéril?”. Él respondió: “Así es el designio de Al-lah; Él hace lo que quiere”.", "urdu": " اس نے کہا کہ اے میرے رب مجھے (میری زندگی میں) (عمر پانے والا) لڑکا کس طرح ملے گا‘ حالانکہ مجھ پر بڑھاپا آگیا ہے اور میری بیوی بانجھ ہے۔ فرمایا اللہ ایسا ہی (قادر) ہے۔ وہ جو چاہتا ہے کرتا ہے۔"}, {"arabic": " قَالَ رَبِّ اجۡعَلۡ لِّیۡۤ اٰیَۃً ؕ قَالَ اٰیَتُکَ اَلَّا تُکَلِّمَ النَّاسَ ثَلٰثَۃَ اَیَّامٍ اِلَّا رَمۡزًا ؕ وَ اذۡکُرۡ رَّبَّکَ کَثِیۡرًا وَّ سَبِّحۡ بِالۡعَشِیِّ وَ الۡاِبۡکَارِ ﴿٪۴۲﴾", "english": " He said, ‘My Lord, appoint a token for me.’ He replied, ‘Thy token shall be that thou shalt not speak to men for three days except by signs. And remember thy Lord much and glorify Him in the evening and in the early morning.’", "french": " Il dit : « Mon Seigneur, donne-moi un signe quelconque. » Il répondit : « Ton signe sera que pendant trois jours, tu ne devras communiquer avec les hommes que par gestes. Et souviens-toi beaucoup de ton Seigneur, et glorifie- Le le soir et au petit matin. »", "german": " Er sprach: \"Mein Herr, bestimme mir ein Gebot.\" Er antwortete: \"Dein Gebot soll sein, dass du drei Tage lang nicht zu Menschen sprechen wirst, außer durch Gebärden. Gedenke fleißig deines Herrn und preise (Ihn) am Abend und am frühen Morgen.\"", "spanish": " Dijo: “Mi Señor, señálame una prueba”. Él respondió: “Tú prueba será que no hablarás a los hombres durante tres días a no ser con gestos. Y recuerda mucho a Tu Señor y glorifícale en el ocaso y en el alba”.", "urdu": " (پھر) اس نے کہا اے میرے رب! میرے لئے کوئی حکم دے۔ فرمایا کہ تجھے یہ حکم ہے کہ تو لوگو ں سے تین دن تک اشارہ کے سوا بات نہ کرے اور اپنے رب کو بہت یاد کرے اور شام اور صبح اس کی تسبیح کرے۔"}, {"arabic": " وَ اِذۡ قَالَتِ الۡمَلٰٓئِکَۃُ یٰمَرۡیَمُ اِنَّ اللّٰہَ اصۡطَفٰکِ وَ طَہَّرَکِ وَ اصۡطَفٰکِ عَلٰی نِسَآءِ الۡعٰلَمِیۡنَ ﴿۴۳﴾", "english": " And remember when the angels said, ‘O Mary, Allah has chosen thee and purified thee and chosen thee above the women of all peoples.", "french": " Et souviens-toi quand les anges dirent : « Ô Marie, Allāh t’a choisie et t’a purifiée et t’a élue d’entre toutes les femmes. »", "german": " Und (denke daran) wie die Engel sprachen: \"O Maria, Allah hat dich erwählt und dich gereinigt und dich erkoren aus den Weibern der Völker.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:43&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:43&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic44\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic44\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:44' style='text-decoration:underline'>3:44</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(44)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control44\"></i></button> <audio id=\"player44\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">یٰمَرۡیَمُ اقۡنُتِیۡ لِرَبِّکِ وَ اسۡجُدِیۡ وَ ارۡکَعِیۡ مَعَ الرّٰکِعِیۡنَ ﴿۴۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘O Mary, be obedient to thy Lord and prostrate thyself and worship <em>God alone</em> with those who worship.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘O Mary, be obedient to thy Lord and prostrate thyself and worship <i>One God </i>with those who worship <i>Him</i>.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اے مریم! اپنے ربّ کی فرمانبردار ہو جا اور سجدہ کر اور جھکنے والوں کے ہمراہ جھک جا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اے مریم! تو اپنے رب کی فرماں بردار بن اور سجدہ کر اور صرف موحدانہ پرستش کرنے والوں کے ساتھ مل کر موحدانہ پرستش کر۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">» Ô Marie, sois obéissante à ton Seigneur et prosterne-toi et incline-toi avec ceux qui s’inclinent. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡Oh, María! sé obediente a tu Señor y póstrate y adora a <em>Dios sólo</em> con los que l<em>e</em> adoran”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">O Maria, sei gehorsam deinem Herrn und wirf dich nieder und bete an mit den Anbetenden.\"", "spanish": " Y acuérdate de cuando los ángeles dijeron: “¡Oh, María!, Al-lah te ha elegido y purificado y te ha escogido sobre las mujeres de todos los pueblos”.", "urdu": " اور (اس وقت کو یاد کرو) جب ملائکہ نے کہا کہ اے مریم! اللہ نے یقیناً تجھے برگزیدہ کیا ہے اور پاک کیا ہے اور سب جہانوں کی عورتوں کے مقابلہ میں تجھے چن لیا ہے۔"}, {"arabic": " ذٰلِکَ مِنۡ اَنۡۢبَآءِ الۡغَیۡبِ نُوۡحِیۡہِ اِلَیۡکَ ؕ وَ مَا کُنۡتَ لَدَیۡہِمۡ اِذۡ یُلۡقُوۡنَ اَقۡلَامَہُمۡ اَیُّہُمۡ یَکۡفُلُ مَرۡیَمَ ۪ وَ مَا کُنۡتَ لَدَیۡہِمۡ اِذۡ یَخۡتَصِمُوۡنَ ﴿۴۵﴾", "english": " This is of the tidings of things unseen which We reveal to thee. And thou wast not with them when they cast their arrows, as to which of them should be the guardian of Mary, nor wast thou with them when they disputed with one another.", "french": " Ce sont là des nouvelles de choses inconnues que Nous te révélons. Et tu n’étais pas présent au tirage au sort quand ils ont jeté des flèches pour décider qui d’entre eux se chargerait de Marie et tu n’étais pas là non plus lorsqu’ils se disputaient. »", "german": " Dies ist eine der Verkündigungen des Ungesehenen, die Wir dir offenbaren. Du warst nicht unter ihnen, als sie [losend] ihre Pfeile warfen, wer von ihnen Marias Pfleger sein solle, noch warst du unter ihnen, als sie miteinander stritten.", "spanish": " Éste es uno de los relatos de las cosas ocultas que te revelamos. Y tú no estabas con ellos cuando lanzaron sus flechas, a fin de saber cuál de ellos sería el tutor de María, ni estabas con ellos cuando disputaron entre sí.", "urdu": " یہ غیب کی خبروں میں سے (ایک خبر) ہے جسے ہم تجھ پر وحی (کے ذریعہ سے ظاہر) کرتے ہیں۔ اور جب وہ اپنے تیروں کو (اس لئے) پھینکتے تھے کہ ان میں سے کون مریم کی خبر گیری کرے تو تو ان کے پاس نہ تھا اور نہ (ہی) تو (اس وقت) ان کے پاس تھا جب وہ جھگڑ رہے تھے۔"}, {"arabic": " اِذۡ قَالَتِ الۡمَلٰٓئِکَۃُ یٰمَرۡیَمُ اِنَّ اللّٰہَ یُبَشِّرُکِ بِکَلِمَۃٍ مِّنۡہُ ٭ۖ اسۡمُہُ الۡمَسِیۡحُ عِیۡسَی ابۡنُ مَرۡیَمَ وَجِیۡہًا فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ وَ مِنَ الۡمُقَرَّبِیۡنَ ﴿ۙ۴۶﴾", "english": " When the angels said, ‘O Mary, Allah gives thee glad tidings of a word from Him; his name shall be the Messiah, Jesus, son of Mary, honoured in this world and in the next, and of those who are granted nearness to God ;", "french": " Quand les anges dirent : « Ô Marie, en vérité, Allāh t’annonce la bonne nouvelle d’une parole de Lui ; son nom sera le Messie Jésus, fils de Marie, honoré en ce monde et dans l’autre, et l'un d’entre les rapprochés d’Allāh .", "german": " Wie die Engel sprachen: \"O Maria, Allah gibt dir frohe Kunde durch ein Wort von Ihm: sein Name soll sein der Messias, Jesus, Sohn Marias, geehrt in dieser und in jener Welt, einer der Gottnahen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:46&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:46&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic47\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic47\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:47' style='text-decoration:underline'>3:47</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(47)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control47\"></i></button> <audio id=\"player47\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ یُکَلِّمُ النَّاسَ فِی الۡمَہۡدِ وَ کَہۡلًا وَّ مِنَ الصّٰلِحِیۡنَ ﴿۴۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And he shall speak to the people in the cradle and when of middle age, and he shall be of the righteous.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And <sup class='ref'>[<a class='ref' data-id='ref_3_47_a' href='#'>a</a>]</sup>he shall speak to the people in the cradle<sup class='ref'>[<a class='ref' data-id='ref_3_47_418A' href='#'>418A</a>]</sup>and when of middle age,<sup class='ref'>[<a class='ref' data-id='ref_3_47_418B' href='#'>418B</a>]</sup>and he shall be of the righteous. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_47_a'>a</span><span class='collapsible plus' data-id='ref_3_47_418A'>418A</span><span class='collapsible plus' data-id='ref_3_47_418B'>418B</span></div> <div><div class='reference' data-id='ref_3_47_a' style='display:none'> <p><b>a.</b> <a href='/quran/5:111' target=_blank>5:111</a>. (<a href='javascript:void(0)' data-id='ref_3_47_a' class='ref'>close</a>)</p> </div> </div><div><a name='418A'></a><div class='reference' data-id='ref_3_47_418A' style='display:none'> <p><b>418A.</b> Primary meaning of the word <i>Mahd </i>is the state or period of preparation when one is, as it were, being prepared and made smooth for the duties of ripe age. The fact that the two periods of <i>Kuhulah </i>and <i>Mahd </i>have been mentioned together shows that there is no intervening period between them. The entire period before <i>Kuhulah </i>(middle age) is <i>Mahd</i>. (<a href='javascript:void(0)' data-id='ref_3_47_418A' class='ref'>close</a>)</p> </div> </div><div><a name='418B'></a><div class='reference' data-id='ref_3_47_418B' style='display:none'> <p><b>418B.</b> <i>Kahl </i>means, one of middle age or of the age when one’s hair becomes intermixed with hoariness; or it means, one who is between thirty or thirty-four and fifty-one years of age or between 40 and 51 (Lane &amp; Tha‘labi).</p><p>That Jesus spoke words of wisdom in his childhood has nothing miraculous or supernatural about it. Many intelligent and well brought up children speak like that. The whole sentence means that he would speak to people words full of extraordinary wisdom and spiritual knowledge, much beyond his years and experience, both in the period of preparation which is youth and in his middle age. The reference to the two distinct periods of Jesus’s life may also be taken to hint that his speaking in the latter period would be of a different nature from that in the former. In the latter period he would speak to men as a Prophet of God. Thus the glad tidings given to Mary consisted in the fact that Jesus was not only destined to be an intelligent young man but was also to live to a ripe old age as a righteous servant of God. (<a href='javascript:void(0)' data-id='ref_3_47_418B' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور وہ لوگوں سے کلام کرے گا پنگھوڑے میں اور ادھیڑ عمر میں اور پاکبازوں میں سے ہوگا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور پنگھوڑے (یعنی چھوٹی عمر) میں بھی لوگوں سے باتیں کرے گا اور ادھیڑ عمر ہونے کی حالت میں (بھی) نیک لوگوں میں سے ہوگا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et il parlera aux hommes dans le berceau et <em>aussi quand il sera</em> à l’âge mûr, et il sera du nombre des justes. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y hablará a los hombres desde la cuna y en la madurez, y estará entre los justos.”</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und er wird zu den Menschen in der Wiege reden und im Mannesalter und der Rechtschaffenen einer sein.\"", "spanish": " Cuando los ángeles dijeron: “¡Oh, María! Al-lah te anuncia la buena nueva de una palabra procedente de Él; su nombre será el Mesías, Jesús, hijo de María, honrado en este mundo y en el otro, y que será de aquellos a quienes se concede la proximidad a Dios;", "urdu": " (پھر اس وقت کو یاد کر) جب فرشتوں نے کہا تھا کہ اے مریم! اللہ تجھے اپنے کلام کے ذریعہ سے (ایک لڑکے کی) بشارت دیتا ہے اس (مُبَشَّر) کا نام مسیح عیسیٰ ابن مریم ہوگا جو (اس) دنیا اور آخرت میں صاحب منزلت ہوگا اور (خدا کے) مقربوں میں سے ہوگا۔"}, {"arabic": " قَالَتۡ رَبِّ اَنّٰی یَکُوۡنُ لِیۡ وَلَدٌ وَّ لَمۡ یَمۡسَسۡنِیۡ بَشَرٌ ؕ قَالَ کَذٰلِکِ اللّٰہُ یَخۡلُقُ مَا یَشَآءُ ؕ اِذَا قَضٰۤی اَمۡرًا فَاِنَّمَا یَقُوۡلُ لَہٗ کُنۡ فَیَکُوۡنُ ﴿۴۸﴾", "english": " She said, ‘My Lord, how shall I have a son, when no man has touched me?’ He said, “Such is the way of Allah, He creates what He pleases. When He decrees a thing, He says to it, ‘Be!’ and it is.", "french": " Elle dit : « Mon Seigneur, comment pourrai-je avoir un fils, alors qu’aucun homme ne m’a touchée ? » Il répondit : « C’est ainsi qu’Allāh crée ce qu’Il veut. Lorsqu’Il décide d’une chose, Il lui dit simplement « Sois, » et elle commence à être.", "german": " Sie sprach: \"Mein Herr, wie soll mir ein Sohn werden, wo mich kein Mann berührt hat?\" Er sprach: «So ist Allahs (Weg), Er schafft, was Ihm gefällt. Wenn Er ein Ding beschließt, so spricht Er zu ihm: \"Sei!\", und es ist.", "spanish": " Ella dijo: “Mi Señor, ¿cómo voy a tener un hijo si ningún hombre me ha tocado?”. Él dijo: “Así es el designio de Al-lah; Él crea lo que Le place. Cuando decreta una cosa, le dice: “¡Sé!” y comienza a ser, y finalmente es;", "urdu": " اس نے کہا (کہ) اے میرے رب! میرے ہاں بچہ کس طرح ہوگا۔ حالانکہ کسی بشر نے (بھی) مجھے نہیں چھوا۔ فرمایا اللہ (کاکام) ایسا ہی (ہوتا) ہے۔ وہ جو چاہتا ہے پیدا کرتا ہے (اور) جب وہ کسی بات کا فیصلہ کر لیتا ہے تو اس کے متعلق صرف یہ فرماتا ہے کہ تو وجود میں آجا۔ سو وہ وجود میں آجاتی ہے۔"}, {"arabic": " وَ یُعَلِّمُہُ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ التَّوۡرٰٮۃَ وَ الۡاِنۡجِیۡلَ ﴿ۚ۴۹﴾", "english": " “And He will teach him the Book and the Wisdom and the Torah and the Gospel;", "french": " Et Il lui enseignera le Livre et la Sagesse, et la Torah et l’Evangile ;", "german": " Und Er wird ihn das Buch lehren und die Weisheit und die Thora und das Evangelium;", "spanish": " “Y Él le enseñará el Libro, la Sabiduría, la Torah y el Evangelio”;", "urdu": " اور (یہ بھی بشارت دی کہ اللہ) اسے کتاب اور حکمت (کی باتیں) سکھائے گا اور تورات اور انجیل (سکھائے گا۔)"}, {"arabic": " وَ رَسُوۡلًا اِلٰی بَنِیۡۤ اِسۡرَآءِیۡلَ ۬ۙ اَنِّیۡ قَدۡ جِئۡتُکُمۡ بِاٰیَۃٍ مِّنۡ رَّبِّکُمۡ ۙ اَنِّیۡۤ اَخۡلُقُ لَکُمۡ مِّنَ الطِّیۡنِ کَہَیۡـَٔۃِ الطَّیۡرِ فَاَنۡفُخُ فِیۡہِ فَیَکُوۡنُ طَیۡرًۢا بِاِذۡنِ اللّٰہِ ۚ وَ اُبۡرِیٴُ الۡاَکۡمَہَ وَ الۡاَبۡرَصَ وَ اُحۡیِ الۡمَوۡتٰی بِاِذۡنِ اللّٰہِ ۚ وَ اُنَبِّئُکُمۡ بِمَا تَاۡکُلُوۡنَ وَ مَا تَدَّخِرُوۡنَ ۙ فِیۡ بُیُوۡتِکُمۡ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لَّکُمۡ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿ۚ۵۰﴾", "english": " “And will make him a Messenger to the children of Israel (to say): ‘I come to you with a Sign from your Lord, which is , that I will fashion out for you a creation out of clay after the manner of a bird, then I will breathe into it a new spirit and it will become a soaring being by the command of Allah; and I will heal the night-blind and the leprous, and I will quicken the dead, by the command of Allah; and I will announce to you what you will eat and what you will store up in your houses. Surely, therein is a Sign for you, if you be believers.", "french": " Et Il fera de lui un Messager aux Enfants d’Israël pour leur dire : 'Je viens à vous avec un Signe de la part de votre Seigneur ; je façonnerai pour vous une figure d’argile à la façon d’un oiseau ; puis, je lui insufflerai un esprit nouveau et, par la volonté d’Allāh, elle deviendra un oiseau spirituel . Je guérirai aussi les aveugles et les lépreux et je ranimerai les morts par la volonté d’Allāh ; et je vous informerai de ce que vous mangerez et de ce que vous amasserez dans vos maisons. Assurément il y a là un Signe pour vous, si vous êtes croyants.", "german": "", "spanish": " “Y lo haremos Mensajero para los Hijos de Israel (y dirá): “Vengo a vosotros con un Signo de vuestro Señor, que es éste : modelaré para vosotros, con barro, una criatura con forma de pájaro; luego le insuflaré un nuevo espíritu y se convertirá en un ser volador por mandato de Al-lah; y curaré al ciego y al leproso, y daré vida al muerto, por mandato de Al-lah; y os anunciaré lo que comeréis y lo que almacenaréis en vuestras casas. En verdad, he ahí un Signo para vosotros, si sois creyentes.", "urdu": " اور بنی اسرائیل کی طرف رسول (بنا کر اسے اس پیغام کے ساتھ بھیجے گا) کہ میں تمہارے پاس تمہارے رب کی طرف سے ایک نشان لے کر آیا ہوں (اور وہ یہ ہے) کہ میں تمہارے (فائدہ کے)بعض طینی خصلت رکھنے والوں سے پرندہ( کے پیداکرنے )کی طرح(مخلوق) پیدا کروں گا۔ پھر میں ان میں ایک نئی روح پھونکوں گا۔ جس پر وہ اللہ کے حکم کے ماتحت اڑنے والے ہو جائیں گے اور میں اللہ کے حکم کے ماتحت اندھے کو اور مبروص کو اچھا کروں گا اور مردوں کو زندہ کروں گا اور جو کچھ تم کھاٶ گے اور جو کچھ تم اپنے گھروں میں جمع کرو گے اس کی تمہیں خبر دوں گا (اور) اگر تم مومن ہو تو اس میں تمہارے لئے ایک نشان ہوگا۔"}, {"arabic": " وَ مُصَدِّقًا لِّمَا بَیۡنَ یَدَیَّ مِنَ التَّوۡرٰٮۃِ وَ لِاُحِلَّ لَکُمۡ بَعۡضَ الَّذِیۡ حُرِّمَ عَلَیۡکُمۡ وَ جِئۡتُکُمۡ بِاٰیَۃٍ مِّنۡ رَّبِّکُمۡ ۟ فَاتَّقُوا اللّٰہَ وَ اَطِیۡعُوۡنِ ﴿۵۱﴾", "english": " ‘And I come fulfilling that which is before me, namely, the Torah; and to allow you some of that which was forbidden you; and I come to you with a Sign from your Lord; so fear Allah and obey me.", "french": " ‘Et je viens pour accomplir ce qui m’a précédé dans la Torah, et pour vous autoriser une partie de ce qui vous était interdit ; et je viens à vous avec un Signe de votre Seigneur. Craignez donc Allāh et obéissez-moi.", "german": " Und (ich komme) das zu erfüllen, was vor mir war, nämlich die Thora, und euch einiges zu erlauben von dem, was euch verboten war; und ich komme zu euch mit einem Zeichen von eurem Herrn; so fürchtet Allah und gehorchet mir.", "spanish": " “Y vengo a cumplir lo que me ha precedido, esto es, la Torah; y para permitiros parte de lo que os fue prohibido; y vengo a vosotros con un Signo de vuestro Señor; temed pues a Al-lah y obedecedme”;", "urdu": " اور (میں اس وحی کو) جو مجھ سے پہلے (آچکی) ہے یعنی تورات اس کو پورا کرنے والا (بن کر آیا) ہوں۔ اور اس لئے (آیا ہوں) کہ بعض ایسی چیزیں جو تمہارے لئے حرام قرار دے دی گئی تھیں‘ تمہارے لئے حلال کردوں اور میں تمہارے پاس تمہارے رب کی طرف سے ایک نشان لیکر آیا ہوں اس لئے تم اللہ کا تقویٰ اختیار کرو اور میری اطاعت کرو۔"}, {"arabic": " اِنَّ اللّٰہَ رَبِّیۡ وَ رَبُّکُمۡ فَاعۡبُدُوۡہُ ؕ ہٰذَا صِرَاطٌ مُّسۡتَقِیۡمٌ ﴿۵۲﴾", "english": " ‘Surely, Allah is my Lord and your Lord; so worship Him: this is the right path.’ ”", "french": " Assurément, Allāh est mon Seigneur et votre Seigneur ; adorez-Le donc : voilà un droit chemin.’ »", "german": " Wahrlich, Allah ist mein Herr und euer Herr; so betet Ihn an: dies ist der gerade Weg.\"»</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:52&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:52&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic53\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic53\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:53' style='text-decoration:underline'>3:53</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(53)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control53\"></i></button> <audio id=\"player53\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَلَمَّاۤ اَحَسَّ عِیۡسٰی مِنۡہُمُ الۡکُفۡرَ قَالَ مَنۡ اَنۡصَارِیۡۤ اِلَی اللّٰہِ ؕ قَالَ الۡحَوَارِیُّوۡنَ نَحۡنُ اَنۡصَارُ اللّٰہِ ۚ اٰمَنَّا بِاللّٰہِ ۚ وَ اشۡہَدۡ بِاَنَّا مُسۡلِمُوۡنَ ﴿۵۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And when Jesus perceived their disbelief, he said, ‘Who will be my helpers in the cause of Allah?’ The disciples answered, ‘We are the helpers of Allah. We have believed in Allah. And bear thou witness that we are obedient.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And when Jesus perceived their disbelief, he said, <sup class='ref'>[<a class='ref' data-id='ref_3_53_c' href='#'>c</a>]</sup>‘Who will be my helpers in the cause of Allah?’ The disciples answered, ‘We are the helpers<sup class='ref'>[<a class='ref' data-id='ref_3_53_422' href='#'>422</a>]</sup> of Allah. We have believed in Allah. And bear thou witness that we are obedient; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_53_c'>c</span><span class='collapsible plus' data-id='ref_3_53_422'>422</span></div> <div><div class='reference' data-id='ref_3_53_c' style='display:none'> <p><b>c.</b> <a href='/quran/5:112' target=_blank>5:112</a>; <a href='/quran/61:15' target=_blank>61:15</a>. (<a href='javascript:void(0)' data-id='ref_3_53_c' class='ref'>close</a>)</p> </div> </div><div><a name='422'></a><div class='reference' data-id='ref_3_53_422' style='display:none'> <p><b>422.</b> <i>Hawariyyun </i>is the plural of <i>Hawariyy </i>which means, (1) a washerman; (2) one tried and found to be free from vice or fault (3) a person of pure and unsullied character; (4) one who advises or counsels or acts honestly and faithfully; (5) a true and sincere friend or helper; (6) a select friend and helper of a Prophet (Lane &amp; Mufradat). (<a href='javascript:void(0)' data-id='ref_3_53_422' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس جب عیسیٰ نے اُن میں انکار (کا رجحان) محسوس کیا تو اس نے کہا کون اللہ کی طرف (بلانے میں) میرے انصار ہوں گے؟ حواریوں نے کہا ہم اللہ کے انصار ہیں، ہم اللہ پر ایمان لے آئے ہیں اور تُو گواہ بن جا کہ ہم فرمانبردار ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پھر جب عیسیٰ نے ان کی طرف سے انکار دیکھا تو کہا کہ اللہ کے لئے کون (لوگ) میرے مددگار بنتے ہیں۔ حواریوں نے کہا کہ ہم اللہ کے (دین کے) مددگار ہیں۔ ہم اللہ پر ایمان رکھتے ہیں اور تو گواہ رہ کہ ہم فرماں بردار ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et lorsque Jésus s’aperçut de leur <em>tendance pour l’</em>incroyance, il dit : « Qui <em>d’entre vous</em> seront mes aides dans la cause d’Allāh ? » Les disciples <em>lui</em> répondirent : « Nous sommes les aides d’Allāh. Nous avons cru en Allāh et sois témoin de notre soumission <em>à Sa volonté</em>.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Mas cuando Jesús se dio cuenta de su incredulidad, dijo: “¿Quiénes serán mis colaboradores en la causa de Al-lah?”. Los discípulos respondieron: “Nosotros somos los colaboradores de Al-lah. Hemos creído en Al-lah y te ponemos por testigo de que somos obedientes;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Als Jesus dann ihren Unglauben wahrnahm, sprach er: \"Wer will mein Helfer sein in Allahs Sache?\" Die Jünger antworteten: \"Wir sind Allahs Helfer. Wir glauben an Allah. Und bezeuge du, dass wir gehorsam sind.", "spanish": " “En verdad, Al-lah es mi Señor y vuestro Señor; adoradle, pues: éste es el camino recto”.", "urdu": " اللہ یقیناً میرا (بھی) رب (ہے) اور تمہارا (بھی) رب ہے۔ سو تم اس کی عبادت کرو۔ یہ سیدھا راستہ ہے۔"}, {"arabic": " رَبَّنَاۤ اٰمَنَّا بِمَاۤ اَنۡزَلۡتَ وَ اتَّبَعۡنَا الرَّسُوۡلَ فَاکۡتُبۡنَا مَعَ الشّٰہِدِیۡنَ ﴿۵۴﴾", "english": " ‘Our Lord, we believe in that which Thou hast sent down and we follow this Messenger. So write us down among those who bear witness.’", "french": " Notre Seigneur, nous croyons en ce que Tu as fait descendre et nous suivons le Messager. Inscris-nous donc au nombre des témoins. »", "german": " Unser Herr, wir glauben an das, was Du herabgesandt hast, und wir folgen diesem Gesandten. So schreibe uns ein unter die Bezeugenden.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:54&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:54&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic55\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic55\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:55' style='text-decoration:underline'>3:55</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(55)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control55\"></i></button> <audio id=\"player55\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَکَرُوۡا وَ مَکَرَ اللّٰہُ ؕ وَ اللّٰہُ خَیۡرُ الۡمٰکِرِیۡنَ ﴿٪۵۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And they planned, and Allah <em>also</em> planned; and Allah is the Best of planners.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And <sup class='ref'>[<a class='ref' data-id='ref_3_55_a' href='#'>a</a>]</sup><i>Jesus’s enemies </i>planned and Allah <i>also </i>planned, and Allah is the Best of planners.<sup class='ref'>[<a class='ref' data-id='ref_3_55_423' href='#'>423</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_55_a'>a</span><span class='collapsible plus' data-id='ref_3_55_423'>423</span></div> <div><div class='reference' data-id='ref_3_55_a' style='display:none'> <p><b>a.</b> <a href='/quran/8:31' target=_blank>8:31</a>; <a href='/quran/27:51' target=_blank>27:51</a>. (<a href='javascript:void(0)' data-id='ref_3_55_a' class='ref'>close</a>)</p> </div> </div><div><a name='423'></a><div class='reference' data-id='ref_3_55_423' style='display:none'> <p><b>423.</b> The Jews had planned that Jesus should die an accursed death on the Cross (Deut. 21:&zwnj;24), but God’s plan was that he should be saved from that death. The plan of the Jews miscarried and God’s plan was successful, because Jesus did not die on the Cross but came down from it alive, and died a natural death in Kashmir, full of years, and far away from the scene of his crucifixion. (<a href='javascript:void(0)' data-id='ref_3_55_423' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور انہوں نے (یعنی مسیح کے منکروں نے بھی) تدبیر کی اور اللہ نے بھی تدبیر کی۔ اور اللہ تدبیر کرنے والوں میں بہترین ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور انہوں نے (یعنی مسیح کے دشمنوں نے) بھی تدبیریں کیں اور اللہ نے بھی تدبیریں کیں اور اللہ سب تدبیر کرنے والوں سے بہتر تدبیر کرنے والا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Alors <em>les ennemis de Jésus</em> firent une machination et Allāh<em>aussi</em> fit un plan. Et Allāh est plus habile <em>que tout autre</em> à faire des plans.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">E intrigaron, y Al-lah <em>también</em> hizo Sus planes; pues Al-lah es el que mejor sabe hacer planes.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und sie planten, auch Allah plante; und Allah ist der beste Planer.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:55&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:55&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic56\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic56\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:56' style='text-decoration:underline'>3:56</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(56)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control56\"></i></button> <audio id=\"player56\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِذۡ قَالَ اللّٰہُ یٰعِیۡسٰۤی اِنِّیۡ مُتَوَفِّیۡکَ وَ رَافِعُکَ اِلَیَّ وَ مُطَہِّرُکَ مِنَ الَّذِیۡنَ کَفَرُوۡا وَ جَاعِلُ الَّذِیۡنَ اتَّبَعُوۡکَ فَوۡقَ الَّذِیۡنَ کَفَرُوۡۤا اِلٰی یَوۡمِ الۡقِیٰمَۃِ ۚ ثُمَّ اِلَیَّ مَرۡجِعُکُمۡ فَاَحۡکُمُ بَیۡنَکُمۡ فِیۡمَا کُنۡتُمۡ فِیۡہِ تَخۡتَلِفُوۡنَ ﴿۵۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">When Allah said, ‘O Jesus, I will cause thee to die <em>a natural death</em> and will exalt thee to Myself, and will clear thee from <em>the charges of</em> those who disbelieve, and will place those who follow thee above those who disbelieve, until the Day of Resurrection; then to Me shall be your return, and I will judge between you concerning that wherein you differ.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <i>Remember the time </i>when Allah said, ‘O Jesus, <sup class='ref'>[<a class='ref' data-id='ref_3_56_b' href='#'>b</a>]</sup>I will cause thee to die<sup class='ref'>[<a class='ref' data-id='ref_3_56_424' href='#'>424</a>]</sup> <i>a natural death </i>and <sup class='ref'>[<a class='ref' data-id='ref_3_56_a' href='#'>a</a>]</sup>will raise<sup class='ref'>[<a class='ref' data-id='ref_3_56_424A' href='#'>424A</a>]</sup> thee to Myself, and will clear thee <i>of the charges </i>of those who disbelieve, and will exalt<sup class='ref'>[<a class='ref' data-id='ref_3_56_424B' href='#'>424B</a>]</sup> those who follow thee above those who disbelieve, until the Day of Resurrection; <sup class='ref'>[<a class='ref' data-id='ref_3_56_c' href='#'>c</a>]</sup>then to Me shall be your return, and I will judge between you concerning that wherein you differ. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_56_b'>b</span><span class='collapsible plus' data-id='ref_3_56_424'>424</span><span class='collapsible plus' data-id='ref_3_56_a'>a</span><span class='collapsible plus' data-id='ref_3_56_424A'>424A</span><span class='collapsible plus' data-id='ref_3_56_424B'>424B</span><span class='collapsible plus' data-id='ref_3_56_c'>c</span></div> <div><div class='reference' data-id='ref_3_56_b' style='display:none'> <p><b>b.</b> <a href='/quran/3:194' target=_blank>3:194</a>; <a href='/quran/4:16' target=_blank>4:16</a>; <a href='/quran/7:127' target=_blank>7:127</a>; <a href='/quran/8:51' target=_blank>8:51</a>; <a href='/quran/10:47' target=_blank>10:47</a>, <a href='/quran/10:105' target=_blank>105</a>; <a href='/quran/12:102' target=_blank>12:102</a>; <a href='/quran/13:141' target=_blank>13:141</a>; <a href='/quran/16:29' target=_blank>16:29</a>, <a href='/quran/16:33' target=_blank>33</a>; <a href='/quran/22:6' target=_blank>22:6</a>; <a href='/quran/39:43' target=_blank>39:43</a>; <a href='/quran/40:68' target=_blank>40:68</a>, <a href='/quran/40:78' target=_blank>78</a>; <a href='/quran/47:28' target=_blank>47:28</a> (<a href='javascript:void(0)' data-id='ref_3_56_b' class='ref'>close</a>)</p> </div> </div><div><a name='424'></a><div class='reference' data-id='ref_3_56_424' style='display:none'> <p><b>424.</b> <i>Mutawaffi </i>is derived from <i>Tawaffa</i>. They say <i>Tawaffallahu Zaidan</i>, i.e. God took away the soul of Zaid, namely He caused him to die. When God is the subject and a human being the object, <i>Tawaffa </i>has no other meaning than that of taking away the soul, whether in sleep or death. Ibn-e-‘Abbas has translated <i>Mutawaffi-ka </i>as <i>Mumitu-ka</i>, i.e. I will cause thee to die (Bukhari). Similarly, Zamakhshari, an Arab linguist of great repute, says: \" Mutawaffi-ka means, I will protect thee from being killed by the people and will grant thee full lease of life ordained for thee, and will cause thee to die a natural death, not being killed\" (Kashshaf). In fact, all Arabic lexicographers are agreed on the point that the word <i>Tawaffa </i>as used in the aforesaid manner, can bear no other interpretation and not a single instance from the whole Arabic literature can be cited of this word having been used in any other sense. Outstanding scholars and Commentators like (I) Ibn-e-‘Abbas, (2) <i>Imam </i>Malik, (3) <i>Imam </i>Bukhari, (4) <i>Imam </i>Ibn-e-Hazm, (5) <i>Imam </i>Ibn-e-Qayyim, (6) Qatadah, (7) Wahhab and others are of the same view (Bukhari, ch. on <i>Tafsir</i>; Bukhari, ch. on <i>Bad’ul Khalq</i>; Bihar; Al-Muhalla, Ma‘ad, p. 19; Manthur ii; Kathir). The word has been used in no less than 25 different places in the Qur’an and in no less than 23 of them the meaning is to take away the soul at the time of death. Only in two places the meaning is to take away the soul at the time of sleep; but here the qualifying word \"sleep\" or \"night\" has been added (<a href='/quran/6:61' target=_blank>6:61</a>; <a href='/quran/39:43' target=_blank>39:43</a>). The fact cannot be denied that Jesus is dead. The Holy Prophet is reported to have said, \"Had Moses and Jesus now been alive, they would have found themselves forced to follow me\" (Kathir). He even fixed the age of Jesus at 120 years (‘Ummal). The Qur’an, in as many as 30 verses, has completely demolished the absurd belief of the physical ascension of Jesus to, and his supposed life in, heaven. (<a href='javascript:void(0)' data-id='ref_3_56_424' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_3_56_a' style='display:none'> <p><b>a.</b> <a href='/quran/4:159' target=_blank>4:159</a>; <a href='/quran/7:177' target=_blank>7:177</a>; <a href='/quran/19:58' target=_blank>19:58</a>. (<a href='javascript:void(0)' data-id='ref_3_56_a' class='ref'>close</a>)</p> </div> </div><div><a name='424A'></a><div class='reference' data-id='ref_3_56_424A' style='display:none'> <p><b>424A.</b> <i>Raf</i>‘ signifies raising the status and rank of a person and honouring him. When the <i>Raf</i>‘ of a man is spoken of as being towards God, the meaning is invariably his spiritual ascension, because God not being material or confined to any place, no physical ascension to Him is possible. The word has been used in the Qur’an in this sense (<a href='/quran/24:37' target=_blank>24:37</a> &amp; <a href='/quran/35:11' target=_blank>35:11</a>). The raising of Jesus is mentioned in the verse under comment in reply to the false claim of the Jews that he died an accursed death on the Cross. (<a href='javascript:void(0)' data-id='ref_3_56_424A' class='ref'>close</a>)</p> </div> </div><div><a name='424B'></a><div class='reference' data-id='ref_3_56_424B' style='display:none'> <p><b>424B.</b> <i>Ja‘ala </i>means, he made; he prepared or made; he appointed; he pronounced; he exalted (<a href='/quran/2:144' target=_blank>2:144</a>); he held, etc. (Lane). (<a href='javascript:void(0)' data-id='ref_3_56_424B' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_3_56_c' style='display:none'> <p><b>c.</b> <a href='/quran/5:49' target=_blank>5:49</a>; <a href='/quran/6:165' target=_blank>6:165</a>; <a href='/quran/11:24' target=_blank>11:24</a>; <a href='/quran/31:16' target=_blank>31:16</a>; <a href='/quran/39:8' target=_blank>39:8</a>. (<a href='javascript:void(0)' data-id='ref_3_56_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">جب اللہ نے کہا اے عیسیٰ! یقیناً میں تجھے وفات دینے والا ہوں اور اپنی طرف تیرا رفع کرنے والا ہوں اور تجھے ان لوگوں سے نتھار کر الگ کرنے والا ہوں جو کافر ہوئے، اور ان لوگوں کو جنہوں نے تیری پیروی کی ہے ان لوگوں پر جنہوں نے انکار کیا ہے قیامت کے دن تک بالادست کرنے والا ہوں۔ پھر میری ہی طرف تمہارا لوٹ کر آنا ہے جس کے بعد میں تمہارے درمیان اُن باتوں کا فیصلہ کروں گا جن میں تم اختلاف کیا کرتے تھے۔ </span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اس وقت کو یاد کرو) جب اللہ نے کہا۔ اے عیسیٰ! میں تجھے (طبعی طور پر) وفات دوں گا اور تجھے اپنے حضور عزت بخشوں گا اور کافروں (کے الزامات) سے تجھے پاک کروں گا اور جو تیرے پیرو ہیں انہیں ان لوگوں پر جو منکر ہیں قیامت کے دن تک غالب رکھوں گا۔ پھر میری ہی طرف تمہیں لوٹنا ہوگا۔ تب میں ان باتوں میں جن میں تم اختلاف کرتے ہو تمہارے درمیان فیصلہ کروں گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Lorsqu’Allāh dit : « Ô Jésus, Je te ferai mourir<em>de mort naturelle</em> et Je t’élèverai à Moi et Je te laverai <em> des accusations</em> de ceux qui n’ont pas cru et Je mettrai ceux qui te suivent au-dessus des mécréants jusqu’au Jour de la Résurrection ; puis c’est vers Moi que sera votre retour et Je jugerai entre vous concernant ce sur quoi vous étiez en désaccord.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Cuando Al-lah dijo: “¡Oh, Jesús! te haré morir<em>de muerte natural y</em> te ensalzaré hasta Mí mismo, librándote <em>de las acusaciones</em> de los incrédulos, y colocaré a los que te siguen por encima de los incrédulos, hasta el Día de la Resurrección; entonces volveréis a Mí y Yo os juzgaré respecto a vuestras diferencias.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wie Allah sprach: \"O Jesus, Ich will dich [eines natürlichen Todes] sterben lassen und will dir bei Mir Ehre verleihen und dich reinigen (von den Anwürfen) derer, die ungläubig sind, und will die, die dir folgen, über jene setzen, die ungläubig sind, bis zum Tage der Auferstehung: dann ist zu Mir eure Wiederkehr, und Ich will richten zwischen euch über das, worin ihr uneins seid.", "spanish": " “Señor nuestro, creemos en lo que Tú has revelado y seguimos a este Mensajero. Inscríbenos, pues, entre los que son testigos.”", "urdu": " اے ہمارے رب! جو کچھ تو نے اتارا ہے اس پر ہم ایمان لے آئے ہیں اور ہم اس رسول کے متبع ہو گئے ہیں۔ اس لئے تو ہمیں گواہوں میں لکھ لے۔"}, {"arabic": " فَاَمَّا الَّذِیۡنَ کَفَرُوۡا فَاُعَذِّبُہُمۡ عَذَابًا شَدِیۡدًا فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۫ وَ مَا لَہُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿۵۷﴾", "english": " ‘Then as for those who disbelieve, I will punish them with a severe punishment in this world and in the next, and they shall have no helpers.", "french": " Alors, quant aux mécréants, Je leur ferai subir un châtiment rigoureux en ce monde et dans l’autre et personne ne leur viendra en aide.", "german": " Was nun die Ungläubigen anlangt, so will Ich ihnen strenge Strafe auferlegen in dieser und in jener Welt, und sie sollen keine Helfer finden.", "spanish": " “Y en cuanto a los incrédulos, los castigaré con un severo castigo en este mundo y en el futuro, y no tendrán quien les ayude.”", "urdu": " پس جو لوگ کافر ہیں انہیں میں اس دنیا (میں بھی) اور آخرت میں (بھی) سخت عذاب دوں گا اور ان کا کوئی بھی مددگار نہ ہوگا۔"}, {"arabic": " وَ اَمَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فَیُوَفِّیۡہِمۡ اُجُوۡرَہُمۡ ؕ وَ اللّٰہُ لَا یُحِبُّ الظّٰلِمِیۡنَ ﴿۵۸﴾", "english": " ‘And as for those who believe and do good works, He will pay them their full rewards. And Allah loves not the wrongdoers.’", "french": " Et quant à ceux qui croient et qui font de bonnes actions, Il les récompensera intégralement. Et Allāh n’aime pas les injustes. »", "german": "", "spanish": " “Y a los que creen y hacen buenas obras, Él les pagará toda su recompensa. Pues Al-lah no ama a los injustos”.", "urdu": " اور جو لوگ مومن ہیں اور انہوں نے نیک (اور مناسب حال) عمل کیے ہیں وہ انہیں ان (کے اعمال) کا اجر پورا (پورا) دے گا۔ اور اللہ ظالموں سے محبت نہیں کرتا۔"}, {"arabic": " ذٰلِکَ نَتۡلُوۡہُ عَلَیۡکَ مِنَ الۡاٰیٰتِ وَ الذِّکۡرِ الۡحَکِیۡمِ ﴿۵۹﴾", "english": " That is what We recite unto thee of the Signs and the wise Reminder.", "french": " Voilà donc ce que Nous te récitons des Signes et de la Sage Exhortation.", "german": " Das ist es, was Wir dir vortragen von den Zeichen und der weisen Ermahnung.", "spanish": " Esto es lo que te recitamos de los Signos y del sabio Recordatorio.", "urdu": " اس کو یعنی آیات اور حکمت والی تعلیم کو ہم تجھے پڑھ کر سناتے ہیں۔"}, {"arabic": " اِنَّ مَثَلَ عِیۡسٰی عِنۡدَ اللّٰہِ کَمَثَلِ اٰدَمَ ؕ خَلَقَہٗ مِنۡ تُرَابٍ ثُمَّ قَالَ لَہٗ کُنۡ فَیَکُوۡنُ ﴿۶۰﴾", "english": " Surely, the case of Jesus with Allah is like the case of Adam. He created him out of dust, then He said to him, ‘Be!,’ and he was.", "french": " Assurément, aux yeux d’Allāh, le cas de Jésus est pareil à celui d’Adam. Il le créa de la poussière ; puis Il lui dit « Sois » et il commença à être.", "german": " Wahrlich, Jesus ist vor Allah wie Adam. Er erschuf ihn aus Erde, dann sprach Er zu ihm: \"Sei!\", und er war.", "spanish": " En verdad, lo que ocurrió con Jesús ante Al-lah es como lo que ocurrió con Adán. Él lo creó del polvo, y le dijo entonces: “¡Sé!” y fue.", "urdu": " (یاد رکھو) عیسیٰ کا حال اللہ کے نزدیک یقیناً آدم کے حال کی طرح ہے اسے (یعنی آدم کو) اس نے خشک مٹی سے پیدا کیا۔ پھر اس کے متعلق کہا کہ تو وجود میں آجا تو وہ وجود میں آنے لگا۔"}, {"arabic": " اَلۡحَقُّ مِنۡ رَّبِّکَ فَلَا تَکُنۡ مِّنَ الۡمُمۡتَرِیۡنَ ﴿۶۱﴾", "english": " This is the truth from thy Lord, so be thou not of those who doubt.", "french": " Voilà donc la vérité de ton Seigneur. Ne sois donc pas du nombre de ceux qui doutent.", "german": " Die Wahrheit ist es von deinem Herrn, so sei nicht der Zweifler einer.", "spanish": " Ésta es la verdad de tu Señor, para que no seas de los que dudan.", "urdu": " یہ تیرے رب کی طرف سے حق ہے اس لئے تو شک کرنے والوں میں سے نہ بن۔"}, {"arabic": " فَمَنۡ حَآجَّکَ فِیۡہِ مِنۡۢ بَعۡدِ مَا جَآءَکَ مِنَ الۡعِلۡمِ فَقُلۡ تَعَالَوۡا نَدۡعُ اَبۡنَآءَنَا وَ اَبۡنَآءَکُمۡ وَ نِسَآءَنَا وَ نِسَآءَکُمۡ وَ اَنۡفُسَنَا وَ اَنۡفُسَکُمۡ ۟ ثُمَّ نَبۡتَہِلۡ فَنَجۡعَلۡ لَّعۡنَتَ اللّٰہِ عَلَی الۡکٰذِبِیۡنَ ﴿۶۲﴾", "english": " Now whoso disputes with thee concerning him, after what has come to thee of knowledge, say to him , ‘Come, let us call our sons and your sons, and our women and your women, and our people and your people; then let us pray fervently and invoke the curse of Allah on those who lie.’", "french": " Alors, dis à ceux qui seront en désaccord avec toi à son sujet, après ce qui t’est parvenu de la connaissance : « Venez donc, assemblons nos fils et vos fils, nos femmes et vos femmes, nos gens et vos gens ; puis prions avec ferveur et appelons les malédictions d’Allāh sur les menteurs. »", "german": " Die nun mit dir darüber streiten nach dem, was dir an Wissen ward, (zu denen) sprich: \"Kommt, lasst uns rufen unsere Söhne und eure Söhne, unsere Frauen und eure Frauen, unsere Leute und eure Leute; dann lasst uns inbrünstig beten und den Fluch Allahs herabbeschwören auf die Lügner.\"", "spanish": " Pero si alguien disputa contigo respecto a él, después de haberte llegado el conocimiento, dile: “Venid, llamemos a nuestros hijos y a los vuestros, a nuestras mujeres y a las vuestras, a nuestras gentes y a las vuestras; entonces oremos fervientemente e invoquemos la maldición de Al-lah sobre los que mienten.”", "urdu": " اب جو (شخص) تیرے پاس علم (الٰہی) کے آچکنے کے بعد تجھ سے اس کے متعلق بحث کرے تو تو (اسے) کہہ دے (کہ) آٶ ہم اپنے بیٹوں کو بلائیں اور تم اپنے بیٹوں کو‘ اور ہم اپنی عورتوں کو اور تم اپنی عورتوں کو‘ اور ہم اپنے نفوس کو اور تم اپنے نفوس کو‘ پھر گڑ گڑا کر دعا کریں اور جھوٹوں پر اللہ کی لعنت ڈالیں۔"}, {"arabic": " اِنَّ ہٰذَا لَہُوَ الۡقَصَصُ الۡحَقُّ ۚ وَ مَا مِنۡ اِلٰہٍ اِلَّا اللّٰہُ ؕ وَ اِنَّ اللّٰہَ لَہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۶۳﴾", "english": " This certainly is the true account. There is none worthy of worship save Allah; and surely, it is Allah Who is the Mighty, the Wise.", "french": " Assurément, ceci est le récit véridique. Nul n’est digne d’adoration à part Allāh. Et assurément, c’est Allāh Qui est le Puissant, le Sage.", "german": " Wahrlich, dies allein ist der wahre Bericht. Keiner ist der Anbetung würdig als Allah; und fürwahr, Allah allein ist der Allmächtige, der Allweise.", "spanish": " Ciertamente éste es el relato verídico. No hay nadie digno de ser adorado sino Al-lah; y en verdad Al-lah es el Poderoso, el Sabio.", "urdu": " یقیناً یہی سچا بیان ہے۔ اور اللہ کے سوا کوئی (بھی) پرستش کا مستحق نہیں اور یقیناً اللہ ہی غالب (اور) حکمت والا ہے۔"}, {"arabic": " فَاِنۡ تَوَلَّوۡا فَاِنَّ اللّٰہَ عَلِیۡمٌۢ بِالۡمُفۡسِدِیۡنَ ﴿٪۶۴﴾", "english": " But if they turn away, then remember that Allah knows the mischief-makers well.", "french": " Mais s’ils tournent le dos, alors souviens-toi qu’ Allāh connaît très bien les semeurs de discorde.", "german": " Doch wenn sie sich abkehren, dann (bedenke), Allah kennt die Unheilstifter wohl.", "spanish": " Pero si vuelven la espalda, recordad que Al-lah conoce bien a los malvados.", "urdu": " پھر اگر وہ پھر جائیں تو (یاد رکھیں کہ) اللہ مفسدوں کو یقیناً خوب جانتاہے۔"}, {"arabic": " قُلۡ یٰۤاَہۡلَ الۡکِتٰبِ تَعَالَوۡا اِلٰی کَلِمَۃٍ سَوَآءٍۢ بَیۡنَنَا وَ بَیۡنَکُمۡ اَلَّا نَعۡبُدَ اِلَّا اللّٰہَ وَ لَا نُشۡرِکَ بِہٖ شَیۡئًا وَّ لَا یَتَّخِذَ بَعۡضُنَا بَعۡضًا اَرۡبَابًا مِّنۡ دُوۡنِ اللّٰہِ ؕ فَاِنۡ تَوَلَّوۡا فَقُوۡلُوا اشۡہَدُوۡا بِاَنَّا مُسۡلِمُوۡنَ ﴿۶۵﴾", "english": " Say, ‘O People of the Book! come to a word equal between us and you — that we worship none but Allah, and that we associate no partner with Him, and that some of us take not others for Lords beside Allah.’ But if they turn away, then say, ‘Bear witness that we have submitted to God .’", "french": " Dis : « Ô Gens du Livre ! Venons-en à cette parole qui est commune entre vous et nous : que nous n’adorions qu’Allāh, et que nous n’acceptions personne comme Son associé, et que nous ne prenions pas les uns les autres pour seigneurs en dehors d’Allāh. » Mais s’ils tournent le dos, dites- leur : « Soyez témoins que nous nous sommes soumis à Allāh. »", "german": " Sprich: \"O Volk der Schrift (Bibel), kommt herbei zu einem Wort, das gleich ist zwischen uns und euch: dass wir keinen anbeten denn Allah und dass wir Ihm keinen Nebenbuhler zur Seite stellen und dass nicht die einen unter uns die anderen zu Herren nehmen statt Allah.\" Doch wenn sie sich abkehren, dann sprecht: \"Bezeugt, dass wir uns (Gott) ergeben haben.\"", "spanish": " Diles: “¡Oh, gente del Libro! venid a una palabra que es igual entre nosotros y vosotros: que no adoremos a nadie que no sea Al-lah, y no asociemos a nadie con Él, y que ninguno de nosotros tomemos a nadie por Señor aparte de Al-lah.” Pero si vuelven la espalda, diles: “Sed testigos de que nos hemos sometido a Dios. ”", "urdu": " تو کہہ (کہ) اے اہل کتاب (کم سے کم) ایک ایسی بات کی طرف تو آجاٶ جو ہمارے درمیان اور تمہارے درمیان برابر ہے (اور وہ یہ ہے) کہ ہم اللہ کے سوا کسی کی عبادت نہ کریں اور کسی چیز کو اس کا شریک نہ ٹھہرائیں اور نہ ہم اللہ کو چھوڑ کر آپس میں ایک دوسرے کو رب بنایا کریں۔ پھر اگر وہ پھر جائیں تو ان سے کہہ دو کہ تم گواہ رہو کہ ہم (خدا کے) فرمانبردار ہیں۔"}, {"arabic": " یٰۤاَہۡلَ الۡکِتٰبِ لِمَ تُحَآجُّوۡنَ فِیۡۤ اِبۡرٰہِیۡمَ وَ مَاۤ اُنۡزِلَتِ التَّوۡرٰٮۃُ وَ الۡاِنۡجِیۡلُ اِلَّا مِنۡۢ بَعۡدِہٖ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۶۶﴾", "english": " O People of the Book! why do you dispute concerning Abraham, when the Torah and the Gospel were not revealed till after him? Will you not then understand?", "french": " Ô Gens du Livre ! Pourquoi discutez-vous au sujet d’Abraham puisque la Torah et l’Evangile n’ont été révélés qu’après lui ? Ne comprenez-vous donc pas ?", "german": " O Volk der Schrift, warum streitet ihr über Abraham, wo die Thora und das Evangelium erst nach ihm herabgesandt wurden? Wollt ihr denn nicht begreifen?", "spanish": " ¡Oh, gente del Libro! ¿Por qué discutís acerca de Abraham, si la Torah y el Evangelio no fueron revelados sino después de él? ¿Acaso no comprenderéis?", "urdu": " اے اہل کتاب! تم ابراہیم کے بارے میں بحث کیوں کرتے ہو حالانکہ تورات اور انجیل یقیناً اس کے بعد اتاری گئی ہیں۔ پھر کیا تم سمجھتے نہیں۔"}, {"arabic": " ہٰۤاَنۡتُمۡ ہٰۤؤُلَآءِ حَاجَجۡتُمۡ فِیۡمَا لَکُمۡ بِہٖ عِلۡمٌ فَلِمَ تُحَآجُّوۡنَ فِیۡمَا لَیۡسَ لَکُمۡ بِہٖ عِلۡمٌ ؕ وَ اللّٰہُ یَعۡلَمُ وَ اَنۡتُمۡ لَا تَعۡلَمُوۡنَ ﴿۶۷﴾", "english": " Behold! you are those who disputed about that whereof you had knowledge. Why then do you now dispute about that whereof you have no knowledge at all ? Allah knows, and you know not.", "french": " Voyez ! Vous êtes ceux-là qui discutaient à propos de ce dont vous aviez quelque connaissance. Pourquoi donc discutez-vous à présent à propos de ce dont vous n’avez aucune connaissance ? Allāh sait et vous ne savez pas.", "german": " Seht doch! Ihr seid es ja, die über das stritten, wovon ihr Kenntnis hattet. Warum streitet ihr denn über das, wovon ihr durchaus keine Kenntnis habt? Allah weiß, ihr aber wisset nicht.", "spanish": " ¡Mirad! sois de los que discutíais sobre lo que ya sabíais. ¿Por ué, pues, discutís ahora de lo que desconocéis en absoluto ? Al-lah sabe y vosotros no sabéis.", "urdu": " سنو! تم وہ لوگ ہو جو ان امور کے بارہ میں بحث کرتے رہے ہو جن کا تمہیں علم تھا پھر (اب) تم کیوں ان امور کے متعلق بحث کرنے لگے ہو جن کا تمہیں کچھ (بھی) علم نہیں۔ حالانکہ اللہ جانتا ہے اور تم نہیں جانتے۔"}, {"arabic": " مَا کَانَ اِبۡرٰہِیۡمُ یَہُوۡدِیًّا وَّ لَا نَصۡرَانِیًّا وَّ لٰکِنۡ کَانَ حَنِیۡفًا مُّسۡلِمًا ؕ وَ مَا کَانَ مِنَ الۡمُشۡرِکِیۡنَ ﴿۶۸﴾", "english": " Abraham was neither a Jew nor a Christian, but he was ever inclined to God and obedient to Him , and he was not of those who associate gods with God .", "french": " Abraham n’était ni Juif ni Chrétien ; mais il était toujours incliné vers Allāh et soumis à Sa volonté ; et il n’était pas du nombre des associateurs.", "german": " Abraham war weder Jude noch Christ; doch er war immer (Gott) zugeneigt und (Ihm) gehorsam, und er war nicht der Götzendiener einer.", "spanish": " Abraham no era ni judío ni cristiano, pero fue siempre sumiso a Dios y obediente a él, y no fue de los que asocian otros dioses a Dios .", "urdu": " نہ (تو) ابراہیم یہودی تھا اور نہ نصرانی بلکہ وہ (خدا کی طرف) جھکا رہنے والا (اور) فرمانبردار تھا اور مشرکوں میں سے نہ تھا۔"}, {"arabic": " اِنَّ اَوۡلَی النَّاسِ بِاِبۡرٰہِیۡمَ لَلَّذِیۡنَ اتَّبَعُوۡہُ وَ ہٰذَا النَّبِیُّ وَ الَّذِیۡنَ اٰمَنُوۡا ؕ وَ اللّٰہُ وَلِیُّ الۡمُؤۡمِنِیۡنَ ﴿۶۹﴾", "english": " Surely, the nearest of men to Abraham are those who followed him, and this Prophet and those who believe; and Allah is the friend of believers.", "french": " Assurément, ceux qui se rapprochent le plus d’Abraham sont ceux qui l’ont suivi, ainsi que ce Prophète-ci et ceux qui croient ; et Allāh est l’Ami des croyants.", "german": " Sicherlich sind die Abraham Nächststehenden unter den Menschen jene, die ihm folgten, und dieser Prophet und die Gläubigen. Und Allah ist der Freund der Gläubigen.", "spanish": " En verdad, los más cercanos a Abraham son los hombres que lo siguieron como también este Profeta y los que creen. Y Al-lah es el amigo de los creyentes.", "urdu": " ابراہیم کے ساتھ لوگوں میں سے زیادہ تعلق رکھنے والے یقیناً (یقیناً) وہ لوگ ہیں جو اس کے پیرو ہیں اور (نیز) یہ نبی اور جو لوگ (اس پر) ایمان لائے۔ اور اللہ مومنوں کا دوست ہے۔"}, {"arabic": " وَدَّتۡ طَّآئِفَۃٌ مِّنۡ اَہۡلِ الۡکِتٰبِ لَوۡ یُضِلُّوۡنَکُمۡ ؕ وَ مَا یُضِلُّوۡنَ اِلَّاۤ اَنۡفُسَہُمۡ وَ مَا یَشۡعُرُوۡنَ ﴿۷۰﴾", "english": " A section of the People of the Book would fain lead you astray; but they lead astray none except themselves, only they perceive not.", "french": " Une partie des Gens du Livre voudraient bien vous égarer. Mais ils n’égarent qu’eux-mêmes. Seulement ils ne s’ en aperçoivent pas.", "german": " Ein Teil vom Volke der Schrift möchte euch irreleiten; doch sie leiten nur sich selber irre; allein sie begreifen es nicht.", "spanish": " A una parte de la gente del Libro les encantaría extraviaros; pero sólo se han extraviado a sí mismos, y no se dan cuenta.", "urdu": " اہل کتاب میں سے ایک گروہ آرزو رکھتا ہے کہ کاش وہ تمہیں گمراہ کر دے۔ اور وہ اپنے آپ کو ہی گمراہی میں ڈال رہے ہیں اور سمجھتے نہیں۔"}, {"arabic": " یٰۤاَہۡلَ الۡکِتٰبِ لِمَ تَکۡفُرُوۡنَ بِاٰیٰتِ اللّٰہِ وَ اَنۡتُمۡ تَشۡہَدُوۡنَ ﴿۷۱﴾", "english": " O People of the Book! why do you deny the Signs of Allah, while you are witnesses thereof ?", "french": " Ô Gens du Livre ! Pourquoi ne voulez-vous pas croire aux Signes d’Allāh, alors que vous en êtes les témoins ?", "german": " O Volk der Schrift, warum leugnet ihr die Zeichen Allahs, dieweil ihr (deren) Zeugen seid?", "spanish": " ¡Oh, gente del Libro! ¿por qué negáis los Signos de Al-lah, si sois sus testigos?", "urdu": " اے اہل کتاب! تم دیکھتے ہوئے کیوں اللہ کی آیات کا انکار کرتے ہو‘ حالانکہ تم گواہی دے چکے ہو۔"}, {"arabic": " یٰۤاَہۡلَ الۡکِتٰبِ لِمَ تَلۡبِسُوۡنَ الۡحَقَّ بِالۡبَاطِلِ وَ تَکۡتُمُوۡنَ الۡحَقَّ وَ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿٪۷۲﴾", "english": " O People of the Book! why do you confound truth with falsehood and hide the truth knowingly?", "french": " Ô Gens du Livre ! Pourquoi confondez-vous la vérité avec le mensonge et pourquoi cachez-vous la vérité sciemment ?", "german": " O Volk der Schrift, warum vermengt ihr Wahr mit Falsch und verhehlet die Wahrheit wissentlich?", "spanish": " ¡Oh, gente del Libro! ¿por qué confundís la verdad con la falsedad y ocultáis la verdad a sabiendas?", "urdu": " اے اہل کتاب! کیوں تم جانتے بوجھتے ہوئے حق کو باطل کے ساتھ ملاتے اور حق کو چھپاتے ہو۔"}, {"arabic": " وَ قَالَتۡ طَّآئِفَۃٌ مِّنۡ اَہۡلِ الۡکِتٰبِ اٰمِنُوۡا بِالَّذِیۡۤ اُنۡزِلَ عَلَی الَّذِیۡنَ اٰمَنُوۡا وَجۡہَ النَّہَارِ وَ اکۡفُرُوۡۤا اٰخِرَہٗ لَعَلَّہُمۡ یَرۡجِعُوۡنَ ﴿ۚۖ۷۳﴾", "english": " And a section of the People of the Book say, ‘Believe in that which has been revealed unto the believers, in the early part of day, and disbelieve in the latter part thereof; perchance they may return;", "french": " Et une partie des Gens du Livre disent : « Croyez à ce qui a été révélé aux croyants pendant la première partie de la journée et niez pendant la dernière partie de la journée ; il se peut qu’ils reviennent.", "german": " Ein Teil vom Volke der Schrift sagt: \"Glaubet in der ersten Hälfte des Tages an das, was den Gläubigen offenbart worden ist, und leugnet es später; vielleicht werden sie umkehren;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:73&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:73&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic74\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic74\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:74' style='text-decoration:underline'>3:74</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(74)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control74\"></i></button> <audio id=\"player74\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَا تُؤۡمِنُوۡۤا اِلَّا لِمَنۡ تَبِعَ دِیۡنَکُمۡ ؕ قُلۡ اِنَّ الۡہُدٰی ہُدَی اللّٰہِ ۙ اَنۡ یُّؤۡتٰۤی اَحَدٌ مِّثۡلَ مَاۤ اُوۡتِیۡتُمۡ اَوۡ یُحَآجُّوۡکُمۡ عِنۡدَ رَبِّکُمۡ ؕ قُلۡ اِنَّ الۡفَضۡلَ بِیَدِ اللّٰہِ ۚ یُؤۡتِیۡہِ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ وَاسِعٌ عَلِیۡمٌ ﴿ۚۙ۷۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And obey none but him who follows your religion;’ — Say, ‘Surely, the <em>true</em> guidance, the guidance of Allah, is that one may be given the like of that which has been given to you’ — ‘or they would dispute with you before your Lord.’ Say, ‘All bounty is in the hand of Allah. He gives it to whomsoever He pleases. And Allah is Bountiful, All-Knowing.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And <sup class='ref'>[<a class='ref' data-id='ref_3_74_a' href='#'>a</a>]</sup>obey none but him who follows your religion.’—Say, ‘Surely, <i>true </i>guidance—the guidance of Allah, is, that one be given the like of that which has been given to you’—‘or <sup class='ref'>[<a class='ref' data-id='ref_3_74_b' href='#'>b</a>]</sup>they would argue<sup class='ref'>[<a class='ref' data-id='ref_3_74_428A' href='#'>428A</a>]</sup> with you before your Lord.’ Say, ‘<i>All </i>grace<sup class='ref'>[<a class='ref' data-id='ref_3_74_428B' href='#'>428B</a>]</sup> is in the <sup class='ref'>[<a class='ref' data-id='ref_3_74_c' href='#'>c</a>]</sup>hand of Allah. He gives it to whomsoever He pleases. And Allah is Bountiful, All-Knowing;<sup class='ref'>[<a class='ref' data-id='ref_3_74_428C' href='#'>428C</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_74_a'>a</span><span class='collapsible plus' data-id='ref_3_74_b'>b</span><span class='collapsible plus' data-id='ref_3_74_428A'>428A</span><span class='collapsible plus' data-id='ref_3_74_428B'>428B</span><span class='collapsible plus' data-id='ref_3_74_c'>c</span><span class='collapsible plus' data-id='ref_3_74_428C'>428C</span></div> <div><div class='reference' data-id='ref_3_74_a' style='display:none'> <p><b>a.</b> <a href='/quran/2:121' target=_blank>2:121</a>. (<a href='javascript:void(0)' data-id='ref_3_74_a' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_3_74_b' style='display:none'> <p><b>b.</b> <a href='/quran/2:77' target=_blank>2:77</a>. (<a href='javascript:void(0)' data-id='ref_3_74_b' class='ref'>close</a>)</p> </div> </div><div><a name='428A'></a><div class='reference' data-id='ref_3_74_428A' style='display:none'> <p><b>428A.</b> If we are wrong in holding this view, then they should remove this misunderstanding by some Divine argument. (<a href='javascript:void(0)' data-id='ref_3_74_428A' class='ref'>close</a>)</p> </div> </div><div><a name='428B'></a><div class='reference' data-id='ref_3_74_428B' style='display:none'> <p><b>428B.</b> 'Grace' here may signify Prophethood. (<a href='javascript:void(0)' data-id='ref_3_74_428B' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_3_74_c' style='display:none'> <p><b>c.</b> <a href='/quran/57:30' target=_blank>57:30</a>. (<a href='javascript:void(0)' data-id='ref_3_74_c' class='ref'>close</a>)</p> </div> </div><div><a name='428C'></a><div class='reference' data-id='ref_3_74_428C' style='display:none'> <p><b>428C.</b> (1) The clause, <i>And obey none but him who follows your religion</i>, constitutes a continuation of the concluding clause of the preceding verse. Thereafter comes the parenthetical clause beginning with the words, <i>Say, surely true guidance—the guidance of Allah—is that one may be given the like of that which has been given to you</i>. Then comes again the speech of the Jews in the words, <i>or they would argue with you before your Lord</i>, the verse finally ending with the Divine commandment: <i>Say, </i>'<i>All bounty, etc.</i>' This style is peculiar to the Qur’an and is intended to produce a good psychological effect.</p><p>(2) According to another interpretation, only the words which in this case would be translated as \"Say, the true guidance is the guidance of Allah,\" would be considered as being parenthetical and the following words, i.e. <i>that one be given the like of that which has been given to you, ...before your Lord</i>, would be taken to form part of the speech of the Jews. (3) Yet according to a third interpretation the speech of the Jews is taken to end with the words, <i>obey none but him who follows your religion</i>, the succeeding clauses being considered to be all Divine speech. See also 'The Larger Edition of this Commentary.' (<a href='javascript:void(0)' data-id='ref_3_74_428C' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور کسی کی بات پر ایمان نہ لاؤ سوائے اس کے جو تمہارے دین کی پیروی کرے۔ تُو کہہ دے کہ یقیناً ہدایت تو اللہ ہی کی ہدایت ہے۔ یہ (ضروری نہیں) کہ کسی کو وہی کچھ دیا جائے جیسا تمہیں دیا گیا یا (اگر نہ دیا جائے تو گویا اُن کا حق ہوجائے گا کہ) وہ تمہارے ربّ کے حضور تم سے جھگڑا کریں۔ تُو کہہ دے یقیناً فضل اللہ کے ہاتھ میں ہے وہ اسے جس کو چاہتا ہے دیتا ہے اور اللہ بہت وسعت بخشنے والا (اور) دائمی علم رکھنے والا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور (کہتے ہیں کہ) اس شخص کے سوا جو تمہارے دین کی پیروی کرتا ہو کسی کی نہ مانو۔ تو کہدے (کہ) اصل ہدایت یعنی اللہ کی ہدایت تو یہ ہے کہ کسی کو ویسا ہی (کچھ) ملے جیساکہ تم کو ملا تھا یا پھر وہ تمہارے رب کے حضور تمہارے ساتھ جھگڑیں (نیز) کہدے کہ فضل تو یقیناً اللہ کے ہاتھ میں ہے۔ وہ جسے چاہتا ہے فضل بخشتا ہے اور اللہ بہت وسعت دینے والا اور بہت جاننے والا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et n’obéissez qu’à celui qui suit votre religion. » <em>Ô Prophète</em> , dis : « En vérité, la vraie direction est <em>n’importe quelle</em> direction provenant d’Allāh – <em>l’essentiel, c’est</em> que chacun reçoive <em>des enseignements</em> similaires à ce qui vous a été donné à vous - <em>les Gens du Livre</em>. Sinon, ils - <em>les croyants</em> - auraient eu le droit d’argumenter contre vous en présence de votre Seigneur. » Dis : « Toute grâce est dans la main d’Allāh. Il la donne à qui Il veut. Et Allāh est Munificent et Omniscient. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y no obedezcáis sino a quien sigue vuestra religión”. Di, <em>Oh, Profeta</em>: “En verdad, la guía es la guía de Al-lah, <em>la que El desee”</em>. Lo que es esencial es que a cada uno se le conceda <em>una enseñanza</em> similar a la que fue concedida anteriormente. De otra manera tendrían derecho a disputar con vosotros en presencia de vuestro Señor. Diles: “Toda la generosidad está en las manos de Al-lah y Él la concede a quien Le place. Y Al-lah es Magnánimo, Omnisciente;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">und gehorchet niemandem außer dem, der eure Religion befolgt.\" Sprich: \"Gewiss, die (wahre) Leitung, die Führung Allahs, besteht darin, dass einem ein Gleiches gegeben werde, wie es euch gegeben ward, oder dass sie mit euch streiten vor eurem Herrn.\" Sprich: \"Alle Huld ist in Allahs Hand. Er gewährt sie, wem Er will. Und Allah ist allgütig, allwissend.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=3:74&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=3:74&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic75\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic75\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/3:75' style='text-decoration:underline'>3:75</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(75)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control75\"></i></button> <audio id=\"player75\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">یَّخۡتَصُّ بِرَحۡمَتِہٖ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿۷۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘He chooses for His mercy whomsoever He pleases. And Allah is Lord of exceeding bounty.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘He <sup class='ref'>[<a class='ref' data-id='ref_3_75_a' href='#'>a</a>]</sup>selects for His mercy whomsoever He pleases. And Allah is the Lord of mighty grace.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_3_75_a'>a</span></div> <div><div class='reference' data-id='ref_3_75_a' style='display:none'> <p><b>a.</b> <a href='/quran/2:106' target=_blank>2:106</a>. (<a href='javascript:void(0)' data-id='ref_3_75_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">وہ اپنی رحمت کے لئے جس کو چاہے خاص کر لیتا ہے اور اللہ بہت بڑے فضل والا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">وہ جسے چاہتا ہے (اسے) اپنی رحمت کے لئے خاص کر لیتا ہے اور اللہ بڑا فضل کرنے والا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il accorde d’une façon particulière Sa miséricorde à qui Il veut. Et Allāh est le Seigneur de la grâce immense.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Él elige para Su misericordia a quien Le place. Pues Al-lah es Señor de suma generosidad”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er erwählt für Seine Barmherzigkeit, wen Er will. Und Allah ist Herr großer Huld.\"", "spanish": " Y una parte de la gente del Libro dice: “Creed al comienzo del día en lo que ha sido revelado a los creyentes y no creáis al final del mismo; tal vez así regresen”;", "urdu": " اور اہل کتاب میں سے ایک گروہ کہتا ہے کہ مومنوں پر جو کچھ نازل کیا گیا ہے اس پر دن کے ابتدائی حصہ میں تو ایمان لے آٶ اور اس کے پچھلے حصہ میں (اس سے) انکار کردو۔ شاید (اس ذریعہ سے) وہ پھر جائیں۔"}, {"arabic": " وَ مِنۡ اَہۡلِ الۡکِتٰبِ مَنۡ اِنۡ تَاۡمَنۡہُ بِقِنۡطَارٍ یُّؤَدِّہٖۤ اِلَیۡکَ ۚ وَ مِنۡہُمۡ مَّنۡ اِنۡ تَاۡمَنۡہُ بِدِیۡنَارٍ لَّا یُؤَدِّہٖۤ اِلَیۡکَ اِلَّا مَادُمۡتَ عَلَیۡہِ قَآئِمًا ؕ ذٰلِکَ بِاَنَّہُمۡ قَالُوۡا لَیۡسَ عَلَیۡنَا فِی الۡاُمِّیّٖنَ سَبِیۡلٌ ۚ وَ یَقُوۡلُوۡنَ عَلَی اللّٰہِ الۡکَذِبَ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۷۶﴾", "english": " Among the People of the Book there is he who, if thou trust him with a treasure, will return it to thee; and among them there is he who, if thou trust him with a dinar, will not return it to thee, unless thou keep standing over him. That is because they say, ‘We are not liable to blame in the matter of the unlearned;’ and they utter a lie against Allah knowingly.", "french": " Parmi les Gens du Livre se trouve celui qui, si tu lui confies un trésor, te le rendra ; et il y en a aussi qui, si tu lui confies un dinār, ne te le rendra que si tu le lui rappelles constamment. C’est parce qu’ils disent : « On ne peut aucunement nous blâmer en ce qui concerne les '‘Ummiyyīn'. » Et ils mentent contre Allāh alors qu’ils le savent.", "german": " Unter dem Volke der Schrift gibt es manchen, der, wenn du ihm einen Schatz anvertraust, ihn dir zurückgeben wird; und es gibt unter ihnen auch manchen, der, wenn du ihm einen Dinár anvertraust, ihn dir nicht zurückgeben wird, es sei denn, dass du beständig hinter ihm her bist. Dies ist, weil sie sagen: \"Wir haben keine Verpflichtung gegen die Analphabeten.\" Sie äußern wissentlich eine Lüge gegen Allah.", "spanish": " Entre la gente del Libro hay alguno que, si le confías un tesoro, te lo devolverá; y hay entre ellos alguno que, si le confías un dinar, no te lo devolverá, a menos que le apremies insistentemente. Y es porque dicen: “No se nos reprochará nada en lo que se refiere a los ignorantes”; y profieren a sabiendas una mentira contra Al-lah.", "urdu": " اور اہل کتاب میں سے (کوئی تو) ایسا ہے کہ اگر تو اسے (مال کا) ایک ڈھیر امانت کے طور پر دے دے تو وہ اسے تجھے واپس کر دے گا اور (کوئی) ان میں سے (ایسا) ہے کہ اگر تو اسے ایک دینار امانت کے طور پر دے تو وہ وہ (بھی) تجھے واپس نہ دے گا۔ سوائے اس کے کہ تو اس (کے سر) پر کھڑا رہے۔ یہ (بات) اس سبب سے ہے کہ وہ کہتے ہیں کہ ہم پر امیوں کے بارہ میں کوئی گرفت نہیں اور وہ اللہ پر جانتے (بوجھتے) ہوئے جھوٹ باندھتے ہیں۔"}, {"arabic": " بَلٰی مَنۡ اَوۡفٰی بِعَہۡدِہٖ وَ اتَّقٰی فَاِنَّ اللّٰہَ یُحِبُّ الۡمُتَّقِیۡنَ ﴿۷۷﴾", "english": " Nay, but whoso fulfils his pledge and fears God — verily, Allah loves the God-fearing.", "french": " Certes, quiconque remplit ses promesses et craint Allāh, qu’il se rassure qu’ en vérité, Allāh aime ceux qui Le craignent.", "german": " Nein! Wer aber seiner Verpflichtung nachkommt und Gott fürchtet – wahrlich, Allah liebt die Gottesfürchtigen.", "spanish": " No, pero quien cumple su promesa y teme a Dios, sepa que, en verdad, Al-lah ama a los temerosos de Dios.", "urdu": " یوں نہیں بلکہ جو شخص اپنے عہد کو پورا کرے اور تقویٰ اختیار کرے تو (وہ متقی ہے) اللہ متقیوں سے یقیناً محبت رکھتا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یَشۡتَرُوۡنَ بِعَہۡدِ اللّٰہِ وَ اَیۡمَانِہِمۡ ثَمَنًا قَلِیۡلًا اُولٰٓئِکَ لَا خَلَاقَ لَہُمۡ فِی الۡاٰخِرَۃِ وَ لَا یُکَلِّمُہُمُ اللّٰہُ وَ لَا یَنۡظُرُ اِلَیۡہِمۡ یَوۡمَ الۡقِیٰمَۃِ وَ لَا یُزَکِّیۡہِمۡ ۪ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۷۸﴾", "english": " As for those who take a paltry price in exchange for their covenant with Allah and their oaths, they shall have no portion in the life to come, and Allah will neither speak to them nor look upon them on the Day of Resurrection, nor will He purify them; and for them shall be a grievous punishment.", "french": " Ceux qui vendent à vil prix la promesse qu’ils ont faite à Allāh ainsi que leurs serments, ceux-là n’auront aucune part dans l’au-delà ; Allāh ne leur parlera pas, ni ne les regardera au Jour de la Résurrection ; Il ne les purifiera pas et il y aura pour eux un châtiment douloureux.", "german": " Jene jedoch, die einen armseligen Preis in Tausch nehmen für (ihren) Bund mit Allah und ihre Eidschwüre, sie sollen keinen Anteil haben am zukünftigen Leben, und Allah wird weder zu ihnen sprechen noch auf sie blicken am Tage der Auferstehung, noch wird Er sie reinigen; und ihnen wird schmerzliche Strafe.", "spanish": " En cuanto a los que cobran un precio ridículo a cambio de su pacto con Al-lah y sus juramentos, no tendrán parte alguna en la vida futura, y Al-lah no les hablará ni les mirará el Día de la Resurrección, ni tampoco los purificará; y sufrirán un severo castigo.", "urdu": " جو لوگ اللہ کے ساتھ اپنے عہدوں اور قسموں کے بدلے میں تھوڑی قیمت لیتے ہیں ان لوگوں کا آخرت میں کوئی حصہ نہیں ہوگا اور قیامت کے دن اللہ ان سے بات نہیں کرے گا اور نہ ان کی طرف دیکھے گا اور نہ انہیں پاک ٹھہرائے گا۔ اور ان کے لئے دردناک عذاب (مقدر) ہے۔"}, {"arabic": " وَ اِنَّ مِنۡہُمۡ لَفَرِیۡقًا یَّلۡوٗنَ اَلۡسِنَتَہُمۡ بِالۡکِتٰبِ لِتَحۡسَبُوۡہُ مِنَ الۡکِتٰبِ وَ مَا ہُوَ مِنَ الۡکِتٰبِ ۚ وَ یَقُوۡلُوۡنَ ہُوَ مِنۡ عِنۡدِ اللّٰہِ وَ مَا ہُوَ مِنۡ عِنۡدِ اللّٰہِ ۚ وَ یَقُوۡلُوۡنَ عَلَی اللّٰہِ الۡکَذِبَ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۷۹﴾", "english": " And, surely, among them is a section who twist their tongues while reciting the Book; that you may think it to be part of the Book, while it is not part of the Book. And they say, ‘It is from Allah;’ while it is not from Allah; and they utter a lie against Allah knowingly.", "french": " Et assurément il en est parmi eux qui roulent leur langue en récitant le Livre pour vous faire croire que c’est une partie du Livre, alors que ce n’est pas une partie du Livre. Et ils disent : « Cela provient d’Allāh, » alors que cela ne provient pas d’Allāh ; et ils mentent contre Allāh alors qu’ils le savent.", "german": " Und fürwahr, unter ihnen ist ein Teil, die verdrehen mit ihren Zungen die Schrift (Thora), damit ihr es als aus der Schrift vermutet, während es doch nicht aus der Schrift ist. Und sie sprechen: \"Es ist von Allah\"; und es ist doch nicht von Allah; und sie äußern wissentlich eine Lüge gegen Allah.", "spanish": " Y en verdad, entre ellos hay una parte que tuercen la lengua mientras recitan el Libro; para que penséis que es parte del Libro, aunque no lo es. Y dicen: “Esto procede de Al-lah”, siendo así que no procede de Él; y profieren a sabiendas una mentira contra Al-lah.", "urdu": " اور ان میں سے ایک گروہ یقیناً (ایسا) ہے جو اپنی زبانوں کو کتاب (یعنی تورات) کے ذریعہ سے مروڑتا ہے تا کہ تم اسے (جو وہ کہتا ہے) کتاب میں سے سمجھو حالانکہ وہ کتاب میں سے نہیں ہوتا۔ اور وہ کہتے ہیں کہ وہ اللہ کی طرف سے ہے حالانکہ وہ اللہ کی طرف سے نہیں اور وہ جانتے (بوجھتے) ہوئے اللہ پر جھوٹ باندھتے ہیں۔"}, {"arabic": " مَا کَانَ لِبَشَرٍ اَنۡ یُّؤۡتِیَہُ اللّٰہُ الۡکِتٰبَ وَ الۡحُکۡمَ وَ النُّبُوَّۃَ ثُمَّ یَقُوۡلَ لِلنَّاسِ کُوۡنُوۡا عِبَادًا لِّیۡ مِنۡ دُوۡنِ اللّٰہِ وَ لٰکِنۡ کُوۡنُوۡا رَبّٰنِیّٖنَ بِمَا کُنۡتُمۡ تُعَلِّمُوۡنَ الۡکِتٰبَ وَ بِمَا کُنۡتُمۡ تَدۡرُسُوۡنَ ﴿ۙ۸۰﴾", "english": " It is not possible for a man that Allah should give him the Book and dominion and prophethood, and then he should say to men: ‘Be servants to me and not to Allah;’ but he would say : ‘Be solely devoted to the Lord because you teach the Book and because you study it .’", "french": " Il n’est pas possible qu’un homme à qui Allāh accorderait le Livre, la Sagesse et le prophétat – nubuwwah -, dise ensuite aux gens : « Soyez mes serviteurs et non les serviteurs d’Allāh. » Il dirait plutôt, « Consacrez-vous entièrement au Seigneur, parce que vous enseignez le Livre et parce que vous l’ étudiez. »", "german": " Es geziemt einem Menschen nicht, wenn Allah ihm das Buch und die Herrschaft und Prophetentum gibt, dass er zu den Leuten spricht: \"Seid meine Diener statt Allahs\"; sondern: \"Seid einzig dem Herrn ergeben, da ihr ja die Schrift lehrt und euch (in sie) vertieft.\"", "spanish": " Es inadmisible que un hombre al que Al-lah le haya dado el Libro, la sabiduría y el Profetazgo, diga después a los hombres: “Sed siervos míos y no de Al-lah”; por el contrario debería decir: “Consagraos únicamente al Señor porque enseñáis el Libro y lo estudiáis.”", "urdu": " کسی (سچے) انسان کے شایان شان نہیں کہ اللہ تو اسے کتاب اور حکومت اور نبوت دے اور وہ (یہ) کہے (کہ) تم اللہ کو چھوڑ کر میرے بندے بن جاٶ۔ بلکہ (ایسا انسان تو یہی کہتا ہے کہ) تم خدا ہی کے ہو جاٶ کیونکہ تم کتاب (الٰہی) کی تعلیم دیتے ہو اور اس لئے کہ تم (اسے) حفظ کرتے ہو۔"}, {"arabic": " وَ لَا یَاۡمُرَکُمۡ اَنۡ تَتَّخِذُوا الۡمَلٰٓئِکَۃَ وَ النَّبِیّٖنَ اَرۡبَابًا ؕ اَیَاۡمُرُکُمۡ بِالۡکُفۡرِ بَعۡدَ اِذۡ اَنۡتُمۡ مُّسۡلِمُوۡنَ ﴿٪۸۱﴾", "english": " Nor is it possible for him that he should bid you take the angels and the Prophets for Lords. Would he enjoin you to disbelieve after you have submitted to God ?", "french": " Et ni est-il possible qu’il vous enjoigne de prendre les anges et les Prophètes pour seigneurs. Vous enjoindrait-il de ne pas croire après que vous vous soyez soumis à Allāh ?", "german": " Noch dass er euch gebieten sollte, die Engel und die Propheten zu Herren anzunehmen. Würde er euch Unglauben gebieten, nachdem ihr euch (Gott) ergeben habt?", "spanish": " Y es igualmente inadmisible que dicho hombre os ordene tomar a los ángeles y a los Profetas como “Señores”. ¿Cómo puede obligaros a ser incrédulos si ya os habéis sometido a Dios?", "urdu": " اور نہ (ہی اس کے لئے) یہ (ممکن ہے) کہ تمہیں یہ ہدایت دے کہ فرشتوں اور نبیوں کو رب بنالو۔ کیا تمہارے مسلمان ہو جانے کے بعد وہ تمہیں کفر (اختیار کرنے) کی تعلیم دے گا۔"}, {"arabic": " وَ اِذۡ اَخَذَ اللّٰہُ مِیۡثَاقَ النَّبِیّٖنَ لَمَاۤ اٰتَیۡتُکُمۡ مِّنۡ کِتٰبٍ وَّ حِکۡمَۃٍ ثُمَّ جَآءَکُمۡ رَسُوۡلٌ مُّصَدِّقٌ لِّمَا مَعَکُمۡ لَتُؤۡمِنُنَّ بِہٖ وَ لَتَنۡصُرُنَّہٗ ؕ قَالَ ءَاَقۡرَرۡتُمۡ وَ اَخَذۡتُمۡ عَلٰی ذٰلِکُمۡ اِصۡرِیۡ ؕ قَالُوۡۤا اَقۡرَرۡنَا ؕ قَالَ فَاشۡہَدُوۡا وَ اَنَا مَعَکُمۡ مِّنَ الشّٰہِدِیۡنَ ﴿۸۲﴾", "english": " And remember the time when Allah took a covenant from the people through the Prophets, saying : ‘Whatever I give you of the Book and Wisdom and then there comes to you a Messenger, fulfilling that which is with you, you shall believe in him and help him.’ And He said: ‘Do you agree, and do you accept the responsibility which I lay upon you in this matter ?’ They said, ‘We agree;’ He said, ‘Then bear witness, and I am with you among the witnesses.’", "french": " Et souvenez-vous lorsqu’Allāh prit un engagement avec le peuple par l’intermédiaire des Prophètes, en disant : « Quoi que Je vous donne du Livre et de la Sagesse, quand un Messager viendra à vous, accomplissant ce qui est avec vous, vous croirez en lui et vous l’aiderez. » Puis Il dit : « Êtes-vous d’accord et acceptez-vous la responsabilité que Je vous impose à cet égard ? » Ils répondirent : « Nous acceptons. » Il dit : « Alors soyez témoins et Je suis avec vous parmi les témoins. »", "german": " Und (gedenket der Zeit) da Allah (mit dem Volk der Schrift) den Bund der Propheten abschloss (und sprach): \"Was immer Ich euch gebe von dem Buch und der Weisheit – kommt dann ein Gesandter zu euch, erfüllend, was bei euch ist, so sollt ihr unbedingt an ihn glauben und ihm unbedingt helfen.\" Er sprach: \"Seid ihr einverstanden, und nehmet ihr diese Verantwortung Mir gegenüber an?\" Sie sprachen: \"Wir sind einverstanden.\" Er sprach: \"So bezeugt es, und Ich bin mit euch unter den Zeugen.\"", "spanish": " Y acordaos de cuando Al-lah estableció una alianza con el pueblo a través de los Profetas, diciendo: “Cuando os dé el Libro y la Sabiduría y os llegue después un Mensajero, cumpliendo lo que ya tenéis, creed en él y ayudadle”. Y Él dijo: “¿Estáis de acuerdo y aceptáis la responsabilidad que os impongo a este respecto?”. Dijeron: “Aceptamos”. Él dijo: “Dad, pues, testimonio y Yo estaré con vosotros entre los testigos.”", "urdu": " اور (اس وقت کو بھی یاد کرو) جب اللہ نے (اہل کتاب سے) سب نبیوں والا پختہ عہد لیا تھا کہ جو بھی کتاب اور حکمت میں تمہیں دوں پھر تمہارے پاس کوئی (ایسا) رسول آئے جو اس کلام کو پورا کرنے والا ہو جو تمہارے پاس ہے تو تم ضرور ہی اس پر ایمان لانا اور ضرور اس کی مدد کرنا (اور) فرمایا تھا کہ کیا تم اقرار کرتے ہو اور اس پر میری (طرف سے) ذمہ داری قبول کرتے ہو؟ (اور) انہوں نے کہا تھا‘ ہاں ہم اقرار کرتے ہیں‘ فرمایا اب تم گواہ رہو اور میں بھی تمہارے ساتھ گواہوں میں سے (ایک گواہ) ہوں۔"}, {"arabic": " فَمَنۡ تَوَلّٰی بَعۡدَ ذٰلِکَ فَاُولٰٓئِکَ ہُمُ الۡفٰسِقُوۡنَ ﴿۸۳﴾", "english": " Now whoso turns away after this, then, surely, those are the transgressors.", "french": " Et ceux qui se détourneront ensuite, ceux-là seront assurément du nombre des transgresseurs.", "german": " Wer sich nun danach abwendet – sie sind die Frevler.", "spanish": " Mas quienes se aparten después de esto serán de los inicuos.", "urdu": " اب جو (شخص) اس عہد کے بعد پھر جائے تو ایسے لوگ فاسق ہوں گے۔"}, {"arabic": " اَفَغَیۡرَ دِیۡنِ اللّٰہِ یَبۡغُوۡنَ وَ لَہٗۤ اَسۡلَمَ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ طَوۡعًا وَّ کَرۡہًا وَّ اِلَیۡہِ یُرۡجَعُوۡنَ ﴿۸۴﴾", "english": " Do they seek a religion other than Allah’s, while to Him submits whosoever is in the heavens and the earth, willingly or unwillingly, and to Him shall they be returned?", "french": " Cherchent-ils donc une religion autre que celle d’Allāh, alors que c’est à Lui que se soumet, de gré ou de force, tout ce qui est dans les cieux et sur la terre, et c’est vers Lui qu’ils seront ramenés !", "german": " Suchen sie eine andere Glaubenslehre als Allahs, wo sich Ihm ergibt, wer in den Himmeln und auf Erden ist, freiwillig oder widerstrebend, und zu Ihm müssen sie zurück?", "spanish": " ¿Acaso buscan una religión distinta de la de Al-lah, cuando a Él está sometido todo lo que hay en los cielos y en la tierra, voluntaria o involuntariamente, y a Él serán devueltos?", "urdu": " پھر کیا وہ اللہ کے دین کے سوا (کوئی اور دین) چاہتے ہیں حالانکہ آسمانوں اور زمین میں جو (کوئی بھی) ہے خوشی سے (بھی) اور ناخوشی سے (بھی) اسی کا فرمانبردار ہے اور اسی کی طرف لوٹایا جائے گا۔"}, {"arabic": " قُلۡ اٰمَنَّا بِاللّٰہِ وَ مَاۤ اُنۡزِلَ عَلَیۡنَا وَ مَاۤ اُنۡزِلَ عَلٰۤی اِبۡرٰہِیۡمَ وَ اِسۡمٰعِیۡلَ وَ اِسۡحٰقَ وَ یَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَ مَاۤ اُوۡتِیَ مُوۡسٰی وَ عِیۡسٰی وَ النَّبِیُّوۡنَ مِنۡ رَّبِّہِمۡ ۪ لَا نُفَرِّقُ بَیۡنَ اَحَدٍ مِّنۡہُمۡ ۫ وَ نَحۡنُ لَہٗ مُسۡلِمُوۡنَ ﴿۸۵﴾", "english": " Say, ‘We believe in Allah and in that which has been revealed to us, and that which was revealed to Abraham and Ishmael and Isaac and Jacob and the Tribes, and that which was given to Moses and Jesus and other Prophets from their Lord. We make no distinction between any of them, and to Him we submit.’", "french": " Dis : « Nous croyons en Allāh et en ce qui nous a été révélé, et en ce qui a été révélé à Abraham, à Ismaël, à Isaac, à Jacob et aux Tribus, et en ce qui a été donné à Moïse, à Jésus et aux autres Prophètes de la part de leur Seigneur. Nous ne faisons aucune distinction entre eux, et c’est à Lui que nous nous soumettons. »", "german": " Sprich: \"Wir glauben an Allah und an das, was zu uns herabgesandt worden und was herabgesandt ward zu Abraham und Ismael und Isaak und Jakob und den Nachfahren, und was gegeben ward Moses und Jesus und [anderen] Propheten von ihrem Herrn. Wir machen keinen Unterschied zwischen ihnen, und Ihm unterwerfen wir uns.\"", "spanish": " Di: “Creemos en Al-lah y en lo que nos ha sido revelado, y en lo revelado a Abraham, Ismael, Isaac, Jacob y a las tribus, y en lo que fue dado por su Señor a Moisés, Jesús y otros Profetas. No hacemos distinción entre ninguno de ellos y a Él nos sometemos.”", "urdu": " تو کہہ دے (کہ) ہم اللہ (پر) اور جو کچھ ہم پر نازل کیا گیا ہے‘ (اس پر) اور جو کچھ ابراہیم اور اسماعیل اور اسحاق اور یعقوب اور (اس کی) اولاد پر نازل کیا گیا تھا اور جو کچھ موسیٰ کو اور عیسیٰ کو اور (باقی) سب نبیوں کو ان کے رب کی طرف سے دیا گیا تھا اس پر ایمان رکھتے ہیں اور ان میں سے کسی ایک کو دوسرے سے علیحدہ نہیں سمجھتے اور ہم اس کے فرماں بردار ہیں۔"}, {"arabic": " وَ مَنۡ یَّبۡتَغِ غَیۡرَ الۡاِسۡلَامِ دِیۡنًا فَلَنۡ یُّقۡبَلَ مِنۡہُ ۚ وَ ہُوَ فِی الۡاٰخِرَۃِ مِنَ الۡخٰسِرِیۡنَ ﴿۸۶﴾", "english": " And whoso seeks a religion other than Islam, it shall not be accepted from him, and in the life to come he shall be among the losers.", "french": " Et quiconque cherche une religion autre que l’Islam, cela ne sera pas accepté de lui, et dans l’au-delà il sera parmi les perdants.", "german": " Und wer eine andere Glaubenslehre sucht als den Islam: nimmer soll sie von ihm angenommen werden, und im zukünftigen Leben soll er unter den Verlierenden sein.", "spanish": " Y a quien busque una religión distinta del Islam, no le será aceptada, y en la vida futura estará entre los perdedores.", "urdu": " اور جو شخص اسلام کے سوا کسی (اور) دین کو (اختیار کرنا) چاہے تو (وہ یاد رکھے کہ) وہ اس سے ہرگز قبول نہیں کیا جائے گا اور آخرت میں وہ نقصان اٹھانے والوں میں سے ہوگا۔"}, {"arabic": " کَیۡفَ یَہۡدِی اللّٰہُ قَوۡمًا کَفَرُوۡا بَعۡدَ اِیۡمَانِہِمۡ وَ شَہِدُوۡۤا اَنَّ الرَّسُوۡلَ حَقٌّ وَّ جَآءَہُمُ الۡبَیِّنٰتُ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿۸۷﴾", "english": " How shall Allah guide a people who have disbelieved after believing and who had borne witness that the Messenger was true and to whom clear proofs had come? And Allah guides not the wrongdoing people.", "french": " Comment Allāh guidera-t-Il un peuple devenu mécréant après avoir cru et qui a témoigné que le Messager est véridique et à qui des preuves éclatantes étaient venues ? Et Allāh ne guide pas les gens injustes.", "german": " Wie soll Allah einem Volk den Weg weisen, das ungläubig ward, nachdem es geglaubt und bezeugt, dass der Gesandte wahrhaft sei, und ihm klare Beweise geworden? Und Allah weist den Ungerechten nicht den Weg.", "spanish": " ¿Cómo guiará Al-lah a unas gentes que han dejado de creer después de haber creído, de haber sido testigos de que el Mensajero era auténtico y de haber recibido pruebas claras? Pues Al-lah no guía a los injustos.", "urdu": " جو لوگ ایمان لانے کے بعد (پھر) منکر ہو گئے ہوں اور شہادت دے چکے ہوں کہ (یہ) رسول سچا ہے اور (نیز) ان کے پاس دلائل بھی آچکے ہوں انہیں اللہ کس طرح ہدایت پر لائے اور اللہ (تو) ظالم (لوگوں) کو ہدایت نہیں دیتا۔"}, {"arabic": " اُولٰٓئِکَ جَزَآؤُہُمۡ اَنَّ عَلَیۡہِمۡ لَعۡنَۃَ اللّٰہِ وَ الۡمَلٰٓئِکَۃِ وَ النَّاسِ اَجۡمَعِیۡنَ ﴿ۙ۸۸﴾", "english": " Of such the reward is that on them shall be the curse of Allah and of angels and of men, all together.", "french": " Ceux-là auront sur eux en guise de récompense la malédiction d’Allāh, des anges et de tous les hommes.", "german": " Der Lohn solcher ist, dass über ihnen der Fluch Allahs und der Engel und aller Menschen ist.", "spanish": " Su recompensa será la maldición de Al-lah, de los ángeles y de los hombres, al mismo tiempo.", "urdu": " یہ لوگ ایسے ہیں کہ ان کی سزا یہ ہے کہ ان پر اللہ اور فرشتوں (کی) اور لوگوں (کی) سب ہی کی لعنت ہو۔"}, {"arabic": " خٰلِدِیۡنَ فِیۡہَا ۚ لَا یُخَفَّفُ عَنۡہُمُ الۡعَذَابُ وَ لَا ہُمۡ یُنۡظَرُوۡنَ ﴿ۙ۸۹﴾", "english": " They shall abide thereunder. Their punishment shall not be lightened nor shall they be reprieved;", "french": " Ils y resteront longtemps. Leur châtiment ne sera pas allégé, et aucun répit ne leur sera accordé ;", "german": " Unter ihm sei ihre Bleibe! Die Strafe wird ihnen nicht gemildert, noch wird ihnen Aufschub gewährt;", "spanish": " Y bajo ella vivirán. Su castigo no les será aliviado ni serán indultados;", "urdu": " وہ اس (لعنت) میں رہیں گے‘ نہ (تو) ان (پر) سے عذاب ہلکا کیا جائے گا اور نہ انہیں ڈھیل دی جائے گی۔"}, {"arabic": " اِلَّا الَّذِیۡنَ تَابُوۡا مِنۡۢ بَعۡدِ ذٰلِکَ وَ اَصۡلَحُوۡا ۟ فَاِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۹۰﴾", "english": " Except those who repent thereafter and amend. And surely, Allah is Most Forgiving, Merciful.", "french": " A l’exception de ceux qui par la suite se repentiront de leur mécréance et qui s’amenderont. Assurément, Allāh est Très-Pardonnant, Miséricordieux.", "german": " es sei denn jenen, die hernach bereuen und sich bessern, denn Allah ist allverzeihend, barmherzig.", "spanish": " Excepto los que después se arrepientan y se enmienden. En verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " سوائے ان لوگوں کے کہ جو اس کے بعد توبہ کر لیں اور اصلاح کر لیں۔ اور اللہ یقیناً بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا بَعۡدَ اِیۡمَانِہِمۡ ثُمَّ ازۡدَادُوۡا کُفۡرًا لَّنۡ تُقۡبَلَ تَوۡبَتُہُمۡ ۚ وَ اُولٰٓئِکَ ہُمُ الضَّآلُّوۡنَ ﴿۹۱﴾", "english": " Surely, those who disbelieve after they have believed and then increase in disbelief, their repentance shall not be accepted, and these are they who have gone astray.", "french": " Assurément, ceux qui ne croient pas après avoir cru, et dont la mécréance augmente, leur repentir ne sera point accepté ; ceux-là sont les égarés.", "german": " Wahrlich, die ungläubig werden, nachdem sie geglaubt, und dann zunehmen an Unglauben: ihre Reue wird nicht angenommen werden, und sie allein sind die Irregegangenen.", "spanish": " En verdad, a quienes han dejado de creer después de haber creído y aumentan acto seguido su incredulidad, no se les aceptará su arrepentimiento, y serán ellos los descarriados.", "urdu": " جو لوگ ایمان لانے کے بعد منکر ہو گئے ہوں پھر وہ کفر میں اور بھی بڑھ گئے ہوں ان کی توبہ ہرگز قبول نہ کی جائے گی۔ اور یہی لوگ گمراہ ہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ مَاتُوۡا وَ ہُمۡ کُفَّارٌ فَلَنۡ یُّقۡبَلَ مِنۡ اَحَدِہِمۡ مِّلۡءُ الۡاَرۡضِ ذَہَبًا وَّلَوِ افۡتَدٰی بِہٖ ؕ اُولٰٓئِکَ لَہُمۡ عَذَابٌ اَلِیۡمٌ وَّ مَا لَہُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿٪۹۲﴾", "english": " As for those who have disbelieved, and die while they are disbelievers, there shall not be accepted from any one of them even an earthful of gold, though he offer it in ransom. It is these for whom shall be a grievous punishment, and they shall have no helpers.", "french": " Quant à ceux qui ne croient plus et qui meurent mécréants, il ne sera accepté d’aucun d’entre eux même la terre remplie d’or, bien qu’il l’offre comme rançon. Ceux-là auront un châtiment douloureux, et ils n’auront personne pour les secourir.", "german": " Die aber ungläubig waren und als Ungläubige sterben, von ihrer keinem soll selbst eine Welt voll Gold angenommen werden, auch wenn er es als Lösegeld bietet. Sie sind es, denen schmerzliche Strafe wird, und keine Helfer sollen sie finden.", "spanish": " En cuanto a los que no han creído y mueren en la incredulidad, no se aceptará de ninguno de ellos ni siquiera todo el oro de la tierra, aunque lo ofrezcan como rescate. Sufrirán un doloroso castigo y no tendrán defensores.", "urdu": " جو لوگ منکر ہو گئے ہوں اور کفر (ہی) کی حالت میں مر گئے ہوں‘ ان میں سے کسی سے زمین بھر سونا (بھی) جسے وہ فدیہ کے طور پر پیش کرے ہرگز قبول نہیں کیا جائے گا۔ ان لوگوں کے لئے دردناک عذاب (مقدر) ہے اور ان کا کوئی بھی مددگار نہ ہوگا۔"}, {"arabic": " لَنۡ تَنَالُوا الۡبِرَّ حَتّٰی تُنۡفِقُوۡا مِمَّا تُحِبُّوۡنَ ۬ؕ وَ مَا تُنۡفِقُوۡا مِنۡ شَیۡءٍ فَاِنَّ اللّٰہَ بِہٖ عَلِیۡمٌ ﴿۹۳﴾", "english": " Never shall you attain to righteousness unless you spend out of that which you love; and whatever you spend, Allah surely knows it well.", "french": " Jamais vous n’atteindrez la droiture à moins que vous ne dépensiez de ce que vous aimez ; et quoi que vous dépensiez, assurément, Allāh le sait très bien.", "german": " Nie könnt ihr zur vollkommenen Rechtschaffenheit gelangen, solange ihr nicht spendet von dem, was ihr liebt; und was immer ihr spendet, wahrlich, Allah weiß es wohl.", "spanish": " Jamás alcanzaréis la piedad a menos que gastéis de lo que amáis. Y Al-lah conoce con seguridad cualquier cosa que deis.", "urdu": " تم کامل نیکی کو ہرگز نہیں پا سکتے جب تک کہ اپنی پسندیدہ اشیاء میں سے (خدا کے لئے) خرچ نہ کرو۔ اور جو کوئی چیز بھی تم خرچ کرو اللہ اسے یقیناً خوب جانتا ہے۔"}, {"arabic": " کُلُّ الطَّعَامِ کَانَ حِلًّا لِّبَنِیۡۤ اِسۡرَآءِیۡلَ اِلَّا مَا حَرَّمَ اِسۡرَآءِیۡلُ عَلٰی نَفۡسِہٖ مِنۡ قَبۡلِ اَنۡ تُنَزَّلَ التَّوۡرٰٮۃُ ؕ قُلۡ فَاۡتُوۡا بِالتَّوۡرٰٮۃِ فَاتۡلُوۡہَاۤ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۹۴﴾", "english": " All food was lawful to the children of Israel, except what Israel forbade himself before the Torah was sent down. Say, ‘Bring, then, the Torah and read it, if you are truthful.’", "french": " Toute espèce de nourriture était permise aux Enfants d’Israël, hormis ce qu’Israël lui-même se défendait avant que la Torah ne soit descendue. Dis : « Apportez donc la Torah et récitez-la si vous êtes véridiques. »", "german": " Alle Speise war den Kindern Israels erlaubt, mit Ausnahme dessen, was Israel sich selbst verbot, ehe die Thora herabgesandt war. Sprich: \"Bringt also die Thora herbei und leset sie, wenn ihr wahrhaft seid.\"", "spanish": " Todo alimento era lícito para los hijos de Israel, excepto lo que Israel se prohibió a sí mismo, antes de que la Torah fuese revelada. Diles: “Traed, pues, la Torah y recitadla, si sois sinceros.”", "urdu": " سب کا سب کھانا سوائے اس حصہ کے جو اسرائیل (یعنی حضرت یعقوب) نے تورات کے اتارے جانے سے پہلے اپنے لئے مکروہ قرار دے دیا تھا بنی اسرائیل کے لئے حلال تھا۔ تو کہہ دے کہ اگر تم سچے ہو تو تورات لاٶ اور اسے پڑھو۔"}, {"arabic": " فَمَنِ افۡتَرٰی عَلَی اللّٰہِ الۡکَذِبَ مِنۡۢ بَعۡدِ ذٰلِکَ فَاُولٰٓئِکَ ہُمُ الظّٰلِمُوۡنَ ﴿۹۵﴾؃", "english": " Now whoso forges a lie against Allah after this, then it is these that are the wrongdoers.", "french": " Alors, quiconque invente des mensonges contre Allāh après ceci, ceux-là sont les injustes.", "german": " Wer nun danach eine Lüge gegen Allah erdichtet – sie sind die Frevler.", "spanish": " Mas quienes, después de esto, fragüen una mentira contra Al-lah, se contarán entre los injustos.", "urdu": " اب جو (لوگ) اس کے بعد (بھی) اللہ پر جھوٹ باندھیں تو وہی لوگ ظالم ہوں گے۔"}, {"arabic": " قُلۡ صَدَقَ اللّٰہُ ۟ فَاتَّبِعُوۡا مِلَّۃَ اِبۡرٰہِیۡمَ حَنِیۡفًا ؕ وَ مَا کَانَ مِنَ الۡمُشۡرِکِیۡنَ ﴿۹۶﴾", "english": " Say, ‘Allah has spoken the truth: follow, therefore, the religion of Abraham, who was ever inclined to God ; and he was not of those who associate gods with God .’", "french": " Dis- leur : « Allāh a dit la vérité ; suivez donc la religion d’Abraham, qui était toujours incliné vers Allāh ; il n’était pas du nombre des associateurs. »", "german": " Sprich: \"Allah hat die Wahrheit gesprochen; folget darum dem Glauben Abrahams, des Aufrichtigen; er war keiner der Götzendiener.\"", "spanish": " Y diles: “Al-lah ha dicho la verdad; seguid, pues, la religión de Abraham, quien estuvo siempre sometido a Dios; y no fue de los que asocian otros dioses a Dios .”", "urdu": " تو کہہ کہ اللہ نے سچ کہا ہے۔ اس لئے تم ابراہیم کے دین کی جو (خدا کی طرف) جھکا رہنے والا تھا پیروی کرو‘ اور وہ مشرکوں میں سے نہیں تھا۔"}, {"arabic": " اِنَّ اَوَّلَ بَیۡتٍ وُّضِعَ لِلنَّاسِ لَلَّذِیۡ بِبَکَّۃَ مُبٰرَکًا وَّ ہُدًی لِّلۡعٰلَمِیۡنَ ﴿ۚ۹۷﴾", "english": " Surely, the first House founded for mankind is that at Becca, abounding in blessings and a guidance for all peoples.", "french": " Assurément, la première Maison qui ait été fondée pour l’humanité est celle de Bakkah ; abondante en bénédictions et une direction pour tous les peuples.", "german": " Wahrlich, das erste Haus, das für die Menschheit gegründet wurde, ist das zu Bakka – überreich an Segen und zur Richtschnur für alle Völker.", "spanish": " En verdad, la primera Casa fundada para la humanidad es la de Bakka, abundante en bendiciones y guía para todos los pueblos.", "urdu": " سب سے پہلا گھر جو تمام لوگوں کے (فائدہ کے) لئے بنایا گیا تھا وہ ہے جو مکہ میں ہے وہ تمام جہانوں کے لئے برکت والا (مقام) اور (موجب) ہدایت ہے۔"}, {"arabic": " فِیۡہِ اٰیٰتٌۢ بَیِّنٰتٌ مَّقَامُ اِبۡرٰہِیۡمَ ۬ۚ وَ مَنۡ دَخَلَہٗ کَانَ اٰمِنًا ؕ وَ لِلّٰہِ عَلَی النَّاسِ حِجُّ الۡبَیۡتِ مَنِ اسۡتَطَاعَ اِلَیۡہِ سَبِیۡلًا ؕ وَ مَنۡ کَفَرَ فَاِنَّ اللّٰہَ غَنِیٌّ عَنِ الۡعٰلَمِیۡنَ ﴿۹۸﴾", "english": " In it are manifest Signs; it is the place of Abraham; and whoso enters it, enters peace. And pilgrimage to the House is a duty which men — those who can find a way thither — owe to Allah. And whoever disbelieves, let him remember that Allah is surely independent of all creatures.", "french": " Il s’y trouve des Signes manifestes : la station d’Abraham les constitue ; et tous ceux qui y entreront y trouveront la paix. Le Pèlerinage à la Maison est un devoir envers Allāh pour tous les gens, du moins pour ceux qui peuvent trouver le moyen de s’y rendre. Et quant à celui qui ne croit pas, qu’il se souvienne qu’ Allāh est assurément Indépendant de toutes les créatures.", "german": " In ihm sind deutliche Zeichen. Die Stätte Abrahams – und wer sie betritt, hat Frieden. Und wallfahrt zu diesem Haus – wer nur immer einen Weg dahin finden kann – ist den Menschen eine Pflicht vor Allah. Wer aber ablehnt (möge bedenken), dass Allah sicherlich unabhängig ist von allen Geschöpfen.", "spanish": " En ella hay Signos evidentes; es el lugar de Abraham; y quien entra en ella entra en la paz. Y la peregrinación a la Casa es un deber que los hombres –quienes sean capaces de encontrar el camino a ella– deben a Al-lah. Mas a quien no crea, recuérdale que Al-lah es ciertamente independiente de todas las criaturas.", "urdu": " اس میں کئی روشن نشانات ہیں (وہ) ابراہیم کی قیام گاہ ہے اور جو اس میں داخل ہو وہ امن میں آجاتا ہے۔ اور اللہ نے لوگوں پر فرض کیا ہے کہ وہ اس گھر کا حج کریں (یعنی) جو (بھی) اس تک جانے کی توفیق پائے اور جو انکار کرے تو (وہ یاد رکھے کہ) اللہ تمام جہانوں سے بے پروا ہے۔"}, {"arabic": " قُلۡ یٰۤاَہۡلَ الۡکِتٰبِ لِمَ تَکۡفُرُوۡنَ بِاٰیٰتِ اللّٰہِ ٭ۖ وَ اللّٰہُ شَہِیۡدٌ عَلٰی مَا تَعۡمَلُوۡنَ ﴿۹۹﴾", "english": " Say, ‘O People of the Book! why deny ye the Signs of Allah, while Allah is Watchful of what you do?’", "french": " Dis : « Ô Gens du Livre ! Pourquoi refusez-vous les Signes d’Allāh, alors qu’Allāh est Témoin de tout ce que vous faites ? »", "german": " Sprich: \"O Volk der Schrift, warum leugnet ihr die Zeichen Allahs, obwohl Allah Zeuge dessen ist, was ihr tut?\"", "spanish": " Diles: “¡Oh, Pueblo del Libro! ¿por qué negáis los Signos de Al-lah, si Al-lah es testigo de lo que hacéis?”.", "urdu": " تو کہہ (کہ) اے اہل کتاب! تم اللہ کی آیات کا کیوں انکار کرتے ہو‘ حالانکہ اللہ تمہارے اعمال پر نگران ہے۔"}, {"arabic": " قُلۡ یٰۤاَہۡلَ الۡکِتٰبِ لِمَ تَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ مَنۡ اٰمَنَ تَبۡغُوۡنَہَا عِوَجًا وَّ اَنۡتُمۡ شُہَدَآءُ ؕ وَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۱۰۰﴾", "english": " Say, ‘O People of the Book! why hinder ye the believers from the path of Allah, seeking to make it crooked, while you are witnesses thereof ? And Allah is not unmindful of what you do.’", "french": " Dis : « Ô Gens du Livre ! Pourquoi empêchez-vous les croyants de suivre le chemin d’Allāh en cherchant à le rendre tortueux alors que vous en êtes témoins ? Et Allāh n’est pas inattentif à ce que vous faites. »", "german": "", "spanish": " Diles: “¡Oh, Pueblo del Libro! ¿por qué desviáis a los creyentes del camino de Al-lah, intentando hacerlo tortuoso, si sois sus testigos?. Pero Al-lah no está desatento a lo que hacéis.”", "urdu": " (نیز تو) کہہ (کہ) اے اہل کتاب! جو ایمان لاتا ہے اسے تم اللہ کے راستہ سے کیوں روکتے ہو۔ تم اس (راستہ) کو کجی اختیار کرتے ہوئے چاہتے ہو حالانکہ تم (اس پر) گواہ ہو اور جو کچھ تم کرتے ہو اللہ اس سے ہرگز غافل نہیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنۡ تُطِیۡعُوۡا فَرِیۡقًا مِّنَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ یَرُدُّوۡکُمۡ بَعۡدَ اِیۡمَانِکُمۡ کٰفِرِیۡنَ ﴿۱۰۱﴾", "english": " O ye who believe! if you obey any party of those who have been given the Book, they will turn you again into disbelievers after you have believed.", "french": " Ô vous qui croyez ! Si vous obéissez à un groupe quelconque de ceux à qui le Livre a été donné, ils vous feront retourner à la mécréance après que vous ayez cru.", "german": " O die ihr glaubt, wenn ihr irgendeinem Teil derer gehorcht, denen das Buch gegeben ward, so werden sie euch wieder ungläubig machen, nachdem ihr geglaubt.", "spanish": " ¡Oh, vosotros, los que creéis! si obedecéis a cualquier grupo de los que recibieron el Libro, os convertirán de nuevo en incrédulos después de haber sido creyentes.", "urdu": " اے مومنو! اگر تم ان لوگوں میں سے جنہیں کتاب دی گئی تھی کسی فریق کی اطاعت کرو گے تو وہ تمہارے ایمان لے آنے کے بعد پھر تمہیں کافر بنا دیں گے۔"}, {"arabic": " وَ کَیۡفَ تَکۡفُرُوۡنَ وَ اَنۡتُمۡ تُتۡلٰی عَلَیۡکُمۡ اٰیٰتُ اللّٰہِ وَ فِیۡکُمۡ رَسُوۡلُہٗ ؕ وَ مَنۡ یَّعۡتَصِمۡ بِاللّٰہِ فَقَدۡ ہُدِیَ اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۱۰۲﴾٪", "english": " How would you disbelieve, while to you are rehearsed the Signs of Allah, and His Messenger is present among you? And he who holds fast to Allah is indeed guided to the right path.", "french": " Comment pouvez-vous ne pas croire, alors que les Signes d’Allāh vous sont récités, et que Son Messager est présent parmi vous ? Et celui qui se cramponne à Allāh est assurément guidé vers un droit chemin.", "german": " Wie könnt ihr Ungläubige werden, wo euch die Zeichen Allahs vorgetragen werden und Sein Gesandter unter euch ist? Und wer da an Allah festhält, der wird fürwahr auf den geraden Weg geleitet.", "spanish": " ¿Cómo podéis renegar si os han recitado los Signos de Al-lah y su Mensajero está presente entre vosotros? Mas quien se aferre fuertemente a Al-lah es en verdad conducido por el camino recto.", "urdu": " اور تم کسی طرح کفر کرو گے جبکہ تم وہ لوگ ہو جنہیں اللہ کی آیات پڑھ کر سنائی جاتی ہیں اور تم میں اس کا رسول (موجود) ہے۔ اورجو شخص اللہ کی پناہ لے تو (سمجھو کہ) اسے سیدھی راہ پر چلا دیا گیا۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ حَقَّ تُقٰتِہٖ وَ لَا تَمُوۡتُنَّ اِلَّا وَ اَنۡتُمۡ مُّسۡلِمُوۡنَ ﴿۱۰۳﴾", "english": " O ye who believe! fear Allah as He should be feared; and let not death overtake you except when you are in a state of submission.", "french": " Ô vous qui croyez ! Craignez Allāh comme Il doit être craint et ne laissez pas la mort vous surprendre que lorsque vous êtes en état de soumission.", "german": " O die ihr glaubt, fürchtet Allah in geziemender Furcht; und sterbet nicht, außer ihr seid gottergeben.", "spanish": " ¡Oh, vosotros, los que creéis! temed a Al-lah como debe ser temido; y no permitáis que os llegue la muerte si no estáis sometidos.", "urdu": " اے ایماندارو! اللہ کا تقویٰ اس کی تمام شرائط کے ساتھ اختیار کرو اور تم پر صرف ایسی حالت میں موت آئے کہ تم پورے فرمانبردار ہو۔"}, {"arabic": " وَ اعۡتَصِمُوۡا بِحَبۡلِ اللّٰہِ جَمِیۡعًا وَّ لَا تَفَرَّقُوۡا ۪ وَ اذۡکُرُوۡا نِعۡمَتَ اللّٰہِ عَلَیۡکُمۡ اِذۡ کُنۡتُمۡ اَعۡدَآءً فَاَلَّفَ بَیۡنَ قُلُوۡبِکُمۡ فَاَصۡبَحۡتُمۡ بِنِعۡمَتِہٖۤ اِخۡوَانًا ۚ وَ کُنۡتُمۡ عَلٰی شَفَا حُفۡرَۃٍ مِّنَ النَّارِ فَاَنۡقَذَکُمۡ مِّنۡہَا ؕ کَذٰلِکَ یُبَیِّنُ اللّٰہُ لَکُمۡ اٰیٰتِہٖ لَعَلَّکُمۡ تَہۡتَدُوۡنَ ﴿۱۰۴﴾", "english": " And hold fast, all together, by the rope of Allah and be not divided; and remember the favour of Allah which He bestowed upon you when you were enemies and He united your hearts in love, so that by His grace you became as brothers; and you were on the brink of a pit of fire and He saved you from it. Thus does Allah explain to you His commandments that you may be guided.", "french": " Et cramponnez-vous ensemble à la corde d’Allāh et ne soyez pas divisés ; et souvenez-vous de la grâce d’Allāh sur vous quand vous étiez ennemis, alors Il a réconcilié vos cœurs dans l’amour, de sorte que par Sa grâce vous êtes devenus frères. Et vous étiez au bord d’un gouffre de feu, et Il vous en a sauvés. C’est ainsi qu’Allāh vous explique Ses commandements afin que vous soyez guidés.", "german": " Und haltet euch allesamt fest am Seile Allahs; und seid nicht zwieträchtig; und gedenket der Huld Allahs gegen euch, als ihr Feinde waret. Alsdann fügte Er eure Herzen so in Liebe zusammen, dass ihr durch Seine Gnade Brüder wurdet; ihr waret am Rande einer Feuergrube, und Er bewahrte euch davor. Also macht Allah euch Seine Zeichen klar, auf dass ihr rechtgeleitet seiet.", "spanish": " Y aferraos fuertemente todos juntos, con la cuerda de Al-lah y no os dividáis; y recordad el favor de Al-lah que Él os concedió cuando erais enemigos y Él unió vuestros corazones en el amor, para que con su gracia os hicierais como hermanos; estabais al borde de un abismo de fuego y Él os salvó. Así os explica Al-lah sus mandamientos, para que seáis guiados.", "urdu": " اور تم سب (کے سب) اللہ کی رسی کو مضبوطی سے پکڑ لو اور پراگندہ مت ہو اور اللہ کا احسان جو (اس نے) تم پر (کیا) ہے یاد کرو کہ جب تم (ایک دوسرے کے) دشمن تھے اس نے تمہارے دلوں میں الفت پیدا کر دی جس کے نتیجہ میں تم اس کے احسان سے بھائی بھائی بن گئے اور تم آگ کے ایک گڑھے کے کنارہ پر تھے مگر اس نے تمہیں اس سے بچالیا۔ اسی طرح اللہ تمہارے لئے اپنی آیات کو بیان کرتا ہے تا کہ تم ہدایت پاٶ۔"}, {"arabic": " وَلۡتَکُنۡ مِّنۡکُمۡ اُمَّۃٌ یَّدۡعُوۡنَ اِلَی الۡخَیۡرِ وَ یَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَ یَنۡہَوۡنَ عَنِ الۡمُنۡکَرِ ؕ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۱۰۵﴾", "english": " And let there be among you a body of men who should invite to goodness, and enjoin equity and forbid evil. And it is they who shall prosper.", "french": " Et qu’il se trouve parmi vous un groupe qui appelle au bien, qui enjoint la vertu et qui interdit le mal. Et ceux-là qui prospéreront.", "german": " Es sollte unter euch eine Gemeinschaft sein, die zum Rechten auffordert und das Gute gebietet und das Böse verwehrt. Diese allein sollen Erfolg haben.", "spanish": " Y que surja de entre vosotros un grupo de hombres que invite a la bondad, imponga la justicia y prohíba la maldad. Ellos serán los bienaventurados.", "urdu": " اور تم میں سے ایک ایسی جماعت ہونی چاہیے جس کا کام صرف یہ ہو کہ وہ (لوگوں کو) نیکی کی طرف بلائے اور نیک باتوں کی تعلیم دے اور بدی سے روکے اور یہی لوگ کامیاب ہونے والے ہیں۔"}, {"arabic": " وَ لَا تَکُوۡنُوۡا کَالَّذِیۡنَ تَفَرَّقُوۡا وَ اخۡتَلَفُوۡا مِنۡۢ بَعۡدِ مَا جَآءَہُمُ الۡبَیِّنٰتُ ؕ وَ اُولٰٓئِکَ لَہُمۡ عَذَابٌ عَظِیۡمٌ ﴿۱۰۶﴾ۙ", "english": " And be not like those who became divided and who disagreed among themselves after clear proofs had come to them. And it is they for whom there shall be a great punishment,", "french": " Et ne soyez pas comme ceux qui se sont divisés et qui se sont disputés entre eux après avoir reçu des preuves manifestes de la vérité . Et ceux-là auront un très grand châtiment,", "german": " Und seid nicht wie jene, die zwieträchtig wurden und uneins, nachdem ihnen klare Beweise zuteil geworden. Und ihnen wird schwere Strafe.", "spanish": " Y no seáis como aquellos que se separaron y disputaron entre sí después de que les llegaran pruebas evidentes. Y sobre ellos caerá un gran castigo.", "urdu": " اور تم ان لوگوں کی طرح نہ بنو جو کھلے کھلے نشانات آچکنے کے بعد پراگندہ ہو گئے اور انہوں نے (باہم) اختلاف پیدا کر لیا اور انہی لوگوں کے لئے (اس دن) بڑا عذاب (مقدر) ہے۔"}, {"arabic": " یَّوۡمَ تَبۡیَضُّ وُجُوۡہٌ وَّ تَسۡوَدُّ وُجُوۡہٌ ۚ فَاَمَّا الَّذِیۡنَ اسۡوَدَّتۡ وُجُوۡہُہُمۡ ۟ اَکَفَرۡتُمۡ بَعۡدَ اِیۡمَانِکُمۡ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ تَکۡفُرُوۡنَ ﴿۱۰۷﴾", "english": " On the day when some faces shall be white, and some faces shall be black. As for those whose faces will be black, it will be said to them : ‘Did you disbelieve after believing? Taste, then, the punishment because you disbelieved.’", "french": " Au jour où certains visages seront éclairés et où d’autres seront assombris ; et quant à ceux qui auront le visage assombri, on leur dira : « Avez-vous rejeté la foi après avoir cru ? Goûtez-donc le châtiment à cause de votre mécréance. »", "german": " An dem Tage, da manche Gesichter weiß sein werden und manche Gesichter schwarz, wird zu jenen, deren Gesichter schwarz sein werden (gesprochen): \"Wurdet ihr ungläubig, nachdem ihr geglaubt hattet? So kostet die Strafe für euren Unglauben.\"", "spanish": " El día en que unos rostros serán blancos y otros negros. Y a cuantos tengan el rostro negro se les dirá: “¿Dejasteis de creer después de haber creído? Probad, pues, el castigo de vuestra incredulidad.”", "urdu": " جس دن کہ بعض چہرے سفید ہوں گے اور بعض چہرے کالے ہوں گے۔ اور جن لوگوں کے چہرے کالے ہو جائیں گے (ان سے کہا جائے گا کہ) کیا (یہ سچ نہیں کہ) تم اپنے ایمان لانے کے بعد کافر ہو گئے تھے۔ اس لئے اپنے کافر ہونے کی وجہ سے اس عذاب کو چکھو۔"}, {"arabic": " وَ اَمَّا الَّذِیۡنَ ابۡیَضَّتۡ وُجُوۡہُہُمۡ فَفِیۡ رَحۡمَۃِ اللّٰہِ ؕ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۱۰۸﴾", "english": " And as for those whose faces will be white, they will be in the mercy of Allah; therein will they abide.", "french": " Quant à ceux qui auront le visage éclairé, ils seront dans la miséricorde d’Allāh et ils y demeureront éternellement.", "german": " Jene aber, deren Gesichter weiß sein werden, werden in Allahs Gnade sein; darin werden sie verweilen.", "spanish": " Y en cuanto a los que tengan el rostro blanco, estarán en la misericordia de Al-lah; y en ella morarán eternamente.", "urdu": " اور جن لوگوں کے چہرے سفید ہو جائیں گے وہ اللہ کی رحمت میں ہوں گے وہ اس میں رہتے چلے جائیں گے۔"}, {"arabic": " تِلۡکَ اٰیٰتُ اللّٰہِ نَتۡلُوۡہَا عَلَیۡکَ بِالۡحَقِّ ؕ وَ مَا اللّٰہُ یُرِیۡدُ ظُلۡمًا لِّلۡعٰلَمِیۡنَ ﴿۱۰۹﴾", "english": " These are the Signs of Allah, We rehearse them to thee while they comprise the truth; and Allah wills not any wrong to His creatures.", "french": " Voilà les Signes d’Allāh ; Nous te les récitons avec vérité, et Allāh ne veut aucune injustice pour Ses créatures.", "german": " Dies sind die Wahrheit umfassende Zeichen Allahs, die Wir dir vortragen; und Allah will keine Ungerechtigkeit für die Welten.", "spanish": " Éstos son los Signos de Al-lah. Te los recitamos porque aúnan la Verdad. Pues Al-lah no desea nada malo a Sus criaturas.", "urdu": " یہ اللہ کی آیات ہیں جو حق پر مشتمل ہیں (اور) جنہیں ہم تجھے پڑھ کر سناتے ہیں اور اللہ تمام جہانوں پر کسی قسم کا ظلم کرنا نہیں چاہتا۔"}, {"arabic": " وَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ اِلَی اللّٰہِ تُرۡجَعُ الۡاُمُوۡرُ ﴿۱۱۰﴾٪", "english": " And to Allah belongs whatever is in the heavens and whatever is in the earth, and to Allah shall all affairs be returned for decision .", "french": " Et à Allāh appartiennent tout ce qui est dans les cieux et tout ce qui est sur la terre ; et c’est à Allāh que toutes les affaires seront ramenées pour Sa décision .", "german": " Allahs ist, was in den Himmeln und was auf Erden ist, und Allah sollen die Dinge vorgelegt werden.", "spanish": " Y a Al-lah pertenece cuanto hay en los cielos y en la tierra; y a Al-lah se someterán todos los asuntos.", "urdu": " اور جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے (سب) اللہ ہی کا ہے اور اللہ ہی کی طرف تمام امور کو لوٹایا جائے گا۔"}, {"arabic": " کُنۡتُمۡ خَیۡرَ اُمَّۃٍ اُخۡرِجَتۡ لِلنَّاسِ تَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَ تَنۡہَوۡنَ عَنِ الۡمُنۡکَرِ وَ تُؤۡمِنُوۡنَ بِاللّٰہِ ؕ وَ لَوۡ اٰمَنَ اَہۡلُ الۡکِتٰبِ لَکَانَ خَیۡرًا لَّہُمۡ ؕ مِنۡہُمُ الۡمُؤۡمِنُوۡنَ وَ اَکۡثَرُہُمُ الۡفٰسِقُوۡنَ ﴿۱۱۱﴾", "english": " You are the best people raised for the good of mankind; you enjoin what is good and forbid evil and believe in Allah. And if the People of the Book had believed, it would have surely been better for them. Some of them are believers, but most of them are disobedient.", "french": " Vous êtes le meilleur peuple, suscité pour le bien de l’humanité ; vous enjoignez ce qui est bien, vous interdisez le mal, et vous croyez en Allāh. Et si les Gens du Livre avaient cru, cela aurait été meilleur pour eux. Certains d’entre eux sont croyants, mais la plupart d’entre eux sont des pervers.", "german": " Ihr seid das beste Volk, hervorgebracht zum Wohl der Menschheit; ihr gebietet das Gute und verwehrt das Böse und glaubt an Allah. Und wenn das Volk der Schrift auch (diese Anweisung Allahs) annähme, wahrlich würde es ihnen besser frommen. Manche von ihnen nehmen (sie) an, doch die meisten ihrer sind ungehorsam.", "spanish": " Sois el mejor pueblo, exaltado para el bien de la humanidad; ordenáis lo bueno, prohibís lo malo y creéis en Al-lah. Y si el Pueblo del Libro hubiese creído, en verdad hubiese sido mejor para ellos. Algunos de ellos son creyentes, pero en su mayoría son desobedientes.", "urdu": " تم (سب سے) بہتر جماعت ہو جسے لوگوں کے (فائدہ کے) لئے پیدا کیا گیا ہے۔ تم نیکی کی ہدایت کرتے ہو اور بدی سے روکتے ہو۔ اور اللہ پر ایمان رکھتے ہو۔ اور اگر اہل کتاب بھی ایمان لاتے تو ان کے لئے بہتر ہوتا۔ ان میں سے بعض مومن بھی ہیں اور اکثر ان میں سے نافرمان ہیں۔"}, {"arabic": " لَنۡ یَّضُرُّوۡکُمۡ اِلَّاۤ اَذًی ؕ وَ اِنۡ یُّقَاتِلُوۡکُمۡ یُوَلُّوۡکُمُ الۡاَدۡبَارَ ۟ ثُمَّ لَا یُنۡصَرُوۡنَ ﴿۱۱۲﴾", "english": " They cannot harm you save a slight hurt; and if they fight you, they shall show you their backs. Then they shall not be helped.", "french": " Ils ne peuvent vous faire de mal, si ce n’est qu’une légère blessure ; et s’ils vous combattent, ils vous tourneront le dos en déroute . Alors personne ne leur viendra en aide.", "german": " Sie können euch nur geringen Schaden zufügen; und wenn sie wider euch kämpfen, werden sie euch den Rücken kehren. Dann werden sie keine Hilfe finden.", "spanish": " No os perjudicarán, salvo con ligero daño; y si os combaten os volverán la espalda. Entonces quedarán sin ayuda.", "urdu": " یہ (لوگ) معمولی ایذا دہی کے سوا تمہیں کوئی نقصان نہیں پہنچا سکتے اور اگر وہ تم سے جنگ کریں گے تو تمہاری طرف پیٹھیں پھیر کر بھاگ جائیں گے۔ پھر انہیں کسی طرف سے بھی مدد نہیں مل سکے گی۔"}, {"arabic": " ضُرِبَتۡ عَلَیۡہِمُ الذِّلَّۃُ اَیۡنَ مَا ثُقِفُوۡۤا اِلَّا بِحَبۡلٍ مِّنَ اللّٰہِ وَ حَبۡلٍ مِّنَ النَّاسِ وَ بَآءُوۡ بِغَضَبٍ مِّنَ اللّٰہِ وَ ضُرِبَتۡ عَلَیۡہِمُ الۡمَسۡکَنَۃُ ؕ ذٰلِکَ بِاَنَّہُمۡ کَانُوۡا یَکۡفُرُوۡنَ بِاٰیٰتِ اللّٰہِ وَ یَقۡتُلُوۡنَ الۡاَنۡۢبِیَآءَ بِغَیۡرِ حَقٍّ ؕ ذٰلِکَ بِمَا عَصَوۡا وَّ کَانُوۡا یَعۡتَدُوۡنَ ﴿۱۱۳﴾٭", "english": " Smitten shall they be with abasement wherever they are found, unless they have protection from Allah, or protection from men. They have incurred the wrath of Allah, and smitten are they with wretchedness. That is because they would reject the Signs of Allah and kill the Prophets unjustly. That is because they rebelled and used to transgress.", "french": " Où qu’ils se trouvent, ils seront frappés d’avilissement, à moins d’ être protégés par un pacte avec Allāh ou par un pacte conclu avec les hommes. Ils se sont attiré la colère d’Allāh et ils sont frappés de misère. C’est parce qu’ils ont rejeté les Signes d’Allāh, et ont voulu tuer les Prophètes injustement. C’est parce qu’ils se sont révoltés et étaient habitués à transgresser.", "german": " Mit Schmach sollen sie geschlagen werden, wo immer sie angetroffen werden, außer in einem Bund mit Allah oder in einem Bund mit den Menschen. Sie haben Allahs Zorn erregt; und mit Elend sind sie geschlagen darum, dass sie Allahs Zeichen verwarfen und die Propheten widerrechtlich töten wollten. Dies, weil sie Empörer waren und das Maß überschritten.", "spanish": " Serán afligidos con la humillación donde quiera que se encuentren, a menos que tengan la protección de Al-lah o la protección de los hombres. Han incurrido en la cólera de Al-lah y sufrieron la miseria. Todo ello por haber rechazado los Signos de Al-lah y matado injustamente a los Profetas. Todo ello por haberse rebelado y ser pecadores.", "urdu": " جہاں کہیں بھی وہ پائے جائیں ان پر ذلت نازل کی گئی ہے سوائے اس کہ وہ اللہ کے کسی عہد (کی) یا لوگوں کے کسی عہد کی پناہ میں آجائیں (اس ذلت سے بچ نہیں سکتے) اور وہ اللہ کے غضب کا مورد بن گئے ہیں اور بے بسی (کی حالت) ان کے ساتھ لازم کر دی گئی ہے۔ یہ اس سبب سے (کیا گیا) ہے کہ وہ اللہ کی آیتوں کا انکار کرتے تھے اور بلاوجہ نبیوں کو قتل کرنا چاہتے تھے (اور) یہ بات ان کے نافرمانی کرنے اور حد سے بڑھے ہوئے ہونے کے سبب سے (ان میں پائی جاتی) تھی۔"}, {"arabic": " لَیۡسُوۡا سَوَآءً ؕ مِنۡ اَہۡلِ الۡکِتٰبِ اُمَّۃٌ قَآئِمَۃٌ یَّتۡلُوۡنَ اٰیٰتِ اللّٰہِ اٰنَآءَ الَّیۡلِ وَ ہُمۡ یَسۡجُدُوۡنَ ﴿۱۱۴﴾", "english": " They are not all alike. Among the People of the Book there is a party who stand by their covenant ; they recite the word of Allah in the hours of night and prostrate themselves before Him .", "french": " Ils ne sont pas tous pareils. Il y en a parmi les Gens du Livre qui ont tenu ferme à leurs engagements . Ils récitent la parole d’Allāh pendant les heures de la nuit, et ils se prosternent devant Lui.", "german": " Sie sind nicht (alle) gleich. Unter dem Volke der Schrift ist eine Gemeinde, die fest (zu ihrem Vertrag) steht; sie sprechen Allahs Wort in den Stunden der Nacht und werfen sich nieder (vor Ihm).", "spanish": " No todos ellos son iguales. Entre las gentes del Libro hay un grupo que cumple con firmeza su alianza; ecitan la palabra de Al-lah durante las horas de la noche y se postran ante Él.", "urdu": " وہ سب (لوگ) برابر نہیں ہیں۔ اہل کتاب (ہی) میں سے ایک ایسی جماعت بھی ہے جو (اپنے عہد پر) قائم ہے۔ وہ رات کے اوقات میں اللہ کی آیتوں کو پڑھتے ہیں اور سجدے (بھی) کرتے ہیں۔"}, {"arabic": " یُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ یَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَ یَنۡہَوۡنَ عَنِ الۡمُنۡکَرِ وَ یُسَارِعُوۡنَ فِی الۡخَیۡرٰتِ ؕ وَ اُولٰٓئِکَ مِنَ الصّٰلِحِیۡنَ ﴿۱۱۵﴾", "english": " They believe in Allah and the Last Day, and enjoin what is good and forbid evil, and hasten, vying with one another, in good works. And these are among the righteous.", "french": " Ils croient en Allāh et au Jour Dernier ; ils enjoignent le bien et interdisent le mal et s’empressent à qui mieux mieux à faire de bonnes oeuvres. Ceux-là sont du nombre des justes.", "german": " Sie glauben an Allah und an den Jüngsten Tag und gebieten das Gute und verwehren das Böse und wetteifern miteinander in guten Werken. Und sie zählen zu den Rechtschaffenen.", "spanish": " Creen en Al-lah y en el Último Día, ordenan lo que es bueno y prohíben lo malo y rivalizan entre ellos en las buenas obras. Y éstos están entre los justos.", "urdu": " وہ اللہ (پر) اور آنے والے دن پر ایمان رکھتے ہیں اور نیکی کی ہدایت کرتے ہیں اور بدی سے روکتے ہیں اور نیک کاموں میں ایک دوسرے سے آگے بڑھتے ہیں اور یہ لوگ نیکوں میں سے ہیں۔"}, {"arabic": " وَ مَا یَفۡعَلُوۡا مِنۡ خَیۡرٍ فَلَنۡ یُّکۡفَرُوۡہُ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِالۡمُتَّقِیۡنَ ﴿۱۱۶﴾", "english": " And whatever good they do, they shall not be denied its due reward; and Allah well knows the God-fearing.", "french": " Et quelque bien qu’ils fassent, il ne leur en sera pas dénié, et Allāh connaît très bien ceux qui se préservent du mal.", "german": " Und was sie Gutes tun, nimmer wird es ihnen bestritten; und Allah kennt die Gottesfürchtigen wohl.", "spanish": " Y de sus buenas acciones no se les negará la debida recompensa; y Al-lah conoce bien a los que Le temen.", "urdu": " اور جو نیکی بھی وہ کریں اس کی ناقدری نہیں کی جائے گی۔ اور اللہ متقیوں کو خوب جانتا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا لَنۡ تُغۡنِیَ عَنۡہُمۡ اَمۡوَالُہُمۡ وَ لَاۤ اَوۡلَادُہُمۡ مِّنَ اللّٰہِ شَیۡـًٔا ؕ وَ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۱۱۷﴾", "english": " As for those who disbelieve, their possessions and their children shall not avail them aught against Allah; and these are the inmates of the Fire; therein shall they abide.", "french": " Quant aux mécréants, leurs biens et leurs enfants ne leur serviront à rien contre Allāh ; et ceux-là sont les gens du Feu. Ils y demeureront longtemps.", "german": " Den Ungläubigen aber sollen ihr Besitz und ihre Kinder nichts nützen gegen Allah; und sie sind des Feuers Bewohner; darin müssen sie bleiben.", "spanish": " Y en cuanto a los que no creen, de nada les valdrá ante Al-lah ni su hacienda ni sus hijos; éstos serán los habitantes del Fuego; allí tendrán su morada.", "urdu": " جو لوگ کافر ہیں انہیں نہ ان کے اموال اور نہ ان کی اولادیں اللہ کے عذاب سے بچائیں گی اور وہ (لوگ) آگ (میں پڑنے) والے ہیں۔ اس میں بستے چلے جائیں گے۔"}, {"arabic": " مَثَلُ مَا یُنۡفِقُوۡنَ فِیۡ ہٰذِہِ الۡحَیٰوۃِ الدُّنۡیَا کَمَثَلِ رِیۡحٍ فِیۡہَا صِرٌّ اَصَابَتۡ حَرۡثَ قَوۡمٍ ظَلَمُوۡۤا اَنۡفُسَہُمۡ فَاَہۡلَکَتۡہُ ؕ وَ مَا ظَلَمَہُمُ اللّٰہُ وَ لٰکِنۡ اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ﴿۱۱۸﴾", "english": " The likeness of what they spend for the present life is as the likeness of a wind wherein there is intense cold which smites the harvest of a people who have wronged themselves, and destroys it. And Allah has not wronged them, but they wrong themselves.", "french": " La similitude de ce qu’ils dépensent pour la vie d’ici-bas est comme celle d’un vent chargé d’un froid intense qui s’abat sur la moisson d’un peuple qui s’est fait du tort à lui-même et la détruit. Ce n’est pas Allāh Qui leur a fait du tort, mais ils se font tort à eux-mêmes.", "german": " Das, was sie für dieses Erdenleben hingeben, ist wie ein Wind, in dem eisige Kälte ist: er trifft die Ackerfrucht eines Volkes, das gegen sich selbst gefrevelt, und vernichtet sie. Und nicht Allah war gegen sie ungerecht, sie selbst sind ungerecht gegen sich.", "spanish": " Lo que gastan en la presente vida es parecido a un viento con frío glacial, que azota los cultivos de un pueblo que se ha perjudicado a sí mismo, y los destruye. Y no es Al-lah quien les hace daño, sino ellos mismos quienes se lo hacen.", "urdu": " جو کچھ یہ (لوگ) اس قریب کی زندگی کے متعلق خرچ کرتے ہیں اس کی حالت اس ہوا کی حالت کی طرح ہے جس میں سخت سردی ہو (اور) وہ ایسی قوم کی کھیتی پر چلے جس نے اپنے آپ پر ظلم کیا ہو پھر وہ اسے تباہ کر دے اور اللہ نے ان (لوگوں) پر ظلم نہیں کیا۔ ہاں! یہ اپنی جانوں پر آپ ہی ظلم کر رہے ہیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَّخِذُوۡا بِطَانَۃً مِّنۡ دُوۡنِکُمۡ لَا یَاۡلُوۡنَکُمۡ خَبَالًا ؕ وَدُّوۡا مَا عَنِتُّمۡ ۚ قَدۡ بَدَتِ الۡبَغۡضَآءُ مِنۡ اَفۡوَاہِہِمۡ ۚۖ وَ مَا تُخۡفِیۡ صُدُوۡرُہُمۡ اَکۡبَرُ ؕ قَدۡ بَیَّنَّا لَکُمُ الۡاٰیٰتِ اِنۡ کُنۡتُمۡ تَعۡقِلُوۡنَ ﴿۱۱۹﴾", "english": " O ye who believe! take not others than your own people as intimate friends; they will not fail to corrupt you. They love to see you in trouble. Hatred has already shown itself through the utterances of their mouths, and what their breasts conceal is greater still. We have made clear to you Our commandments, if you will understand.", "french": " Ô croyants ! Ne choisissez pas comme amis intimes en dehors de vos propres gens ; ils ne manqueront pas de vous corrompre. Ils aiment à vous voir en difficulté. La haine s’est déjà manifestée à travers ce qui sort de leurs bouches ; et ce que leur cœur cache est plus grave encore. Nous vous avons rendu clairs Nos commandements, si vous voulez bien comprendre.", "german": " O die ihr glaubt, nehmt euch nicht andere zu vertrauten Freunden, unter Ausschluss der Eurigen; sie werden nicht verfehlen, euch zu verderben. Sie sehen es gern, wenn euch Unheil trifft. Schon ward Hass offenbar von ihren Zungen, doch was ihre Herzen verhehlen, ist noch weit schlimmer. Wir haben euch die Gebote klargemacht, wenn ihr nur verstehen wollt.", "spanish": " ¡Oh, vosotros, los que creéis! no toméis como amigos íntimos a otros que no sean de los vuestros; porque ellos no dejarán de corromperos. Les agrada veros en problemas. El odio se ha manifestado ya por lo que profieren sus bocas, y es aún peor lo que ocultan en sus corazones. Os hemos aclarado Nuestro mandamiento, si es que comprendéis.", "urdu": " اے ایماندارو! اپنے لوگوں کو چھوڑ کر (دوسروں کو) راز دار دوست نہ بناٶ وہ تم سے بدسلوکی کرنے میں کوئی کمی نہیں کرتے (اور) تمہارے دکھ میں پڑجانے کو پسند کرتے ہیں۔ (ان کی) دشمنی ان کے مونہوں سے ظاہر ہو چکی ہے اور جو کچھ ان کے سینوں میں مخفی ہے وہ (اس سے بھی) بڑھ کر ہے۔ اگر تم عقل سے کام لینے والے ہو تو ہم نے تمہارے لئے اپنی آیات کو کھول کر بیان کر دیا ہے۔"}, {"arabic": " ہٰۤاَنۡتُمۡ اُولَآءِ تُحِبُّوۡنَہُمۡ وَ لَا یُحِبُّوۡنَکُمۡ وَ تُؤۡمِنُوۡنَ بِالۡکِتٰبِ کُلِّہٖ ۚ وَ اِذَا لَقُوۡکُمۡ قَالُوۡۤا اٰمَنَّا ۚ٭ۖ وَ اِذَا خَلَوۡا عَضُّوۡا عَلَیۡکُمُ الۡاَنَامِلَ مِنَ الۡغَیۡظِ ؕ قُلۡ مُوۡتُوۡا بِغَیۡظِکُمۡ ؕ اِنَّ اللّٰہَ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۱۲۰﴾", "english": " Behold, you are those who love them, but they love you not. And you believe in all the Book. When they meet you, they say, ‘We believe;’ but when they are alone, they bite their finger-tips at you for rage. Say, ‘Perish in your rage. Surely, Allah knows well what is hidden in your breasts.’", "french": " Comment vous êtes drôles ! Vous les aimez alors qu’ils ne vous aiment pas. Et vous croyez au Livre tout entier. Lorsqu’ils vous rencontrent, ils disent : « Nous croyons, » mais quand ils sont seuls, ils se mordent les bouts des doigts, tant ils sont fous de rage contre vous. Dis : « Mourez de votre rage. En vérité, Allāh connaît très bien ce qui est caché dans les cœurs. »", "german": " Seht her, ihr liebt sie, sie aber lieben euch nicht. Und ihr glaubt an das ganze Buch. Wenn sie euch treffen, sagen sie: \"Wir glauben\"; sobald sie aber allein sind, beißen sie sich in die Fingerspitzen vor Zorn gegen euch. Sprich: \"Sterbet an eurem Zorn.\" Wahrlich, Allah weiß das Innerste der Seelen wohl.", "spanish": " He ahí que vosotros los amáis, pero ellos no os aman. Y vosotros creéis en todo el Libro. Cuando se reúnen con vosotros, dicen: “Creemos”; pero cuando están solos se muerden las yemas de los dedos de rabia contra vosotros. Diles: “Morid en vuestra rabia. En verdad, Al-lah conoce bien lo que está oculto en vuestros corazones”.", "urdu": " سنو! تم وہ لوگ ہو جو ان سے محبت رکھتے ہو حالانکہ وہ تم سے محبت نہیں رکھتے اور تم سب (کی سب) کتاب پر ایمان لاتے ہو اور جب وہ تم سے ملیں تو کہہ دیتے ہیں کہ ہم (بھی) ایمان رکھتے ہیں اور جب وہ علیحدہ ہوتے ہیں تو تمہارے خلاف غصہ سے انگلیاں کاٹتے ہیں۔ تو (ان سے) کہہ دے تم اپنے غصہ (کے سبب) سے مرجاٶ۔ اللہ یقیناً سینہ کے رازوں تک کو بھی جانتا ہے۔"}, {"arabic": " اِنۡ تَمۡسَسۡکُمۡ حَسَنَۃٌ تَسُؤۡہُمۡ ۫ وَ اِنۡ تُصِبۡکُمۡ سَیِّئَۃٌ یَّفۡرَحُوۡا بِہَا ؕ وَ اِنۡ تَصۡبِرُوۡا وَ تَتَّقُوۡا لَا یَضُرُّکُمۡ کَیۡدُہُمۡ شَیۡـًٔا ؕ اِنَّ اللّٰہَ بِمَا یَعۡمَلُوۡنَ مُحِیۡطٌ ﴿۱۲۱﴾٪", "english": " If anything good befall you, it grieves them; and if an evil befall you, they rejoice thereat. But if you be steadfast and righteous, their designs will not harm you at all; surely, Allah encompasses all that they do.", "french": " Si un bien vous arrive, ils s’en affligent ; et si un malheur vous atteint, ils s’en réjouissent. Mais si vous restez fermes dans la foi d’Allāh et que vous êtes droits, leurs mauvais desseins ne vous causeront aucun tort, car Allāh cerne tout ce qu’ils font.", "german": " Wenn euch etwas Gutes widerfährt, so tut es ihnen wehe; widerfährt euch Böses, so frohlocken sie darob. Seid ihr aber standhaft und redlich, so werden ihre Ränke euch nichts schaden; denn wahrlich, Allah wird ihr Tun zunichte machen.", "spanish": " Si os ocurre algo bueno, eso les molesta; y si os ocurre algo malo se regocijan. Pero si sois perseverantes y piadosos, sus designios no os perjudicarán en absoluto; en verdad, Al-lah conoce todo lo que hacen.", "urdu": " اگر تمہیں کوئی کامیابی حاصل ہو تو انہیں برا لگتا ہے۔ اور اگر تمہیں کوئی تکلیف پہنچے تو وہ اس سے خوش ہوتے ہیں۔ اور اگر تم صبر کرو گے اور تقویٰ اختیار کرو گے تو ان کی (مخالفانہ) چال تمہیں کچھ (بھی) نقصان نہیں پہنچائے گی اور جو کچھ وہ کرتے ہیں اللہ یقیناً اسے پارہ پارہ کرنے والا ہے۔"}, {"arabic": " وَ اِذۡ غَدَوۡتَ مِنۡ اَہۡلِکَ تُبَوِّیٴُ الۡمُؤۡمِنِیۡنَ مَقَاعِدَ لِلۡقِتَالِ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۱۲۲﴾ۙ", "english": " And remember the time when thou didst go forth early in the morning from thy household, assigning to the believers their positions for battle. And Allah is All- Hearing, All-Knowing;", "french": " Et souviens-toi quand tu sortis de grand matin de ta maison, assignant aux croyants leurs postes de combat – et Allāh entend tout et sait tout –", "german": " Und (gedenke der Zeit) da du des Morgens früh von deinem Hause aufbrachst und den Gläubigen ihre Stellungen für die Schlacht anwiesest. Und Allah ist allhörend, allwissend;", "spanish": " Y acuérdate de cuando abandonaste tu casa al amanecer, a fin de asignar a los creyentes sus posiciones para la batalla. Pues Al-lah es quien todo lo oye, el Omnisciente.", "urdu": " اور (اس وقت کو یاد کرو) جب تم اپنے اہل کے پاس سے نکل کر صبح صبح اس لئے گیا تھا کہ مومنوں کو جنگ کے لئے ان کی مقررہ جگہوں پر بٹھا دے اور اللہ (تیری دعائیں) بہت سننے والا (اور تم لوگوں کے حالات کو) خوب جاننے والا ہے۔"}, {"arabic": " اِذۡ ہَمَّتۡ طَّآئِفَتٰنِ مِنۡکُمۡ اَنۡ تَفۡشَلَا ۙ وَ اللّٰہُ وَلِیُّہُمَا ؕ وَ عَلَی اللّٰہِ فَلۡیَتَوَکَّلِ الۡمُؤۡمِنُوۡنَ ﴿۱۲۳﴾", "english": " When two of your groups meditated cowardice, although Allah was their friend. And upon Allah should the believers rely.", "french": " Ce fut quand deux de vos bandes méditaient une lâcheté, bien qu’Allāh fût leur Ami. Et c’est en Allāh que les croyants doivent placer leur confiance.", "german": " wie zwei von euren Haufen Feigheit sannen, obwohl Allah ihr Freund war. Und auf Allah sollten die Gläubigen bauen.", "spanish": " Cuando dos de vuestros grupos flaquearon aunque Al-lah era su Amigo. Y los creyentes deben apoyarse en Al-lah.", "urdu": " (پھر اس وقت کو بھی یاد کر) جب (کہ ان کے حالات کو دیکھ کر) تم میں سے دو گروہ بزدلی دکھانے پر تیار ہو گئے تھے حالانکہ اللہ ان کا دوست تھا اور مومنوں کو تو اللہ پر ہی بھروسہ رکھنا چاہئیے۔"}, {"arabic": " وَ لَقَدۡ نَصَرَکُمُ اللّٰہُ بِبَدۡرٍ وَّ اَنۡتُمۡ اَذِلَّۃٌ ۚ فَاتَّقُوا اللّٰہَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۱۲۴﴾", "english": " And Allah had already helped you at Badr when you were weak. So take Allah for your Protector that you may be grateful.", "french": " Et, en vérité, Allāh vous a déjà secourus à Badr lorsque vous étiez faibles. Prenez donc Allāh comme Protecteur, afin que vous soyez reconnaissants.", "german": " Und Allah war euch schon bei Badr beigestanden, als ihr schwach waret. So nehmet euch Allah zum Beschützer, auf dass ihr dankbar sein möget.", "spanish": " Y Al-lah os había ayudado ya en Badr cuando erais débiles. Tomad pues a Al-lah como vuestro Protector para que seáis agradecidos.", "urdu": " اور (اس سے پہلے) بدر (کی جنگ) میں جبکہ تم حقیر تھے اللہ یقیناً تمہیں مدد دے چکا ہے۔ سو تم اللہ کا تقویٰ اختیار کرو تا کہ تم شکر گذار بنو۔"}, {"arabic": " اِذۡ تَقُوۡلُ لِلۡمُؤۡمِنِیۡنَ اَلَنۡ یَّکۡفِیَکُمۡ اَنۡ یُّمِدَّکُمۡ رَبُّکُمۡ بِثَلٰثَۃِ اٰلٰفٍ مِّنَ الۡمَلٰٓئِکَۃِ مُنۡزَلِیۡنَ ﴿۱۲۵﴾ؕ", "english": " When thou didst say to the believers, ‘Will it not suffice you that your Lord should help you with three thousand angels sent down from on high ?’", "french": " Quand tu disais aux croyants : « Ne vous suffira-t-il pas que votre Seigneur vous vienne en aide en faisant descendre trois mille anges des cieux ?", "german": " Wie du zu den Gläubigen sprachst: \"Genügt es euch nicht, dass euer Herr euch mit dreitausend (vom Himmel) herabgesandten Engeln zu Hilfe kommt?\"", "spanish": " Cuando dijiste a los creyentes: “¿No será suficiente para nosotros on que vuestro Señor os ayude con tres mil ángeles enviados desde lo alto?”.", "urdu": " (اس وقت کو بھی یاد کر) جب تو مومنوں سے کہہ رہا تھا کہ کیا تمہارے لئے یہ (بات) کافی نہ ہوگی کہ تمہارا رب (آسمان سے) نازل کئے ہوئے تین ہزار فرشتوں کے ذریعہ سے تمہاری مدد کرے۔"}, {"arabic": " بَلٰۤی ۙ اِنۡ تَصۡبِرُوۡا وَ تَتَّقُوۡا وَ یَاۡتُوۡکُمۡ مِّنۡ فَوۡرِہِمۡ ہٰذَا یُمۡدِدۡکُمۡ رَبُّکُمۡ بِخَمۡسَۃِ اٰلٰفٍ مِّنَ الۡمَلٰٓئِکَۃِ مُسَوِّمِیۡنَ ﴿۱۲۶﴾", "english": " Yea, if you be steadfast and righteous and they come upon you immediately in hot haste, your Lord will help you with five thousand angels, attacking vehemently.", "french": " Oui, si vous demeurez fermes et droits et que vos ennemis fondent sur vous au grand galop, votre Seigneur vous enverra pour vous aider cinq mille anges, qui les attaqueront avec véhémence. »", "german": " Ja, wenn ihr standhaft und redlich seid und sie kommen über euch jählings in wilder Hast, so wird euer Herr euch mit fünftausend stürmenden Engeln zu Hilfe kommen.", "spanish": " Cierto que si sois perseverantes y piadosos y ellos os atacan de inmediato y por sorpresa, vuestro Señor os ayudará con cinco mil ángeles, atacando valientemente.", "urdu": " کیوں (کافی) نہ ہوگی! اگر تم صبر کرو اور تقویٰ اختیار کرو۔ اور وہ (کافر) تم پر اسی دم چڑھ آئیں تو تمہارا رب پانچ ہزار سخت حملہ کرنے والے فرشتوں کے ذریعہ سے تمہاری مدد کرے گا۔"}, {"arabic": " وَ مَا جَعَلَہُ اللّٰہُ اِلَّا بُشۡرٰی لَکُمۡ وَ لِتَطۡمَئِنَّ قُلُوۡبُکُمۡ بِہٖ ؕ وَ مَا النَّصۡرُ اِلَّا مِنۡ عِنۡدِ اللّٰہِ الۡعَزِیۡزِ الۡحَکِیۡمِ ﴿۱۲۷﴾ۙ", "english": " And Allah has made it only as glad tidings for you and that your hearts might be at rest thereby; and help comes from Allah alone, the Mighty, the Wise.", "french": " Et Allāh n’a fait ceci qu’à titre de bonne nouvelle pour vous, et pour que vos cœurs soient tranquillisés ; et le secours ne vient que d’Allāh Seul, le Puissant, le Sage,", "german": " Und Allah richtete es nur als frohe Botschaft für euch ein und auf dass sich eure Herzen damit beruhigten – und Hilfe kommt von Allah allein, dem Allmächtigen, dem Allweisen –.", "spanish": " Y Al-lah no lo ha hecho sino como una buena nueva para vosotros y para que vuestros corazones se tranquilicen; y la ayuda sólo procede de Al-lah, el Poderoso, el Sabio.", "urdu": " و ۱۲۸۔اور اللہ نے یہ (بات) صرف تمہارے لئے خوشخبری کے طور پر اور اس لئے کہ تمہارے دل اس کے ذریعہ سے اطمینان پائیں مقرر کی ہے (اور) اس لئے (مقرر کی ہے) کہ تا وہ (اللہ) کافروں کے ایک حصہ کو کاٹ دے یا انہیں ذلیل کر دے تا کہ وہ ناکام واپس جائیں۔ ورنہ مدد تو (صرف) اللہ ہی کی طرف سے (آتی) ہے جو غالب (اور) حکمت والا ہے۔"}, {"arabic": " لِیَقۡطَعَ طَرَفًا مِّنَ الَّذِیۡنَ کَفَرُوۡۤا اَوۡ یَکۡبِتَہُمۡ فَیَنۡقَلِبُوۡا خَآئِبِیۡنَ ﴿۱۲۸﴾", "english": " God will do so that He might cut off a part of the disbelievers or abase them so that they might go back frustrated.", "french": " Pour qu’Il fauche une partie des mécréants ou les humilie, et afin qu’ils en retournent déconfits.", "german": " (Ferner) damit Er einen Teil der Ungläubigen abschneide oder sie niederwerfe, dass sie unverrichteter Dinge umkehren.", "spanish": " Dios lo hará así para poder eliminar a parte de los incrédulos o derribarlos a fin de que retrocedan desengañados.", "urdu": " (اور) اس لئے (مقرر کی ہے) کہ تا وہ (اللہ) کافروں کے ایک حصہ کو کاٹ دے یا انہیں ذلیل کر دے تا کہ وہ ناکام واپس جائیں۔"}, {"arabic": " لَیۡسَ لَکَ مِنَ الۡاَمۡرِ شَیۡءٌ اَوۡ یَتُوۡبَ عَلَیۡہِمۡ اَوۡ یُعَذِّبَہُمۡ فَاِنَّہُمۡ ظٰلِمُوۡنَ ﴿۱۲۹﴾", "english": " Thou hast no concern in the matter: He may turn to them in mercy or punish them, for they are wrongdoers.", "french": " Cette affaire ne dépend aucunement de toi ; il se peut qu’Il se tourne vers eux avec clémence ou qu’Il les châtie, car ce sont des injustes.", "german": " Das ist nicht deine Angelegenheit; Er mag Sich ihnen gnädig zuwenden oder sie bestrafen, weil sie Frevler sind.", "spanish": " A ti nada te incumbe en el asunto: Él puede volverse hacia ellos con misericordia o castigarlos, porque son malvados.", "urdu": " تیرا اس معاملہ میں کچھ (دخل) نہیں (یہ سب معاملہ خدا کے ہاتھ میں ہے) چاہے تو ان پر فضل کرے اور چاہے تو ان کو عذاب دے دے (اور وہ عذاب کے ہی مستحق ہیں) کیونکہ وہ ظالم ہیں۔"}, {"arabic": " وَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ یَغۡفِرُ لِمَنۡ یَّشَآءُ وَ یُعَذِّبُ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۳۰﴾٪", "english": " And to Allah belongs whatever is in the heavens and whatever is in the earth. He forgives whomsoever He pleases and punishes whomsoever He pleases, and Allah is Most Forgiving, Merciful.", "french": " Et à Allāh appartiennent tout ce qui est dans les cieux et tout ce qui est sur la terre. Il pardonne à qui Il veut et Il punit qui Il veut, et Allāh est Très-Pardonnant et Miséricordieux.", "german": " Allahs ist, was in den Himmeln und was auf Erden ist. Er vergibt, wem Er will, und Er bestraft, wen Er will, und Allah ist allvergebend, barmherzig.", "spanish": " Y a Al-lah pertenece cuanto hay en los cielos y en la tierra. Él perdona a quien le place y castiga a quien le place, pues Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے (سب) اللہ ہی کا ہے۔ وہ جسے چاہتا ہے بخش دیتا ہے اور جسے چاہتا ہے عذاب دیتا ہے اور اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَاۡکُلُوا الرِّبٰۤوا اَضۡعَافًا مُّضٰعَفَۃً ۪ وَ اتَّقُوا اللّٰہَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿۱۳۱﴾ۚ", "english": " O ye who believe! devour not interest involving diverse additions; and fear Allah that you may prosper.", "french": " Ô vous qui croyez ! Ne consommez pas l’intérêt qui comprend des additions multiples ; et craignez Allāh afin de prospérer.", "german": " O die ihr glaubt, verschlinget nicht Zins, der (die Schuld) übermäßig mehrt; und fürchtet Allah, auf dass ihr Erfolg habt.", "spanish": " ¡Oh, vosotros, los que creéis! no devoréis intereses que llevan inherente su multiplicación; y temed a Al-lah para que prosperéis.", "urdu": " اے ایماندارو! تم (اپنے مال پر) سود جو (مال کو) بے انتہا بڑھاتا ہے۔ مت کھاٶ۔ اور اللہ کا تقویٰ اختیار کرو تا کہ تم کامیاب ہو جاٶ۔"}, {"arabic": " وَ اتَّقُوا النَّارَ الَّتِیۡۤ اُعِدَّتۡ لِلۡکٰفِرِیۡنَ ﴿۱۳۲﴾ۚ", "english": " And fear the Fire prepared for the disbelievers.", "french": " Et redoutez le Feu qui a été préparé pour les mécréants.", "german": " Und fürchtet das Feuer, das für die Ungläubigen bereitet ward.", "spanish": " Y temed al Fuego preparado para los incrédulos.", "urdu": " اور اس آگ سے ڈرو جو منکروں کے لئے تیار کی گئی ہے۔"}, {"arabic": " وَ اَطِیۡعُوا اللّٰہَ وَ الرَّسُوۡلَ لَعَلَّکُمۡ تُرۡحَمُوۡنَ ﴿۱۳۳﴾ۚ", "english": " And obey Allah and the Messenger that you be shown mercy.", "french": " Et obéissez à Allāh et au Messager, afin que miséricorde vous soit faite.", "german": " Und gehorchet Allah und dem Gesandten, auf dass ihr Gnade finden möget.", "spanish": " Y obedeced a Al-lah y al Mensajero, para que se os muestre misericordia.", "urdu": " اور اللہ (کی) اور اس رسول کی اطاعت کرو تا کہ تم پر رحم کیا جائے۔"}, {"arabic": " وَ سَارِعُوۡۤا اِلٰی مَغۡفِرَۃٍ مِّنۡ رَّبِّکُمۡ وَ جَنَّۃٍ عَرۡضُہَا السَّمٰوٰتُ وَ الۡاَرۡضُ ۙ اُعِدَّتۡ لِلۡمُتَّقِیۡنَ ﴿۱۳۴﴾ۙ", "english": " And vie with one another in asking for forgiveness from your Lord, and for a Paradise whose price is the heavens and the earth, prepared for the God-fearing —", "french": " Et hâtez-vous à qui mieux mieux vers le pardon de votre Seigneur et vers un Paradis large comme les cieux et la terre, préparé pour ceux qui craignent Allāh –", "german": " Und wetteifert miteinander im Trachten nach der Vergebung eures Herrn und einem Paradiese, dessen Preis Himmel und Erde sind, bereitet für die Gottesfürchtigen –", "spanish": " Y rivalizad mutuamente pidiendo el perdón de vuestro Señor, y pidiendo el paraíso cuya recompensa son los cielos y la tierra, preparado para los temerosos de Dios.", "urdu": " اور اپنے رب کی طرف سے نازل ہونے والی بخشش (کی طرف) اور اس جنت کی طرف جس کی قیمت آسمان اور زمین ہیں اور جو متقیوں کے لئے تیار کی گئی ہے بڑھو۔"}, {"arabic": " الَّذِیۡنَ یُنۡفِقُوۡنَ فِی السَّرَّآءِ وَ الضَّرَّآءِ وَ الۡکٰظِمِیۡنَ الۡغَیۡظَ وَ الۡعَافِیۡنَ عَنِ النَّاسِ ؕ وَ اللّٰہُ یُحِبُّ الۡمُحۡسِنِیۡنَ ﴿۱۳۵﴾ۚ", "english": " Those who spend in prosperity and adversity, and those who suppress anger and pardon men; and Allah loves those who do good;", "french": " Ceux qui dépensent dans la prospérité et dans l’adversité, et ceux qui réfrènent leur colère et qui pardonnent aux autres ; et Allāh aime ceux qui font le bien ;", "german": " die da spenden in Überfluss und Mangel, die den Zorn unterdrücken und den Mitmenschen vergeben; und Allah liebt, die da Gutes tun,", "spanish": " Los que gastan en la prosperidad y en la adversidad, y los que reprimen su cólera y perdonan a los hombres; pues Al-lah ama a los que hacen el bien;", "urdu": " جو (متقی) خوشحالی (میں بھی) اور تنگ دستی میں (بھی) (خدا کی راہ میں) خرچ کرتے ہیں اور غصہ کو دبانے والے اور لوگوں کو معاف کرنے والے ہیں اور اللہ محسنوں سے محبت کرتا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ اِذَا فَعَلُوۡا فَاحِشَۃً اَوۡ ظَلَمُوۡۤا اَنۡفُسَہُمۡ ذَکَرُوا اللّٰہَ فَاسۡتَغۡفَرُوۡا لِذُنُوۡبِہِمۡ ۪ وَ مَنۡ یَّغۡفِرُ الذُّنُوۡبَ اِلَّا اللّٰہُ ۪۟ وَ لَمۡ یُصِرُّوۡا عَلٰی مَا فَعَلُوۡا وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۱۳۶﴾", "english": " And those who, when they commit a foul deed or wrong themselves, remember Allah and implore forgiveness for their sins — and who can forgive sins except Allah? — and do not persist knowingly in what they have done.", "french": " Et ceux qui, après avoir fait une action immorale ou après s’être fait du tort, se souviennent d’Allāh et Lui demandent de leur pardonner leurs péchés – et qui peut pardonner les péchés sinon Allāh ? – et qui ne s’obstinent pas sciemment dans ce qu’ils ont fait,", "german": " und die, so sie eine Untat begehen oder wider sich selbst sündigen, Allahs gedenken und um Verzeihung flehen für ihre Sünden – und wer kann Sünden vergeben außer Allah? – und die nicht wissentlich beharren in ihrem Tun.", "spanish": " Y aquellos que, cuando cometen una mala acción o se perjudican, se acuerdan de Al-lah e imploran el perdón de sus pecados -¿y quién puede perdonar los pecados sino Al-lah?- y no persisten a sabiendas en lo que han hecho.", "urdu": " ہاں (ان لوگوں کے لئے جو کسی برا کام کرنے کی صورت میں یا اپنی جانوں پر ظلم کرنے کی صورت میں اللہ کو یاد کرتے ہیں اور اپنے قصوروں کی معافی چاہتے ہیں اور اللہ کے سوا کون قصور معاف کر سکتا ہے اور جو کچھ انہوں نے کیا ہوتا ہے اس پر (دیدہ و) دانستہ ضد نہیں کرتے۔"}, {"arabic": " اُولٰٓئِکَ جَزَآؤُہُمۡ مَّغۡفِرَۃٌ مِّنۡ رَّبِّہِمۡ وَ جَنّٰتٌ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ وَ نِعۡمَ اَجۡرُ الۡعٰمِلِیۡنَ ﴿۱۳۷﴾ؕ", "english": " It is these whose reward is forgiveness from their Lord, and Gardens beneath which rivers flow, wherein they shall abide; and how good is the reward of those who work!", "french": " Ceux-là auront comme récompense le pardon de leur Seigneur, et des Jardins sous lesquels coulent des rivières, où ils demeureront éternellement ; et comme est excellente la récompense de ceux qui oeuvrent pour le bien !", "german": " Ihr Lohn ist ihres Herrn Vergebung und Gärten, durch welche Ströme fließen, darin sollen sie weilen; und wie schön ist der Lohn der Wirkenden!", "spanish": " Son éstos cuya recompensa es el perdón de su Señor, y jardines por los cuales corren ríos, en donde morarán eternamente; ¡qué hermosa es la recompensa de los que trabajan!", "urdu": " یہ لوگ ایسے ہیں کہ ان کی جزا ان کے رب کی طرف سے (نازل ہونے والی) مغفرت اور ایسے باغات ہوں گے جن کے نیچے نہریں بہتی ہوں گی۔ اور وہ ان میں بستے چلے جائیں گے اور کام کرنے والوں کا (یہ) بدلہ کیا ہی اچھا ہے۔"}, {"arabic": " قَدۡ خَلَتۡ مِنۡ قَبۡلِکُمۡ سُنَنٌ ۙ فَسِیۡرُوۡا فِی الۡاَرۡضِ فَانۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الۡمُکَذِّبِیۡنَ ﴿۱۳۸﴾", "english": " Surely, there have been many dispensations before you; so travel through the earth and see how evil was the end of those who treated the Prophets as liars.", "french": " Assurément, bien des civilisations ont passé avant vous ; parcourez donc la terre et voyez l’ affreuse fin de ceux qui ont traité les Prophètes de menteurs.", "german": " Es sind vor euch schon viele Verordnungen ergangen; also durchwandert die Erde und schaut, wie das Ende derer war, die (sie) verwarfen!", "spanish": " En verdad hubo muchos designios antes de vosotros; recorred, pues, a tierra y comprobad qué malo fue el fin de los que trataron a los Profetas de embusteros.", "urdu": " تم سے پہلے کئی دستور العمل گذر چکے ہیں (جن کے نتائج دیکھنے ہوں) تو زمین میں پھرو اور دیکھو کہ (ان قوانین کو) جھٹلانے والوں کا کیسا (برا) انجام ہوا۔"}, {"arabic": " ہٰذَا بَیَانٌ لِّلنَّاسِ وَ ہُدًی وَّ مَوۡعِظَۃٌ لِّلۡمُتَّقِیۡنَ ﴿۱۳۹﴾", "english": " This (the Qur’an) is a clear demonstration to men, and a guidance and an admonition to the Godfearing.", "french": " Ceci - le Coran - est une déclaration claire aux hommes, ainsi qu’une direction et une exhortation pour ceux qui craignent Allāh.", "german": " Dies (der Qur-ân) ist eine klare Darlegung für die Menschen und eine Führung und eine Ermahnung den Gottesfürchtigen.", "spanish": " Éste (el Corán), es una declaración evidente para los hombres, una guía y exhortación para los temerosos de Dios.", "urdu": " یہ (ذکر) لوگوں کے لئے بہت وضاحت کرنے والا ہے اور متقیوں کے لئے ہدایت اور نصیحت ہے۔"}, {"arabic": " وَ لَا تَہِنُوۡا وَ لَا تَحۡزَنُوۡا وَ اَنۡتُمُ الۡاَعۡلَوۡنَ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۱۴۰﴾", "english": " Slacken not, nor grieve; and you shall certainly have the upper hand, if you are believers.", "french": " Ne faites pas preuve de faiblesse et ne vous désolez pas ; et vous prévaudrez certainement, si vous êtes croyants.", "german": " Ermattet nicht und trauert nicht; ihr werdet sicherlich die Oberhand behalten, wenn ihr Gläubige seid.", "spanish": " No os desaniméis ni os aflijáis; y tendréis ciertamente la posibilidad más ventajosa, si es que sois creyentes.", "urdu": " اور تم کمزوری نہ دکھا‘ اور نہ غم کرو اور اگر تم مومن ہو تو تم ہی بالا رہو گے۔"}], "Surah": 3}