{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لیکر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِنَّاۤ اَنۡزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۲﴾", "english": " Surely, We sent it down on the Night of Destiny.", "french": " Assurément, Nous l’avons fait descendre pendant la Nuit de Al-Qadr.", "german": " Wahrlich, Wir sandten ihn (den Qur-ân) hernieder in der Nacht Al-Qadr.", "spanish": " En verdad, lo revelamos en la Noche del Destino.", "urdu": " ہم نے یقیناً اس (قرآن) کو ایک (عظیم الشان) تقدیر والی رات میں اتارا ہے۔"}, {"arabic": " وَ مَاۤ اَدۡرٰٮکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۳﴾", "english": " And what should make thee know what the Night of Destiny is?", "french": " Et qu’est-ce qui te ferait savoir ce qu’est la Nuit de Al-Qadr ?", "german": " Und was lehrt dich wissen, was die Nacht Al-Qadr ist?", "spanish": " Y ¿qué podía darte a conocer qué es la Noche del Destino?", "urdu": " اور (اے مخاطب)! تجھے کیا معلوم ہے کہ (یہ عظیم الشان) رات جس میں تقدیریں اترتی ہیں کیا شے ہے۔"}, {"arabic": " لَیۡلَۃُ الۡقَدۡرِ ۬ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۴﴾", "english": " The Night of Destiny is better than a thousand months.", "french": " La Nuit de Al-Qadr vaut mieux que mille mois.", "german": " Die Nacht Al-Qadr ist besser als tausend Monde.", "spanish": " La Noche del Destino es mejor que un millar de meses.", "urdu": " یہ (عظیم الشان) تقدیروں والی رات تو ہزار مہینے سے بھی بہتر ہے۔"}, {"arabic": " تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۵﴾", "english": " Therein descend angels and the Spirit by the command of their Lord — with every matter.", "french": " Durant celle-ci descendent les anges et l’Esprit avec le décret de leur Seigneur concernant chaque chose.", "german": " In ihr steigen Engel herab und der Geist nach dem Gebot ihres Herrn – mit jeder Sache.", "spanish": " En ella descienden ángeles y el Espíritu con el decreto de su Señor en relación con todos los asuntos.", "urdu": " (ہر قسم کے) فرشتے اور (کامل) روح اس (رات) میں اپنے رب کے حکم سے تمام (دینی و دنیوی) امور لے کر اترتے ہیں۔"}, {"arabic": " سَلٰمٌ ۟ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۶﴾", "english": " It is all peace till the rising of the dawn.", "french": " Tout est paix – et il en sera ainsi jusqu’à la naissance de l’aube.", "german": " Friede währt bis zum Anbruch der Morgenröte.", "spanish": " Paz: así será incluso cuando despunte la aurora.", "urdu": " (پھر فرشتوں کے اترنے کے بعد تو) سلامتی (ہی سلامتی ہوتی) ہے (اور) یہ (حال) صبح کے طلوع ہونے تک (رہتا) ہے۔"}], "Surah": 97}