{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِذَا جَآءَکَ الۡمُنٰفِقُوۡنَ قَالُوۡا نَشۡہَدُ اِنَّکَ لَرَسُوۡلُ اللّٰہِ ۘ وَ اللّٰہُ یَعۡلَمُ اِنَّکَ لَرَسُوۡلُہٗ ؕ وَ اللّٰہُ یَشۡہَدُ اِنَّ الۡمُنٰفِقِیۡنَ لَکٰذِبُوۡنَ ۚ﴿۲﴾", "english": " When the hypocrites come to thee, they say, ‘We bear witness that thou art indeed the Messenger of Allah.’ And Allah knows that thou art indeed His Messenger, but Allah bears witness that the hypocrites are surely liars.", "french": " Quand les hypocrites viennent à toi, ils disent : « Nous témoignons que tu es en effet le Messager d’Allāh. » Et Allāh sait que tu es en effet Son Messager, mais Allāh atteste que les hypocrites sont sûrement des menteurs.", "german": " Wenn die Heuchler zu dir kommen, sagen sie: \"Wir bezeugen, dass du in Wahrheit der Gesandte Allahs bist.\" Und Allah weiß, dass du in Wahrheit Sein Gesandter bist, jedoch Allah bezeugt, dass die Heuchler gewisslich Lügner sind.", "spanish": " Cuando llegan a ti los hipócritas dicen: “Somos testigos de que eres en verdad el Mensajero de Al-lah”. Al-lah sabe que ciertamente tú eres el Mensajero, pero Él es Testigo de que los hipócritas son ciertamente embusteros.", "urdu": " جب تیرے پاس منافق آتے ہیں تو وہ کہتے ہیں کہ ہم قسم کھا کر گواہی دیتے ہیں کہ تو اللہ کا رسول ہے۔ اور اللہ جانتا ہے کہ تو اس کا رسول ہے۔ مگر (ساتھ ہی) اللہ قسم کھا کر گواہی دیتا ہے کہ منافق جھوٹے ہیں۔"}, {"arabic": " اِتَّخَذُوۡۤا اَیۡمَانَہُمۡ جُنَّۃً فَصَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ ؕ اِنَّہُمۡ سَآءَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۳﴾", "english": " They have made their oaths a shield; thus they turn men away from the way of Allah. Evil surely is that which they have been doing.", "french": " Ils ont fait de leurs serments un bouclier ; c’est ainsi qu’ils empêchent les gens de suivre la voie d’Allāh. Mauvais est assurément ce qu’ils faisaient !", "german": " Sie haben sich aus ihren Eiden einen Schild gemacht; so machen sie abwendig vom Wege Allahs. Schlimm ist wahrlich das, was sie zu tun pflegen.", "spanish": " Han hecho de sus juramentos un escudo; de este modo apartan a los hombres del camino de Al-lah. Qué perverso es en verdad lo que han estado haciendo.", "urdu": " انہوں نے اپنی قسموں کو (تیری گرفت سے بچنے کے لئے) ڈھال بنا لیا ہے اور وہ اللہ کے رستہ سے لوگوں کو روکتے ہیں‘ جو کچھ وہ کرتے ہیں بہت برا ہے۔"}, {"arabic": " ذٰلِکَ بِاَنَّہُمۡ اٰمَنُوۡا ثُمَّ کَفَرُوۡا فَطُبِعَ عَلٰی قُلُوۡبِہِمۡ فَہُمۡ لَا یَفۡقَہُوۡنَ ﴿۴﴾", "english": " That is because they first believed, then disbelieved. So a seal was set upon their hearts and consequently they understand not.", "french": " C’est parce qu’ils ont d’abord cru, et qu’ensuite ils ont mécru. Aussi, un sceau a été mis sur leur cœur, donc ils ne comprennent pas.", "german": " Dies, weil sie glaubten und hernach ungläubig wurden. So ist ein Siegel auf ihre Herzen gesetzt worden, also dass sie nicht verstehen.", "spanish": " Y es porque en primer lugar creyeron y después dejaron de creer. Se les puso, pues, un sello en sus corazones y, en consecuencia, no comprenden.", "urdu": " یہ کام وہ اس لئے کرتے ہیں کہ وہ پہلے ایمان لائے پھر انہوں نے انکار کر دیا۔ جس کے نتیجہ میں ان کے دلوں پر مہر لگا دی گئی اور اب وہ سمجھتے نہیں۔"}, {"arabic": " وَ اِذَا رَاَیۡتَہُمۡ تُعۡجِبُکَ اَجۡسَامُہُمۡ ؕ وَ اِنۡ یَّقُوۡلُوۡا تَسۡمَعۡ لِقَوۡلِہِمۡ ؕ کَاَنَّہُمۡ خُشُبٌ مُّسَنَّدَۃٌ ؕ یَحۡسَبُوۡنَ کُلَّ صَیۡحَۃٍ عَلَیۡہِمۡ ؕ ہُمُ الۡعَدُوُّ فَاحۡذَرۡہُمۡ ؕ قٰتَلَہُمُ اللّٰہُ ۫ اَنّٰی یُؤۡفَکُوۡنَ ﴿۵﴾", "english": " And when thou seest them, their figures please thee; and if they speak, thou listenest to their speech. They are as though they were blocks of wood propped up. They think that every cry is against them. They are the enemy, so beware of them. Allah’s curse be upon them! How are they being turned away!", "french": " Et quand tu les vois, leur apparence physique te plaît et s’ils parlent, tu écoutes leur discours ; comme si ils étaient des bûches dressées se supportant les unes les autres . Ils s’imaginent que chaque calamité va les frapper. Ce sont eux l’ennemi ; prends donc garde à eux. Que la malédiction d’Allāh soit sur eux ! Comme ils sont détournés !", "german": " Und wenn du sie siehst, so gefallen dir ihre Gestalten; und wenn sie sprechen, horchst du auf ihre Rede. Sie sind, als wären sie aufgerichtete Holzklötze. Sie glauben, jeder Schrei sei wider sie. Sie sind der Feind, drum hüte dich vor ihnen. Allahs Fluch über sie! Wie werden sie abgewendet!", "spanish": " Mas cuando los ves, su aspecto te agrada; y si hablan, escuchas sus palabras. En cambio son como ramas secas apuntaladas. Temen que toda calamidad se abata sobre ellos. Son el enemigo. Cuídate, pues, de ellos. ¡Que sean malditos de Al-lah! ¡Cómo se están extraviando!", "urdu": " جب تو ان کو دیکھتا ہے تو ان کے مضبوط جسم تجھے خوب بھاتے ہیں۔ اور اگر وہ کوئی بات کرتے ہیں (تو ایسے شاندار طریقے سے کہ) تو ان کی بات کو (باوجود ان کے حالات جاننے کے) سن لیتا ہے (وہ مجلس میں اس طرح بیٹھے ہوئے ہوتے ہیں) گویا کہ وہ بڑے بڑے شہتیر ہیں جو (دیوار سے) اٹکائے ہوئے ہیں۔ جب کسی عذاب کی خبر (قرآن میں) نازل ہو تو وہ سمجھتے ہیں کہ یہ ہمارے ہی متعلق ہے۔ وہ پکے دشمن ہیں پس تو ان سے ہوشیار رہ۔ اللہ ان کو ہلاک کرے‘ وہ کہاں سے پھرا کر (راہ حق سے دور) لے جائے جاتے ہیں۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ تَعَالَوۡا یَسۡتَغۡفِرۡ لَکُمۡ رَسُوۡلُ اللّٰہِ لَوَّوۡا رُءُوۡسَہُمۡ وَ رَاَیۡتَہُمۡ یَصُدُّوۡنَ وَ ہُمۡ مُّسۡتَکۡبِرُوۡنَ ﴿۶﴾", "english": " And when it is said to them, ‘Come, that the Messenger of Allah may ask forgiveness for you,’ they turn their heads aside, and thou seest them keeping back while they are full of pride.", "french": " Et lorsqu’il leur est dit : « Venez, afin que le Messager d’Allāh implore le pardon pour vous, » ils détournent la tête, et tu les vois rester en arrière, pleins d’orgueil.", "german": " Und wenn zu ihnen gesprochen wird: \"Kommt her, der Gesandte Allahs will für euch um Verzeihung bitten\", dann wenden sie ihre Köpfe zur Seite, und du siehst, wie sie sich in Hochmut abkehren.", "spanish": " Mas cuando se les dice: “Venid, para que el Mensajero de Al-lah pida perdón por vosotros”, vuelven la cabeza y los ves dándote la espalda llenos de orgullo”.", "urdu": " اور جب ان سے کہا جاتا ہے کہ آٶ! اللہ کا رسول تمہارے لئے استغفار کرے تو وہ اپنے سر (تکبر اور انکار سے) پھیر لیتے ہیں اور تو ان کو دیکھتا ہے کہ وہ راہ حق سے لوگوں کو پھرا رہے ہیں اور وہ تکبر کی مرض میں مبتلا ہیں۔"}, {"arabic": " سَوَآءٌ عَلَیۡہِمۡ اَسۡتَغۡفَرۡتَ لَہُمۡ اَمۡ لَمۡ تَسۡتَغۡفِرۡ لَہُمۡ ؕ لَنۡ یَّغۡفِرَ اللّٰہُ لَہُمۡ ؕ اِنَّ اللّٰہَ لَا یَہۡدِی الۡقَوۡمَ الۡفٰسِقِیۡنَ ﴿۷﴾", "english": " It is equal to them whether thou ask forgiveness for them or ask not forgiveness for them, Allah will never forgive them. Surely Allah guides not the rebellious people.", "french": " Cela leur est égal que tu implores le pardon pour eux, ou que tu n’implores pas le pardon pour eux. Allāh ne leur pardonnera jamais. Assurément, Allāh ne guide pas le peuple rebelle.", "german": " Es ist ihnen gleich, ob du für sie um Verzeihung bittest oder nicht für sie um Verzeihung bittest. Allah wird ihnen nie verzeihen; Allah weist dem widerspenstigen Volk nicht den Weg.", "spanish": " Les es igual que pidas o no pidas perdón por ellos. Al-lah nunca los perdonará. En verdad, Al-lah no guía a la gente rebelde.", "urdu": " تو ان کے لئے استغفار کرے یا استغفار نہ کرے ان کے حق میں سب برابر ہے کیونکہ اللہ ان کو کبھی معاف نہیں کرے گا (جب تک وہ خود توبہ نہ کریں) اللہ اطاعت سے نکل جانے والی قوم کو کامیابی کا منہ نہیں دکھاتا۔"}, {"arabic": " ہُمُ الَّذِیۡنَ یَقُوۡلُوۡنَ لَا تُنۡفِقُوۡا عَلٰی مَنۡ عِنۡدَ رَسُوۡلِ اللّٰہِ حَتّٰی یَنۡفَضُّوۡا ؕ وَ لِلّٰہِ خَزَآئِنُ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ لٰکِنَّ الۡمُنٰفِقِیۡنَ لَا یَفۡقَہُوۡنَ ﴿۸﴾", "english": " They it is who say, ‘Spend not on those who are with the Messenger of Allah that they may disperse and leave him ;’ while to Allah belong the treasures of the heavens and the earth; but the hypocrites understand not.", "french": " Ce sont eux qui disent : « Ne dépensez rien pour ceux qui sont avec le Messager d’Allāh jusqu’à ce qu’ils se dispersent et l’abandonnent , » alors que c’est à Allāh qu’appartiennent les trésors des cieux et de la terre ; mais les hypocrites ne comprennent pas.", "german": " Sie sind es, die sprechen: \"Spendet nicht für die, die mit dem Gesandten Allahs sind, damit sie sich zerstreuen (und ihn verlassen)\", während doch die Schätze der Himmel und der Erde Allahs sind; allein die Heuchler verstehen es nicht.", "spanish": " Son ellos quienes dicen: “No gastéis a favor de quienes están con el Mensajero de Al-lah hasta que se dispersen y lo abandonen ; cuando a Al-lah pertenecen los tesoros de los cielos y la tierra; pero los hipócritas no lo entienden”.", "urdu": " یہی لوگ ہیں جو کہتے ہیں کہ اللہ کے رسول کے پاس جو لوگ رہتے ہیں ان پر خرچ نہ کرو‘ یہاں تک کہ وہ (فاقوں سے تنگ آکر) بھاگ جائیں۔ حالانکہ آسمان اور زمین کے خزانے اللہ کے پاس ہیں‘ لیکن منافق سمجھتے نہیں۔"}, {"arabic": " یَقُوۡلُوۡنَ لَئِنۡ رَّجَعۡنَاۤ اِلَی الۡمَدِیۡنَۃِ لَیُخۡرِجَنَّ الۡاَعَزُّ مِنۡہَا الۡاَذَلَّ ؕ وَ لِلّٰہِ الۡعِزَّۃُ وَ لِرَسُوۡلِہٖ وَ لِلۡمُؤۡمِنِیۡنَ وَ لٰکِنَّ الۡمُنٰفِقِیۡنَ لَا یَعۡلَمُوۡنَ ٪﴿۹﴾", "english": " They say, ‘If we return to Medina, the one most honourable will surely drive out therefrom the one most mean;’ while true honour belongs to Allah and to His Messenger and the believers; but the hypocrites know not.", "french": " Ils disent : « Si nous retournons à Médine, le plus honorable en chassera assurément le plus méprisable ; » alors que l’honneur réel appartient à Allāh et à Son Messager et aux croyants ; mais les hypocrites ne savent pas.", "german": " Sie sprechen: \"Wenn wir nach Medina zurückkehren, dann wird der Angesehenste sicherlich den Geringsten daraus vertreiben\", obwohl das Ansehen nur Allah und Seinem Gesandten und den Gläubigen gebührt; allein die Heuchler wissen es nicht.", "spanish": " Dicen: “Si volvemos a Medina, el más honorable expulsará ciertamente de allí al más insignificante;” cuando el auténtico honor corresponde a Al-lah y a Su Mensajero y a los creyentes; pero los hipócritas lo desconocen.", "urdu": " وہ کہتے ہیں کہ اگر ہم مدینہ کی طرف لوٹ کر گئے تو جو مدینہ کا سب سے معزز آدمی ہے وہ مدینہ کے سب سے ذلیل آدمی کو اس سے نکال دے گا۔ اور عزت اللہ اور اس کے رسول اور مومنوں کو ہی حاصل ہے لیکن منافق جانتے نہیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تُلۡہِکُمۡ اَمۡوَالُکُمۡ وَ لَاۤ اَوۡلَادُکُمۡ عَنۡ ذِکۡرِ اللّٰہِ ۚ وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ فَاُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿۱۰﴾", "english": " O ye who believe! let not your wealth and your children divert you from the remembrance of Allah. And whoever does so — it is they who are the losers.", "french": " Ô vous qui croyez ! que vos biens et vos enfants ne vous distraient pas du souvenir d’Allāh. Et quiconque agit ainsi – ce sont eux qui sont les perdants.", "german": " O die ihr glaubt, lasset euer Vermögen und eure Kinder euch nicht vom Gedenken an Allah abhalten. Und wer das tut – das sind die Verlierenden.", "spanish": " ¡Oh vosotros, los creyentes! No permitáis que vuestras riquezas y vuestros hijos os distraigan del recuerdo de Al-lah. Pues quienes así actúen, sepan que serán los perdedores.", "urdu": " اے مومنو! تم کو تمہارے مال اور تمہاری اولادیں اللہ کے ذکر سے غافل نہ کر دیں اور جو لوگ ایسا کریں گے‘ وہی گھاٹا پانے والے ہوں گے۔"}, {"arabic": " وَ اَنۡفِقُوۡا مِنۡ مَّا رَزَقۡنٰکُمۡ مِّنۡ قَبۡلِ اَنۡ یَّاۡتِیَ اَحَدَکُمُ الۡمَوۡتُ فَیَقُوۡلَ رَبِّ لَوۡ لَاۤ اَخَّرۡتَنِیۡۤ اِلٰۤی اَجَلٍ قَرِیۡبٍ ۙ فَاَصَّدَّقَ وَ اَکُنۡ مِّنَ الصّٰلِحِیۡنَ ﴿۱۱﴾", "english": " And spend out of that with which We have provided you before death comes upon one of you and he says, ‘My Lord! if only Thou wouldst grant me respite for a little while, then I would give alms and be among the righteous.’", "french": " Et dépensez de ces dons et richesses que Nous vous avons accordés, avant que la mort ne surprenne l’un d’entre vous, et qu’il ne dise : « Mon Seigneur ! si seulement tu voulais m’accorder du répit pendant quelque temps, pour que je puisse faire l’aumône, et puisse être du nombre des justes ! »", "german": " Und spendet von dem, was Wir euch gegeben haben, bevor einen von euch der Tod ereilt und er spricht: \"Mein Herr! wenn Du mir nur Aufschub gewähren wolltest auf eine kleine Weile, dann würde ich Almosen geben und der Rechtschaffenen einer sein.\"", "spanish": " Emplead de lo que os hemos proporcionado, antes de que la muerte llegue a uno de vosotros y diga: ¡Señor mío! Ojalá me hubieses concedido respiro durante un poco más de tiempo , a fin de que pudiera dar limosnas y encontrarme entre los justos”.", "urdu": " اور (اے مومنو)! جو کچھ ہم نے تمہیں دیا ہے اس میں سے موت آنے سے پہلے خرچ کرو‘ تا ایسا نہ ہو کہ (جب موت آئے تو خرچ نہ کرنے والے کو) کہنا پڑے کہ اے میرے رب! تو نے مجھے کیوں تھوڑی سی ڈھیل نہیں دی تا کہ میں اس (ڈھیل) میں کچھ صدقہ کر لیتا اور نیک بن جاتا۔"}, {"arabic": " وَ لَنۡ یُّؤَخِّرَ اللّٰہُ نَفۡسًا اِذَا جَآءَ اَجَلُہَا ؕ وَ اللّٰہُ خَبِیۡرٌۢ بِمَا تَعۡمَلُوۡنَ ﴿٪۱۲﴾", "english": " And Allah will not grant respite to a soul when its appointed time has come; and Allah is Well-Aware of what you do.", "french": " Et Allāh n’accordera jamais de répit à une âme lorsque son terme déterminé est arrivé ; et Allāh est Très-Conscient de ce que vous faites.", "german": " Nie aber wird Allah einer Seele Aufschub gewähren, wenn ihre Frist um ist; und Allah kennt wohl, was ihr tut.", "spanish": " Mas Al-lah no concederá respiro a ningún alma cuando haya llegado su hora fijada; ya que Al-lah conoce muy bien lo que hacéis.", "urdu": " لیکن جب کسی نفس کی موت آجاتی ہے تو اللہ اسے ڈھیل نہیں دیا کرتا‘ اور اللہ تمہارے اعمال سے واقف ہے۔"}], "Surah": 63}