{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں) ۔"}, {"arabic": " یٰسٓ ۚ﴿۲﴾", "english": " Ya Sin.", "french": " Yā Sīn (Ô Leader Parfait).", "german": " Jâ Sîn!", "spanish": " Ya Sin.", "urdu": " اے سید!"}, {"arabic": " وَ الۡقُرۡاٰنِ الۡحَکِیۡمِ ۙ﴿۳﴾", "english": " By the Qur’an, full of wisdom,", "french": " Par le Coran, plein de sagesse,", "german": " Beim Qur-ân, dem weisen,", "spanish": " Por el Corán, lleno de sa­biduría,", "urdu": " ہم حکمت والے قرآن کو (تیرے سید ہونے کی) شہادت میں پیش کرتے ہیں۔"}, {"arabic": " اِنَّکَ لَمِنَ الۡمُرۡسَلِیۡنَ ۙ﴿۴﴾", "english": " Thou art indeed one of the Messengers,", "french": " Tu es en vérité un des Messagers,", "german": " du bist fürwahr ein Gesandter", "spanish": " Eres ciertamente uno de los Mensajeros,", "urdu": " یقیناً تو رسولوں میں سے ہے۔"}, {"arabic": " عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ؕ﴿۵﴾", "english": " On a right path.", "french": " Sur un droit chemin.", "german": " auf einem geraden Weg.", "spanish": " Que siguen el camino recto.", "urdu": " (اور) سیدھے راستہ پر (ہے) ۔"}, {"arabic": " تَنۡزِیۡلَ الۡعَزِیۡزِ الرَّحِیۡمِ ۙ﴿۶﴾", "english": " This is a revelation of the Mighty, the Merciful,", "french": " Ceci est une révélation du Puissant, du Miséricordieux,", "german": " (Dies ist) eine Offenbarung des Allmächtigen, des Barmherzigen,", "spanish": " Ésta es una revelación del Poderoso, el Misericordioso,", "urdu": " (اور قرآن) غالب (اور) بے انتہا رحم کرنے والے (خدا) کی طرف سے نازل کیا گیا ہے۔"}, {"arabic": " لِتُنۡذِرَ قَوۡمًا مَّاۤ اُنۡذِرَ اٰبَآؤُہُمۡ فَہُمۡ غٰفِلُوۡنَ ﴿۷﴾", "english": " That thou mayest warn a people whose fathers were not warned, and so they are heedless.", "french": " Afin que tu puisses avertir un peuple dont les pères ne furent pas avertis et qui sont donc négligents.", "german": " auf dass du ein Volk warnest, dessen Väter nicht gewarnt waren, und die daher achtlos sind.", "spanish": " Para que adviertas a un pueblo cuyos padres no fueron advertidos, y por tanto son descuidados.", "urdu": " اس غرض سے کہ تو اس قوم کو ہوشیار کرے جن کے باپ دادوں کو ہوشیار نہیں کیا گیا تھا اور وہ غافل پڑے تھے۔"}, {"arabic": " لَقَدۡ حَقَّ الۡقَوۡلُ عَلٰۤی اَکۡثَرِہِمۡ فَہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۸﴾", "english": " Surely the word has proved true against most of them, for they believe not.", "french": " Assurément la parole s’est avérée vraie contre la plupart d’entre eux car ils ne sont pas croyants.", "german": " Bereits hat das Wort sich als wahr erwiesen gegen die meisten von ihnen, denn sie glauben nicht.", "spanish": " En verdad, ha resultado ser cierta la palabra contra la mayoría de ellos, porque no creen.", "urdu": " ہمارا دعویٰ ان میں سے اکثر کے متعلق پورا ہوگیا‘ چنانچہ وہ ایمان نہیں لاتے۔"}, {"arabic": " اِنَّا جَعَلۡنَا فِیۡۤ اَعۡنَاقِہِمۡ اَغۡلٰلًا فَہِیَ اِلَی الۡاَذۡقَانِ فَہُمۡ مُّقۡمَحُوۡنَ ﴿۹﴾", "english": " We have put round their necks, chains reaching unto the chins, so that their heads are forced up.", "french": " Nous avons mis à leur cou des carcans, montant jusqu’à leur menton, de sorte qu’ils ont la tête repoussée en arrière.", "german": " Um ihren Hals haben Wir Fesseln gelegt, die bis an das Kinn reichen, so dass ihr Haupt hochgezwängt ist.", "spanish": " Hemos puesto collares alrededor de sus cuellos que llegan hasta el mentón, para que sus cabezas queden echadas hacia atrás.", "urdu": " ہم نے ان کی گردنوں میں طوق ڈالے ہوئے ہیں اور وہ ان کی ٹھوڑیوں تک چڑھ گئے ہیں اور وہ (دکھ سے بچنے کے لئے اپنی) گردنیں اونچی کر رہے ہیں۔"}, {"arabic": " وَ جَعَلۡنَا مِنۡۢ بَیۡنِ اَیۡدِیۡہِمۡ سَدًّا وَّ مِنۡ خَلۡفِہِمۡ سَدًّا فَاَغۡشَیۡنٰہُمۡ فَہُمۡ لَا یُبۡصِرُوۡنَ ﴿۱۰﴾", "english": " And We have set a barrier before them and a barrier behind them, and have covered them over, so that they cannot see.", "french": " Et Nous avons mis une barrière devant eux et une barrière derrière eux et Nous les avons recouverts, de sorte qu’ils ne puissent voir.", "german": " Und Wir haben eine Schranke gelegt vor sie und eine Schranke hinter sie, und Wir haben sie verhüllt, so dass sie nicht sehen können.", "spanish": " Hemos colocado una barrera ante ellos y otra tras ellos, y los hemos cubierto para que no puedan ver.", "urdu": " اور ہم نے ان کے آگے بھی ایک روک بنا دی ہے اور ان کے پیچھے بھی ایک روک بنا دی ہے اور ان کو ڈھانک دیا ہے۔ پس وہ دیکھ نہیں سکتے۔"}, {"arabic": " وَ سَوَآءٌ عَلَیۡہِمۡ ءَاَنۡذَرۡتَہُمۡ اَمۡ لَمۡ تُنۡذِرۡہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۱۱﴾", "english": " And it is equal to them whether thou warn them or warn them not: they will not believe.", "french": " Et cela leur est bien égal que tu les avertisses ou que tu ne les avertisses pas, ils ne croiront pas.", "german": " Und ihnen ist es gleich, ob du sie warnst oder ob du sie nicht warnst: sie werden nicht glauben.", "spanish": " Lo mismo les da si les ad­viertes como si no; no creerán.", "urdu": " اور تیرا ڈرانا یا نہ ڈرانا ان کے لئے برابر ہے وہ (جب تک اپنے دل میں تبدیلی پیدا نہ کریں گے) ایمان نہیں لائیں گے۔"}, {"arabic": " اِنَّمَا تُنۡذِرُ مَنِ اتَّبَعَ الذِّکۡرَ وَ خَشِیَ الرَّحۡمٰنَ بِالۡغَیۡبِ ۚ فَبَشِّرۡہُ بِمَغۡفِرَۃٍ وَّ اَجۡرٍ کَرِیۡمٍ ﴿۱۲﴾", "english": " Thou canst warn only him who would follow the Reminder and fear the Gracious God in secret. So give him the glad tidings of forgiveness and a noble reward.", "french": " Tu ne peux avertir que celui qui veut suivre l’Avertissement, et craindre en secret le Dieu Gracieux. Aussi, annonce-lui la bonne nouvelle d'un pardon et d’une noble récompense.", "german": " Du vermagst nur den zu warnen, der die Ermahnung befolgt und den Gnädigen im verborgenen fürchtet. Gib ihm darum frohe Botschaft von Vergebung und einem ehrenvollen Lohn.", "spanish": " Sólo puedes advertir a quien está dispuesto a seguir el Recordatorio y teme en secreto al Dios Clemente. Dale pues la buena nueva del perdón y una noble recompensa.", "urdu": " تو تو صرف اس شخص کو ہوشیار کر سکتا ہے جو یاددہانی کو مان لیا کرتا ہے اور رحمن (خدا) سے علیحدگی میں بھی ڈرتا ہے۔ پس ایسے شخص کو تو ایک عظم الشان معافی اور ایک عزت والے بدلہ کی خبر سنا دے۔"}, {"arabic": " اِنَّا نَحۡنُ نُحۡیِ الۡمَوۡتٰی وَ نَکۡتُبُ مَا قَدَّمُوۡا وَ اٰثَارَہُمۡ ؕؑ وَ کُلَّ شَیۡءٍ اَحۡصَیۡنٰہُ فِیۡۤ اِمَامٍ مُّبِیۡنٍ ﴿٪۱۳﴾", "english": " Surely, We alone give life to the dead, and We record that which they send forward and that which they leave behind; and all things have We recorded in a clear Book.", "french": " Assurément, Nous Seul donnons la vie aux morts, et Nous inscrivons ce qu’ils envoient devant eux et ce qu’ils laissent derrière ; et Nous avons enregistré toutes choses dans un Registre clair.", "german": " Wahrlich, Wir Selbst beleben die Toten, und Wir schreiben das auf, was sie vor sich her senden, zugleich mit dem, was sie zurücklassen; und alle Dinge haben Wir verzeichnet in einem deutlichen Buch.", "spanish": " En verdad, sólo Nosotros damos la vida a los muertos y regis­tramos lo que envían delante de ellos y lo que dejan detrás; pues hemos anotado todas las cosas en un re­gistro claro.", "urdu": " ہم ہی مردوں کو زندہ کرتے ہیں اور جو کچھ وہ آئندہ زندگی کے لئے آگے بھیجتے ہیں اس کو بھی محفوظ رکھتے ہیں اور جو اعمال انہوں نے دنیا میں کیے تھے ان کے جو نتائج نکلیں گے ان کو بھی ہم محفوظ رکھتے ہیں اور ہر چیز کو ہم نے ایک کھلی کتاب میں گن رکھا ہے۔"}, {"arabic": " وَ اضۡرِبۡ لَہُمۡ مَّثَلًا اَصۡحٰبَ الۡقَرۡیَۃِ ۘ اِذۡ جَآءَہَا الۡمُرۡسَلُوۡنَ ﴿ۚ۱۴﴾", "english": " And set forth to them the parable of a people of the town, when the Messengers came to it.", "french": " Et explique-leur la parabole des habitants de la ville lorsque les Messagers y vinrent.", "german": " Erzähle ihnen die Geschichte von den Leuten einer Stadt, als die Gesandten zu ihr kamen.", "spanish": " Y preséntales la parábola de los moradores de la ciudad, cuando llegaron a ella los Mensa­jeros.", "urdu": " اور تو ان کے سامنے ایک گاٶں والوں کی حالت بیان کر جب کہ ان کے پاس ان کے رسول آئے۔"}, {"arabic": " اِذۡ اَرۡسَلۡنَاۤ اِلَیۡہِمُ اثۡنَیۡنِ فَکَذَّبُوۡہُمَا فَعَزَّزۡنَا بِثَالِثٍ فَقَالُوۡۤا اِنَّاۤ اِلَیۡکُمۡ مُّرۡسَلُوۡنَ ﴿۱۵﴾", "english": " When We sent to them two Messengers, and they rejected them both; so We strengthened them by a third, and they said, ‘Verily we have been sent to you as Messengers.’", "french": " Quand Nous leur envoyâmes deux Messagers , et qu’ils les rejetèrent tous les deux ; Nous les renforçâmes donc par un troisième, et ils dirent : « En vérité, nous avons été envoyés vers vous en tant que Messagers. »", "german": " Als Wir zwei zu ihnen schickten, verwarfen sie beide; da stärkten Wir (sie) durch einen dritten, und sie sprachen: \"Wir sind zu euch entsandt worden.\"", "spanish": " Cuando les enviamos a dos Mensajeros, y les rechazaron a ambos; por tanto les fortalecimos con un tercero, y dijeron: “En verdad, hemos sido enviados a vosotros como Mensajeros”.", "urdu": " یعنی جس وقت ہم نے پہلے تو ان کی طرف دو رسول بھیجے لیکن انہوں نے ان دونوں کا انکار کر دیا‘ اس پر ہم نے پہلے دو رسولوں کو ایک تیسرا رسول بھیج کر طاقت بخشی پھر ان سب نے مل کر اپنی قوم سے کہا کہ ہم تمہاری طرف ایک پیغام لیکر تمہارے رب کی طرف سے بھیجے گئے ہیں۔"}, {"arabic": " قَالُوۡا مَاۤ اَنۡتُمۡ اِلَّا بَشَرٌ مِّثۡلُنَا ۙ وَ مَاۤ اَنۡزَلَ الرَّحۡمٰنُ مِنۡ شَیۡءٍ ۙ اِنۡ اَنۡتُمۡ اِلَّا تَکۡذِبُوۡنَ ﴿۱۶﴾", "english": " They replied, ‘You are but men like us and the Gracious God has not revealed anything. You only lie.’", "french": " Ils répondirent : « Vous n’êtes que des hommes comme nous, et le Dieu Gracieux n’a rien révélé. Vous ne faites que mentir. »", "german": " Jene antworteten: \"Ihr seid nur Menschen wie wir; und der Gnädige hat nichts herabgesandt. Ihr lügt bloß.\"", "spanish": " Respondieron: “No sois sino hombres como nosotros y el Dios Clemente no ha revelado nada. No hacéis más que mentir”.", "urdu": " انہوں نے (جواب میں) کہا کہ تم تو ہمارے جیسے آدمی ہو اور رحمن خدا نے کوئی چیز (بطور الہام کے) نہیں اتاری‘ تم صرف جھوٹ بول رہے ہو۔"}, {"arabic": " قَالُوۡا رَبُّنَا یَعۡلَمُ اِنَّاۤ اِلَیۡکُمۡ لَمُرۡسَلُوۡنَ ﴿۱۷﴾", "english": " They said, ‘Our Lord knows that we are indeed His Messengers to you;", "french": " Ils dirent : « Notre Seigneur sait que nous sommes en vérité Ses Messagers auprès de vous ;", "german": " Sie sprachen: \"Unser Herr weiß, dass wir fürwahr (Seine) Abgesandten an euch sind;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:17&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:17&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic18\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic18\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:18' style='text-decoration:underline'>36:18</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(18)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control18\"></i></button> <audio id=\"player18\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَا عَلَیۡنَاۤ اِلَّا الۡبَلٰغُ الۡمُبِیۡنُ ﴿۱۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And on us lies only the plain delivery of the Message.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_36_18_a' href='#'>a</a>]</sup>‘And our duty is only plain delivery of the Message.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_36_18_a'>a</span></div> <div><div class='reference' data-id='ref_36_18_a' style='display:none'> <p><b>a.</b> <a href='/quran/13:41' target=_blank>13:41</a>; <a href='/quran/16:36' target=_blank>16:36</a>; <a href='/quran/24:55' target=_blank>24:55</a>; <a href='/quran/29:19' target=_blank>29:19</a>. (<a href='javascript:void(0)' data-id='ref_36_18_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ہم پر کھول کھول کر بات پہنچانے کے سوا کوئی ذمہ داری نہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور ہمارا کام صرف یہ ہے کہ ہم کھلی کھلی تبلیغ کریں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et il ne nous incombe que la transmission claire du Message<em>.</em> »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y a nosotros solamente corresponde la simple entrega del Mensaje”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">und uns obliegt nur die klare Verkündigung.\"", "spanish": " Respondieron: “Nuestro Señor sabe que somos ciertamente Sus Mensajeros para vosotros”;", "urdu": " انہوں نے کہا‘ کہ ہمارا رب اس بات کو جانتا ہے کہ ہم تمہاری طرف رسول بنا کر بھیجے گئے ہیں۔"}, {"arabic": " قَالُوۡۤا اِنَّا تَطَیَّرۡنَا بِکُمۡ ۚ لَئِنۡ لَّمۡ تَنۡتَہُوۡا لَنَرۡجُمَنَّکُمۡ وَ لَیَمَسَّنَّکُمۡ مِّنَّا عَذَابٌ اَلِیۡمٌ ﴿۱۹﴾", "english": " They said, ‘Surely we augur evil fortune from you; if you desist not, we will certainly stone you, and a painful punishment will surely befall you at our hands.’", "french": " Ils dirent : « Assurément, nous augurons un mauvais sort de vous ; si vous ne cessez pas, nous vous lapiderons certainement, et un châtiment douloureux vous frappera assurément de notre part. »", "german": " Jene sprachen: \"Wir ahnen Böses von euch; wenn ihr nicht ablasset, so werden wir euch gewisslich steinigen, und von uns wird euch sicherlich eine schmerzliche Strafe treffen.\"", "spanish": " Respondieron: “Ciertamente esperamos mala suerte de vosotros; si no desistís, ciertamente que os la­pidaremos, y os sobrevendrá un doloroso castigo de nuestras manos”.", "urdu": " اس پر کفار نے کہا‘ ہم تو تمہارا اپنی طرف آنا منحوس قرار دیتے ہیں اگر تم اپنی باتوں سے رکو گے نہیں‘ تو ہم تم کو سنگسار کر دیں گے اور تم کو ہماری طرف سے دردناک عذاب پہنچے گا۔"}, {"arabic": " قَالُوۡا طَآئِرُکُمۡ مَّعَکُمۡ ؕ اَئِنۡ ذُکِّرۡتُمۡ ؕ بَلۡ اَنۡتُمۡ قَوۡمٌ مُّسۡرِفُوۡنَ ﴿۲۰﴾", "english": " They replied, ‘Your evil fortune is with your own selves. Is it because you have been admonished? Nay, you are a people transgressing all bounds.’", "french": " Ils répondirent « Votre mauvais sort est avec vous-mêmes. Dites-vous cela parce que vous avez été avertis ? Non , mais vous êtes un peuple qui transgresse toutes les bornes. »", "german": " Sie antworteten: \"Euer Unheil ist bei euch selbst. Liegt es daran, dass ihr ermahnt werdet? Nein, ihr seid Leute, die das Maß überschreiten.\"", "spanish": " Ellos contestaron: “Vuestra mala suerte os corresponde a vo­sotros mismos. ¿Es por que habéis sido amonestados? ¡No! sois un pue­blo que sobrepasáis todos los lí­mites”.", "urdu": " انہوں نے کہا کہ تمہارا عمل تو تمہارے ساتھ ہے (تم جہاں بھی ہوگے تمہارے عملوں کا بدنتیجہ نکلتا رہے گا) کیا تم یہ بات اس لئے کہتے ہو کہ ہم تم کو اچھے کام یاد دلاتے ہیں بلکہ حق یہ ہے کہ تم حد سے گذرنے والی قوم ہو (اس لئے لازما سزا پاٶ گے)"}, {"arabic": " وَ جَآءَ مِنۡ اَقۡصَا الۡمَدِیۡنَۃِ رَجُلٌ یَّسۡعٰی قَالَ یٰقَوۡمِ اتَّبِعُوا الۡمُرۡسَلِیۡنَ ﴿ۙ۲۱﴾", "english": " And from the farthest part of the town there came a man running. He said, ‘O my people, follow the Messengers,", "french": " Et du quartier le plus éloigné de la ville accourut un homme. Il dit : « Ô mon peuple, suivez les Messagers,", "german": " Und vom entferntesten Ende der Stadt kam ein Mann gerannt. Er sprach: \"O mein Volk, folget den Gesandten!</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:21&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:21&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic22\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic22\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:22' style='text-decoration:underline'>36:22</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(22)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control22\"></i></button> <audio id=\"player22\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اتَّبِعُوۡا مَنۡ لَّا یَسۡـَٔلُکُمۡ اَجۡرًا وَّ ہُمۡ مُّہۡتَدُوۡنَ ﴿۲۲﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Follow those who ask of you no reward, and who are rightly guided.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Follow those who ask of you no reward, and who are rightly guided; </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">ان کی اطاعت کرو جو تم سے کوئی اجر نہیں مانگتے اور وہ ہدایت یافتہ ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ان کی اتباع کرو‘ جو تم سے کوئی اجر نہیں مانگتے‘ اور وہ ہدایت یافتہ ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Suivez ceux qui ne vous demandent aucune récompense, et qui sont <em>bien</em> guidés.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Seguid a quienes no os piden recompensa y están rectamente guiados”;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Folget denen, die keinen Lohn von euch fordern und die rechtgeleitet sind.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:22&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:22&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic23\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic23\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:23' style='text-decoration:underline'>36:23</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(23)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control23\"></i></button> <audio id=\"player23\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَا لِیَ لَاۤ اَعۡبُدُ الَّذِیۡ فَطَرَنِیۡ وَ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۲۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And what reason have I that I should not worship Him Who has created me, and unto Whom you will be brought back?</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And why should I not worship Him Who has created me, and unto Whom you will be brought back? </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور مجھے (آخر) کیا ہوا ہے کہ میں اس کی عبادت نہ کروں جس نے مجھے پیدا کیا اور اُسی کی طرف تم (بھی) لوٹائے جاؤ گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور مجھے کیا ہوا ہے کہ میں اس (خدا) کی عبادت نہ کروں جس نے مجھے پیدا کیا ہے اور تم سب اسی کی طرف لوٹا کر لے جائے جاٶ گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et quelle raison aurais-je pour ne pas adorer Celui Qui m’a créé, et auprès de Qui vous serez ramenés ?</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Qué razón tengo para no adorar a Quien me ha creado, y a Quien seréis devueltos?</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und warum sollte ich Den nicht verehren, Der mich erschaffen hat und zu Dem ihr zurückgebracht werden sollt?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:23&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:23&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic24\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic24\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:24' style='text-decoration:underline'>36:24</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(24)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control24\"></i></button> <audio id=\"player24\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ءَاَتَّخِذُ مِنۡ دُوۡنِہٖۤ اٰلِہَۃً اِنۡ یُّرِدۡنِ الرَّحۡمٰنُ بِضُرٍّ لَّا تُغۡنِ عَنِّیۡ شَفَاعَتُہُمۡ شَیۡئًا وَّ لَا یُنۡقِذُوۡنِ ﴿ۚ۲۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Shall I take others beside Him as gods? If the Gracious <em>God </em>should intend me any harm, their intercession will avail me naught, nor can they rescue me.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Shall I take <i>others </i>beside Him as gods?<sup class='ref'>[<a class='ref' data-id='ref_36_24_2439' href='#'>2439</a>]</sup> <sup class='ref'>[<a class='ref' data-id='ref_36_24_a' href='#'>a</a>]</sup>If the Gracious <i>God </i>should intend me any harm, their intercession will avail me naught, nor can they rescue me <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_36_24_2439'>2439</span><span class='collapsible plus' data-id='ref_36_24_a'>a</span></div> <div><a name='2439'></a><div class='reference' data-id='ref_36_24_2439' style='display:none'> <p><b>2439.</b> People will worship various gods in the time of the Promised Messiah—Mammon, material power, false political philosophies and impracticable economic theories, etc. (<a href='javascript:void(0)' data-id='ref_36_24_2439' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_36_24_a' style='display:none'> <p><b>a.</b> <a href='/quran/22:13' target=_blank>22:13</a>, <a href='/quran/22:14' target=_blank>14</a>; <a href='/quran/39:39' target=_blank>39:39</a>. (<a href='javascript:void(0)' data-id='ref_36_24_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا میں اُس کو چھوڑ کر ایسے معبود اپنا لوں کہ اگر رحمان مجھے کوئی ضرر پہنچانا چاہے تو ان کی کوئی شفاعت میرے کچھ کام نہ آئے گی اور نہ وہ مجھے چھڑا سکیں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا میں اس کے سوا اور معبود اختیار کر سکتا ہوں اگر رحمن (خدا) مجھے کوئی نقصان پہنچانا چاہے تو ان (معبودوں) کی شفاعت مجھے کوئی فائدہ نہیں پہنچا سکتی اور نہ وہ مجھے (اس کے ضرر سے) بچا سکتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Prendrais-je en dehors de Lui d’autres dieux ? Si le <em>Dieu</em> Gracieux me voulait du mal, leur intercession ne me servirait à rien, et ils ne pourraient pas non plus me sauver.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Debo acaso tomar a otros fuera de Él como dioses? Si el <em>Dios</em> Clemente pretendiera hacerme cualquier daño, la intercesión de ellos no me serviría de nada, ni podrían rescatarme.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Soll ich etwa andere neben Ihm zu Göttern nehmen? Wenn der Gnädige mir ein Leid zufügen will, so wird ihre Fürbitte mir nichts nützen, noch können sie mich retten.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:24&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:24&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic25\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic25\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:25' style='text-decoration:underline'>36:25</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(25)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control25\"></i></button> <audio id=\"player25\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنِّیۡۤ اِذًا لَّفِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۲۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘In that case I should indeed be in manifest error.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘In that case I should, indeed, be in manifest error. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً ایسی صورت میں معاً مَیں کھلی کھلی گمراہی میں (مبتلا) ہو جاؤں گا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اگر میں ایسا کروں) تو میں یقیناً کھلی کھلی گمراہی میں مبتلا ہوں گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Dans ce cas, je serais assurément dans une erreur manifeste.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“En ese caso estaría, en verdad, en error evidente”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dann wäre ich wahrlich in offenkundigem Irrtum.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:25&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:25&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic26\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic26\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:26' style='text-decoration:underline'>36:26</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(26)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control26\"></i></button> <audio id=\"player26\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنِّیۡۤ اٰمَنۡتُ بِرَبِّکُمۡ فَاسۡمَعُوۡنِ ﴿ؕ۲۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘I believe in your Lord; so listen to me.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘I believe in your Lord; so listen to me.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً میں تمہارے ربّ پر ایمان لایا ہوں۔ پس میری سنو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">میں تمہارے رب پر ایمان لایا ہوں پس میری بات سنو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">En vérité, je crois en votre Seigneur ; écoutez-moi donc. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Creo en vuestro Señor; escu­chadme pues”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ich glaube an euren Herrn; darum höret mich.\"", "spanish": " Y de la parte más alejada de la ciudad vino un hombre corriendo. Dijo: “Oh, pueblo mío, seguid a los Mensajeros,", "urdu": " اور شہر کے دوسرے سرے سے ایک شخص دوڑتا ہوا آیا‘ اور اس نے کہا کہ اے میری قوم! رسولوں کی اتباع کرو۔"}, {"arabic": " قِیۡلَ ادۡخُلِ الۡجَنَّۃَ ؕ قَالَ یٰلَیۡتَ قَوۡمِیۡ یَعۡلَمُوۡنَ ﴿ۙ۲۷﴾", "english": " It was said to him , ‘Enter Paradise.’ He said, ‘O, would that my people knew,", "french": " Il lui fut dit : « Entre au Paradis. » Il dit : « Ah ! Si seulement mon peuple savait,", "german": " Da ward (zu ihm) gesprochen: \"Geh ein ins Paradies.\" Er sprach: \"O dass doch mein Volk es wüßte,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:27&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:27&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic28\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic28\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:28' style='text-decoration:underline'>36:28</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(28)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control28\"></i></button> <audio id=\"player28\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">بِمَا غَفَرَ لِیۡ رَبِّیۡ وَ جَعَلَنِیۡ مِنَ الۡمُکۡرَمِیۡنَ ﴿۲۸﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘How <em>graciously </em>my Lord has granted me forgiveness and has made me of the honoured ones!’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> How <i>graciously </i>my Lord has granted me forgiveness and has made me of the honoured ones!’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">جو میرے ربّ نے مجھ سے مغفرت کا سلوک کیا اور مجھے معزز لوگوں میں شامل کر دیا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کہ کس طرح میرے رب نے مجھے بخش دیا ہے اور مجھے معزز گروہ میں شامل کیا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Comme mon Seigneur m’a pardonné <em>avec bonté</em>, et m’a admis au nombre des honorés ! »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡Con <em>cuánta clemencia </em>mi Señor me ha concedido el perdón y me ha hecho uno de los honorables!”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">wie (gnädig) mein Herr mir vergeben und mich zu einem der Hochgeehrten gemacht hat!\"", "spanish": " Se le dijo: “Entra en el Pa­raíso”. Él respondió: “Oh, si mi pueblo supiera,", "urdu": " (تب اسے خدا کی طرف سے) کہا گیا‘ جنت میں داخل ہو جا (اس پر) اس نے کہا‘ کاش! میری قوم کو (میرا انجام) معلوم ہوتا۔"}, {"arabic": " وَ مَاۤ اَنۡزَلۡنَا عَلٰی قَوۡمِہٖ مِنۡۢ بَعۡدِہٖ مِنۡ جُنۡدٍ مِّنَ السَّمَآءِ وَ مَا کُنَّا مُنۡزِلِیۡنَ ﴿۲۹﴾", "english": " And We sent not down against his people, after him, any host from heaven, nor did We need to send down any .", "french": " Et après lui, Nous ne fîmes descendre sur son peuple aucune armée du ciel, et d’ailleurs Nous ne voulions rien envoyer.", "german": " Und nach ihm sandten Wir gegen sein Volk kein Heer vom Himmel herab, noch pflegen Wir (eins) zu senden.", "spanish": " Mas no enviamos contra su pueblo, tras él, ejército alguno de los cielos, ni necesitábamos enviar a ninguno.", "urdu": " اور ہم نے اس کے بعد اس کی قوم پر آسمان سے (ان کو تباہ کرنے کے لئے) کوئی لشکر نہیں اتارا‘ اور نہ ہم ایسا لشکر اتارا ہی کرتے ہیں۔"}, {"arabic": " اِنۡ کَانَتۡ اِلَّا صَیۡحَۃً وَّاحِدَۃً فَاِذَا ہُمۡ خٰمِدُوۡنَ ﴿۳۰﴾", "english": " It was but a single blast and lo! they were extinct.", "french": " Ce ne fut qu’une seule explosion foudroyante, et voilà, ils étaient éteints !", "german": " Es war nur ein einziger Schall, und siehe, sie waren ausgelöscht.", "spanish": " No hubo más que un único soplo, y he ahí cómo quedaron ful­minados.", "urdu": " صرف ایک خطرناک عذاب ان پر آیا اور وہ اپنی سب شان و شوکت کھو بیٹھے۔"}, {"arabic": " یٰحَسۡرَۃً عَلَی الۡعِبَادِ ۚؑ مَا یَاۡتِیۡہِمۡ مِّنۡ رَّسُوۡلٍ اِلَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿۳۱﴾", "english": " Alas for My servants! there comes not a Messenger to them but they mock at him.", "french": " Hélas pour l’humanité ! Aucun Messager ne vient à eux sans qu’ils ne se moquent de lui,", "german": " Wehe über die Diener! Kein Gesandter kommt zu ihnen, den sie nicht verspotteten.", "spanish": " ¡Ay de la humanidad! no les llega ningún Mensajero sin que se burlen de él.", "urdu": " ہائے افسوس (انکار کی طرف مائل) بندوں پر کہ جب کبھی بھی ان کے پاس کوئی رسول آتا ہے وہ اس کو حقارت کی نگاہ سے دیکھنے لگ جاتے ہیں (اور تمسخر کرنے لگتے ہیں) ۔"}, {"arabic": " اَلَمۡ یَرَوۡا کَمۡ اَہۡلَکۡنَا قَبۡلَہُمۡ مِّنَ الۡقُرُوۡنِ اَنَّہُمۡ اِلَیۡہِمۡ لَا یَرۡجِعُوۡنَ ﴿ؕ۳۲﴾", "english": " Have they not seen how many generations We have destroyed before them, and that they never return to them?", "french": " N’ont-ils pas vu combien de générations Nous avons anéanties avant eux et qu’elles ne retournent jamais à eux ?", "german": " Haben sie nicht gesehen, wie viele Geschlechter Wir schon vor ihnen vernichtet haben (und) dass sie nicht zu ihnen zurückkehren?", "spanish": " ¿No han visto acaso a cuán­tas generaciones destruimos antes de ellos, y que nunca volvieron a ellos?", "urdu": " کیا انہوں نے نہیں دیکھا کہ ان سے پہلے کتنی ہی بستیوں کو ہم ہلاک کر چکے ہیں (اور یہ بھی کہ جن کو ہلاک کیا گیا تھا) وہ واپس نہیں لوٹتے۔"}, {"arabic": " وَ اِنۡ کُلٌّ لَّمَّا جَمِیۡعٌ لَّدَیۡنَا مُحۡضَرُوۡنَ ﴿٪۳۳﴾", "english": " And all of them, gathered together, will certainly be brought before Us.", "french": " Et eux tous, réunis ensemble, seront certainement amenés devant Nous.", "german": " Jedoch sie alle, versammelt insgemein, werden sicherlich vor Uns gebracht werden.", "spanish": " Pues todos ellos, reunidos, serán ciertamente traídos ante No­sotros.", "urdu": " اور سب لوگ ضرور ہمارے حضور میں حاضر کیے جائیں گے۔"}, {"arabic": " وَ اٰیَۃٌ لَّہُمُ الۡاَرۡضُ الۡمَیۡتَۃُ ۚۖ اَحۡیَیۡنٰہَا وَ اَخۡرَجۡنَا مِنۡہَا حَبًّا فَمِنۡہُ یَاۡکُلُوۡنَ ﴿۳۴﴾", "english": " And the dead earth is a Sign for them: We quicken it and bring forth therefrom grain, of which they eat.", "french": " Et la terre morte est pour eux un Signe ; Nous la ranimons et en produisons du grain, dont ils mangent.", "german": " Und ein Zeichen ist ihnen die tote Erde: Wir beleben sie und bringen aus ihr Korn hervor, von dem sie essen.", "spanish": " Y la tierra muerta es un Signo para ellos: Nosotros la resuci­tamos y producimos grano de ella, del que se alimentan.", "urdu": " اور ان (کفار) کے لئے مردہ زمین بھی ایک نشان ہے ہم نے اسے زندہ کیا ہے اور اس سے اناج نکالا ہے۔ سو یہ اس سے کھاتے ہیں۔"}, {"arabic": " وَ جَعَلۡنَا فِیۡہَا جَنّٰتٍ مِّنۡ نَّخِیۡلٍ وَّ اَعۡنَابٍ وَّ فَجَّرۡنَا فِیۡہَا مِنَ الۡعُیُوۡنِ ﴿ۙ۳۵﴾", "english": " And We have placed in it gardens of date-palms and grapes, and We have caused springs to gush forth therein,", "french": " Et Nous y avons mis des datteraies et des vignobles et Nous y avons fait jaillir des sources,", "german": " Und Wir haben in ihr Gärten gemacht von Dattelpalmen und Trauben, und Wir ließen Quellen in ihr entspringen,", "spanish": " Hemos colocado en ella jar­dines con palmeras y viñas, y hemos hecho que broten manan­tiales en ella,", "urdu": " اور ہم نے زمین میں کھجوروں اور انگوروں کے باع بھی اگائے ہیں اور اس میں چشمے پھوڑے ہیں۔"}, {"arabic": " لِیَاۡکُلُوۡا مِنۡ ثَمَرِہٖ ۙ وَ مَا عَمِلَتۡہُ اَیۡدِیۡہِمۡ ؕ اَفَلَا یَشۡکُرُوۡنَ ﴿۳۶﴾", "english": " That they may eat of the fruit thereof, and it was not their hands that made them. Will they not then be grateful?", "french": " Afin qu’ils mangent de Ses fruits, et de ce que leurs mains ont produit. Ne seront-ils donc pas reconnaissants ?", "german": " Auf dass sie von ihren Früchten essen können; und ihre Hände schufen sie nicht. Wollen sie da nicht dankbar sein?", "spanish": " Para que coman de sus frutos, aunque no fueron sus manos las que los crearon. ¿No serán pues agra­decidos?", "urdu": " تا کہ وہ اس (یعنی باغ) کے پھل سے (حسب ضرورت) کھائیں اور اس (باغ) کو ان کے ہاتھوں نے نہیں اگایا (بلکہ ہم نے اگایا ہے) کیا وہ شکر نہیں کرتے؟"}, {"arabic": " سُبۡحٰنَ الَّذِیۡ خَلَقَ الۡاَزۡوَاجَ کُلَّہَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ وَ مِنۡ اَنۡفُسِہِمۡ وَ مِمَّا لَا یَعۡلَمُوۡنَ ﴿۳۷﴾", "english": " Holy is He Who created all things in pairs, of what the earth grows, and of themselves, and of what they know not.", "french": " Saint est Celui Qui a créé toutes les choses en couples, de ce que la terre fait croître, et d’eux-mêmes, et de ce qu’ils ignorent aussi.", "german": " Preis Ihm, Der die Arten alle paarweise geschaffen von dem, was die Erde sprießen lässt, und von ihnen selber, und von dem, was sie nicht kennen.", "spanish": " Santo es Quien creó todas las cosas en parejas, de lo que crece en la tierra, de ellos mismos y de lo que desconocen.", "urdu": " پاک ہے وہ ذات جس نے ہر قسم کے جوڑے پیدا کیے ہیں اس میں سے بھی جس کو زمین اگاتی ہے اور خود ان کی جانوں میں سے بھی اور ان چیزوں میں سے بھی جن کو وہ نہیں جانتے۔"}, {"arabic": " وَ اٰیَۃٌ لَّہُمُ الَّیۡلُ ۚۖ نَسۡلَخُ مِنۡہُ النَّہَارَ فَاِذَا ہُمۡ مُّظۡلِمُوۡنَ ﴿ۙ۳۸﴾", "english": " And a Sign for them is the night from which We strip off the day, and lo! they are in darkness.", "french": " Et la nuit est un Signe pour eux, de laquelle Nous enlevons le jour, et voilà qu’ils sont dans l’obscurité !", "german": " Und ein Zeichen ist ihnen die Nacht. Wir entziehen ihr das Tageslicht, und siehe, sie sind in Finsternis.", "spanish": " Un Signo para ellos es la noche de la que retiramos al día, y ¡helos ahí! en tinieblas.", "urdu": " اور ان کے لئے رات بھی ایک بڑا نشان ہے جس میں سے کھینچ کر ہم دن نکال لیتے ہیں جس کے بعد اچانک وہ اندھیرے میں رہ جاتے ہیں۔"}, {"arabic": " وَ الشَّمۡسُ تَجۡرِیۡ لِمُسۡتَقَرٍّ لَّہَا ؕ ذٰلِکَ تَقۡدِیۡرُ الۡعَزِیۡزِ الۡعَلِیۡمِ ﴿ؕ۳۹﴾", "english": " And the sun is moving on the course prescribed for it. That is the decree of the Almighty, the All- Knowing God .", "french": " Et le soleil se déplace sur sa course prescrite. C’est là le décret du Puissant, de l’Omniscient.", "german": " Und die Sonne eilt vorwärts zu einem ihr gesetzten Ziel. Das ist die Anordnung des Allmächtigen, des Allwissenden.", "spanish": " Y el sol que sigue el rumbo que se le ha prescrito. Ése es el decreto del Todopoderoso, el Dios Omnisciente.", "urdu": " اور سورج ایک مقررہ جگہ کی طرف چلا جا رہا ہے‘ یہ غالب (اور) علم والے (خدا) کا مقرر کردہ قانون ہے۔"}, {"arabic": " وَ الۡقَمَرَ قَدَّرۡنٰہُ مَنَازِلَ حَتّٰی عَادَ کَالۡعُرۡجُوۡنِ الۡقَدِیۡمِ ﴿۴۰﴾", "english": " And for the moon We have appointed stages, till it becomes again like an old dry branch of a palm-tree.", "french": " Et pour la lune, Nous avons désigné des phases, jusqu’à ce qu’elle retourne à son ancienne forme comme une vieille branche sèche de dattier.", "german": " Und für den Mond haben Wir Lichtgestalten bestimmt, bis er wie ein alter Palmzweig wiederkehrt.", "spanish": " Para la luna hemos estable­cido fases, hasta que vuelve a su antigua forma , similar a una rama vieja y seca de palmera.", "urdu": " اور چاند کو (دیکھو کہ) ہم نے اس کے لئے بھی منزلیں مقرر کر چھوڑی ہیں یہاں تک کہ وہ (ان منزلوں پر چلتے چلتے) ایک پرانی شاخ کے مشابہ ہو کر پھر لوٹ آتا ہے۔"}, {"arabic": " لَا الشَّمۡسُ یَنۡۢبَغِیۡ لَہَاۤ اَنۡ تُدۡرِکَ الۡقَمَرَ وَ لَا الَّیۡلُ سَابِقُ النَّہَارِ ؕ وَ کُلٌّ فِیۡ فَلَکٍ یَّسۡبَحُوۡنَ ﴿۴۱﴾", "english": " It is not for the sun to overtake the moon, nor can the night outstrip the day. All of them float in an orbit.", "french": " Il n’est pas permis au soleil de rattraper la lune, et la nuit ne peut pas dépasser le jour non plus. Chacun flotte dans une orbite.", "german": " Nicht geziemte es der Sonne, dass sie den Mond einholte, noch darf die Nacht dem Tage zuvorkommen. Sie schweben ein jedes in (seiner) Sphäre.", "spanish": " No corresponde al sol alcanzar la luna, ni la noche puede adelan­tarse al día. Todos flotan en una órbita.", "urdu": " نہ تو سورج کو طاقت ہے کہ وہ اپنے سال کے دورہ میں کسی وقت چاند کے قریب جا پہنچے (کیونکہ اگر ایسا ہو تو سارا نظام شمسی تباہ ہو جائے) اور نہ رات کو (یعنی چاند کو) طاقت ہے کہ وہ مسابقت کرتے ہوئے دن کو (یعنی سورج کو) پکڑ لے بلکہ یہ سب کے سب ایک مقررہ راستہ پر نہایت سہولت سے چلتے چلے جاتے ہیں۔"}, {"arabic": " وَ اٰیَۃٌ لَّہُمۡ اَنَّا حَمَلۡنَا ذُرِّیَّتَہُمۡ فِی الۡفُلۡکِ الۡمَشۡحُوۡنِ ﴿ۙ۴۲﴾", "english": " And a Sign for them is that We carry their offspring in the laden ship,", "french": " Et un signe pour eux est que Nous avons transporté leur progéniture sur le bateau chargé.", "german": " Und ein Zeichen ist es ihnen, dass Wir ihre Nachkommenschaft in dem beladenen Schiffe tragen,", "spanish": " Y un Signo para ellos es que llevamos a sus descendientes en la embarcación cargada.", "urdu": " اور ان کے لئے یہ بھی نشانی ہے کہ ہم ان کی نسل کو بھری ہوئی کشتیوں میں اٹھائے پھرتے ہیں۔"}, {"arabic": " وَ خَلَقۡنَا لَہُمۡ مِّنۡ مِّثۡلِہٖ مَا یَرۡکَبُوۡنَ ﴿۴۳﴾", "english": " And We have created for them the like thereof whereon they ride.", "french": " Et Nous créerons pour eux d’autres moyens semblables sur lesquels ils voyageront.", "german": " und Wir werden für sie ein Gleiches ins Dasein rufen, darauf sie fahren werden.", "spanish": " Y crearemos para ellos algo similar en lo que montarán.", "urdu": " اور ہم ان کے لئے اسی قسم کی اور (چیزیں) بھی پیدا کریں گے جن کو وہ سواری کے کام میں لائیں گے۔"}, {"arabic": " وَ اِنۡ نَّشَاۡ نُغۡرِقۡہُمۡ فَلَا صَرِیۡخَ لَہُمۡ وَ لَا ہُمۡ یُنۡقَذُوۡنَ ﴿ۙ۴۴﴾", "english": " And if We so willed, We could drown them; then they would have no one to succour them , nor would they be rescued,", "french": " Et si Nous le voulions, Nous pourrions les noyer ; alors ils n’auraient personne pour les secourir, et ils ne seraient pas non plus sauvés,", "german": " Und wenn Wir wollten, so könnten Wir sie ertrinken lassen; dann würden sie keinen Helfer haben, noch könnten sie gerettet werden,", "spanish": " Mas si hubiésemos querido, los hubiésemos ahogado; entonces no tendrían a nadie que les socorrieran, ni serían rescatados,", "urdu": " اور اگر ہم چاہیں تو ان کو ہلاک کر دیں پھر کوئی ان کا فریاد سننے والا نہ ہوگا اور نہ ہماری رحمت کے سوا کسی اور ذریعہ سے وہ بچائے جائیں گے۔"}, {"arabic": " اِلَّا رَحۡمَۃً مِّنَّا وَ مَتَاعًا اِلٰی حِیۡنٍ ﴿۴۵﴾", "english": " Except through mercy from Us and as a provision for a time.", "french": " Sauf par une miséricorde de Notre part, et comme provision pour un temps.", "german": " außer durch Unsere Barmherzigkeit und zu einem Nießbrauch auf gewisse Zeit.", "spanish": " Salvo por Nuestra miseri­cordia y como provisión durante algún tiempo.", "urdu": " اور وہ صرف ایک مدت تک دنیاوی فائدہ اٹھائیں گے۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمُ اتَّقُوۡا مَا بَیۡنَ اَیۡدِیۡکُمۡ وَ مَا خَلۡفَکُمۡ لَعَلَّکُمۡ تُرۡحَمُوۡنَ ﴿۴۶﴾", "english": " And when it is said to them, ‘Guard yourselves against that which is before you and that which is behind you, in order that you may receive mercy,’ they turn away .", "french": " Et lorsqu’on leur dit : « Prémunissez-vous contre ce qui est devant vous, et ce qui est derrière vous afin que miséricorde vous soit faite, »", "german": " Und wenn zu ihnen gesprochen wird: \"Hütet euch vor dem, was vor euch ist und was hinter euch ist, auf dass ihr Erbarmen findet\" (dann kehren sie sich ab).", "spanish": " Y cuando se les dijo: “Guar­daos contra lo que está delante de osotros y lo que está tras vo­sotros, es decir, de las faltas mani­fiestas y ocultas, para que se os muestre misericordia”.", "urdu": " اور جب ان سے کہا جائے کہ جو کچھ تمہارے آگے آنے والا ہے (اس سے بچو) اور جو اعمال تم پیچھے چھوڑ آئے ہو ان کی جزا سے بھی بچنے کی کوشش کرو تا کہ تم پر رحم کیا جائے (تو وہ نصیحت پکڑنے کی بجائے اس کی تحقیر کرتے ہیں اور فائدہ نہیں اٹھاتے)"}, {"arabic": " وَ مَا تَاۡتِیۡہِمۡ مِّنۡ اٰیَۃٍ مِّنۡ اٰیٰتِ رَبِّہِمۡ اِلَّا کَانُوۡا عَنۡہَا مُعۡرِضِیۡنَ ﴿۴۷﴾", "english": " And there comes not to them any Sign out of the Signs of their Lord, but they turn away from it.", "french": " Et il ne leur vient aucun Signe parmi les Signes de leur Seigneur, sans qu’ils ne s’en détournent.", "german": " Und es kommt kein Zeichen zu ihnen von den Zeichen ihres Herrn, ohne dass sie sich davon abwenden.", "spanish": " Y no llega a ellos ninguno de los Signos de su Señor sin que se aparten de él.", "urdu": " اور ان کے رب کے نشانوں میں سے جو کوئی اہم نشان ظاہر ہوتا ہے‘ وہ اس سے بھی منہ پھیر لیتے ہیں۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ اَنۡفِقُوۡا مِمَّا رَزَقَکُمُ اللّٰہُ ۙ قَالَ الَّذِیۡنَ کَفَرُوۡا لِلَّذِیۡنَ اٰمَنُوۡۤا اَنُطۡعِمُ مَنۡ لَّوۡ یَشَآءُ اللّٰہُ اَطۡعَمَہٗۤ ٭ۖ اِنۡ اَنۡتُمۡ اِلَّا فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۴۸﴾", "english": " And when it is said to them, ‘Spend out of that with which Allah has provided you,’ those who disbelieve say to those who believe, ‘Shall we feed him whom Allah would have fed, if He had so willed? You are but in manifest error.’", "french": " Et lorsqu’il leur est dit : « Dépensez de la provision qu'Allāh vous a accordée », les mécréants disent aux croyants : « Devons-nous nourrir celui qu’Allāh aurait nourri, s’Il l’avait voulu ? Vous n’êtes que dans une erreur manifeste ! »", "german": " Und wenn zu ihnen gesprochen wird: \"Spendet von dem, was Allah euch gegeben hat\", sagen die Ungläubigen zu den Gläubigen: \"Sollen wir einen speisen, den Allah hätte speisen können, wenn Er es gewollt? Ihr seid da zweifellos in offenkundigem Irrtum.\"", "spanish": " Mas cuando se les dice: “Em­plead de lo que Al‑lah os ha propor­cionado”, los incrédulos dicen a los creyentes: “¿Debemos limentar a quien Al‑lah habría alimentado si Él lo hubiese así querido? Estáis en un error evidente”.", "urdu": " اور جب ان سے کہا جاتا ہے کہ جو کچھ تم کو خدا نے دیا ہے اس سے خرچ کرو‘ تو کافر مومنوں سے کہتے ہیں کہ کیا ہم ان کو کھلائیں جن کو اگر اللہ چاہتا تو آپ بھی کھلا سکتا تھا تم (تو خدا کی مرضی کے خلاف تعلیم دے کر) کھلی کھلی گمراہی میں مبتلا ہو۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ مَتٰی ہٰذَا الۡوَعۡدُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۴۹﴾", "english": " And they say, ‘When will this promise be fulfilled , if indeed you are truthful?’", "french": " Et ils disent : « Quand cette promesse sera-t-elle accomplie, si vous êtes véridiques ? »", "german": " Und sie sprechen: \"Wann wird diese Verheißung (in Erfüllung gehen), wenn ihr die Wahrheit redet?\"", "spanish": " Dicen: “¿Cuándo será cumplida esta promesa, si en verdad s ois veraces?”.", "urdu": " اور وہ کہتے ہیں کہ اگر تم سچے ہو تو ہمیں بتاٶ کہ وہ (عذاب کا) وعدہ کب پورا ہوگا۔"}, {"arabic": " مَا یَنۡظُرُوۡنَ اِلَّا صَیۡحَۃً وَّاحِدَۃً تَاۡخُذُہُمۡ وَ ہُمۡ یَخِصِّمُوۡنَ ﴿۵۰﴾", "english": " They are waiting only for a single blast which will seize them while they are disputing.", "french": " Ils n’attendent qu’une seule explosion foudroyante qui les saisira pendant qu’ils discutent.", "german": " Sie warten nur auf einen einzigen Schall, der sie erfassen wird, während sie noch streiten.", "spanish": " Están esperando al único so­plo que los arrebatará mientras disputan.", "urdu": " وہ صرف ایک اچانک عذاب کا انتظار کررہے ہیں جو ان کو آپکڑے گا اور وہ بحثوں میں ہی لگے ہوئے ہوں گے۔"}, {"arabic": " فَلَا یَسۡتَطِیۡعُوۡنَ تَوۡصِیَۃً وَّ لَاۤ اِلٰۤی اَہۡلِہِمۡ یَرۡجِعُوۡنَ ﴿٪۵۱﴾", "english": " And they will not be able to make a will, nor will they return to their families.", "french": " Et ils ne pourront pas faire de testament, et ils ne retourneront pas non plus à leur famille.", "german": " Und sie werden nicht imstande sein, einander Rat zu geben, noch werden sie zu ihren Angehörigen zurückkehren.", "spanish": " Y no podrán otorgar testa­mento ni regresarán a sus familias.", "urdu": " اس وقت نہ تو وہ ایک دوسرے کو کوئی نصیحت کر سکیں گے اور نہ اپنے اہل و عیال کی طرف واپس جا (کر ان کو سمجھا) سکیں گے۔"}, {"arabic": " وَ نُفِخَ فِی الصُّوۡرِ فَاِذَا ہُمۡ مِّنَ الۡاَجۡدَاثِ اِلٰی رَبِّہِمۡ یَنۡسِلُوۡنَ ﴿۵۲﴾", "english": " And the trumpet shall be blown, and lo! from the graves they will hasten on to their Lord.", "french": " Et l’on sonnera de la trompe, et voilà que de leur tombe ils se hâteront vers leur Seigneur.", "german": " Und in die Posaune soll geblasen werden, und siehe, aus den Gräbern eilen sie hervor zu ihrem Herrn.", "spanish": " La trompeta sonará, y he ahí que de sus tumbas se apresurarán a ir a su Señor.", "urdu": " اور بگل بجایا جائے گا۔ اور وہ اچانک قبروں میں سے نکل کر اپنے رب کی طرف بھاگ کھڑے ہوں گے۔"}, {"arabic": " قَالُوۡا یٰوَیۡلَنَا مَنۡۢ بَعَثَنَا مِنۡ مَّرۡقَدِنَا ٜۘؐ ہٰذَا مَا وَعَدَ الرَّحۡمٰنُ وَ صَدَقَ الۡمُرۡسَلُوۡنَ ﴿۵۳﴾", "english": " They will say, ‘O! woe to us! who has raised us up from our place of sleep? This is what the Gracious God had promised, and the Messengers spoke the truth.’", "french": " Ils diront : « Ô ! Malheur à nous ! qui nous a fait sortir de notre tombe ? Ceci est ce qu’avait promis le Dieu Gracieux et les Messagers avaient dit la vérité. »", "german": " Sie werden sprechen: \"O wehe uns! wer hat uns erweckt von unserer Ruhestätte? Das ist´s, was der Gnadenreiche (uns) verheißen hatte, und die Gesandten sprachen doch die Wahrheit.\"", "spanish": " Dirán: “¡Oh, ay de no­sotros! ¿Quién nos ha sacado de nuestras tumbas? Esto es lo que el Dios Clemente había prometido, y los Mensajeros dijeron la verdad”.", "urdu": " (اور ایک دوسرے سے) کہیں گے‘ ہائے ہلاکت! ہمیں قبروں سے نکال کر کس نے کھڑا کر دیا ہے یہ تو وہی بات ہے جس کا رحمن (خدا) نے ہم سے وعدہ کیا تھا اور رسولوں نے جو کچھ کہا تھا سچ ہی کہا تھا۔"}, {"arabic": " اِنۡ کَانَتۡ اِلَّا صَیۡحَۃً وَّاحِدَۃً فَاِذَا ہُمۡ جَمِیۡعٌ لَّدَیۡنَا مُحۡضَرُوۡنَ ﴿۵۴﴾", "english": " It will be but one blast and lo! they will all be brought before Us.", "french": " Ce ne sera qu’une seule explosion foudroyante, et voilà que certainement ils seront tous amenés devant Nous.", "german": " Es wird nur ein einziger Schall sein, und siehe, sie werden alle vor Uns gebracht werden.", "spanish": " ¡No será más que un soplo y he ahí que todos ellos serán traídos ante Nosotros!", "urdu": " یہ (محض) ایک اچانک عذاب ہوگا جس کے نتیجہ میں وہ سب کے سب اکٹھے کیے جاکر ہمارے حضور میں پیش کیے جائیں گے۔"}, {"arabic": " فَالۡیَوۡمَ لَا تُظۡلَمُ نَفۡسٌ شَیۡئًا وَّ لَا تُجۡزَوۡنَ اِلَّا مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۵۵﴾", "english": " And on that day, no soul will be wronged in aught; nor will you be rewarded but for what you used to do.", "french": " Et ce jour-là, nul tort ne sera fait à aucune âme, et vous ne serez rétribués que pour ce que vous faisiez.", "german": " Und an jenem Tage soll keinem irgendein Unrecht geschehen; und ihr sollt nur für das belohnt werden, was ihr zu tun pflegtet.", "spanish": " Y en ese día, ningún alma será perjudicada en absoluto; ni se­réis retribuidos excepto por lo que solíais practicar.", "urdu": " اور اس دن کسی جان پر ذرہ بھر بھی ظلم نہیں کیا جائے گا‘ اور تم کو تمہارے اعمال کے مطابق جزا دی جائے گی۔"}, {"arabic": " اِنَّ اَصۡحٰبَ الۡجَنَّۃِ الۡیَوۡمَ فِیۡ شُغُلٍ فٰکِہُوۡنَ ﴿ۚ۵۶﴾", "english": " Verily the inmates of Heaven will, on that day, be happy in their occupation.", "french": " En vérité, ce jour-là, les habitants du Paradis seront heureux dans différentes occupations.", "german": " Wahrlich, die Bewohner des Himmels sollen an jenem Tage Freude finden an einer Beschäftigung.", "spanish": " En verdad, los habitantes del Cielo, en ese día estarán felizmente ocupados en diversos quehaceres.", "urdu": " جنتی لوگ اس دن ایک اہم کام (یعنی ذکر الٰہی) میں مشغول ہونگے اور (اپنی حالت کو دیکھ کر) خوشی سے ہنس رہے ہوں گے۔"}, {"arabic": " ہُمۡ وَ اَزۡوَاجُہُمۡ فِیۡ ظِلٰلٍ عَلَی الۡاَرَآئِکِ مُتَّکِـُٔوۡنَ ﴿۵۷﴾", "english": " They and their wives will be in pleasant shades, reclining on raised couches.", "french": " Eux et leurs épouses seront sous des ombrages agréables, accoudés sur des divans élevés.", "german": " Sie und ihre Gefährten werden in angenehmem Schatten sein, hingelehnt auf erhöhten Sitzen.", "spanish": " Ellos y sus esposas estarán bajo sombras agradables, reclinados en divanes elevados.", "urdu": " وہ بھی اور ان کے ساتھی بھی چھپرکھٹوں پر تکئے لگائے بیٹھے ہوں گے (اور خدا کی رحمت کے) سایوں تلے (ہونگے) ۔"}, {"arabic": " لَہُمۡ فِیۡہَا فَاکِہَۃٌ وَّ لَہُمۡ مَّا یَدَّعُوۡنَ ﴿ۚۖ۵۸﴾", "english": " They will have fruits therein, and they will have whatever they call for.", "french": " Ils y auront des fruits, et ils auront tout ce qu’ils demanderont.", "german": " Früchte werden sie darin haben, und sie werden haben, was immer sie begehren.", "spanish": " Tendrán allí frutos y tendrán todo lo que pidan.", "urdu": " ان کے لئے ان جنتوں میں میوے مہیا کیے جائیں گے اور جو کچھ وہ طلب کریں گے انہیں دیا جائے گا۔"}, {"arabic": " سَلٰمٌ ۟ قَوۡلًا مِّنۡ رَّبٍّ رَّحِیۡمٍ ﴿۵۹﴾", "english": " ‘Peace on you ’ — a word of greeting from the Merciful Lord.", "french": " Ils seront salués avec : « Paix ! » – parole de salutation d’un Seigneur Miséricordieux.", "german": " Frieden – eine Botschaft von einem erbarmenden Herrn.", "spanish": " “La paz sea con vosotros ”, una palabra de saludo del Señor Misericordioso.", "urdu": " (اور) ان کو سلام کہا جائے گا جو باربار کرم کرنے والے رب کی طرف سے ان کی طرف پیغام ہوگا۔"}, {"arabic": " وَ امۡتَازُوا الۡیَوۡمَ اَیُّہَا الۡمُجۡرِمُوۡنَ ﴿۶۰﴾", "english": " And God will say , ‘Separate yourselves from the righteous this day, O ye guilty ones!", "french": " Et Allāh dira : « Séparez-vous aujourd’hui des justes , ô vous les coupables !", "german": "", "spanish": " Y Dios dirá : “¡Separaos de los justos en este día, Oh vosotros, los culpables!", "urdu": " اور (ہم یہ بھی کہیں گے کہ) اے مجرمو! آج تم (مومنوں سے) الگ ہو جاٶ۔"}, {"arabic": " اَلَمۡ اَعۡہَدۡ اِلَیۡکُمۡ یٰبَنِیۡۤ اٰدَمَ اَنۡ لَّا تَعۡبُدُوا الشَّیۡطٰنَ ۚ اِنَّہٗ لَکُمۡ عَدُوٌّ مُّبِیۡنٌ ﴿ۙ۶۱﴾", "english": " ‘Did I not enjoin on you, O ye sons of Adam, that you worship not Satan — for he is to you an open enemy —", "french": " Ne vous avais-Je pas enjoint, ô enfants d'Adam, de ne pas adorer Satan – car il est pour vous un ennemi déclaré –", "german": " Habe Ich euch nicht geboten, ihr Kinder Adams, dass ihr nicht Satan dienet – denn er ist euch ein offenkundiger Feind –,", "spanish": " “¿Acaso no os ordené, Oh vo­sotros, hijos de Adán, que no adorarais a Satanás ‑pues él es vuestro enemigo declarado‑", "urdu": " اے بنی آدم! کیا میں نے تم پر یہ ذمہ واری نہیں لگائی تھی کہ شیطان کی عبادت نہ کیا کرو‘ وہ تمہارا کھلا کھلا دشمن ہے۔"}, {"arabic": " وَّ اَنِ اعۡبُدُوۡنِیۡ ؕؔ ہٰذَا صِرَاطٌ مُّسۡتَقِیۡمٌ ﴿۶۲﴾", "english": " ‘And that you worship Me? This is the right path.", "french": " Et ne vous avais-Je pas enjoint de M'adorer ? Voilà un droit chemin.", "german": " sondern dass ihr Mir allein dienet? Das ist der gerade Weg.", "spanish": " “Y que Me adorarais? Éste es el camino recto.", "urdu": " اور صرف میری عبادت کرو کہ یہی سیدھا راستہ ہے۔"}, {"arabic": " وَ لَقَدۡ اَضَلَّ مِنۡکُمۡ جِبِلًّا کَثِیۡرًا ؕ اَفَلَمۡ تَکُوۡنُوۡا تَعۡقِلُوۡنَ ﴿۶۳﴾", "english": " ‘And he did lead astray a great multitude of you. Why did you not then understand?", "french": " Et pourtant il a égaré un grand nombre d’entre vous. Pourquoi n’avez-vous pas compris donc ?", "german": " Und doch hat er eine große Menge von euch irregeführt. Hattet ihr denn keine Einsicht?", "spanish": " “Mas él extravió a una gran multitud de vosotros. ¿Por qué no entendisteis entonces?", "urdu": " اور شیطان تو بہت سی مخلوق کو ہلاک کر چکا ہے‘ کیا تمہاری سمجھ میں یہ نہیں آتا؟"}, {"arabic": " ہٰذِہٖ جَہَنَّمُ الَّتِیۡ کُنۡتُمۡ تُوۡعَدُوۡنَ ﴿۶۴﴾", "english": " ‘This is the Hell which you were promised.", "french": " Ceci est l’Enfer qui vous a été promis.", "german": " vDas ist die Hölle, die euch angedroht ward.", "spanish": " “Éste es el Infierno que se os prometió,", "urdu": " (دیکھو) یہ جہنم ہے جس کا تم سے وعدہ کیا جاتا ہے۔"}, {"arabic": " اِصۡلَوۡہَا الۡیَوۡمَ بِمَا کُنۡتُمۡ تَکۡفُرُوۡنَ ﴿۶۵﴾", "english": " ‘Enter it this day, because you disbelieved.’", "french": " Entrez-y aujourd’hui, parce que vous avez refusé de croire. »", "german": "", "spanish": " “Entrad en él en este día, porque no creísteis”.", "urdu": " اپنے کفر کی وجہ سے آج اس میں داخل ہو جاٶ۔"}, {"arabic": " اَلۡیَوۡمَ نَخۡتِمُ عَلٰۤی اَفۡوَاہِہِمۡ وَ تُکَلِّمُنَاۤ اَیۡدِیۡہِمۡ وَ تَشۡہَدُ اَرۡجُلُہُمۡ بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۶۶﴾", "english": " This day We shall put a seal on their mouths, and their hands will speak to Us, and their feet will bear witness to what they had earned.", "french": " Ce jour-là Nous scellerons leur bouche, et leurs mains Nous parleront, et leurs pieds porteront témoignage de ce qu’ils avaient acquis.", "german": " An jenem Tage werden Wir ihre Münder versiegeln, jedoch ihre Hände werden zu Uns sprechen, und ihre Füße werden alle ihre Machenschaften bezeugen.", "spanish": " En este día pondremos un sello en sus bocas, y sus manos nos hablarán, y sus pies serán testigos de lo que consiguieron.", "urdu": " اس دن ہم (ان کے کفر کی وجہ سے) ان کے مونہوں پر مہر لگا دیں گے (یعنی بولنے کی ضرورت نہیں ہوگی) اور ان کے ہاتھ ہم سے باتیں کریں گے اور ان کے پاٶں ان کی کرتوتوں پر گواہی دیں گے۔"}, {"arabic": " وَ لَوۡ نَشَآءُ لَطَمَسۡنَا عَلٰۤی اَعۡیُنِہِمۡ فَاسۡتَبَقُوا الصِّرَاطَ فَاَنّٰی یُبۡصِرُوۡنَ ﴿۶۷﴾", "english": " And if We had so willed, We could have put out their eyes, then they would have rushed to find the way. But how could they see?", "french": " Et si Nous l’avions voulu, Nous aurions pu leur crever les yeux, alors ils se seraient précipités pour trouver le chemin. Mais comment pourraient-ils voir ?", "german": " Und hätten Wir gewollt, Wir hätten ihre Augen auslöschen können; dann würden sie nach dem Weg geeilt sein. Aber wie hätten sie sehen können?", "spanish": " Y si así lo hubiésemos querido, les habríamos privado de los ojos, y entonces habrían continuado pi­sando el camino, pero ¿cómo lo per­cibirían?", "urdu": " اور اگر ہم چاہیں تو ان کی آنکھوں کو اندھا کر دیں‘ پھر وہ بے دیکھے ایک راستہ کی تلاش میں چل پڑیں‘ مگر اس حالت میں وہ (سچے راستہ کو) دیکھ کس طرح سکتے ہیں۔"}, {"arabic": " وَ لَوۡ نَشَآءُ لَمَسَخۡنٰہُمۡ عَلٰی مَکَانَتِہِمۡ فَمَا اسۡتَطَاعُوۡا مُضِیًّا وَّ لَا یَرۡجِعُوۡنَ ﴿٪۶۸﴾", "english": " And if We had so willed, We could have transformed them so as to transfix them in their places, then they would not be able to move forward or turn back.", "french": " Et si Nous l’avions voulu, Nous aurions pu les transformer pour qu’ils soient figés à leur place, alors ils ne pourraient ni avancer ni retourner en arrière.", "german": " Und hätten Wir gewollt, Wir hätten sie verwandeln können, wo sie waren; dann wären sie nicht imstande gewesen, vorwärts oder rückwärts zu gehen.", "spanish": " Y si así lo hubiésemos querido, los hubiésemos transformado a fin de inmovilizarlos en sus lugares, y entonces no hubieran podido avan­zar ni retroceder.", "urdu": " اور اگر ہم چاہیں تو جہاں وہ ہیں وہیں ان کی شان کو باطل کر دیں۔ پھر وہ نہ تو کہیں آگے جانے کی طاقت پائیں اور نہ واپس لوٹنے کا راستہ پائیں۔"}, {"arabic": " وَ مَنۡ نُّعَمِّرۡہُ نُنَکِّسۡہُ فِی الۡخَلۡقِ ؕ اَفَلَا یَعۡقِلُوۡنَ ﴿۶۹﴾", "english": " And him whom We grant long life — We revert him to a weak condition of creation. Will they not then understand?", "french": " Et celui à qui Nous accordons une longue vie – Nous le faisons régresser à un état de sénilité. Ne veulent-ils donc pas comprendre ?", "german": " Und wem Wir langes Leben gewähren, den wandeln Wir um in der Schöpfung. Wollen sie denn nicht begreifen?", "spanish": " Y a quien le concedemos lar­ga vida, hacemos que vuelva a un estado de senilidad. ¿Acaso no en­tenderán entonces?", "urdu": " اور جس کی ہم بہت زیادہ لمبی عمر کرتے ہیں اس کو جسمانی طاقتوں میں کمزور کرتے جاتے ہیں‘ کیا وہ سمجھتے نہیں۔"}, {"arabic": " وَ مَا عَلَّمۡنٰہُ الشِّعۡرَ وَ مَا یَنۡۢبَغِیۡ لَہٗ ؕ اِنۡ ہُوَ اِلَّا ذِکۡرٌ وَّ قُرۡاٰنٌ مُّبِیۡنٌ ﴿ۙ۷۰﴾", "english": " And We have not taught him poetry, nor does that suit it (the Qur’an). It is but a Reminder and a Qur’an that makes things plain,", "french": " Et Nous ne lui avons pas enseigné la poésie, et d’ailleurs cela ne lui convient pas. Ce n’est qu’un Rappel et un Coran qui explique et rend les choses claires,", "german": " Und Wir haben ihm nicht die Kunst der Dichtung gelehrt, noch ziemte sie sich für ihn. Dies ist einfach eine Ermahnung und ein Qur-ân, der die Dinge deutlich macht,", "spanish": " No le hemos enseñado la poesía, ni es propia de él. No es más que un Recordatorio y un Corán que deja las cosas claras.", "urdu": " اور ہم نے اسے (یعنی محمد رسول اللہ صلی اللہ علیہ وسلم کو) شعر کہنا نہیں سکھایا‘ اور نہ یہ کام اس کی شان کے مطابق تھا۔ یہ قرآن تو صرف ایک نصیحت ہے اور باربار پڑھنے والی کتاب ہے جو کہ (دلائل ساتھ ساتھ) بیان کرتی ہے۔"}, {"arabic": " لِّیُنۡذِرَ مَنۡ کَانَ حَیًّا وَّ یَحِقَّ الۡقَوۡلُ عَلَی الۡکٰفِرِیۡنَ ﴿۷۱﴾", "english": " So that it may warn all who live, and that the word of punishment be justified against the disbelievers.", "french": " Afin qu’il avertisse tous ceux qui sont vivants, et afin que le décret d’Allāh concernant les mécréants puisse être accompli.", "german": " dass er jeden warne, der Leben hat, und dass der Spruch gerechtfertigt sei wider die Ungläubigen.", "spanish": " Para advertir a todos los que viven, y para que el decreto de Al‑lah se cumpla contra los incrédulos.", "urdu": " تا کہ جو زندہ (دل) ہے اسے ہوشیار کر دے اور کافروں کے متعلق خدا کا فیصلہ پورا ہو جائے۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّا خَلَقۡنَا لَہُمۡ مِّمَّا عَمِلَتۡ اَیۡدِیۡنَاۤ اَنۡعَامًا فَہُمۡ لَہَا مٰلِکُوۡنَ ﴿۷۲﴾", "english": " Do they not see that, among the things which Our hands have fashioned, We have created for them cattle of which they are masters?", "french": " Ne voient-ils pas que parmi les choses que Nos mains ont façonnées, Nous avons créé pour eux des bestiaux dont ils sont maîtres ?", "german": " Haben sie nicht gesehen, dass Wir unter den Dingen, die Unsere Hände gebildet, für sie das Vieh schufen, über das sie Herr sind?", "spanish": " ¿No ven que, de entre las cosas que Nuestras manos han modelado, hemos creado para ellos el ganado del que son dueños?", "urdu": " کیا وہ نہیں دیکھتے کہ ہم نے ان کے لئے اپنی خاص قدرت سے چار پائے بنائے ہیں اور وہ ان کے مالک ہیں۔"}, {"arabic": " وَ ذَلَّلۡنٰہَا لَہُمۡ فَمِنۡہَا رَکُوۡبُہُمۡ وَ مِنۡہَا یَاۡکُلُوۡنَ ﴿۷۳﴾", "english": " And We have subjected the same to them, so that some of them they use for riding and some others they eat.", "french": " Et Nous leur avons assujetti ceux-ci, de sorte qu’ils en utilisent certains comme montures, et en mangent la chair de certains autres.", "german": " Und Wir haben es ihnen unterwürfig gemacht, so dass manche davon ihnen Reittiere sind und manche essen sie.", "spanish": " Se los sometimos de manera que utilicen algunos de ellos para montar y coman de otros.", "urdu": " اور ہم نے ان چار پایوں کو ان کے تابع کر دیا ہے۔ پس ان میں سے بعض پر تو وہ سوار ہوتے ہیں اور بعض کو وہ کھاتے ہیں۔"}, {"arabic": " وَ لَہُمۡ فِیۡہَا مَنَافِعُ وَ مَشَارِبُ ؕ اَفَلَا یَشۡکُرُوۡنَ ﴿۷۴﴾", "english": " And in them they have other benefits and also drinks. Will they not then be grateful?", "french": " Et en eux ils ont d’ autres avantages et aussi des boissons. Ne veulent-ils donc pas être reconnaissants ?", "german": " Und sie haben noch (andere) Nutzen an ihnen und (auch) Trank. Wollen sie also nicht dankbar sein?", "spanish": " En ellos tienen otros bene­ficios y también bebidas. ¿No serán pues agradecidos?", "urdu": " اور ان سے کئی قسم کے فائدے اٹھاتے ہیں اور پینے کا سامان بھی مہیا کرتے ہیں کیا وہ شکر نہیں کرتے؟"}, {"arabic": " وَ اتَّخَذُوۡا مِنۡ دُوۡنِ اللّٰہِ اٰلِہَۃً لَّعَلَّہُمۡ یُنۡصَرُوۡنَ ﴿ؕ۷۵﴾", "english": " And they have taken other gods beside Allah, that they might be helped.", "french": " Et ils ont pris d ’autres dieux en dehors d’Allāh pour être aidés !", "german": " Und sie haben sich Götter genommen statt Allah, damit ihnen geholfen würde.", "spanish": " Mas tomaron a otros dioses distintos de Al‑lah, para que les ayudaran.", "urdu": " اور ان لوگوں نے اللہ کے سوا کچھ اور معبود بنا چھوڑے ہیں کہ شاید کسی وقت ان کی مدد کی جائے۔"}, {"arabic": " لَا یَسۡتَطِیۡعُوۡنَ نَصۡرَہُمۡ ۙ وَ ہُمۡ لَہُمۡ جُنۡدٌ مُّحۡضَرُوۡنَ ﴿۷۶﴾", "english": " They are not able to help them, but they will be brought before God as their allied host.", "french": " Ceux-là ne seront pas capables de les aider. Au contraire ils seront présentés devant Allāh comme une armée pour témoigner contre eux.", "german": " Sie vermögen ihnen nicht zu helfen, sondern sie werden selbst als ein Heer gegen sie gebracht werden.", "spanish": " No podrán ayudarles; por el contrario, se les hará comparecer a ellos mismos junto con éstos como una multitud.", "urdu": " وہ (معبود) ان کی کوئی مدد نہیں کر سکتے اور (معبود ان کی مدد تو کیا کریں گے) الٹا ان کے خلاف سب ایک لشکر کی شکل میں اکٹھے ہو کر گواہی دیں گے۔"}, {"arabic": " فَلَا یَحۡزُنۡکَ قَوۡلُہُمۡ ۘ اِنَّا نَعۡلَمُ مَا یُسِرُّوۡنَ وَ مَا یُعۡلِنُوۡنَ ﴿۷۷﴾", "english": " So let not their speech grieve thee. Verily We know what they conceal and what they proclaim.", "french": " Que leur discours ne t’afflige donc pas. En vérité, Nous savons ce qu’ils dissimulent et ce qu’ils proclament.", "german": " Lass ihre Rede dich daher nicht betrüben. Wir wissen, was sie verbergen und was sie bekunden.", "spanish": " No dejes pues que te aflijan sus discursos. En verdad, sabemos lo que ocultan y lo que proclaman.", "urdu": " پس تجھ کو ان کی باتیں غمگین نہ کریں ہم اسے بھی جانتے ہیں جو وہ چھپاتے ہیں اور اسے بھی جو وہ ظاہر کرتے ہیں۔"}, {"arabic": " اَوَ لَمۡ یَرَ الۡاِنۡسَانُ اَنَّا خَلَقۡنٰہُ مِنۡ نُّطۡفَۃٍ فَاِذَا ہُوَ خَصِیۡمٌ مُّبِیۡنٌ ﴿۷۸﴾", "english": " Does not man see that We have created him from a mere spermdrop? Yet lo! he is an open quarreller!", "french": " L’homme ne voit-il pas que Nous l’avons créé d’une simple goutte de sperme ? Et pourtant , le voilà disputeur déclaré !", "german": " Weiß der Mensch nicht, dass Wir ihn aus einem Samentropfen erschufen? Und siehe da, er ist ein offenkundiger Widersacher!", "spanish": " ¿No ve el hombre que lo hemos creado de una simple gota de esperma? Y sin embargo ¡helo ahí convertido en un pendenciero ma­nifiesto!", "urdu": " کیا انسان کو معلوم نہیں کہ ہم نے اس کو ایک (حقیر) قطرہ سے پیدا کیا ہے پھر جب وہ (پیدا ہوتا ہے تو) اچانک سخت جھگڑالو بن جاتا ہے۔"}, {"arabic": " وَ ضَرَبَ لَنَا مَثَلًا وَّ نَسِیَ خَلۡقَہٗ ؕ قَالَ مَنۡ یُّحۡیِ الۡعِظَامَ وَ ہِیَ رَمِیۡمٌ ﴿۷۹﴾", "english": " And he coins similitudes for Us and forgets his own creation. He says, ‘Who can quicken the bones when they are decayed?’", "french": " Et il fabrique des histoires à Notre sujet, et oublie sa propre création. Il dit : « Qui peut ranimer les ossements lorsqu’ils sont pourris ? »", "german": " Er erzählt Dinge über Uns und vergisst seine eigene Erschaffung. Er spricht: \"Wer kann die Gebeine beleben, wenn sie vermodert sind?\"", "spanish": " E inventa similitudes para Nosotros y olvida su propia creación. Dice: “¿Quién puede dar la vida a los huesos cuando están podridos?”.", "urdu": " اور ہماری ہستی کے متعلق باتیں بنانے لگ جاتا ہے اور اپنی پیدائش کو بھول جاتا ہے اور کہنے لگتا ہے کہ جب ہڈیاں گل سڑ جائیں گی تو ان کو بھلا کون زندہ کرے گا۔"}, {"arabic": " قُلۡ یُحۡیِیۡہَا الَّذِیۡۤ اَنۡشَاَہَاۤ اَوَّلَ مَرَّۃٍ ؕ وَ ہُوَ بِکُلِّ خَلۡقٍ عَلِیۡمُ ۣ﴿ۙ۸۰﴾", "english": " Say, ‘He, Who created them the first time, will quicken them; and He knows every kind of creation full well,", "french": " Dis : « Celui Qui les créa la première fois, les ranimera ; et Il connaît très bien toute espèce de création,", "german": " Sprich: \"Er, Der sie das erstemal erschuf, Er wird sie beleben; denn Er kennt jegliche Schöpfung.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:80&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:80&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic81\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic81\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:81' style='text-decoration:underline'>36:81</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(81)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control81\"></i></button> <audio id=\"player81\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">الَّذِیۡ جَعَلَ لَکُمۡ مِّنَ الشَّجَرِ الۡاَخۡضَرِ نَارًا فَاِذَاۤ اَنۡتُمۡ مِّنۡہُ تُوۡقِدُوۡنَ ﴿۸۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘He Who produces for you fire out of the green tree, and behold, you kindle from it.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_36_81_g' href='#'>g</a>]</sup>‘<i>He </i>Who produces for you fire out of the green<sup class='ref'>[<a class='ref' data-id='ref_36_81_2463' href='#'>2463</a>]</sup> tree, and behold, you kindle from it. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_36_81_g'>g</span><span class='collapsible plus' data-id='ref_36_81_2463'>2463</span></div> <div><div class='reference' data-id='ref_36_81_g' style='display:none'> <p><b>g.</b> <a href='/quran/56:72' target=_blank>56:72</a>, <a href='/quran/56:73' target=_blank>73</a>. (<a href='javascript:void(0)' data-id='ref_36_81_g' class='ref'>close</a>)</p> </div> </div><div><a name='2463'></a><div class='reference' data-id='ref_36_81_2463' style='display:none'> <p><b>2463.</b> 'Green tree' seems to be the resinous tree whose branches get easily ignited and catch fire when friction is caused by the blowing of the wind, the implication being that just as fire is caused by friction between the branches of a tree, even so does new spiritual life result when spiritually weak people come in contact with a Prophet of God, or a Divine Reformer. (<a href='javascript:void(0)' data-id='ref_36_81_2463' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">وہ جس نے سرسبز درختوں سے تمہارے لئے آگ بنا دی۔ پس تم انہی میں سے بعض کو جلانے لگے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">وہ (خدا) جس نے تمہارے لئے سبز درختوں میں سے آگ پیدا کی ہے پس تم اس کے ذریعہ سے آگ جلاتے ہو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Celui Qui produit pour vous du feu de l’arbre vert, et voilà que vous allumez avec.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Aquel que produce para vosotros el fuego del árbol verde y he ahí como vosotros encendéis fuego con él.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er, Der für euch Feuer hervorbringt aus dem grünen Baum; und siehe, dann zündet ihr damit.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=36:81&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=36:81&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic82\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic82\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/36:82' style='text-decoration:underline'>36:82</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(82)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control82\"></i></button> <audio id=\"player82\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَوَ لَیۡسَ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ بِقٰدِرٍ عَلٰۤی اَنۡ یَّخۡلُقَ مِثۡلَہُمۡ ؕ؃ بَلٰی ٭ وَ ہُوَ الۡخَلّٰقُ الۡعَلِیۡمُ ﴿۸۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Has not He Who created the heavens and the earth the power to create the like of them?’ Yea, and He is indeed the Supreme Creator, the All-Knowing.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_36_82_h' href='#'>h</a>]</sup>‘Has not He Who created the heavens and the earth the power to create the like of them?’ Yea, and He is, indeed, the Supreme Creator, the All-Knowing. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_36_82_h'>h</span></div> <div><div class='reference' data-id='ref_36_82_h' style='display:none'> <p><b>h.</b> <a href='/quran/17:100' target=_blank>17:100</a>; <a href='/quran/46:34' target=_blank>46:34</a>; <a href='/quran/86:9' target=_blank>86:9</a>. (<a href='javascript:void(0)' data-id='ref_36_82_h' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا وہ جس نے آسمانوں اور زمین کو پیدا کیا ہے اس بات پر قادر نہیں کہ ان جیسے پیدا کر دے؟ کیوں نہیں۔ جبکہ وہ تو بہت عظیم خالق (اور) دائمی علم رکھنے والا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا وہ جس نے آسمانوں اور زمین کو پیدا کیا ہے اس بات پر قادر نہیں کہ ان کی طرح کی اور مخلوق پیدا کر دے۔ ایسا خیال (کہ وہ پیدا نہیں کر سکتا) درست نہیں‘ بلکہ وہ بہت پیدا کرنے والا (اور) بہت جاننے والا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Celui Qui a créé les cieux et la terre, n’est-Il pas capable de créer leurs pareils ? » Oui <em>certainement</em>, et Il est en vérité le Créateur Suprême, l’Omniscient.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿No tiene acaso, Quien creó los cielos y la tierra, el poder de crear algo semejante a ellos?”. Sí, pues Él es en verdad el Creador Supremo, el Omnisciente.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ist nicht Er, Der die Himmel und die Erde erschuf, imstande, ihresgleichen zu schaffen?\" Doch, und Er ist der größte Schöpfer, der Allwissende.", "spanish": " Diles: “Aquel que los creó la primera vez los vivará; pues Él conoce perfectamente todo tipo de creación;", "urdu": " تو کہہ دے کہ ایسی ہڈیوں کو وہی زندہ کرے گا جس نے ان کو پہلی دفعہ پیدا کیا تھا اور وہ ہر مخلوق کی حالت سے خوب واقف ہے۔"}, {"arabic": " اِنَّمَاۤ اَمۡرُہٗۤ اِذَاۤ اَرَادَ شَیۡئًا اَنۡ یَّقُوۡلَ لَہٗ کُنۡ فَیَکُوۡنُ ﴿۸۳﴾", "english": " Verily His command, when He intends a thing, is only that He says to it, ‘Be!,’ and it is.", "french": " Assurément, Son commandement, lorsqu’Il veut une chose, est seulement qu’Il dit la concernant : « Sois, » et elle commence à être.", "german": " Sein Befehl, wenn Er ein Ding will, ist nur, dass Er spricht: \"Sei!\" – und es ist.", "spanish": " En verdad, Su mandato, cuando quiere una cosa, consiste solamente decir: “¡Sea!”, y comienza a ser.", "urdu": " اس کا معاملہ تو یوں ہے کہ جب کبھی وہ یہ ارادہ کرتا ہے کہ فلاں چیز ہو جائے وہ اس کے بارہ میں کہہ دیتا ہے کہ اس طرح ہو جائے اور وہ اسی طرح ہو جاتی ہے۔"}, {"arabic": " فَسُبۡحٰنَ الَّذِیۡ بِیَدِہٖ مَلَکُوۡتُ کُلِّ شَیۡءٍ وَّ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿٪۸۴﴾", "english": " So Holy is He, in Whose hand is the kingdom of all things. And to Him will you all be brought back.", "french": " Donc, Saint est-Il, en la main de Qui est l’empire sur toutes choses ! Et c’est à Lui que vous serez tous ramenés.", "german": " Preis denn Ihm, in Dessen Hand die Herrschaft über alle Dinge ist und zu Dem ihr zurückgebracht werdet!", "spanish": " Santo es pues Él, en Cuya mano está el reino de todas las cosas. A Él seréis todos devueltos.", "urdu": " پس پاک ہے وہ جس کے قبضہ قدرت میں ہر چیز کی بادشاہت ہے اور جس کی طرف تم سب کو لوٹا کر لے جایا جائے گا۔"}], "Surah": 36}