{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَلۡحَمۡدُ لِلّٰہِ الَّذِیۡ لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ وَ لَہُ الۡحَمۡدُ فِی الۡاٰخِرَۃِ ؕ وَ ہُوَ الۡحَکِیۡمُ الۡخَبِیۡرُ ﴿۲﴾", "english": " All praise is due to Allah, to Whom belongs whatever is in the heavens and whatever is in the earth. And His is all praise in the Hereafter; and He is the Wise, the All-Aware.", "french": " Toute louange est due à Allāh, à Qui appartiennent tout ce qui est aux cieux et tout ce qui est sur la terre. Et à Lui est toute louange dans l’au-delà ; et Il est le Sage, le Très-Conscient.", "german": " Aller Preis gehört Allah, Dessen ist, was in den Himmeln und was auf Erden ist, und Sein ist aller Preis im Jenseits; und Er ist der Allweise, der Allkundige.", "spanish": " Toda alabanza corresponde a Al‑lah, a Quien pertenece todo lo que hay en los cielos y todo lo que hay en la tierra. Suya es toda la alabanza en el Más Allá; pues Él es el Sabio, el Consciente.", "urdu": " سب تعریف اللہ ہی کی ہے (اور) جو آسمانوں اور زمین میں ہے‘ (سب) اسی کا ہے اور (جس طرح ابتدا میں وہ حمد کا مستحق ہے) انجام کار بھی وہی حمد کا مستحق ہوتا ہے اور وہ بڑی حکمتوں کا مالک ہے (اور) ہر چیز سے خبردار ہے۔"}, {"arabic": " یَعۡلَمُ مَا یَلِجُ فِی الۡاَرۡضِ وَ مَا یَخۡرُجُ مِنۡہَا وَ مَا یَنۡزِلُ مِنَ السَّمَآءِ وَ مَا یَعۡرُجُ فِیۡہَا ؕ وَ ہُوَ الرَّحِیۡمُ الۡغَفُوۡرُ ﴿۳﴾", "english": " He knows whatever goes into the earth and whatever comes forth from it, and whatever descends from the heaven and whatever ascends into it; and He is Merciful, Most Forgiving.", "french": " Il sait tout ce qui entre dans la terre et tout ce qui en sort, et tout ce qui descend du ciel et tout ce qui y monte ; et Il est le Miséricordieux, le Très-Pardonnant.", "german": " Er weiß, was in die Erde eingeht und was aus ihr hervorkommt, und was vom Himmel herniedersteigt und was zu ihm aufsteigt; und Er ist der Barmherzige, der Allverzeihende.", "spanish": " Él conoce lo que penetra en la tierra y lo que procede de ella, cuanto desciende del cielo y cuanto a él sube; pues Él es Misericordioso, Sumo Indulgente.", "urdu": " جو کچھ زمین میں داخل ہوتا ہے اسے بھی وہ جانتا ہے اور جو کچھ اس سے نکلتا ہے‘ اسے بھی جانتا ہے نیز اسے بھی جو آسمان سے اترتا ہے اور اسے بھی جو آسمان کی طرف چڑھتا ہے اور وہ باربار رحم کرنے والا (اور) بہت بخشنے والا ہے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا لَا تَاۡتِیۡنَا السَّاعَۃُ ؕ قُلۡ بَلٰی وَ رَبِّیۡ لَتَاۡتِیَنَّکُمۡ ۙ عٰلِمِ الۡغَیۡبِ ۚ لَا یَعۡزُبُ عَنۡہُ مِثۡقَالُ ذَرَّۃٍ فِی السَّمٰوٰتِ وَ لَا فِی الۡاَرۡضِ وَ لَاۤ اَصۡغَرُ مِنۡ ذٰلِکَ وَ لَاۤ اَکۡبَرُ اِلَّا فِیۡ کِتٰبٍ مُّبِیۡنٍ ٭ۙ﴿۴﴾", "english": " And those who disbelieve say, ‘The Hour will never come upon us.’ Say, ‘Yea, by my Lord Who knows the unseen, it will surely come upon you! Not an atom’s weight in the heavens or in the earth or any thing less than that or greater escapes Him, but all is recorded in a perspicuous Book,", "french": " Et ceux qui ne croient pas disent : « L’Heure ne nous atteindra jamais. » Dis : « Mais si, par mon Seigneur Qui connaît l’invisible, elle vous atteindra sûrement ! Rien ne Lui échappe ni dans les cieux ni sur la terre, pas même le poids d’un atome, ou quoi que ce soit de plus petit ou de plus grand, mais tout est inscrit dans un Livre clair,", "german": " Die ungläubig sind, sprechen: \"Wir werden die \"Stunde\" nicht erleben.\" Sprich: \"Ja doch, bei meinem Herrn, dem Wisser des Ungesehenen, sie wird gewisslich über euch kommen! Nicht einmal das Gewicht eines Stäubchens ist vor Ihm verborgen in den Himmeln oder auf Erden; noch gibt es etwas Kleineres oder Größeres als dieses, das nicht in einem deutlichen Buch stünde,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=34:4&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=34:4&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic5\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic5\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/34:5' style='text-decoration:underline'>34:5</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(5)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control5\"></i></button> <audio id=\"player5\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لِّیَجۡزِیَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ ؕ اُولٰٓئِکَ لَہُمۡ مَّغۡفِرَۃٌ وَّ رِزۡقٌ کَرِیۡمٌ ﴿۵﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘That He may reward those who believe and do good works. It is these who will have forgiveness and an honourable provision.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_34_5_b' href='#'>b</a>]</sup>That He may reward those who believe and do righteous deeds. It is these who will have forgiveness and an honourable provision.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_34_5_b'>b</span></div> <div><div class='reference' data-id='ref_34_5_b' style='display:none'> <p><b>b.</b> <a href='/quran/10:5' target=_blank>10:5</a>; <a href='/quran/30:46' target=_blank>30:46</a>. (<a href='javascript:void(0)' data-id='ref_34_5_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">تاکہ وہ ان لوگوں کو جزا دے جو ایمان لائے اور نیک اعمال بجا لائے۔ یہی وہ لوگ ہیں کہ ان کے لئے بخشش ہے اور عزت والا رزق ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اس گھڑی کا آنا اس لئے ضروری ہے) تا کہ اللہ مومنوں اور ایمان کے مطابق عمل کرنے والوں کو ان کے ایمان اور عمل کے مطابق جزا دے۔ وہ یقیناً ایسے ہیں کہ ان کو خدا کی طرف سے مغفرت اور معزز رزق ہمیشہ پہنچتا رہے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Afin qu’Il puisse récompenser ceux qui croient et font de bonnes œuvres. Ceux-là auront <em>le</em> pardon et une provision honorable. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Para que recompense a los que creen y hacen buenas obras. Son éstos quienes tendrán el perdón y una provisión honorable”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">auf dass Er diejenigen belohne, die glauben und gute Werke tun. Solche sind es, die Vergebung und eine ehrenvolle Versorgung erhalten werden.\"", "spanish": " Los que no creen dicen: “La Hora nunca vendrá sobre nosotros”. Diles: “Sí, por mi Señor que conoce lo oculto, ciertamente caerá sobre vo­sotros. Ni el peso de un átomo en los cielos o en la tierra, ni nada menor o mayor se Le escapa, sino que todo está registrado en un Libro lúcido,", "urdu": " اور کافروں نے کہا کہ ہماری قوم کی تباہی کی آخری گھڑی ہم نہیں دیکھیں گے تو کہہ دے ایسا نہیں‘ مجھے اپنے (اس) رب کی قسم جو غیب کا جاننے والا ہے اور آسمانوں اور زمین میں سے کوئی چیز خواہ ایک سرخ چیونٹی کے برابر ہو یا اس سے بھی چھوٹی یا اس سے بڑی ہو اس کی نظروں سے غائب نہیں رہتی۔ یہ گھڑی تم ضرور دیکھو گے کیونکہ وہ ایک ظاہر کر دینے والی تحریر میں محفوظ ہے۔"}, {"arabic": " وَ الَّذِیۡنَ سَعَوۡ فِیۡۤ اٰیٰتِنَا مُعٰجِزِیۡنَ اُولٰٓئِکَ لَہُمۡ عَذَابٌ مِّنۡ رِّجۡزٍ اَلِیۡمٌ ﴿۶﴾", "english": " But as to those who strive against Our Signs, seeking to frustrate Our plans , it is they for whom there will be the suffering of a painful punishment.", "french": " Mais quant à ceux qui luttent contre Nos Signes, cherchant à contrarier Nos desseins , Ceux-là auront le supplice d’un châtiment douloureux.", "german": " Die aber versuchen, Unsere Zeichen zu entkräften, sie sind es, denen eine Strafe schmerzlicher Pein wird.", "spanish": " Pero en cuanto a quienes luchan contra Nuestros Signos, inten­tando frustrar Nuestros planes, para ellos habrá el sufrimiento de un do­loroso castigo.", "urdu": " اور وہ لوگ جو ہمارے نشانوں کے بارے میں (ہم کو) عاجز کرنے کی کوشش کرتے ہیں ان کو ان کے گناہ کی وجہ سے دردناک عذاب پہنچے گا۔"}, {"arabic": " وَ یَرَی الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ الَّذِیۡۤ اُنۡزِلَ اِلَیۡکَ مِنۡ رَّبِّکَ ہُوَ الۡحَقَّ ۙ وَ یَہۡدِیۡۤ اِلٰی صِرَاطِ الۡعَزِیۡزِ الۡحَمِیۡدِ ﴿۷﴾", "english": " And those who are given knowledge see that whatever has been revealed to thee from thy Lord is the truth, and guides unto the path of the Mighty, the Praiseworthy.", "french": " Et ceux à qui le savoir a été donné, voient que tout ce qui t’a été révélé de ton Seigneur est la vérité, et guide vers le chemin du Puissant, du Digne de louange.", "german": " Und die, denen das Wissen gegeben ward, sehen, dass das, was dir von deinem Herrn offenbart worden, die Wahrheit selbst ist und zu dem Pfade des Allmächtigen, des Preiswürdigen leitet.", "spanish": " Los que han recibido conoci­miento ven que todo lo que te ha sido revelado por tu Señor es la verdad, y que guía por el camino del Poderoso, el Merecedor de Alabanza.", "urdu": " اور وہ لوگ جن کو علم دیا گیا ہے اس چیز کو جو تیری طرف تیرے رب کی طرف سے نازل ہوئی ہے حق جانتے ہیں اور یہ (بھی جانتے ہیں) کہ (وہ تعلیم) غالب اور حمد والے خدا کی طرف لے جاتی ہے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا ہَلۡ نَدُلُّکُمۡ عَلٰی رَجُلٍ یُّنَبِّئُکُمۡ اِذَا مُزِّقۡتُمۡ کُلَّ مُمَزَّقٍ ۙ اِنَّکُمۡ لَفِیۡ خَلۡقٍ جَدِیۡدٍ ۚ﴿۸﴾", "english": " And those who disbelieve say, ‘Shall we show you a man who will tell you that when you are broken up into pieces, you shall be raised as a new creation?", "french": " Et ceux qui ne croient pas disent : « Voulez-vous que nous vous montrions un homme qui vous dira que , quand vous aurez été reduits en poussière, vous serez ressuscités en une nouvelle création ? »", "german": " Und jene, die ungläubig sind, sprechen: \"Sollen wir euch einen Mann zeigen, der euch berichtet, ihr würdet, wenn ihr in Stücke zerstückt seid, auch dann noch neue Schöpfung werden?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=34:8&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=34:8&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic9\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic9\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/34:9' style='text-decoration:underline'>34:9</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(9)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control9\"></i></button> <audio id=\"player9\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَفۡتَرٰی عَلَی اللّٰہِ کَذِبًا اَمۡ بِہٖ جِنَّۃٌ ؕ بَلِ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ فِی الۡعَذَابِ وَ الضَّلٰلِ الۡبَعِیۡدِ ﴿۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Has he forged a lie against Allah or is he afflicted with madness?’ Nay, but it is those who believe not in the Hereafter that are suffering from the punishment and are too far gone in error.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> Has he forged a lie against Allah or is he afflicted with madness?’ Nay, <sup class='ref'>[<a class='ref' data-id='ref_34_9_a' href='#'>a</a>]</sup>but those who believe not in the Hereafter are <i>already </i>suffering the punishment and are too far gone in error. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_34_9_a'>a</span></div> <div><div class='reference' data-id='ref_34_9_a' style='display:none'> <p><b>a.</b> <a href='/quran/17:11' target=_blank>17:11</a>; <a href='/quran/27:5' target=_blank>27:5</a>. (<a href='javascript:void(0)' data-id='ref_34_9_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا اس نے اللہ پر جھوٹ گھڑا ہے یا اسے جنون ہو گیا ہے؟ نہیں۔ حقیقت یہ ہے کہ وہ لوگ جو آخرت پر ایمان نہیں لاتے عذاب میں ہیں اور بہت دُور کی گمراہی میں (بھٹک رہے) ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا وہ شخص اللہ پر جھوٹ باندھ رہا ہے یا اس کو جنون ہے یوں نہیں بلکہ جو لوگ آخرت پر ایمان نہیں لاتے وہ (ایسے برے خیالات کی وجہ سے ابھی سے) عذاب اور خطرناک گمراہی میں مبتلا ہو گئے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« A-t-il fabriqué un mensonge contre Allāh, ou est-il affligé de folie ? » <em>Non</em>, mais ce sont ceux qui ne croient pas à l’au-delà qui souffrent<em> déjà</em> du châtiment, et qui sont dans l’égarement extrême.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Ha forjado él una mentira contra Al‑lah o le ha afligido la locura?”. No, pero quienes no creen en el Más Allá son los que sufren el castigo y han ido dema­siado lejos en el error.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Hat er eine Lüge wider Allah ersonnen oder ist er ein Wahnbesessener?\" Nein, sondern jene, die nicht an das Jenseits glauben, sie befinden sich in der Strafe und im großen Irrtum.", "spanish": " Quienes no creen dicen: “¿Hará falta que os mostremos a un hombre que os diga que cuando seáis redu­cidos a fragmentos, seréis resucitados como nueva criatura?", "urdu": " اور وہ (لوگ) جنہوں نے کفر کیا ہے کہتے ہیں کہ (اے لوگو)! کیا ہم تم کو ایک ایسے شخص کا پتہ دیں جو تم کو یہ بتاتا ہے کہ جب تم (مرنے کے بعد) ذرہ ذرہ کر دئیے جاٶ گے تو پھر جڑ کر تم ایک نئی مخلوق کی صورت میں بدل جاٶ گے۔"}, {"arabic": " اَفَلَمۡ یَرَوۡا اِلٰی مَا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ مِّنَ السَّمَآءِ وَ الۡاَرۡضِ ؕ اِنۡ نَّشَاۡ نَخۡسِفۡ بِہِمُ الۡاَرۡضَ اَوۡ نُسۡقِطۡ عَلَیۡہِمۡ کِسَفًا مِّنَ السَّمَآءِ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّکُلِّ عَبۡدٍ مُّنِیۡبٍ ٪﴿۱۰﴾", "english": " Do they not see what is before them and what is behind them of the heaven and the earth? If We please, We could cause the earth to sink with them, or cause pieces of the sky to fall upon them. In that verily is a Sign for every repentant servant.", "french": " Ne voient-ils pas ce qui est devant eux et ce qui est derrière eux du ciel et de la terre ? Si Nous le voulions, Nous pourrions faire la terre s’affaisser avec eux, ou faire tomber sur eux des morceaux du ciel. En vérité, il y a en cela un Signe pour tout serviteur repentant.", "german": " Haben sie denn nicht gesehen, was vor ihnen ist und was hinter ihnen ist vom Himmel und von der Erde? Wenn Wir wollten, könnten Wir sie im Lande zunichte machen oder Stücke von Wolken auf sie fallen lassen. Hierin ist wahrlich ein Zeichen für jeden Diener, der sich bekehrt.", "spanish": " ¿Acaso no ven lo que hay delante de ellos y lo que hay detrás de ellos del cielo y de la tierra? Si queremos, podemos hacer que la tierra se hunda con ellos o hacer que sobre ellos caigan varios pedazos desde el cielo. Aquí hay en verdad un Signo para cualquier siervo arrepen­tido.", "urdu": " کیا انہوں نے اس چیز کی طرف نہیں دیکھا جو آسمان اور زمین سے ان کے آگے کی طرف سے اور ان کے پیچھے کی طرف سے ان کو گھیرے ہوئے ہے اگر ہم چاہیں تو ان کو انہی کے ملک میں مصائب میں مبتلا کر دیں یا ان پر بادل کے کچھ ٹکڑے نازل کریں اس میں خدا کی طرف جھکنے والے ہر بندہ کے لئے ایک نشان ہے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا دَاوٗدَ مِنَّا فَضۡلًا ؕ یٰجِبَالُ اَوِّبِیۡ مَعَہٗ وَ الطَّیۡرَ ۚ وَ اَلَنَّا لَہُ الۡحَدِیۡدَ ﴿ۙ۱۱﴾", "english": " And certainly, We bestowed grace upon David from Ourselves : ‘O ye mountains, repeat the praises of All a h with him, and O birds, ye also .’ And We made the iron soft for him,", "french": " Et certainement, Nous accordâmes à David un grand bienfait de Notre part et dîmes : « Ô montagnes, tournez-vous avec lui vers Allāh en toute soumission et ô oiseaux vous aussi . » Et Nous amollîmes le fer pour lui,", "german": " Und fürwahr, Wir verliehen David Unsere Gnade: \"O ihr (Bewohner der) Berge, singet mit ihm (Gottes) Lob, und ihr Vögel (ebenfalls)!\" Und Wir machten das Eisen weich für ihn", "spanish": " Ciertamente concedimos Nues­tra Gracia a David: “Oh montañas, olveos a Dios con plena sumisión junto a é1, y Oh vosotros pájaros, haced lo mismo ”. E hicimos que el hierro fuese blan­do para él.", "urdu": " اور ہم نے داٶد کو اپنی طرف سے فضل عطا کیا تھا (اور کہا تھا کہ) اے پہاڑوں کے رہنے والو! تم بھی اور اے پرندو تم بھی اس کے ساتھ خدا کی تسبیح کرو اور ہم نے اس کے لئے لوہے کو نرم کر دیا تھا۔"}, {"arabic": " اَنِ اعۡمَلۡ سٰبِغٰتٍ وَّ قَدِّرۡ فِی السَّرۡدِ وَ اعۡمَلُوۡا صَالِحًا ؕ اِنِّیۡ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۱۲﴾", "english": " Saying , ‘Make thou full-length coats of mail, and make the rings of a proper measure. And do righteous deeds, surely I see all that you do.’", "french": " Et Nous dîmes : « Fais des cottes de mailles de pleine longueur, et fais les anneaux de dimensions appropriées. Et faites de bonnes oeuvres, assurément Je vois bien tout ce que vous faites. »", "german": " (und sprachen:) \"Verfertige lange Panzerhemden und füge die Maschen des Kettengewirks fein ineinander. Und tut das Rechte, denn Ich sehe alles, was ihr tut.\"", "spanish": " Diciéndole: “Haz cotas de ma­lla para todo el cuerpo y haz los anillos de la medida adecuada. Y prac­ticad el bien, pues ciertamente veo todo lo que hacéis”.", "urdu": " (اور کہا تھا کہ) پورے سائز کی زرہیں بناٶ اور ان کے حلقے چھوٹے بنانا اور (اے داٶد کے ساتھیو)! اپنے ایمان کے مطابق عمل کرو‘ میں تمہارے عمل کو دیکھ رہا ہوں۔"}, {"arabic": " وَ لِسُلَیۡمٰنَ الرِّیۡحَ غُدُوُّہَا شَہۡرٌ وَّ رَوَاحُہَا شَہۡرٌ ۚ وَ اَسَلۡنَا لَہٗ عَیۡنَ الۡقِطۡرِ ؕ وَ مِنَ الۡجِنِّ مَنۡ یَّعۡمَلُ بَیۡنَ یَدَیۡہِ بِاِذۡنِ رَبِّہٖ ؕ وَ مَنۡ یَّزِغۡ مِنۡہُمۡ عَنۡ اَمۡرِنَا نُذِقۡہُ مِنۡ عَذَابِ السَّعِیۡرِ ﴿۱۳﴾", "english": " And to Solomon We subjected the wind; its morning course was a month’s journey , and its evening course was a month’s journey too . And We caused a fount of molten copper to flow for him. And of the Jinn were some who worked under him, by the command of his Lord. And We had told them that if any of them turned away from Our command, We would make him taste the punishment of burning fire.", "french": " Et à Salomon Nous assujettîmes le vent ; sa course du matin valait un trajet d’un mois, et sa course du soir valait aussi un trajet d’un mois. Et Nous fîmes couler pour lui une source de cuivre fondu. Et parmi les djinns certains travaillaient à son service, par le commandement de son Seigneur, et Nous leur avions dit que si l’un quelconque d’entre eux se déviait de Notre commandement, Nous lui ferions goûter le châtiment de la Fournaise.", "german": " Und Salomo (machten Wir) den Wind (dienstbar); sein Morgenweg dauerte einen Monat, und sein Abendweg dauerte einen Monat. Und Wir ließen eine Quelle von geschmolzenem Erz für ihn fließen. Und unter den Jinn waren welche, die unter ihm arbeiteten auf seines Herrn Geheiß, und sollte einer von ihnen sich wegwenden von Unserem Gebot, so würden Wir ihn die Strafe des flammenden Feuers kosten lassen.", "spanish": " Y sometimos el viento a Salomón; su trayecto de la mañana ue un viaje de un mes, y su trayecto de la tarde un viaje también de un mes. E hicimos que ara él fluyera una fuente de cobre fundido. Y entre los Yinn hubo algunos que trabajaron para él, por orden de su Señor. Y les habíamos dicho que si cualquiera de ellos se apartaba de Nuestro man­damiento, le haríamos probar el cas­tigo del fuego llameante.", "urdu": " اور (ہم نے) سلیمان کو ایسی ہوا (عطا کی تھی) جس کا صبح کا چلنا ایک مہینہ کے برابر ہوتا تھا اور شام کا چلنا بھی ایک مہینہ کے برابر ہوتا تھا اور ہم نے اس کے لئے تانبہ کا چشمہ پگھلا دیا تھا اور ہم نے اس کو جنوں کی ایک جماعت بھی عطا کی تھی جو اس کے رب کے حکم سے اس کے تابع فرمان عمل کرتی تھی اور (یہ بھی کہہ دیا تھا کہ) ان میں سے جو کوئی ہمارے حکم سے کجروی اختیار کرے گا ہم اس کو بھڑکتا ہوا عذاب پہنچائیں گے۔"}, {"arabic": " یَعۡمَلُوۡنَ لَہٗ مَا یَشَآءُ مِنۡ مَّحَارِیۡبَ وَ تَمَاثِیۡلَ وَ جِفَانٍ کَالۡجَوَابِ وَ قُدُوۡرٍ رّٰسِیٰتٍ ؕ اِعۡمَلُوۡۤا اٰلَ دَاوٗدَ شُکۡرًا ؕ وَ قَلِیۡلٌ مِّنۡ عِبَادِیَ الشَّکُوۡرُ ﴿۱۴﴾", "english": " They made for him what he desired; palaces and statues, and basins like reservoirs, and large cooking vessels fixed in their places: ‘Work ye, O House of David gratefully;’ but few of My servants are grateful.", "french": " Ils exécutèrent pour lui ce qu’il désirait : des palais et des statues et des bassins comme des réservoirs, et de gros chaudrons solidement fixés en place : « Travaillez, ô gens de la Maison de David, avec gratitude ; » mais peu de Mes serviteurs sont reconnaissants.", "german": " Sie machten für ihn, was er begehrte: Bethäuser und Bildsäulen, Becken wie Teiche und eingebaute Kochbottiche: \"Wirket, ihr, vom Hause Davids, in Dankbarkeit.\" Und nur wenige von Meinen Dienern sind dankbar.", "spanish": " Hicieron para él lo que deseó: palacios y estatuas, depósitos como estanques, y grandes recipientes para cocinar fijados en sus lugares: “Trabajad, Oh Casa de David, con agradecimiento”; pero muy pocos de Mis siervos son agradecidos.", "urdu": " وہ جو کچھ چاہتا تھا جن (یعنی سرکش قوموں کے سردار) اس کے لئے بناتے تھے یعنی مساجد اور ڈھلے ہوئے مجسمے اور بڑے بڑے لگن جو حوضوں کے برابر ہوتے تھے اور بھاری بھاری دیگیں جو ہر وقت چولھوں پر دھری رہتی تھیں (اور ہم نے کہا) اے داٶد کے خاندان کے لوگو! شکر گذاری کے ساتھ عمل کرو اور میرے بندوں میں سے بہت کم لوگ شکر گذار ہوتے ہیں۔"}, {"arabic": " فَلَمَّا قَضَیۡنَا عَلَیۡہِ الۡمَوۡتَ مَا دَلَّہُمۡ عَلٰی مَوۡتِہٖۤ اِلَّا دَآبَّۃُ الۡاَرۡضِ تَاۡکُلُ مِنۡسَاَتَہٗ ۚ فَلَمَّا خَرَّ تَبَیَّنَتِ الۡجِنُّ اَنۡ لَّوۡ کَانُوۡا یَعۡلَمُوۡنَ الۡغَیۡبَ مَا لَبِثُوۡا فِی الۡعَذَابِ الۡمُہِیۡنِ ﴿ؕ۱۵﴾", "english": " And when We decreed his (Solomon’s) death, nothing pointed out to them that he was dead save a worm of the earth that ate away his staff. So when he fell down, the Jinn plainly realized that if they had known the unseen, they would not have remained in a state of degrading torment.", "french": " Et lorsque Nous décidâmes la mort de Salomon , rien ne leur indiqua qu’il était mort, sauf une créature terrestre qui rongeait son bâton ; alors, lorsque le bâton tomba, les djinns s’aperçurent clairement que s’ils avaient connu l’invisible, ils ne seraient pas restés dans un état de supplice dégradant.", "german": " Und als Wir seinen (Salomos) Tod herbeigeführt hatten, da zeigte ihnen nichts seinen Tod an als ein Wurm der Erde, der sein Zepter zerfraß; also gewahrten die Jinn deutlich, wie er fiel, dass sie, hätten sie das Verborgene gekannt, nicht in schmählicher Pein hätten bleiben müssen.", "spanish": " Mas cuando decretamos su muerte (la de Salomón), nada les indicó que había muerto salvo una criatura de la tierra que devoró su báculo. Por eso, cuando cayó, los Yinn comprendieron claramente que si hubiesen sabido lo oculto, no ha­brían permanecido en estado de tor­mento ignominioso.", "urdu": " پھر جب ہم نے اس کے لئے موت کے وارد ہونے کا فیصلہ کیا تو ان (یعنی سرکش قوموں) کو اس کی موت کی صرف ایک زمین کے کیڑے نے خبر دی جو اس کے عصاء (حکومت) کو کھا رہا تھا پھر جب وہ گر گیا‘ تو جنوں پر ظاہر ہو گیا کہ اگر ان کو غیب کا علم ہوتا تو وہ ذلت والے عذاب میں پڑے نہ رہتے۔"}, {"arabic": " لَقَدۡ کَانَ لِسَبَاٍ فِیۡ مَسۡکَنِہِمۡ اٰیَۃٌ ۚ جَنَّتٰنِ عَنۡ یَّمِیۡنٍ وَّ شِمَالٍ ۬ؕ کُلُوۡا مِنۡ رِّزۡقِ رَبِّکُمۡ وَ اشۡکُرُوۡا لَہٗ ؕ بَلۡدَۃٌ طَیِّبَۃٌ وَّ رَبٌّ غَفُوۡرٌ ﴿۱۶﴾", "english": " There was indeed a Sign for Saba’ in their home-land: two gardens on the right hand and on the left: ‘Eat of the provision of your Lord and be grateful to Him. A good land and a Most Forgiving Lord!’", "french": " Il y avait très certainement un Signe pour les Sabéens dans leur patrie, deux jardins l'un à droite et l'autre à gauche : « Consommez de la provision de votre Seigneur, et soyez reconnaissants envers Lui. Un bon pays et un Seigneur Très-Pardonnnant ! »", "german": " Es gab fürwahr ein Zeichen für Sabâ in ihrem Heimatland: zwei Gärten zur Rechten und zur Linken: \"Esset von den Gaben eures Herrn und seid Ihm dankbar. (Euer ist) eine gute Stadt und ein allverzeihender Herr!\"", "spanish": " Aquí hubo en verdad un Signo para Saba en su propio país: dos jardines a la derecha y a la izquierda. “Comed de la provisión de uestro Señor y sed agradecidos a Él. ¡Una buena tierra y un Señor Sumo In­dulgente!”.", "urdu": " سبا کے لئے ان کے اپنے ملک میں ایک بڑی نشانی موجود تھی (اور وہ) دو باغوں کی صورت میں (تھی) جن میں سے ایک دائیں طرف تھا اور ایک بائیں طرف (تھا) (اور ہم نے ان سے کہہ رکھا تھا کہ) اپنے رب کے رزق کو کھاٶ اور اس کا شکر ادا کرو (تمہارا) شہر ایک خوبصورت شہر ہے اور (تمہارا) رب بہت بخشنے والا ہے۔"}, {"arabic": " فَاَعۡرَضُوۡا فَاَرۡسَلۡنَا عَلَیۡہِمۡ سَیۡلَ الۡعَرِمِ وَ بَدَّلۡنٰہُمۡ بِجَنَّتَیۡہِمۡ جَنَّتَیۡنِ ذَوَاتَیۡ اُکُلٍ خَمۡطٍ وَّ اَثۡلٍ وَّ شَیۡءٍ مِّنۡ سِدۡرٍ قَلِیۡلٍ ﴿۱۷﴾", "english": " But they turned away; so We sent against them a fierce flood. And We gave them, in lieu of their gardens, two gardens bearing bitter fruit and tamarisk and a few lotetrees.", "french": " Mais ils se détournèrent ; Nous avons donc envoyé contre eux une inondation dévastatrice résultant d’une digue rompue. Et Nous leur donnâmes à la place de leurs deux jardins, deux jardins produisant des fruits amers et des tamaris, et quelques jujubiers.", "german": " Jedoch sie kehrten sich ab; da sandten Wir gegen sie eine reißende Flut. Und Wir gaben ihnen, an Stelle ihrer Gärten, zwei Gärten mit bitterer Frucht und Tamarisken und wenigen Lotusbäumen.", "spanish": " Pero se apartaron, por lo que enviamos contra ellos una inunda­ción devastadora procedente de la rotura de un dique. Y en lugar de sus jardines, les dimos dos jardines que daban frutos amargos, tama­rindos y algunos lotos.", "urdu": " پھر بھی انہوں نے (حق سے) پیٹھ پھیر لی تب ہم نے (ان کے حق پانے سے مایوس ہو کر) ان پر ایسا سیلاب بھیج دیا جو ہر چیز کو تباہ کرتا جاتا تھا اور ہم نے ان کے دو اعلیٰ درجہ کے باغوں کی جگہ ان کو دو ایسے باغ دئیے جن کے پھل بدمزہ تھے‘ اور جن میں جھاٶ پایا جاتا تھا یا کچھ تھوڑی سی بیریاں تھیں۔"}, {"arabic": " ذٰلِکَ جَزَیۡنٰہُمۡ بِمَا کَفَرُوۡا ؕ وَ ہَلۡ نُجٰزِیۡۤ اِلَّا الۡکَفُوۡرَ ﴿۱۸﴾", "english": " That We awarded them because of their ingratitude; and none do We requite in this way but the ungrateful.", "french": " Nous les rétribuâmes ainsi à cause de leur ingratitude ; et il n’y a que les ingrats que Nous rétribuons de cette manière-ci .", "german": " Solches gaben Wir ihnen zum Lohn für ihre Undankbarkeit; und so lohnen Wir es keinem als den Undankbaren.", "spanish": " Que les proporcionamos debido a su ingratitud; y a nadie retribuimos de este modo excepto a los desagra­decidos.", "urdu": " یہ سزا ہم نے ان کو ان کی ناشکری کی وجہ سے دی تھی اور ناشکروں کو ہی ہم ایسا بدلہ دیا کرتے ہیں۔"}, {"arabic": " وَ جَعَلۡنَا بَیۡنَہُمۡ وَ بَیۡنَ الۡقُرَی الَّتِیۡ بٰرَکۡنَا فِیۡہَا قُرًی ظَاہِرَۃً وَّ قَدَّرۡنَا فِیۡہَا السَّیۡرَ ؕ سِیۡرُوۡا فِیۡہَا لَیَالِیَ وَ اَیَّامًا اٰمِنِیۡنَ ﴿۱۹﴾", "english": " And We placed, between them and the towns which We had blessed, other towns that were prominently visible, and We fixed easy stages between them; ‘Travel in them for nights and days in security.’", "french": " Et Nous plaçâmes entre eux et les villes que Nous avions bénies, d’autres cités bien visibles, et Nous fixâmes des étapes faciles entre elles : « Voyagez-y pendant des nuits et des jours en toute sécurité. »", "german": " Und Wir setzten zwischen sie und die Städte, die Wir gesegnet hatten, (andere) hochragende Städte, und Wir machten das Reisen zwischen ihnen leicht: \"Reiset in ihnen umher bei Nacht und Tag in Sicherheit.\"", "spanish": " Y, entre ellos y las ciudades que habían sido bendecidas por No­sotros, situamos otras ciudades que eran claramente visibles, y fijamos etapas fáciles entre ellas: “Viajad por ellas de noche y de día con toda seguridad”.", "urdu": " اور ہم نے ان کے درمیان اور ان بستیوں کے درمیان جن کو ہم نے برکت دی تھی‘ (یعنی فلسطین جو سلیمان کا ملک تھا) بہت بستیاں آباد کردی تھیں جو ایک دوسرے کے سامنے اور قریب (قریب) تھیں اور ہم نے ایک بستی سے دوسری بستی تک جانے کا سفر چھوٹا کر دیا تھا اور کہا تھا کہ راتوں کو بھی اور دنوں کو بھی ان میں امن کے ساتھ سفر کرو۔"}, {"arabic": " فَقَالُوۡا رَبَّنَا بٰعِدۡ بَیۡنَ اَسۡفَارِنَا وَ ظَلَمُوۡۤا اَنۡفُسَہُمۡ فَجَعَلۡنٰہُمۡ اَحَادِیۡثَ وَ مَزَّقۡنٰہُمۡ کُلَّ مُمَزَّقٍ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّکُلِّ صَبَّارٍ شَکُوۡرٍ ﴿۲۰﴾", "english": " But they said, ‘Our Lord, place longer distances between the stages of our journeys.’ And they wronged themselves; so We made them bywords and We broke them into pieces, a complete breaking up. In that verily are Signs for every steadfast and grateful person.", "french": " Mais ils dirent : « Notre Seigneur, allonge les distances entre les étapes de nos voyages. » Et ils se firent tort, Nous fîmes donc d’eux la fable des nations , et Nous les détruisîmes complètement. En vérité, il y a en cela des Signes pour toute personne endurante et reconnaissante.", "german": " Jedoch sie sprachen: \"Unser Herr, setze größere Entfernung zwischen die Stationen unserer Reise.\" Und sie sündigten wider sich selber; so machten Wir sie zu Geschichten und zerstückten sie in Stücke. Hierin sind wahrlich Zeichen für jeden Standhaften, Dankbaren.", "spanish": " Pero dijeron: “Señor Nuestro, pon distancias más largas entre las etapas de nuestros viajes”. Y se perjudicaron ellos mismos; por tanto, los convertimos en leyendas y los hicimos pedazos, reduciéndolos a trozos. Aquí hay en verdad Signos para cualquier persona perseverante y agradecida.", "urdu": " (مگر بجائے شکریہ ادا کرنے کے) انہوں نے (یہ) کہا کہ اے ہمارے رب! ہمارے سفروں کو لمبا کر دے (تا کہ سیرو سفر کا مزہ آئے) اور انہوں نے اپنی جانوں پر ظلم کیا پس ہم نے ان کا نام مٹا دیا اور ان کو قدیم زمانہ کے افسانے بنا دیا‘ اور تباہ کرکے ذرہ ذرہ کر دیا۔ اس میں ہر صبر کرنے والے اور بہت شکر کرنے والے بندہ کے لئے بڑے نشانات ہیں۔"}, {"arabic": " وَ لَقَدۡ صَدَّقَ عَلَیۡہِمۡ اِبۡلِیۡسُ ظَنَّہٗ فَاتَّبَعُوۡہُ اِلَّا فَرِیۡقًا مِّنَ الۡمُؤۡمِنِیۡنَ ﴿۲۱﴾", "english": " And Iblis found that his judgment of them was true, so they followed him, all except a party of true believers.", "french": " Et Iblīs trouva que son opinion d’eux était certainement correcte, et ils le suivirent donc, sauf un groupe de vrais croyants.", "german": " Und Iblis bewies fürwahr die Richtigkeit seiner Meinung von ihnen; dann folgten sie ihm mit Ausnahme eines Teils der Gläubigen.", "spanish": " Iblis demostró en verdad que la valoración que había hecho de ellos era correcta, por lo que ellos lo siguieron, todos excepto un grupo de auténticos creyentes.", "urdu": " اور ابلیس نے ان کے بارہ میں اپنے خیال کو سچا ثابت کر دیا اور مومنوں کے ایک گروہ کو چھوڑ کر بقیہ لوگوں (یعنی کفار) نے اس کی پیروی کی۔"}, {"arabic": " وَ مَا کَانَ لَہٗ عَلَیۡہِمۡ مِّنۡ سُلۡطٰنٍ اِلَّا لِنَعۡلَمَ مَنۡ یُّؤۡمِنُ بِالۡاٰخِرَۃِ مِمَّنۡ ہُوَ مِنۡہَا فِیۡ شَکٍّ ؕ وَ رَبُّکَ عَلٰی کُلِّ شَیۡءٍ حَفِیۡظٌ ﴿٪۲۲﴾", "english": " And he had no power over them, but it was so that We might distinguish those who believed in the Hereafter from those who were in doubt about it. And thy Lord is Watchful over all things.", "french": " Et il n’avait aucun pouvoir sur eux, mais Nous voulions ainsi distinguer ceux qui croyaient à l’au-delà de ceux qui en doutaient. Et ton Seigneur est Vigilant sur toutes choses.", "german": " Und er hatte keine Macht über sie, allein Wir wünschten denjenigen, der ans Jenseits glaubte, vor dem auszuzeichnen, der Zweifel darüber hegte. Und dein Herr ist wachsam über alle Dinge.", "spanish": " Y no tenía poder sobre ellos, pero ocurrió así para que pudiéramos distinguir a los que creían en el Más Allá de los que dudaban sobre él. Pues tu Señor es Vigilante de todas las cosas.", "urdu": " حالانکہ اس (یعنی شیطان) کو ان پر کوئی قبضہ حاصل نہیں تھا یہ صرف اس لئے ہوا کہ تا ہم ان کو جو آخرت پر ایمان لانے والے ہیں ان کے مقابلہ میں جو آخرت پر شک رکھتے ہیں ممتاز کرکے ان کی اندرونی حقیقت کھول دیں۔ اور تیرا رب ہر چیز کا نگران ہے۔"}, {"arabic": " قُلِ ادۡعُوا الَّذِیۡنَ زَعَمۡتُمۡ مِّنۡ دُوۡنِ اللّٰہِ ۚ لَا یَمۡلِکُوۡنَ مِثۡقَالَ ذَرَّۃٍ فِی السَّمٰوٰتِ وَ لَا فِی الۡاَرۡضِ وَ مَا لَہُمۡ فِیۡہِمَا مِنۡ شِرۡکٍ وَّ مَا لَہٗ مِنۡہُمۡ مِّنۡ ظَہِیۡرٍ ﴿۲۳﴾", "english": " Say, ‘Call upon those whom you assert to be gods beside Allah. They control not even the weight of an atom in the heavens or in the earth, nor have they any share in either, nor has He any helper among them.’", "french": " Dis : « Invoquez ceux que vous prétendez sont dieux en dehors d’Allāh. Ils ne contrôlent même pas le poids d’un atome dans les cieux ou sur la terre, et ils n’y ont aucune part non plus, ni n’a-t-Il d’auxiliaire parmi eux.", "german": " Sprich: \"Rufet doch jene an, die ihr neben Allah wähnt! Sie haben nicht einmal über das Gewicht eines Stäubchens Macht in den Himmeln oder auf Erden, noch haben sie einen Anteil an beiden, noch hat Er einen Helfer unter ihnen.\"", "spanish": " Diles: “Invocad a aquellos que afirmáis que son dioses fuera de Al‑lah. Ellos no controlan ni siquiera el peso de un átomo en los cielos ni en la tierra, ni tienen parte alguna en ambos, ni tiene Él nadie que le ayude de entre ellos”.", "urdu": " تو کہہ دے کہ جن لوگوں کو تم اپنے خیال کے مطابق اللہ کے سوا پکارتے ہو ان کو (اپنی مدد کے لئے) بلا لو وہ آسمانوں اور زمین میں ایک چیونٹی کے برابر بھی کسی چیز کے ہرگز مالک نہیں اور ان دونوں (کی ملکیت) میں ان کو (کوئی) شراکت حاصل نہیں اور نہ اس کا ان میں سے کوئی مددگار ہے۔"}, {"arabic": " وَ لَا تَنۡفَعُ الشَّفَاعَۃُ عِنۡدَہٗۤ اِلَّا لِمَنۡ اَذِنَ لَہٗ ؕ حَتّٰۤی اِذَا فُزِّعَ عَنۡ قُلُوۡبِہِمۡ قَالُوۡا مَاذَا ۙ قَالَ رَبُّکُمۡ ؕ قَالُوا الۡحَقَّ ۚ وَ ہُوَ الۡعَلِیُّ الۡکَبِیۡرُ ﴿۲۴﴾", "english": " No intercession avails with Him, except for him about whom He permits it , until when their hearts are relieved of fright they would say, ‘What is it that your Lord said?’ They (the Messengers) will answer, ‘The truth.’ And He is the High, the Great.", "french": " L’intercession auprès de Lui ne sera d’aucun profit, sauf l’intercession de celui à qui Il le permet, jusqu’à ce que, quand la frayeur sera enlevée de leur cœur, ils diront : « Qu’a dit votre Seigneur ? Les messagers répondront : « La vérité. » Et Il est le Très-Haut, l’Incomparablement Grand.", "german": " Auch nützt bei Ihm keine Fürbitte, außer für den, bei dem Er es erlaubt, so dass, wenn der Schrecken aus ihren Seelen gewichen ist und sie fragen: \"Was hat euer Herr gesprochen?\", sie antworten werden: \"Die Wahrheit\". Und Er ist der Erhabene, der Große.", "spanish": " Ante Él no sirve intercesión alguna salvo para quien Él se lo permite, hasta que, cuando sus corazones pierden el temor, di­cen: “¿Qué es lo que dijo tu Señor?”. Ellos (los Mensajeros) respon­derán: “La verdad”. Pues Él es el Alto, el Grande.", "urdu": " اور اس (اللہ) کے حضور اس شخص کی شفاعت کے سوا جس کو اللہ نے اجازت دی ہو (یا جس شخص کے حق میں اللہ نے شفاعت کرنے کی اجازت دی ہو) کسی شخص کی شفاعت نفع نہیں بخشتی۔ یہاں تک کہ جب ان (شفاعت کی اجازت پانے والے گروہ) کے دلوں پر سے رعب جاتا رہتا ہے تو دوسرے لوگ ان سے کہتے ہیں کہ ابھی تمہارے رب نے تم سے کیا کہا تھا۔ اس پر وہ جواب دیتے ہیں کہ جو کچھ کہا تھا‘ سچ ہی کہا تھا اور وہ بلند شان اور بڑے اختیارات والا ہے۔"}, {"arabic": " قُلۡ مَنۡ یَّرۡزُقُکُمۡ مِّنَ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ قُلِ اللّٰہُ ۙ وَ اِنَّاۤ اَوۡ اِیَّاکُمۡ لَعَلٰی ہُدًی اَوۡ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۲۵﴾", "english": " Say, ‘Who gives you sustenance from the heavens and the earth?’ Say, ‘Allah. Either we or you are on right guidance or in manifest error.’", "french": " Dis : « Qui vous fournit de la subsistance des cieux et de la terre ? » Dis : « Allāh. Soit nous sommes, soit vous êtes, sur une bonne voie ou dans une erreur manifeste. »", "german": " Sprich: \"Wer gibt euch Nahrung von den Himmeln und der Erde?\" Sprich: \"Allah. Entweder wir sind oder ihr seid auf dem rechten Weg oder in offenkundigem Irrtum.\"", "spanish": " Diles: “¿Quién os da el sostén desde los cielos y la tierra?”. Diles: “Al‑lah. O nosotros o vosotros se­guimos la guía correcta o estamos en error evidente”.", "urdu": " (اور) تو کہہ دے (کہ اے لوگو)! آسمانوں اور زمین میں سے تمہیں کون رزق دیتا ہے (اور پھر خود ہی اس سوال کے جواب میں) کہہ اللہ (اور کون) اور میں اور تم یا تو ہدایت پر قائم ہیں یا کھلی کھلی گمراہی میں مبتلا ہیں۔"}, {"arabic": " قُلۡ لَّا تُسۡـَٔلُوۡنَ عَمَّاۤ اَجۡرَمۡنَا وَ لَا نُسۡـَٔلُ عَمَّا تَعۡمَلُوۡنَ ﴿۲۶﴾", "english": " Say, ‘You will not be questioned as to our sins, nor shall we be questioned as to what you do.’", "french": " Dis : « Vous ne serez pas interrogés sur nos péchés, et nous ne serons pas interrogés non plus sur ce que vous faites. »", "german": " Sprich: \"Ihr sollt nicht befragt werden ob unserer Sünden, noch werden wir befragt werden nach dem, was ihr tut.\"", "spanish": " Diles: “No seréis interrogados sobre nuestros pecados, ni nosotros seremos interrogados sobre lo que vosotros hacéis”.", "urdu": " تو کہہ دے (اگر ہم تمہارے خیال کے مطابق مجرم ہیں تو) ہمارے جرموں کے متعلق تم سے نہیں پوچھا جائے گا اور نہ ہم سے تمہارے اعمال کے متعلق پوچھا جائے گا۔"}, {"arabic": " قُلۡ یَجۡمَعُ بَیۡنَنَا رَبُّنَا ثُمَّ یَفۡتَحُ بَیۡنَنَا بِالۡحَقِّ ؕ وَ ہُوَ الۡفَتَّاحُ الۡعَلِیۡمُ ﴿۲۷﴾", "english": " Say, ‘Our Lord will bring us all together; then He will judge between us with truth: and He is the Judge, the All-Knowing.’", "french": " Dis : « Notre Seigneur nous rassemblera tous ; alors Il jugera entre nous avec justice ; et Il est le Grand Juge, l’Omniscient. »", "german": " Sprich: \"Unser Herr wird uns alle zusammenbringen; dann wird Er zwischen uns richten nach Gerechtigkeit; und Er ist der beste Richter, der Allwissende.\"", "spanish": " Diles: “Nuestro Señor nos reu­nirá a todos, entonces Él juzgará entre nosotros con verdad; pues Él es el Árbitro, el Omnisciente”.", "urdu": " اور یہ بھی کہہ دے کہ ہمارا رب (ایک دن) تم کو اورہم کو (ایک جنگ کے میدان میں) جمع کرے گا پھرحق اورانصاف کے ساتھ ہم دونوں کے درمیان فیصلہ کردے گا اور وہ سب سے بڑا (اور) اچھا فیصلہ کرنے والا ہے اور ہر بات کو خوب جانتا ہے۔"}, {"arabic": " قُلۡ اَرُوۡنِیَ الَّذِیۡنَ اَلۡحَقۡتُمۡ بِہٖ شُرَکَآءَ کَلَّا ؕ بَلۡ ہُوَ اللّٰہُ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۲۸﴾", "english": " Say, ‘Show me those whom you have joined with Him as partners. Nay! You cannot do so , for He is Allah, the Mighty, the Wise.’", "french": " Dis : « Montrez-moi ceux que vous Lui avez adjoints comme associés. Non, mais vous ne pouvez pas le faire , car Il est Allāh, le Puissant, le Sage. »", "german": " Sprich: \"Zeigt mir jene, die ihr Ihm als Götter zur Seite gesetzt habt! Nichts! Er aber ist Allah, der Allmächtige, der Allweise.\"", "spanish": " Diles. “Mostradme aquellos que habéis asociado a Él como partí­cipes”. ¡No!, no podéis hacerlo, pues Él es Al‑lah, el Poderoso, el Sabio.", "urdu": " کہو ان کو مجھے دکھاٶ تو سہی جن کو تم شریک بنا کر اس کے ساتھ ملاتے ہو (اس کا کوئی شریک بنانا) ہرگز درست نہیں بلکہ حق یہ ہے کہ اللہ غالب (اور) بڑی حکمتوں والا ہے۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنٰکَ اِلَّا کَآفَّۃً لِّلنَّاسِ بَشِیۡرًا وَّ نَذِیۡرًا وَّ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یَعۡلَمُوۡنَ ﴿۲۹﴾", "english": " And We have not sent thee but as a bearer of glad tidings and a Warner, for all mankind, but most men know not.", "french": " Et Nous ne t’avons envoyé qu'en tant que Porteur de la bonne nouvelle et Avertisseur pour toute l’humanité ; mais la plupart des hommes ne savent pas.", "german": " Und Wir haben dich entsandt nur als Bringer froher Botschaft und Warner für die ganze Menschheit; jedoch die meisten Menschen verstehen es nicht.", "spanish": " No te hemos enviado sino como portador de la buena nueva y Amonestador para toda la humanidad pero la mayoría de los hombres no lo saben.", "urdu": " اور ہم نے تجھ کو تمام بنی نوع انسان کی طرف (جن میں سے ایک بھی تیرے حلقئہ رسالت سے باہر نہ رہے ایسا) رسول بنا کر بھیجا ہے جو (مومنوں کو) خوشخبری دیتا اور (کافروں کو) ہوشیار کرتا ہے لیکن انسانوں میں سے اکثر اس حقیقت سے واقف نہیں۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ مَتٰی ہٰذَا الۡوَعۡدُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۳۰﴾", "english": " And they say, ‘When will this promise be fulfilled , if you are truthful?’", "french": " Et ils disent : « Quand cette promesse s’accomplira-t-elle , si vous êtes véridiques ? »", "german": " Und sie sprechen: \"Wann wird diese Verheißung (in Erfüllung gehen), wenn ihr die Wahrheit redet?\"", "spanish": " Y dicen: “¿Cuándo se cum­plirá esta promesa, si sois veraces?”.", "urdu": " اور وہ (جوش میں آکر) کہہ دیتے ہیں یہ (ساری دنیا تک رسالت کا پیغام دینے کا) وعدہ اگر تم سچے ہو کب پورا ہوگا؟"}, {"arabic": " قُلۡ لَّکُمۡ مِّیۡعَادُ یَوۡمٍ لَّا تَسۡتَاۡخِرُوۡنَ عَنۡہُ سَاعَۃً وَّ لَا تَسۡتَقۡدِمُوۡنَ ﴿٪۳۱﴾", "english": " Say, ‘For you is the promise of a day from which you cannot remain behind a single moment nor can you get ahead of it .’", "french": " Dis : « Pour vous est la promesse d’un jour duquel vous ne pouvez rester en arrière un seul instant et que vous ne pouvez non plus devancer d’un seul instant . »", "german": " Sprich: \"Euch ist die Frist von einem Tag festgesetzt, von der ihr nicht einen Augenblick säumen noch (ihr) vorauseilen könnt.\"", "spanish": " Diles: “Para vosotros es la promesa de un día en el que no podréis quedaros atrás ni un solo momento, ni adelantaros a él”.", "urdu": " تو کہہ دے کہ تمہارے لئے ایک دن کی میعاد مقرر ہے نہ تو تم اس سے ایک گھڑی پیچھے رہ سکو گے‘ نہ ایک گھڑی آگے بڑھ سکو گے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا لَنۡ نُّؤۡمِنَ بِہٰذَا الۡقُرۡاٰنِ وَ لَا بِالَّذِیۡ بَیۡنَ یَدَیۡہِ ؕ وَ لَوۡ تَرٰۤی اِذِ الظّٰلِمُوۡنَ مَوۡقُوۡفُوۡنَ عِنۡدَ رَبِّہِمۡ ۚۖ یَرۡجِعُ بَعۡضُہُمۡ اِلٰی بَعۡضِ ۣالۡقَوۡلَ ۚ یَقُوۡلُ الَّذِیۡنَ اسۡتُضۡعِفُوۡا لِلَّذِیۡنَ اسۡتَکۡبَرُوۡا لَوۡ لَاۤ اَنۡتُمۡ لَکُنَّا مُؤۡمِنِیۡنَ ﴿۳۲﴾", "english": " And those who disbelieve say, ‘We will never believe in this Qur’an, nor in what is before it;’ and couldst thou see when the wrongdoers will be made to stand before their Lord, throwing back on one another the blame. Those who were considered weak will say to those who were proud, ‘Had it not been for you, we should surely have been believers.’", "french": " Et ceux qui ne croient pas disent : « Nous ne croirons jamais à ce Coran, ni à ce qui a été révélé auparavant. » Si seulement tu pouvais voir lorsque les injustes seront mis debout en présence de leur Seigneur, se rejetant le blâme les uns sur les autres ! Ceux qui étaient rendus faibles diront à ceux qui étaient arrogants : « Sans vous, nous aurions assurément été croyants. »", "german": " Und jene, die ungläubig sind, sprechen: \"Wir wollen keineswegs an diesen Qur-ân glauben, noch an das, was vor ihm ist.\" Und könntest du nur sehen, wenn die Frevler vor ihren Herrn gestellt werden, wie sie sich wechselseitig die Schuld zuwerfen! Diejenigen, die verachtet waren, werden dann zu denen, die hochmütig waren, sprechen: \"Wäret ihr nicht gewesen, ganz gewiss wären wir Gläubige geworden.\"", "spanish": " Y quienes no creen dicen: “Nun­ca creeremos en este Corán, ni en lo que existió antes de él”. Ojalá pu­dieras ver cuando se haga que los inicuos comparezcan ante su Señor, y se echen mutuamente la culpa. Los que eran considerados débiles dirán a los orgullosos: “De no haber sido por vosotros, ciertamente hubiésemos sido creyentes”.", "urdu": " اور کافر کہتے ہیں کہ ہم نہ تو اس قرآن کو مانتے ہیں اور نہ ان پیشگوئیوں کو جو اس کے متعلق کی گئی ہیں اور اگر تو ظالموں کو اس وقت دیکھے جب کہ وہ اپنے رب کے سامنے کھڑے کیے جائیں گے۔ اور ان میں سے بعض بعض سے بحث کر رہے ہوں گے اور کمزور طبقہ متکبر طبقہ سے کہہ رہا ہوگا کہ اگر تم نہ ہوتے تو ہم ضرور ایمان لے آتے۔"}, {"arabic": " قَالَ الَّذِیۡنَ اسۡتَکۡبَرُوۡا لِلَّذِیۡنَ اسۡتُضۡعِفُوۡۤا اَنَحۡنُ صَدَدۡنٰکُمۡ عَنِ الۡہُدٰی بَعۡدَ اِذۡ جَآءَکُمۡ بَلۡ کُنۡتُمۡ مُّجۡرِمِیۡنَ ﴿۳۳﴾", "english": " Those who were proud will say to those who were considered weak, ‘Was it we that kept you away from the guidance, after it had come to you? Nay, it was you yourselves who were guilty.’", "french": " Ceux qui étaient arrogants diront à ceux qui étaient rendus faibles : « Est-ce nous qui vous avons empêchés de suivre la direction, après qu’elle vous fut venue ? Non , mais c’est vous-mêmes qui étiez coupables. »", "german": " Jene, die hochmütig waren, werden zu denen, die verachtet waren, sprechen: \"Waren wir es etwa, die euch vom rechten Weg abwendig machten, nachdem er zu euch gekommen? Nein, ihr selbst wart die Schuldigen.\"", "spanish": " Los que fueron orgullosos dirán a los considerados débiles: “¿Acaso fuimos nosotros los que os apartamos de la guía, después de que os vino? No, fuisteis vosotros mismos los culpables”.", "urdu": " (تب) متکبر طبقہ جواب میں کمزور طبقہ سے کہے گا‘ کہ جب ہدایت تمہارے پاس آگئی تھی تو کیا ہم نے تمہیں اس سے روکا تھا؟ (ہرگز نہیں) بلکہ تم خود ہی مجرم تھے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ اسۡتُضۡعِفُوۡا لِلَّذِیۡنَ اسۡتَکۡبَرُوۡا بَلۡ مَکۡرُ الَّیۡلِ وَ النَّہَارِ اِذۡ تَاۡمُرُوۡنَنَاۤ اَنۡ نَّکۡفُرَ بِاللّٰہِ وَ نَجۡعَلَ لَہٗۤ اَنۡدَادًا ؕ وَ اَسَرُّوا النَّدَامَۃَ لَمَّا رَاَوُا الۡعَذَابَ ؕ وَ جَعَلۡنَا الۡاَغۡلٰلَ فِیۡۤ اَعۡنَاقِ الَّذِیۡنَ کَفَرُوۡا ؕ ہَلۡ یُجۡزَوۡنَ اِلَّا مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۳۴﴾", "english": " And those who were considered weak will say to those who were proud, ‘Nay, but it was your scheming night and day, when you bade us disbelieve in Allah and set up equals unto Him.’ And they will conceal their remorse when they see the punishment; and We shall put chains round the necks of those who disbelieved. They will not be requited but for what they did.", "french": " Et ceux qui étaient rendus faibles diront à ceux qui étaient arrogants : « Non, mais c’étaient vos machinations nuit et jour, lorsque vous nous avez commandés de ne pas croire en Allāh et de Lui ériger des égaux. » Et ils cacheront leurs remords lorsqu’ils verront le châtiment ; et Nous mettrons des chaînes au cou de ceux qui ont été mécréants. Ils ne seront rétribués que pour ce qu’ils auront fait.", "german": " Und jene, die verachtet waren, werden zu denen, die hochmütig waren, sprechen: \"Nein, aber es war (euer) Ränkeschmieden bei Nacht und Tag, als ihr uns hießet, nicht an Allah zu glauben und Ihm Götter zur Seite zu setzen.\" Und in ihrem Innern werden sie von Reue erfüllt sein, wenn sie die Strafe sehen; und Wir werden Fesseln um die Nacken derer legen, die ungläubig waren. Sie werden nur für das belohnt werden, was sie getan.", "spanish": " Mas los considerados débiles dirán a los que fueron orgullosos: “No, fueron vuestras maquinaciones de día y noche, cuando nos ordenabais no creer en Al‑lah y ensalzar a otros como iguales a Él; ocul­tarán su remordimiento cuando vean el castigo; y Nosotros pondre­mos cadenas alrededor de los cuellos de los que no creyeron. Sólo serán retribuidos por lo que hicieron.", "urdu": " اور وہ لوگ جن کو ضعیف سمجھا گیا تھا‘ ان لوگوں کو جو متکبر تھے کہیں گے (ہم یونہی مجرم نہیں بن گئے تھے) بلکہ تمہاری رات اور دن کی تدبیروں نے ہم کو ایسا بنا دیا جبکہ تم ہم کو اللہ کے احکام کا انکار کرنے اور اس کا شریک بنانے کی تعلیم دیا کرتے تھے اور جب (ان سرکشیوں کے نتیجہ میں) انہوں نے خطرناک عذاب دیکھا۔ تو (جو لوگ اپنے آپ کو بڑا سمجھتے تھے) انہوں نے (اپنے دل کی) شرمندگی کو چھپانا شروع کیا۔ اور ہم ان میں سے جو پکے کافر ہوں گے ان کی گردنوں میں طوق ڈالیں گے۔ (اور یہ سزا ان کی بدعملیوں سے زیادہ نہیں ہوگی‘ کیا وہ سمجھ نہیں سکتے کہ) ان کو جو سزا دی جائے گی وہ ان کے عمل کے مطابق ہوگی۔"}, {"arabic": " وَ مَاۤ اَرۡسَلۡنَا فِیۡ قَرۡیَۃٍ مِّنۡ نَّذِیۡرٍ اِلَّا قَالَ مُتۡرَفُوۡہَاۤ ۙ اِنَّا بِمَاۤ اُرۡسِلۡتُمۡ بِہٖ کٰفِرُوۡنَ ﴿۳۵﴾", "english": " And We never sent a Warner to any city but the wealthy ones thereof said, ‘Surely, we disbelieve in what you have been sent with.’", "french": " Et Nous n’avons jamais envoyé quelqu'un pour avertir une ville, sans que les riches de cette ville ne disent : « Assurément, nous ne croyons pas en ce avec quoi vous avez été envoyé. »", "german": " Und Wir entsandten keinen Warner zu einer Stadt, ohne dass die Reichen darin gesprochen hätten: \"Gewiss, wir leugnen das, womit ihr gesandt seid.\"", "spanish": " Nunca enviamos a un Amones­tador a población alguna sin que sus ricos dijeran: “En verdad, no cree­mos en aquello que os ha sido re­velado”.", "urdu": " اور ہم نے کسی بستی میں کوئی ہوشیار کرنے والا (نبی) نہیں بھیجا کہ اس کے مالداروں نے یہ نہ کہا ہو کہ (اے رسولو)! ہم تمہاری رسالت کے منکر ہیں۔"}, {"arabic": " وَ قَالُوۡا نَحۡنُ اَکۡثَرُ اَمۡوَالًا وَّ اَوۡلَادًا ۙ وَّ مَا نَحۡنُ بِمُعَذَّبِیۡنَ ﴿۳۶﴾", "english": " And they say, ‘We have more riches and children; and we are not going to be punished.’", "french": " Et ils disent : « Nous avons davantage de biens et d’enfants ; et nous ne serons pas châtiés. »", "german": " Und sie sprachen: \"Wir sind reicher an Gut und an Kindern; und wir werden nicht bestraft werden.\"", "spanish": " Y dicen: “Tenemos más riquezas e hijos; no seremos castigados”.", "urdu": " نیز وہ یہ بھی کہتے رہے ہیں کہ ہم تم سے مال اور اولاد میں زیادہ ہیں اور ہم پر کبھی بھی عذاب نازل نہیں ہوگا۔"}, {"arabic": " قُلۡ اِنَّ رَبِّیۡ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ وَ یَقۡدِرُ وَ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یَعۡلَمُوۡنَ ﴿٪۳۷﴾", "english": " Say, ‘Verily, my Lord enlarges the provision for whomsoever He pleases, and straitens it for whomsoever He pleases ; but most men do not know.’", "french": " Dis : « En vérité, mon Seigneur élargit les moyens des provisions pour qui Il veut, et Il les réduit pour qui Il veut ; mais la plupart des hommes ne savent pas. »", "german": " Sprich: \"Fürwahr, mein Herr weitet und beschränkt die Mittel zum Unterhalt, wem Er will; jedoch die meisten Menschen wissen es nicht.\"", "spanish": " Diles: “En verdad, mi Señor amplía la provisión a quien Le place, y la estrecha para quien quiere; aunque la mayoría de los hombres no lo saben”.", "urdu": " تو کہہ دے‘ میرا رب جس کے لئے چاہتا ہے رزق (کا دروازہ) کھول دیتا ہے اور جس کے لئے چاہتا ہے تنگ کر دیتا ہے لیکن لوگوں میں سے اکثر جانتے نہیں۔"}, {"arabic": " وَ مَاۤ اَمۡوَالُکُمۡ وَ لَاۤ اَوۡلَادُکُمۡ بِالَّتِیۡ تُقَرِّبُکُمۡ عِنۡدَنَا زُلۡفٰۤی اِلَّا مَنۡ اٰمَنَ وَ عَمِلَ صَالِحًا ۫ فَاُولٰٓئِکَ لَہُمۡ جَزَآءُ الضِّعۡفِ بِمَا عَمِلُوۡا وَ ہُمۡ فِی الۡغُرُفٰتِ اٰمِنُوۡنَ ﴿۳۸﴾", "english": " And it is not your riches nor your children that will bring you near Us in rank, but those who believe and do good works, will have a double reward for what they did. And in lofty mansions will they be secure.", "french": " Et ce ne sont pas vos biens ni vos enfants qui vous amèneront plus près de Nous en rang, mais ceux qui croient et font de bonnes œuvres, auront une double récompense pour ce qu’ils faisaient. Et ils seront en sécurité dans des Résidences élevées.", "german": " Und es ist nicht euer Gut, noch sind es eure Kinder, die euch Uns nahe bringen werden; die aber, die glauben und gute Werke tun, die sollen vielfachen Lohn erhalten für das, was sie getan. Und in den hohen Hallen (des Paradieses) sollen sie sicher wohnen.", "spanish": " No son vuestra riqueza ni vuestros hijos los que os llevarán más cerca de Nosotros en considera­ción, pero quienes crean y prac­tiquen las buenas obras, tendrán una doble recompensa por lo que hicieron. Y en mansiones elevadas estarán seguros.", "urdu": " اور تمہارے مال اور تمہاری اولادیں ایسی چیز نہیں کہ تم کو ہمارا مقرب بنا دیں‘ ہاں جو ایمان لاتا ہے اور اس کے مناسب حال عمل کرتا ہے (وہی ہمارا مقرب ہوتا ہے) اور ایسے ہی لوگوں کوان کے اچھے اعمال کی وجہ سے بڑھ بڑھ کر بدلے ملیں گے اور وہ بالاخانوں میں امن سے زندگی بسر کریں گے۔"}, {"arabic": " وَ الَّذِیۡنَ یَسۡعَوۡنَ فِیۡۤ اٰیٰتِنَا مُعٰجِزِیۡنَ اُولٰٓئِکَ فِی الۡعَذَابِ مُحۡضَرُوۡنَ ﴿۳۹﴾", "english": " And as to those who strive to frustrate the purpose of Our Signs, it is they who will be brought face to face with punishment.", "french": " Et quant à ceux qui luttent pour faire échouer le but de Nos Signes, ceux-là seront livrés au châtiment.", "german": " Doch jene, die versuchen, Unsere Zeichen zu entkräften, sie sind es, die der Strafe zugeführt werden sollen.", "spanish": " En cuanto a los que se es­fuerzan por frustrar la finalidad de Nuestros Signos, ellos son quienes se enfrentarán cara a cara con el castigo.", "urdu": " اور وہ لوگ جو کہ ہمارے نشانوں کے متعلق ہم کو عاجز کرنے کے لئے کوششیں کرتے ہیں وہ لوگ سخت عذاب کے سامنے پیش کیے جائیں گے۔"}, {"arabic": " قُلۡ اِنَّ رَبِّیۡ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ وَ یَقۡدِرُ لَہٗ ؕ وَ مَاۤ اَنۡفَقۡتُمۡ مِّنۡ شَیۡءٍ فَہُوَ یُخۡلِفُہٗ ۚ وَ ہُوَ خَیۡرُ الرّٰزِقِیۡنَ ﴿۴۰﴾", "english": " Say, ‘Surely, my Lord enlarges the provision for such of His servants as He pleases and straitens it for such of them as He pleases . And whatever you spend, He will replace it; and He is the Best of providers.’", "french": " Dis : « Assurément, mon Seigneur élargit les moyens pour qui Il veut parmi Ses serviteurs, et parfois Il les réduit pour lui. Et tout ce que vous dépensez, Il le remplacera ; et Il est le Meilleur des pourvoyeurs. »", "german": " Sprich: \"Fürwahr, mein Herr weitet und beschränkt die Mittel zum Unterhalt, wem Er will von Seinen Dienern Und was immer ihr spendet, Er wird es vergelten; und Er ist der beste Versorger.\"", "spanish": " Diles: “En verdad, mi Señor amplía la provisión para aquellos de us siervos que Le agradan y la estrecha para aquellos que Él quiere. Y todo lo que empleéis, Él lo re­pondrá; pues Él es el Mejor de los Proveedores”.", "urdu": " (اور) تو کہہ دے میرا رب اپنے بندوں میں سے جس کے رزق کو چاہتا ہے وسیع کرتا ہے اور جس کے رزق کو چاہتا ہے تنگ کر دیتا ہے اور جو کچھ بھی تم خرچ کرو‘ وہ اس کا نتیجہ ضرور نکالے گا۔ وہ سب رزق دینے والوں میں سے اچھا (اور کامل) ہے۔"}, {"arabic": " وَ یَوۡمَ یَحۡشُرُہُمۡ جَمِیۡعًا ثُمَّ یَقُوۡلُ لِلۡمَلٰٓئِکَۃِ اَہٰۤؤُلَآءِ اِیَّاکُمۡ کَانُوۡا یَعۡبُدُوۡنَ ﴿۴۱﴾", "english": " And remember the day, when He will gather them all together; then He will say to the angels: ‘Was it you that they worshipped?’", "french": " Et rappelle le jour où Il les rassemblera tous ensemble ; alors Il dira aux anges : « Est-ce vous qu’ils adoraient en particulier ? »", "german": " Und am Tage, da Er sie alle versammeln, dann zu den Engeln sprechen wird: \"Wart ihr es, denen diese Menschen dienten?\"", "spanish": " Acuérdate del día en que Él los reunirá a todos; entonces dirá a los ángeles: “¿Eras tu, en particular , a quien adoraban?”.", "urdu": " اور جس دن وہ (اللہ) ان سب کو اکٹھا کرے گا پھر وہ فرشتوں سے کہے گا کیا یہ لوگ تمہاری عبادت کرتے تھے؟"}, {"arabic": " قَالُوۡا سُبۡحٰنَکَ اَنۡتَ وَلِیُّنَا مِنۡ دُوۡنِہِمۡ ۚ بَلۡ کَانُوۡا یَعۡبُدُوۡنَ الۡجِنَّ ۚ اَکۡثَرُہُمۡ بِہِمۡ مُّؤۡمِنُوۡنَ ﴿۴۲﴾", "english": " They will say, ‘Holy art Thou. Thou art our Protector against them. Nay, but they worshipped the Jinn; it was in them that most of them believed.’", "french": " Ils diront : « Gloire à Toi ! Tu es notre Protecteur contre eux. Non mais ils adoraient les djinns ; c’est en eux que croyaient la plupart d’entre eux. »", "german": " Sie werden sprechen: \"Preis Dir! Du, nicht sie, bist unser Freund. Nein, sie dienten den Jinn; an sie haben die meisten von ihnen geglaubt.\"", "spanish": " Responderán: “Santo eres Tú. Eres nuestro Protector contra ellos. No, pero adoraban a los Yinn; en ellos era en quienes creían la mayoría”.", "urdu": " وہ کہیں گے کہ تو پاک ہے۔ ان کو چھوڑ کر فقط تو ہمارا دوست ہے (پس یوں نہیں جس طرح کفار کہیں گے) بلکہ حقیقت یہ ہے کہ وہ خیالی اور مخفی ہستیوں کی عبادت کرتے تھے اور ان میں سے اکثر ان ہستیوں پر ایمان لاتے تھے۔"}, {"arabic": " فَالۡیَوۡمَ لَا یَمۡلِکُ بَعۡضُکُمۡ لِبَعۡضٍ نَّفۡعًا وَّ لَا ضَرًّا ؕ وَ نَقُوۡلُ لِلَّذِیۡنَ ظَلَمُوۡا ذُوۡقُوۡا عَذَابَ النَّارِ الَّتِیۡ کُنۡتُمۡ بِہَا تُکَذِّبُوۡنَ ﴿۴۳﴾", "english": " ‘So, this day, you will have no power either to profit or harm one another.’ And We shall say to those who did wrong: ‘Taste ye the punishment of the Fire that you denied.’", "french": " « Alors, ce jour, vous n’aurez aucun pouvoir ni pour profiter ni pour nuire les uns aux autres. » Et Nous dirons à ceux qui faisaient le mal : « Goûtez le châtiment du Feu que vous niiez. »", "german": " (Gott wird sprechen:) \"So sollt ihr heute einander weder nützen noch schaden können.\" Und zu denen, die frevelten, werden Wir sprechen: \"Kostet die Strafe des Feuers, das ihr zu leugnen pflegtet.\"", "spanish": " “Así, en este día, no tendréis poder para beneficiaros o perjudicaros mutuamente”. Y diremos a los que actuaron erróneamente: “Probad el castigo del Fuego que negasteis”.", "urdu": " پس ان سے کہا جائے گا‘ آج تم میں سے بعض بعض کو نہ نفع پہنچا سکیں گے‘ نہ ضرر۔ اور ہم ظالموں سے کہیں گے‘ کہ اس دوزخ کا عذاب چکھو۔ جس کو تم جھٹلاتے تھے۔"}, {"arabic": " وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیٰتُنَا بَیِّنٰتٍ قَالُوۡا مَا ہٰذَاۤ اِلَّا رَجُلٌ یُّرِیۡدُ اَنۡ یَّصُدَّکُمۡ عَمَّا کَانَ یَعۡبُدُ اٰبَآؤُکُمۡ ۚ وَ قَالُوۡا مَا ہٰذَاۤ اِلَّاۤ اِفۡکٌ مُّفۡتَرًی ؕ وَ قَالَ الَّذِیۡنَ کَفَرُوۡا لِلۡحَقِّ لَمَّا جَآءَہُمۡ ۙ اِنۡ ہٰذَاۤ اِلَّا سِحۡرٌ مُّبِیۡنٌ ﴿۴۴﴾", "english": " And when Our manifest Signs are recited to them, they say, ‘This is but a man who seeks to turn you away from that which your fathers worshipped.’ And they say, ‘This is but a forged lie.’ And those who disbelieve say about the truth when it comes to them, ‘This is nothing but clear magic.’", "french": " Et lorsque Nos Signes manifestes leur sont récités, ils disent : « Celui-ci n’est qu’un homme qui cherche à vous détourner de ce qu’adoraient vos pères. » Et ils disent : « Ceci n’est qu’un mensonge fabriqué. » Et les mécréants disent de la vérité, lorsqu’elle leur vient : « Ceci n’est que de la magie manifeste. »", "german": " Und wenn Unsere deutlichen Zeichen ihnen vorgetragen werden, sagen sie: \"Dieser ist nichts weiter als ein Mann, der euch von dem abwendig machen möchte, was eure Väter verehrten.\" Und sie sprechen: \"Dieser (Qur-ân) ist nichts als eine erdichtete Lüge.\" Und diejenigen, die ungläubig sind, sagen von der Wahrheit, wenn sie zu ihnen kommt: \"Das ist nichts als offenkundige Zauberei.\"", "spanish": " Y cuando les recitan Nues­tros Signos manifiestos, dicen: “Éste no es más que un hombre que intenta apartaros de lo que adoraban vues­tros padres”. Y dicen: “No es más que una mentira inventada”. Y quienes no creen, cuando les llega la verdad, dicen sobre ella: “Esto no es más que magia evidente”.", "urdu": " اور جب ان کے سامنے ہمارے کھلے کھلے نشانات پڑھ کر سنائے جاتے ہیں تو وہ کہتے ہیں کہ یہ شخص صرف ایسا آدمی ہے جو تم کو ان (ہستیوں) کی عبادت سے روکنا چاہتا ہے‘ جن کی تمہارے باپ دادے عبادت کرتے تھے اور کہتے ہیں یہ (قرآن صرف) جھوٹ ہے جو اپنے نفس سے بنا لیا گیا ہے اور جب کامل سچائی ان کے پاس آجاتی ہے تو کافر مجبور ہو کر یوں کہتے ہیں کہ یہ تو ایک کھلا کھلا فریب ہے۔"}, {"arabic": " وَ مَاۤ اٰتَیۡنٰہُمۡ مِّنۡ کُتُبٍ یَّدۡرُسُوۡنَہَا وَ مَاۤ اَرۡسَلۡنَاۤ اِلَیۡہِمۡ قَبۡلَکَ مِنۡ نَّذِیۡرٍ ﴿ؕ۴۵﴾", "english": " And We gave them no books which they studied, nor did We send to them any Warner before thee.", "french": " Et Nous ne leur avons pas donné de livres qu’ils ont étudiés, et Nous ne leur avons envoyé personne pour les avertir avant toi.", "german": " Und Wir gaben ihnen keine Bücher, die sie studierten, noch sandten Wir ihnen einen Warner vor dir.", "spanish": " No les dimos libros que estudiaron, ni les enviamos Amonestador alguno antes de ti.", "urdu": " اور ہم نے ان کو کوئی (آسمانی) صحیفے نہیں دئیے جن کو وہ پڑھتے ہوں (اور ان میں ایسی بے ہودہ باتیں لکھی ہوں) اور نہ ہم نے ان کی طرف تجھ سے پہلے کوئی (ایسا) ڈرانے والا بھیجا ہے (جس نے ایسی بیہودہ باتیں انہیں سکھائی ہوں) ۔"}, {"arabic": " وَ کَذَّبَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ۙ وَ مَا بَلَغُوۡا مِعۡشَارَ مَاۤ اٰتَیۡنٰہُمۡ فَکَذَّبُوۡا رُسُلِیۡ ۟ فَکَیۡفَ کَانَ نَکِیۡرِ ﴿٪۴۶﴾", "english": " And those who were before them also rejected the truth — and these have not attained even to a tenth of that which We gave them, but they treated My Messengers as liars. So how terrible was the change I brought about !", "french": " Et ceux qui les ont devancés ont aussi rejeté la vérité – et ceux-ci n’ont pas atteint même le dixième de ce que Nous avions accordé à ceux-là – mais ils traitèrent Mes Messagers de menteurs. Aussi qu’elle fut terrible Ma réprobation !", "german": " Jene, die vor ihnen waren, leugneten ebenfalls – und diese haben nicht den zehnten Teil von dem erreicht, was Wir jenen gegeben –, und doch ziehen sie Meine Gesandten der Lüge. Doch wie war (die Folge) Meiner Verleugnung!", "spanish": " Mas quienes existieron antes que ellos, rechazaron también la verdad, y éstos no han alcanzado ni siquiera una décima parte de lo que les dimos, pero trataron a Mis Mensajeros como mentirosos. ¡Qué terrible fue pues el cambio que Yo les traje!", "urdu": " اور جو لوگ ان سے پہلے تھے انہوں نے بھی (اپنے رسولوں کو) جھٹلایا ہی تھا اور اس زمانہ کے لوگوں کو اس طاقت کا دسواں حصہ بھی نہیں ملا جو ہم نے ان سے پہلے لوگوں کو دی تھی لیکن ان لوگوں نے (بھی باوجود پہلوں سے ذلیل ہونے کے اور ان کی سزا کو دیکھ لینے کے) ہمارے رسولوں کا انکار ہی کیا۔ سو (اب دیکھ لیں کہ ان حالات میں) میرے انکار کا نتیجہ (یعنی عذاب) کیسا ہوتا ہے۔"}, {"arabic": " قُلۡ اِنَّمَاۤ اَعِظُکُمۡ بِوَاحِدَۃٍ ۚ اَنۡ تَقُوۡمُوۡا لِلّٰہِ مَثۡنٰی وَ فُرَادٰی ثُمَّ تَتَفَکَّرُوۡا ۟ مَا بِصَاحِبِکُمۡ مِّنۡ جِنَّۃٍ ؕ اِنۡ ہُوَ اِلَّا نَذِیۡرٌ لَّکُمۡ بَیۡنَ یَدَیۡ عَذَابٍ شَدِیۡدٍ ﴿۴۷﴾", "english": " Say, ‘I only exhort you to do one thing: that you stand up before Allah in twos and singly and then reflect. You will then know that there is no insanity in your companion; he is only a Warner to you of an impending severe punishment.’", "french": " Dis : « Je ne vous exhorte qu’ à faire une seule chose : que vous vous teniez debout devant Allāh deux par deux ou individuellement, et qu'ensuite vous réfléchissiez. Vous réaliserez alors qu’ il n’y a aucune folie dans votre compagnon ; il n’est là que pour vous avertir à propos de l’imminence d’un châtiment rigoureux. »", "german": " Sprich: \"Ich mahne euch nur an eines: dass ihr vor Allah hintretet zu zweit oder einzeln und dann nachdenket. Es ist kein Wahnsinn in eurem Gefährten (dem Propheten); er ist euch nur ein Warner vor einer bevorstehenden strengen Strafe.\"", "spanish": " Diles: “Sólo os exhorto a hacer una cosa: A que permanezcáis de pie ante Al‑lah, de dos en dos e indivi­dualmente, y luego reflexionéis. En­tonces sabréis que no hay locura alguna en vuestro compañero; él no es más que un Amonestador que os advierte del severo castigo que os espera”.", "urdu": " تو کہہ دے‘ میں تم کو ایک بات کی نصیحت کرتا ہوں (کم سے کم وہ تو مانو) وہ یہ ہے کہ اللہ کے سامنے دو دو ہو کر اور اکیلے اکیلے کھڑے ہو جاٶ۔ پھر غور کرو (تو لازماً یہی نتیجہ نکلے گا) کہ تمہارا یہ رسول مجنون نہیں وہ صرف تمہیں آئندہ آنے والے سخت عذاب سے ہوشیار کرنے والا (شخص) ہے۔"}, {"arabic": " قُلۡ مَا سَاَلۡتُکُمۡ مِّنۡ اَجۡرٍ فَہُوَ لَکُمۡ ؕ اِنۡ اَجۡرِیَ اِلَّا عَلَی اللّٰہِ ۚ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ شَہِیۡدٌ ﴿۴۸﴾", "english": " Say, ‘Whatever reward I might have asked of you — let it be yours. My reward is only with Allah; and He is Witness over all things.’", "french": " Dis : « Quelque récompense que j’aurais pu vous avoir demandée – qu’elle soit à vous. Ma récompense se trouve seulement avec Allāh et Il est Témoin de toutes choses. »", "german": " Sprich: \"Was ich auch an Lohn von euch verlangt haben mag, das ist euer. Mein Lohn ist allein bei Allah; und Er ist Zeuge über alle Dinge.\"", "spanish": " Diles: “Cualquier recompen­sa que haya podido pedir de vosotros, que sea vuestra. Mi recompensa sólo corresponde a Al‑lah; y Él es Testigo sobre todas las cosas”.", "urdu": " تو کہہ دے میں نے تم سے (تبلیغ رسالت کے بدلہ میں) جو بھی اجرت مانگی ہو‘ وہ تم ہی لے لو۔ میرا حق صرف اللہ پر ہے اور وہ ہر چیز کو دیکھ رہا ہے۔"}, {"arabic": " قُلۡ اِنَّ رَبِّیۡ یَقۡذِفُ بِالۡحَقِّ ۚ عَلَّامُ الۡغُیُوۡبِ ﴿۴۹﴾", "english": " Say, ‘Truly, my Lord hurls the Truth at falsehood . He is the Great Knower of the unseen.’", "french": " Dis : « En vérité, mon Seigneur lance la Vérité contre le mensonge . Il est le Meilleur Savant des choses cachées. »", "german": " Sprich: \"Wahrlich, mein Herr, der Wisser des Verborgenen, zerstückelt (die Lüge) mit der Wahrheit.\"", "spanish": " Diles: “En verdad, Mi Señor arroja la Verdad contra la falsedad. Él es el Gran Conocedor de lo invi­sible”.", "urdu": " (پھر اُن سے) کہہ دے کہ میرا رب یقیناً حق کے ذریعہ سے (جھوٹ کو) ٹکڑے ٹکڑے کر رہا ہے اور وہ ہر غیب کو اچھی طرح جانتا ہے۔"}, {"arabic": " قُلۡ جَآءَ الۡحَقُّ وَ مَا یُبۡدِئُ الۡبَاطِلُ وَ مَا یُعِیۡدُ ﴿۵۰﴾", "english": " Say, ‘The Truth has come, and falsehood could neither originate any good nor reproduce it .’", "french": " Dis : « La vérité est arrivée, et le mensonge n’a pu commencer quoi que ce soit , ni le répéter. »", "german": " Sprich: \"Die Wahrheit ist gekommen, und das Falsche kann weder etwas erschaffen noch etwas zurückbringen.\"", "spanish": " Diles: “Ha llegado la Verdad” y la falsedad no puede iniciar ni repetir nada ”.", "urdu": " (اور) کہہ دے کہ کامل حق آ گیا ہے اور باطل کوئی چیز پیدا نہیں کرتا اور نہ کسی ہلاک شدہ چیز کو واپس لا سکتا ہے۔"}, {"arabic": " قُلۡ اِنۡ ضَلَلۡتُ فَاِنَّمَاۤ اَضِلُّ عَلٰی نَفۡسِیۡ ۚ وَ اِنِ اہۡتَدَیۡتُ فَبِمَا یُوۡحِیۡۤ اِلَیَّ رَبِّیۡ ؕ اِنَّہٗ سَمِیۡعٌ قَرِیۡبٌ ﴿۵۱﴾", "english": " Say, ‘ If I err, I err only against myself; and if I am rightly guided, it is because of what my Lord has revealed to me. Verily, He is All-Hearing, Nigh.’", "french": " Dis : « Si je m’égare, je m’égare seulement à mon propre détriment ; et si je suis bien guidé, c’est grâce à ce que m’a révélé mon Seigneur. En vérité, Il entend très bien et est Proche. »", "german": " Sprich: \"Wenn ich irre, so irre ich nur wider mich selbst; und wenn ich rechtgeleitet bin, so ist es durch das, was mein Herr mir offenbart hat. Wahrlich, Er ist der Allhörende, der Nahe.\"", "spanish": " Diles: “Si me extravío, me extravío únicamente contra mí mis­mo; y si estoy rectamente guiado, es gracias a lo que mi Señor me ha revelado. En verdad, Él es Quien todo lo oye, el Cercano”.", "urdu": " تو کہہ دے کہ اگر میں گمراہ ہوں تو میری گمراہی کا وبال صرف میری ذات پر پڑے گا اور اگر میں ہدایت پر ہوں تو صرف اس وحی کی وجہ سے ہوں جو میرے رب نے مجھ پر نازل کی ہے وہ یقیناً بہت دعائیں سننے والا (اور) بندے کے پاس ہی موجود رہنے والا ہے۔"}, {"arabic": " وَ لَوۡ تَرٰۤی اِذۡ فَزِعُوۡا فَلَا فَوۡتَ وَ اُخِذُوۡا مِنۡ مَّکَانٍ قَرِیۡبٍ ﴿ۙ۵۲﴾", "english": " Couldst thou but see when they will be smitten with fear! Then there will be no escape, and they will be seized from a place nearby.", "french": " Si seulement tu pouvais voir quand ils seront sous le coup de l’effroi ! Alors il n’y aura aucune échappatoire, et ils seront saisis d’un endroit proche.", "german": " Könntest du nur sehen, wenn sie mit Furcht geschlagen sein werden! Dann wird es kein Entrinnen geben, denn sie werden aus nächster Nähe erfasst werden.", "spanish": " ¡Ojalá pudieras ver cuando sean sobrecogidos por el temor! En­tonces no habrá escapatoria, y serán atrapados desde un lugar cercano.", "urdu": " اور اگر تو اس حالت کو دیکھے جبکہ یہ (خدا کے عذابوں کی وجہ سے) گھبرا جائیں گے اور انہیں بھاگنے کا کوئی رستہ نہ ملے گا اور ایک قریب کے مکان سے وہ پکڑ لئے جائیں گے (تو تجھے معلوم ہو جائے کہ یہ کیسے تھڑدلے ہیں) ۔"}, {"arabic": " وَّ قَالُوۡۤا اٰمَنَّا بِہٖ ۚ وَ اَنّٰی لَہُمُ التَّنَاوُشُ مِنۡ مَّکَانٍۭ بَعِیۡدٍ ﴿ۚۖ۵۳﴾", "english": " And they will say, ‘We now believe therein.’ But how can the attaining of faith be possible to them from a position so far-off,", "french": " Et ils diront : « Nous y croyons maintenant . » Mais comment leur serait-il possible maintenant d’atteindre la foi d’une position si éloignée ?", "german": " Und sie werden sprechen: \"(Nun) glauben wir daran.\" Allein wie kann das Erlangen (des Glaubens) ihnen an einem (so) fernen Orte möglich sein,", "spanish": " Y dirán: “Ahora creemos en ello”. Pero ¿cómo podrán alcanzarlo ahora habiéndose alejado tanto?.", "urdu": " اور کہیں گے ہم اس (کلام) پر ایمان لے آئے لیکن ان کو اس (یعنی ایمان) کا حاصل کرنا اتنی دور جاکر کس طرح نصیب ہو سکتا ہے۔"}, {"arabic": " وَّ قَدۡ کَفَرُوۡا بِہٖ مِنۡ قَبۡلُ ۚ وَ یَقۡذِفُوۡنَ بِالۡغَیۡبِ مِنۡ مَّکَانٍۭ بَعِیۡدٍ ﴿۵۴﴾", "english": " While they had disbelieved in it before? And they are uttering conjectures from a far-off place.", "french": " En vérité, ils avaient refusé d’y croire auparavant et se livraient à des conjectures insensées à partir d’un endroit éloigné.", "german": " wenn sie zuvor nicht daran geglaubt hatten? Und sie äußern Mutmaßungen von einem fernen Ort aus.", "spanish": " En verdad, lo habían rechazado antes entreteniéndose con conjeturas atrevidas desde una posición distante.", "urdu": " اور وہ اس سے پہلے اس کا انکار کر چکے ہیں اور دور بیٹھے بغیر غور و فکر کے اٹکل پچو اعتراض کرتے رہے ہیں۔"}, {"arabic": " وَ حِیۡلَ بَیۡنَہُمۡ وَ بَیۡنَ مَا یَشۡتَہُوۡنَ کَمَا فُعِلَ بِاَشۡیَاعِہِمۡ مِّنۡ قَبۡلُ ؕ اِنَّہُمۡ کَانُوۡا فِیۡ شَکٍّ مُّرِیۡبٍ ﴿٪۵۵﴾", "english": " And a barrier will be placed between them and that which they long for, as was done with the likes of them before. They too were in disquieting doubt indeed.", "french": " Et une barrière sera placée entre eux et ce qu’ils désirent, comme cela avait été fait avec leurs semblables auparavant. Eux aussi étaient en vérité dans un doute inquiétant.", "german": " Und ein Abgrund ist gelegt zwischen ihnen und ihren Begierden, wie es ihresgleichen schon zuvor widerfuhr. Sie auch waren fürwahr in beunruhigendem Zweifel.", "spanish": " Mas se colocará una barrera entre ellos y lo que desean, como se izo con sus afines que antes existieron. En verdad que también estuvieron en una duda in­quietante.", "urdu": " اور ان کے درمیان اور ان کی خواہشات کے درمیان روکیں ڈال دی گئیں۔ اسی طرح جس طرح ان کے ہم جنس لوگوں سے ان سے پہلے کیا گیا تھا۔ وہ بھی ایک ایسے شک میں مبتلا تھے جو بے چینی پیدا کرنے والا تھا۔ (اور یہ بھی) ۔"}], "Surah": 34}