{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " طٰسٓمّٓ ﴿۲﴾", "english": " Ta Sin Mim.", "french": " Ṭā Sīn-Mīm ( Celui Qui est Pur, Qui entend très bien, Qui est Très-Savant !).", "german": " Tâ Sîn Mîm.", "spanish": " Ta Sin Mim.", "urdu": " طاہر (پاک) سمیع (دعائیں سننے والا) مجید (بڑی بزرگی والا خدا اس سورۃ کو نازل کرنے والا ہے)"}, {"arabic": " تِلۡکَ اٰیٰتُ الۡکِتٰبِ الۡمُبِیۡنِ ﴿۳﴾", "english": " These are verses of the clear Book.", "french": " Ceux-ci sont les versets du Livre manifeste.", "german": " Das sind die Verse des deutlichen Buches.", "spanish": " Éstos son los versículos del Libro manifiesto.", "urdu": " یہ (یعنی اس سورۃ کی آیات) ایک مدلل کتاب کی آیات ہیں۔"}, {"arabic": " نَتۡلُوۡا عَلَیۡکَ مِنۡ نَّبَاِ مُوۡسٰی وَ فِرۡعَوۡنَ بِالۡحَقِّ لِقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۴﴾", "english": " We rehearse unto thee a portion of the story of Moses and Pharaoh with truth, for the benefit of a people who would believe.", "french": " Nous te récitons une partie de l’histoire réelle de Moïse et de Pharaon, pour le bien d’ un peuple qui croit.", "german": " Wir wollen dir ein Stück aus der Geschichte von Moses und Pharao vortragen, der Wahrheit gemäß, für Leute, die glauben.", "spanish": " Te narramos una parte de la historia de Moisés y el Faraón con veracidad, a beneficio de un pueblo creyente.", "urdu": " مومن قوم کے فائدہ کے لئے ہم موسیٰ اور فرعون کے صحیح سوانح تیرے سامنے پڑھتے ہیں۔"}, {"arabic": " اِنَّ فِرۡعَوۡنَ عَلَا فِی الۡاَرۡضِ وَ جَعَلَ اَہۡلَہَا شِیَعًا یَّسۡتَضۡعِفُ طَآئِفَۃً مِّنۡہُمۡ یُذَبِّحُ اَبۡنَآءَہُمۡ وَ یَسۡتَحۡیٖ نِسَآءَہُمۡ ؕ اِنَّہٗ کَانَ مِنَ الۡمُفۡسِدِیۡنَ ﴿۵﴾", "english": " Verily, Pharaoh behaved arrogantly in the earth, and divided the people thereof into parties: he sought to weaken a party of them, slaying their sons, and sparing their women. Certainly, he was of the mischief- makers.", "french": " En vérité, Pharaon se comporta avec arrogance sur la terre, et il divisa ses habitants en groupes : il chercha à affaiblir un groupe d’entre eux, tuant leurs fils ; et épargnant leurs femmes. Il était assurément de ceux qui créent le désordre.", "german": " Siehe, Pharao betrug sich hoffärtig im Land und teilte das Volk darin in Gruppen: einen Teil von ihnen versuchte er zu schwächen, indem er ihre Söhne erschlug und ihre Frauen leben ließ. Fürwahr, er war einer der Unheilstifter!", "spanish": " En verdad, el Faraón se com­portó con arrogancia en la tierra, y dividió a sus gentes en grupos: intentó debilitar a un grupo de ellos, matando a sus hijos y dejando vivir a sus mujeres. En verdad, fue uno de los corruptores.", "urdu": " فرعون نے (اپنے) ملک میں بڑی تعلی سے کام لیا تھا اور اس کے رہنے والوں کو ٹکڑے ٹکڑے کر دیا تھا۔ وہ ان میں سے ایک گروہ کو کمزور کرنا چاہتا تھا (اس طرح کہ) ان کے بیٹوں کو قتل کرتا تھا اور ان کی لڑکیوں کو زندہ رکھتا تھا اور وہ یقیناً فسادیوں میں سے تھا۔"}, {"arabic": " وَ نُرِیۡدُ اَنۡ نَّمُنَّ عَلَی الَّذِیۡنَ اسۡتُضۡعِفُوۡا فِی الۡاَرۡضِ وَ نَجۡعَلَہُمۡ اَئِمَّۃً وَّ نَجۡعَلَہُمُ الۡوٰرِثِیۡنَ ۙ﴿۶﴾", "english": " And We desired to show favour unto those who had been considered weak in the earth, and to make them leaders and to make them inheritors of Our favours ,", "french": " Et Nous avons désiré accorder Notre grâce à ceux qui étaient considérés comme faibles sur la terre, et faire d’eux des chefs, et les rendre héritiers de Nos grâces ;", "german": " Und Wir wünschten, denen, die im Lande als schwach erachtet worden waren, Huld zu erweisen und sie zu Führern zu machen und zu Erben einzusetzen,", "spanish": " Y deseamos mostrar Nuestro favor a quienes habían sido considerados ébiles en la tierra, convirtiéndolos en jefes y hacién­dolos herederos de Nuestros favores,", "urdu": " اور ہم نے ارادہ کر رکھا تھا کہ جن لوگوں کو ملک میں کمزور سمجھا گیا تھا ان پر احسان کریں اور ان کو سردار بنادیں اور ان کو (تمام نعمتوں کا) وارث کر دیں۔"}, {"arabic": " وَ نُمَکِّنَ لَہُمۡ فِی الۡاَرۡضِ وَ نُرِیَ فِرۡعَوۡنَ وَ ہَامٰنَ وَ جُنُوۡدَہُمَا مِنۡہُمۡ مَّا کَانُوۡا یَحۡذَرُوۡنَ ﴿۷﴾", "english": " And to establish them in the earth, and to show Pharaoh and Haman and their hosts that which they feared from them.", "french": " Et les établir sur la terre, et montrer à Pharaon et à Hāmān et à leurs armées, cela même qu’ils redoutaient d’eux.", "german": " und sie festzusetzen im Land und Pharao und Hâmân und ihren Heerscharen durch sie das zu zeigen, was sie befürchteten.", "spanish": " Y establecerlos en la tierra, y mostrar al Faraón y a Haman y a sus ejércitos lo que temían de ellos.", "urdu": " اور ان کو ملک میں تمکنت بخشیں اور فرعون اور ہامان اور ان کے لشکروں کو ان سے وہ کچھ دکھائیں جس کا ان کو خوف لگا ہوا تھا۔"}, {"arabic": " وَ اَوۡحَیۡنَاۤ اِلٰۤی اُمِّ مُوۡسٰۤی اَنۡ اَرۡضِعِیۡہِ ۚ فَاِذَا خِفۡتِ عَلَیۡہِ فَاَلۡقِیۡہِ فِی الۡیَمِّ وَ لَا تَخَافِیۡ وَ لَا تَحۡزَنِیۡ ۚ اِنَّا رَآدُّوۡہُ اِلَیۡکِ وَ جَاعِلُوۡہُ مِنَ الۡمُرۡسَلِیۡنَ ﴿۸﴾", "english": " And We revealed to the mother of Moses saying , ‘Suckle him; and when thou fearest for him, then cast him into the river and fear not, nor grieve; for We shall restore him to thee, and shall make him one of the Messengers.’", "french": " Et Nous révélâmes à la mère de Moïse : « Allaite-le ; et quand tu craindras pour lui, alors jette-le à la rivière, et ne crains pas, ni ne te désole ; car Nous te le rendrons, et Nous ferons de lui un des Messagers. »", "german": " Da offenbarten Wir der Mutter des Mose: \"Säuge ihn; und wenn du für ihn fürchtest, so wirf ihn in den Fluss und fürchte dich nicht und betrübe dich nicht; denn Wir werden ihn dir wiedergeben und ihn zu einem der Gesandten machen.\"", "spanish": " Enviamos una revelación a la madre de Moisés diciéndole: “Ama­mántalo; y cuando temas por él, arrójalo al río y no temas ni te ngusties; pues te lo devolveremos y lo convertiremos en uno de los Men­sajeros”.", "urdu": " اور ہم نے موسیٰ کی ماں کی طرف وحی کی تھی کہ اس کو (یعنی موسیٰ کو) دودھ پلا۔ پس جب تو اس (کی جان) کے متعلق خائف ہو تو اس کو دریا میں ڈال دے اور ڈر نہیں اور نہ کسی پچھلے واقعہ کی وجہ سے غم کر ہم اس کو تیری طرف واپس لائیں گے اور اس کو رسولوں میں سے (ایک رسول) بنائیں گے۔ (چنانچہ موسیٰ کی ماں نے اس وحی کے مطابق عمل کیا اور موسیٰ کو دریا میں ڈال دیا) ۔"}, {"arabic": " فَالۡتَقَطَہٗۤ اٰلُ فِرۡعَوۡنَ لِیَکُوۡنَ لَہُمۡ عَدُوًّا وَّ حَزَنًا ؕ اِنَّ فِرۡعَوۡنَ وَ ہَامٰنَ وَ جُنُوۡدَہُمَا کَانُوۡا خٰطِئِیۡنَ ﴿۹﴾", "english": " And the family of Pharaoh picked him up that he might become for them an enemy and a source of sorrow. Verily, Pharaoh and Haman and their hosts were wrongdoers.", "french": " Et la famille de Pharaon le recueillit, sans se douter qu’il deviendrait pour eux un ennemi et un e source de chagrin ; en vérité Pharaon et Hāmān et leurs armées étaient fautifs.", "german": " Und die Angehörigen Pharaos lasen ihn auf, dass er ihnen zum Feind und zum Kummer würde; denn Pharao und Hâmân und ihre Heerscharen waren Missetäter.", "spanish": " La familia del Faraón lo re­cogió sin conocer apenas que se convertiría en enemigo suyo y en fuente de des­dicha. En verdad, el Faraón y Ha­man y sus ejércitos fueron inicuos.", "urdu": " سو اس کے بعد اس (موسیٰ) کو فرعون کے خاندان میں سے ایک نے اٹھا لیا جس کا نتیجہ یہ ہوا کہ ایک دن وہ ان کے لئے دشمن ثابت ہوا اور غم کا موجب بنا۔ فرعون اور ہامان اور ان دونوں کے لشکر غلطی میں مبتلا تھے۔"}, {"arabic": " وَ قَالَتِ امۡرَاَتُ فِرۡعَوۡنَ قُرَّتُ عَیۡنٍ لِّیۡ وَ لَکَ ؕ لَا تَقۡتُلُوۡہُ ٭ۖ عَسٰۤی اَنۡ یَّنۡفَعَنَاۤ اَوۡ نَتَّخِذَہٗ وَلَدًا وَّ ہُمۡ لَا یَشۡعُرُوۡنَ ﴿۱۰﴾", "english": " And Pharaoh’s wife said, ‘ He will be a joy of the eye, for me and for thee. Kill him not. Haply he will be useful to us, or we may adopt him as a son.’ And they perceived not the consequences thereof .", "french": " Et la femme de Pharaon dit : « Il sera une joie pour mes yeux et pour les tiens. Ne le tuez pas. Il se peut qu’il nous devienne utile, ou que nous l’adoptions comme fils. » Et ils ne s’aperçurent pas de la réalité.", "german": " Eine Frau von Pharaos Familie sprach: \"Eine Augenweide mir und dir! Tötet ihn nicht. Vielleicht erweist er sich nützlich für uns, oder wir nehmen ihn als Sohn an.\" Aber sie waren ahnungslos.", "spanish": " Y la mujer del Faraón dijo: “Será para mí y para ti la alegría de nuestros ojos. No lo mates. Es posible que nos sea útil o ue podamos adoptarlo como hijo”. Y no se dieron cuenta de las consecuencias de todo ello.", "urdu": " اور فرعون (کے خاندان) کی (ایک) عورت نے کہا‘ یہ تیرے لئے اور میرے لئے آنکھ کی ٹھنڈک کا موجب ہوگا۔ اس کو قتل نہ کرو ممکن ہے کہ ایک دن وہ ہمیں نفع پہنچائے یا ہم اس کو بیٹا بنا لیں اور ان کو اصل حقیقت معلوم نہ تھی۔"}, {"arabic": " وَ اَصۡبَحَ فُؤَادُ اُمِّ مُوۡسٰی فٰرِغًا ؕ اِنۡ کَادَتۡ لَتُبۡدِیۡ بِہٖ لَوۡ لَاۤ اَنۡ رَّبَطۡنَا عَلٰی قَلۡبِہَا لِتَکُوۡنَ مِنَ الۡمُؤۡمِنِیۡنَ ﴿۱۱﴾", "english": " And the heart of the mother of Moses became free from anxiety . She had almost disclosed his identity , were it not that We had strengthened her heart so that she might be of the firm believers.", "french": " Et le cœur de la mère de Moïse fut libéré de toute inquiétude . Elle aurait presque divulgué l’identité de Moïse , si Nous n’avions affermi son cœur pour qu’elle soit du nombre des croyants.", "german": " Und das Herz der Mutter des Mose wurde leicht. Fast hätte sie ihn öffentlich anerkannt, hätten Wir nicht ihr Herz gestärkt, damit sie am Glauben zunehmen möchte.", "spanish": " Y el corazón de la madre de Moisés quedó libre de ansiedad. Hubiera revelado su identidad de no ser porque forta­lecimos su corazón para que fuese de los creyentes firmes.", "urdu": " اور موسیٰ کی ماں کا دل (غم سے) فارغ ہو گیا۔ قریب تھا کہ اگر ہم اس کے دل کو مومن بنانے کے لئے مضبوط نہ کرتے تو وہ اس واقعہ کی سب حقیقت ظاہر کر دیتی۔"}, {"arabic": " وَ قَالَتۡ لِاُخۡتِہٖ قُصِّیۡہِ ۫ فَبَصُرَتۡ بِہٖ عَنۡ جُنُبٍ وَّ ہُمۡ لَا یَشۡعُرُوۡنَ ﴿ۙ۱۲﴾", "english": " And she said to his sister, ‘Follow him up.’ So she observed him from afar; and they knew not of her relationship .", "french": " Et elle dit à la sœur de Moïse ; « Suis-le. » Alors elle le surveilla de loin ; et ils ne s’aperçurent de rien.", "german": " Sie sprach zu seiner Schwester: \"Spüre ihm nach.\" So beobachtete sie ihn von weitem; und jene ahnten nichts.", "spanish": " Y dijo a su hermana: “Sí­guelo”. Lo vigiló pues desde lejos; y ellos no lo advirtieron.", "urdu": " اور اس (یعنی موسیٰ کی ماں) نے اس (یعنی موسیٰ) کی بہن سے کہا کہ اس کے پیچھے پیچھے جا۔ پس وہ اس کو دُور سے دیکھتی رہی اور وہ (یعنی فرعون کے لوگ) بے خبر تھے۔"}, {"arabic": " وَ حَرَّمۡنَا عَلَیۡہِ الۡمَرَاضِعَ مِنۡ قَبۡلُ فَقَالَتۡ ہَلۡ اَدُلُّکُمۡ عَلٰۤی اَہۡلِ بَیۡتٍ یَّکۡفُلُوۡنَہٗ لَکُمۡ وَ ہُمۡ لَہٗ نٰصِحُوۡنَ ﴿۱۳﴾", "english": " And We had already ordained that he shall refuse the wet nurses; so she said, ‘Shall I tell you of a household who will bring him up for you and will be his sincere well-wishers?’", "french": " Et Nous avions déjà décrété qu’il refuserait les nourrices. Alors sa sœur dit : « Vous indiquerai-je une famille qui l’élèvera pour vous et qui sera très bienveillante envers lui ? »", "german": " Und vordem hatten Wir ihm die Ammen verboten. Da sprach sie (seine Schwester): \"Soll ich euch einen Haushalt nennen, wo man ihn für euch aufziehen und ihm wohlgesinnt sein würde?\"", "spanish": " De antemano hicimos que rechazara a las nodrizas; por lo que dijo: “¿Queréis que os indique una familia que lo criará para vosotros y serán sus custodios sinceros?”.", "urdu": " اور ہم نے اس (یعنی موسیٰ) پر اس سے پہلے دودھ پلانے والیوں کو حرام کر دیا۔ پس اس (یعنی موسیٰ کی بہن) نے کہا کہ کیا میں تمہیں ایک ایسے گھر والوں کی خبر دوں جو اس کو تمہارے لئے پال دیں اور وہ اس کے خیر خواہ ثابت ہونگے۔"}, {"arabic": " فَرَدَدۡنٰہُ اِلٰۤی اُمِّہٖ کَیۡ تَقَرَّ عَیۡنُہَا وَ لَا تَحۡزَنَ وَ لِتَعۡلَمَ اَنَّ وَعۡدَ اللّٰہِ حَقٌّ وَّ لٰکِنَّ اَکۡثَرَہُمۡ لَا یَعۡلَمُوۡنَ ﴿٪۱۴﴾", "english": " Thus did We restore him to his mother that her eye might be gladdened and that she might not grieve, and that she might know that the promise of Allah is true. But most of them know not.", "french": " C’est ainsi que Nous l’avions rendu à sa mère afin que ses yeux se réjouissent, et qu’elle ne se désolât point, et qu’elle sût que la promesse d’Allāh est vraie. Mais la plupart d’entre eux ne savent pas.", "german": " So gaben Wir ihn seiner Mutter zurück, damit ihr Auge gekühlt werde und damit sie sich nicht gräme und damit sie wisse, dass Allahs Verheißung wahr ist. Jedoch die meisten von ihnen wissen es nicht.", "spanish": " Así lo devolvimos a su madre para delicia de su vista, para que no se afligiera y supiera que la promesa de Al‑lah es verdadera. Pero la ma­yoría de ellos lo desconocen.", "urdu": " اس طرح ہم نے اس کو اس کی ماں کی طرف لوٹا دیا تاکہ اس کی آنکھیں ٹھنڈی ہوں اور وہ غم نہ کرے اور جان لے کہ اللہ کا وعدہ پورا ہوکر رہتا ہے لیکن (منکروں میں سے) اکثر جانتے نہیں۔"}, {"arabic": " وَ لَمَّا بَلَغَ اَشُدَّہٗ وَ اسۡتَوٰۤی اٰتَیۡنٰہُ حُکۡمًا وَّ عِلۡمًا ؕ وَ کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿۱۵﴾", "english": " And when he reached his age of full strength and attained maturity, We gave him wisdom and knowledge; and thus do We reward those who do good.", "french": " Et lorsqu’il eut atteint sa pleine vigueur et sa maturité, Nous lui donnâmes la sagesse et la connaissance ; et c’est ainsi que Nous récompensons ceux qui font le bien.", "german": " Und als er seine Vollkraft erreicht hatte und reif geworden war, verliehen Wir ihm Weisheit und Wissen; also belohnen Wir jene, die Gutes tun.", "spanish": " Cuando alcanzó la plena madurez y se hizo fuerte, le concedimos sabiduría y conocimiento; así recom­pensamos a quienes hacen el bien.", "urdu": " اور جب وہ اپنی پختہ جوانی کو پہنچا اور (اپنے اعلیٰ اخلاق پر) مضبوطی سے قائم ہو گیا تو ہم نے اسے حکم اور علم بخشا اور ہم محسنوں کو ایسا ہی بدلہ دیا کرتے ہیں۔"}, {"arabic": " وَ دَخَلَ الۡمَدِیۡنَۃَ عَلٰی حِیۡنِ غَفۡلَۃٍ مِّنۡ اَہۡلِہَا فَوَجَدَ فِیۡہَا رَجُلَیۡنِ یَقۡتَتِلٰنِ ٭۫ ہٰذَا مِنۡ شِیۡعَتِہٖ وَ ہٰذَا مِنۡ عَدُوِّہٖ ۚ فَاسۡتَغَاثَہُ الَّذِیۡ مِنۡ شِیۡعَتِہٖ عَلَی الَّذِیۡ مِنۡ عَدُوِّہٖ ۙ فَوَکَزَہٗ مُوۡسٰی فَقَضٰی عَلَیۡہِ ٭۫ قَالَ ہٰذَا مِنۡ عَمَلِ الشَّیۡطٰنِ ؕ اِنَّہٗ عَدُوٌّ مُّضِلٌّ مُّبِیۡنٌ ﴿۱۶﴾", "english": " And he entered the city at a time when its inhabitants were in a state of heedlessness; and he found therein two men fighting — one of his own party, and the other of his enemies. And he who was of his party sought his help against him who was of his enemies. So Moses smote him with his fist; and thereby caused his death. He said, ‘This is of Satan’s doing; he is indeed an enemy, a manifest misleader.’", "french": " Et il entra dans la ville discrètement alors que ses habitants ne lui portaient pas attention ; et il y trouva deux hommes en train de se battre– l’un de son propre peuple, et l’autre, de ses ennemis. Et celui qui était de son peuple l’appela à l’aide contre celui qui était de ses ennemis. Alors Moïse le frappa du poing ; et causa ainsi sa mort. Puis Moïse dit : « Ceci est l’œuvre de Satan, il est vraiment un ennemi, un trompeur manifeste. »", "german": " Und er betrat die Stadt um eine Zeit, da ihre Bewohner in einem Zustand von Unachtsamkeit waren; und er fand da zwei Männer, die miteinander kämpften, der eine von seiner eigenen Partei und der andere von seinen Feinden. Jener, der von seiner Partei war, rief ihn zu Hilfe gegen den, der von seinen Feinden war. So schlug Moses ihn zurück; doch es führte zu seinem Tod. Er sprach: \"Das ist ein Werk Satans; er ist ein Feind, ein offenbarer Verführer.\"", "spanish": " Entró en la ciudad cuando la gente aún dormía; encontrando allí a dos hombres que peleaban: uno de su propio pueblo y otro de sus enemigos. El miembro de su propio pueblo le pidió ayuda contra el que perte­necía a sus enemigos. Moisés le golpeó entonces con su puño, causán­dole así la muerte. Dijo: “Esto es obra de Satanás; él es en verdad un ene­migo, un engañador manifiesto”.", "urdu": " اور (ایک دن) وہ شہر میں ایسے وقت میں آیا کہ لوگ غفلت کی حالت میں تھے اس نے شہر میں دو آدمیوں کو دیکھا کہ آپس میں لڑ رہے تھے۔ ایک اس کی قوم سے (تعلق رکھتا) تھا اور ایک اس کے دشمنوں سے۔ پس اس نے جو اس کی جماعت میں سے تھا اس شخص کے خلاف جو اس کے دشمنوں میں سے تھا اس کی مدد طلب کی۔ اس پر موسیٰ نے اس (دشمن) کو ایک گھونسا مارا اور اس (گھونسے) نے اس کا کام تمام کر دیا۔ پھر موسیٰ نے کہا یہ سب واقعہ شیطانی کرتوت سے ہوا ہے۔ وہ (شیطان) (مومن کا) دشمن اور (اسے امن کے راستہ سے) کھلا کھلا بہکانے والا ہے۔"}, {"arabic": " قَالَ رَبِّ اِنِّیۡ ظَلَمۡتُ نَفۡسِیۡ فَاغۡفِرۡ لِیۡ فَغَفَرَ لَہٗ ؕ اِنَّہٗ ہُوَ الۡغَفُوۡرُ الرَّحِیۡمُ ﴿۱۷﴾", "english": " He said, ‘My Lord, I have wronged my soul, therefore forgive me.’ So He forgave him; He is Most Forgiving, Merciful.", "french": " Il dit : « Mon Seigneur, j’ai fait du tort à mon âme, pardonne-moi donc. » Alors Il lui pardonna ; Il est le Très-Pardonnant, le Miséricordieux.", "german": " Er sprach: \"Mein Herr, ich habe an meiner Seele Unrecht getan, so vergib mir.\" So verzieh Er ihm; denn Er ist der Allverzeihende, der Barmherzige.", "spanish": " Dijo: “Mi Señor, he obrado mal, perdóname pues”. Y Él lo perdonó; Él es el Sumo Indulgente, Misericordioso.", "urdu": " پھر موسیٰ نے دعا کی کہ اے میرے رب! میں نے اپنی جان کو تکلیف میں ڈال دیا ہے پس تو میرے اس فعل پر پردہ ڈال دے۔ سو اس نے اس فعل پر پردہ ڈال دیا۔ وہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " قَالَ رَبِّ بِمَاۤ اَنۡعَمۡتَ عَلَیَّ فَلَنۡ اَکُوۡنَ ظَہِیۡرًا لِّلۡمُجۡرِمِیۡنَ ﴿۱۸﴾", "english": " He said, ‘My Lord, because Thou hast bestowed favour upon me, I will never be a helper of the guilty.’", "french": " Il dit : « Mon Seigneur, puisque Tu m’as accordé Ta grâce, je ne serai jamais un soutien pour les coupables. »", "german": " Er sprach: \"Mein Herr, da Du mir gnädig gewesen bist, will ich nie ein Helfer der Sünder sein.\"", "spanish": " Dijo: “Mi Señor, por haberme concedido Tu favor, nunca seré so­corredor de los culpables”.", "urdu": " (موسیٰ نے) کہا اے میرے رب! چونکہ تو نے مجھ پر انعام کیا ہے اس لئے آئندہ کبھی کسی مجرم کا مددگار نہیں بنوں گا۔"}, {"arabic": " فَاَصۡبَحَ فِی الۡمَدِیۡنَۃِ خَآئِفًا یَّتَرَقَّبُ فَاِذَا الَّذِی اسۡتَنۡصَرَہٗ بِالۡاَمۡسِ یَسۡتَصۡرِخُہٗ ؕ قَالَ لَہٗ مُوۡسٰۤی اِنَّکَ لَغَوِیٌّ مُّبِیۡنٌ ﴿۱۹﴾", "english": " And morning found him in the city, apprehensive, watchful; and lo! he who had sought his help the day before cried out to him again for help. Moses said to him: ‘Verily, thou art manifestly a misguided fellow.’", "french": " Et il commença la journée dans la ville, craintif, sur le qui-vive ; et voilà que celui qui l’avait appelé à l’aide la veille, l’appela de nouveau à son secours. Moïse lui dit : « En vérité, tu es manifestement un transgresseur. »", "german": " Und der Morgen fand ihn in der Stadt, furchtsam, auf der Hut; und siehe, jener, der ihn tags zuvor zu Hilfe gerufen hatte, schrie (wiederum) zu ihm um Beistand. Da sprach Moses zu ihm: \"Du bist fürwahr ein Irregegangener.\"", "spanish": " Y comenzó el día en la ciudad caminando con temor y aprensión; y he hí que aquel que pidió su ayuda el día anterior le gritó de nuevo pidiéndole ayuda. Moisés le dijo: “Eres en verdad un transgresor evidente”.", "urdu": " اس کے بعد وہ شہر میں صبح کے وقت دشمنوں سے خوف کرتا ہوا اور ادھر ادھر دیکھتا ہوا نکلا تو کیا دیکھتا ہے کہ جس نے اس سے کل مدد طلب کی تھی وہ پھر اسے مدد کے لئے بلا رہا ہے اس پر موسیٰ نے اس سے کہا تو یقیناً ایک کھلا کھلا گمراہ ہے۔"}, {"arabic": " فَلَمَّاۤ اَنۡ اَرَادَ اَنۡ یَّبۡطِشَ بِالَّذِیۡ ہُوَ عَدُوٌّ لَّہُمَا ۙ قَالَ یٰمُوۡسٰۤی اَتُرِیۡدُ اَنۡ تَقۡتُلَنِیۡ کَمَا قَتَلۡتَ نَفۡسًۢا بِالۡاَمۡسِ ٭ۖ اِنۡ تُرِیۡدُ اِلَّاۤ اَنۡ تَکُوۡنَ جَبَّارًا فِی الۡاَرۡضِ وَ مَا تُرِیۡدُ اَنۡ تَکُوۡنَ مِنَ الۡمُصۡلِحِیۡنَ ﴿۲۰﴾", "english": " And when he made up his mind to lay hold of the man who was an enemy to both of them, he said, ‘O Moses, dost thou intend to kill me as thou didst kill a man yesterday? Thou only intend est to become a tyrant in the land, and thou intendest not to be a peacemaker.’", "french": " Et lorsqu’il décida d’empoigner l’homme qui était leur ennemi commun, celui-ci dit : « Ô Moïse, as-tu l’intention de me tuer comme tu as tué un homme hier ? Tu désires seulement devenir un tyran sur la terre, et tu ne veux pas devenir un pacificateur. »", "german": " Und da er sich entschloss, Hand an den Mann zu legen, der ihrer beider Feind war, sprach er: \"O Mose, willst du mich töten, wie du gestern einen Menschen getötet hast? Du suchst nur ein Tyrann im Land zu werden, und du willst nicht ein Friedensstifter sein.\"", "spanish": " Y cuando se decidió a castigar al hombre que era enemigo de ambos, dijo: “Oh, Moisés, ¿piensas matarme como mataste al hombre de ayer? Sólo aspiras a convertirte en un tirano en el país, y no deseas ser un pacificador”.", "urdu": " پس جب اس نے ارادہ کیا کہ اس شخص کو پکڑے جو ان دونوں کا دشمن تھا تو اس (شخص) نے کہا کہ اے موسیٰ! کیا تو چاہتا ہے کہ مجھے قتل کر دے جس طرح تو نے کل ایک شخص کو قتل کیا تھا تو صرف یہ چاہتا ہے کہ کمزوروں کو ملک میں دبا دے اور اصلاح کرنے والوں میں شامل ہونا تیری غرض نہیں۔"}, {"arabic": " وَ جَآءَ رَجُلٌ مِّنۡ اَقۡصَا الۡمَدِیۡنَۃِ یَسۡعٰی ۫ قَالَ یٰمُوۡسٰۤی اِنَّ الۡمَلَاَ یَاۡتَمِرُوۡنَ بِکَ لِیَقۡتُلُوۡکَ فَاخۡرُجۡ اِنِّیۡ لَکَ مِنَ النّٰصِحِیۡنَ ﴿۲۱﴾", "english": " And there came a man from the far side of the city, running. He said, ‘O Moses, of a truth, the chiefs are taking counsel together against thee to kill thee. Therefore get thee away; surely I am of thy well-wishers.’", "french": " Et un homme accourut de l’autre bout de la ville. Il dit : « Ô Moïse, en vérité les chefs se concertent contre toi pour te tuer. Donc quitte la ville ; assurément, je suis de ceux qui te veulent du bien. »", "german": " Da kam ein Mann von dem äußersten Ende der Stadt gelaufen. Er sprach: \"O Mose, die Häupter beraten sich gegen dich, um dich zu töten. Darum mache dich fort, ich bin dir ein aufrichtiger Freund.\"", "spanish": " Y acudió apresuradamente un hombre de la parte más alejada de la ciudad, y dijo: “Oh, Moisés, en ver­dad los jefes conspiran contra ti para matarte. Aléjate pues; en verdad de­seo lo mejor para ti”.", "urdu": " اور اس وقت ایک شخص شہر کے دور کے حصہ سے دوڑتا ہوا آیا اور کہا اے موسیٰ (ملک کے) رٶسا مشورہ کر رہے ہیں کہ تجھے قتل کر دیں۔ پس (میری بات سن اور) اس شہر سے نکل جا‘ میں تیرے خیر خواہوں میں سے ہوں۔"}, {"arabic": " فَخَرَجَ مِنۡہَا خَآئِفًا یَّتَرَقَّبُ ۫ قَالَ رَبِّ نَجِّنِیۡ مِنَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿٪۲۲﴾", "english": " So he went forth therefrom, fearing, watchful. He said, ‘My Lord, deliver me from the unjust people.’", "french": " Alors il partit de là, craintif, sur le qui-vive. Il dit : « Mon Seigneur, sauve-moi du peuple injuste. »", "german": " Da ging er hinaus von dort, furchtsam, auf der Hut. Er sprach: \"Mein Herr, rette mich vor dem ruchlosen Volk.\"", "spanish": " Salió pues de ella, temeroso y receloso. Dijo: “Señor mío, líbrame de los hombres injustos”.", "urdu": " تب وہ اس شہر سے ڈرتے ہوئے نکل گیا اور وہ ہوشیاری سے ادھر ادھر دیکھتا جاتا تھا اس وقت اس نے دعا کی اور کہا اے میرے رب! مجھے ظالم قوم سے نجات دے۔"}, {"arabic": " وَ لَمَّا تَوَجَّہَ تِلۡقَآءَ مَدۡیَنَ قَالَ عَسٰی رَبِّیۡۤ اَنۡ یَّہۡدِیَنِیۡ سَوَآءَ السَّبِیۡلِ ﴿۲۳﴾", "english": " And when he turned his face towards Midian, he said, ‘I hope my Lord will guide me to the right way.’", "french": " Et lorsqu’il tourna son visage vers Madian, il dit : « J’espère que mon Seigneur me guidera sur le droit chemin. »", "german": " Und als er sein Antlitz gegen Midian wandte, sprach er: \"Ich hoffe, mein Herr wird mich auf den rechten Weg leiten.\"", "spanish": " Y cuando dirigió su rostro a Madián, dijo: “Espero que mi Señor me guíe por el camino recto”.", "urdu": " اور جب وہ مدین شہر کی طرف چلا‘ تو اس نے کہا مجھے امید ہے کہ میرا رب مجھے سیدھا راستہ دکھا دے گا۔"}, {"arabic": " وَ لَمَّا وَرَدَ مَآءَ مَدۡیَنَ وَجَدَ عَلَیۡہِ اُمَّۃً مِّنَ النَّاسِ یَسۡقُوۡنَ ۬۫ وَ وَجَدَ مِنۡ دُوۡنِہِمُ امۡرَاَتَیۡنِ تَذُوۡدٰنِ ۚ قَالَ مَا خَطۡبُکُمَا ؕ قَالَتَا لَا نَسۡقِیۡ حَتّٰی یُصۡدِرَ الرِّعَآءُ ٜ وَ اَبُوۡنَا شَیۡخٌ کَبِیۡرٌ ﴿۲۴﴾", "english": " And when he arrived at the water of Midian, he found there a party of men, watering their flocks . And he found beside them two women keeping back their flocks . He said, ‘What is the matter with you?’ They replied, ‘We cannot water our flocks until the shepherds take away their flocks , and our father is a very old man.’", "french": " Et lorsqu’il arriva au point d’eau de Madian, il y trouva un groupe d’hommes abreuvant leurs troupeaux . Et à l’écart d’eux, il trouva deux femmes qui retenaient leurs troupeaux . Il dit : « Qu’est-ce que vous avez ? » Elles dirent : « Nous ne pouvons abreuver nos troupeaux tant que les pâtres ne seront pas partis, et notre père est très vieux. »", "german": " Als er zum Wasser von Midian kam, fand er dort eine Schar von Leuten, die (ihr Vieh) tränkten. Und neben ihnen fand er zwei Frauen, die (ihr Vieh) zurückhielten. Er sprach: \"Was ist mit euch?\" Sie antworteten: \"Wir können (unser Vieh) nicht eher tränken, als bis die Hirten (ihre Herden) fortgetrieben haben, und unser Vater ist ein Greis, hochbetagt.\"", "spanish": " Cuando llegó al agua de Madián, encontró allí a un grupo de hombres, que abrevaban a su ga­nado. Y tras ellos vio a dos mujeres que guardaban su ganado. Les dijo:”¿Qué os ocurre?”. Ellas respondieron: “No podemos abrevar a nuestros animales mientras que los pastores no se lleven los suyos , y nuestro padre es un hombre muy anciano”.", "urdu": " اور جب وہ مدین شہر کے چشمہ کے پاس آیا تو اس نے اس پر لوگوںں کا ایک گروہ کھڑا دیکھا جو (اپنے جانوروں کو) پانی پلا رہے تھے اور ان سے پیچھے ہٹ کر کھڑی ہوئی دو عورتیں دیکھیں جو اپنے جانوروں کو (ہجوم سے پرے) ہٹا رہی تھیں۔ موسیٰ نے ان سے کہا تم دونوں کو کیا اہم کام درپیش ہے۔ اس پر دونوں عورتوں نے کہا‘ ہم پانی نہیں پلا سکتیں جب تک کہ دوسرے چرواہے چلے نہ جائیں اور ہمارا باپ بہت بوڑھا ہے (اس لئے ہمارے ساتھ نہیں آسکا) ۔"}, {"arabic": " فَسَقٰی لَہُمَا ثُمَّ تَوَلّٰۤی اِلَی الظِّلِّ فَقَالَ رَبِّ اِنِّیۡ لِمَاۤ اَنۡزَلۡتَ اِلَیَّ مِنۡ خَیۡرٍ فَقِیۡرٌ ﴿۲۵﴾", "english": " So he watered their flocks for them. Then he turned aside into the shade, and said, ‘My Lord, I am in need of whatever good Thou mayest send down to me.’", "french": " Il abreuva donc leurs troupeaux pour elles. Ensuite il se mit à l’écart dans l’ombre, et dit : « Mon Seigneur, en vérité je suis un mendiant et j’ai besoin de tout bien que Tu voudras bien faire descendre sur moi. »", "german": " Da tränkte er (ihre Herden) für sie. Dann zog er sich in den Schatten zurück und sprach: \"Mein Herr, ich bedarf des Guten, was immer es sei, das Du auf mich herabsenden magst.\"", "spanish": " Así pues abrevó a su ganado en lugar de ellas. A continuación se retiró a la sombra y dijo: “En verdad, Señor mío, soy un mendigo de todo lo bueno que me concedes”.", "urdu": " پس اس نے ان دونوں کی خاطر (جانوروں کو) پانی پلایا۔ پھر ایک سایہ کی طرف ہٹ گیا۔ پھر کہا اے میرے رب! اپنی بھلائی میں سے جو کچھ تو مجھ پر نازل کرے میں اس کا محتاج ہوں۔"}, {"arabic": " فَجَآءَتۡہُ اِحۡدٰٮہُمَا تَمۡشِیۡ عَلَی اسۡتِحۡیَآءٍ ۫ قَالَتۡ اِنَّ اَبِیۡ یَدۡعُوۡکَ لِیَجۡزِیَکَ اَجۡرَ مَا سَقَیۡتَ لَنَا ؕ فَلَمَّا جَآءَہٗ وَ قَصَّ عَلَیۡہِ الۡقَصَصَ ۙ قَالَ لَا تَخَفۡ ٝ۟ نَجَوۡتَ مِنَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿۲۶﴾", "english": " And one of the two women came to him, walking bashfully. She said, ‘My father calls thee that he may reward thee for thy having watered our flocks for us.’ So when he came to him and told him the story, he said, ‘Fear not; thou hast escaped from the unjust people.’", "french": " Et l’une des deux vint à lui, marchant avec timidité. Elle dit : « Mon père t’appelle afin de te récompenser pour avoir abreuvé nos troupeaux pour nous. » Alors quand il vint à lui, et lui eut raconté toute l'histoire, il dit : « Ne crains pas ; tu as échappé au peuple injuste. »", "german": " Und eine der beiden kam schamhaft zu ihm gegangen. Sie sprach: \"Mein Vater ruft dich, damit er dir Lohn geben kann dafür, dass du (unser Vieh) für uns getränkt hast.\" Als er nun zu ihm kam und ihm seine Geschichte erzählte, sprach er: \"Fürchte dich nicht; du bist dem ruchlosen Volk entronnen.\"", "spanish": " Una de dos mujeres se acercó a él, andando recatadamente. ijo: “Mi padre te llama para recom­pensarte por habernos abrevado nuestro ganado”. Así, cuando llegó a él y le contó la historia, dijo: “No temas; te has librado de un pueblo injusto”.", "urdu": " اس کے بعد ان دونوں لڑکیوں میں سے ایک چلتی ہوئی آئی اور وہ شرما رہی تھی اور اس نے کہا میرا باپ تجھے بلاتا ہے تا کہ تجھے ہماری جگہ پر (جانوروں کو) پانی پلانے کا اجر عطا کرے۔ پس جب وہ اس (یعنی لڑکیوں کے باپ) کے پاس آیا اور اس کے آگے (اپنا) سارا واقعہ بیان کیا تو اس نے کہا ڈر نہیں‘ تو اب ظالم قوم کے پنجہ سے نجات پا گیا ہے۔"}, {"arabic": " قَالَتۡ اِحۡدٰٮہُمَا یٰۤاَبَتِ اسۡتَاۡجِرۡہُ ۫ اِنَّ خَیۡرَ مَنِ اسۡتَاۡجَرۡتَ الۡقَوِیُّ الۡاَمِیۡنُ ﴿۲۷﴾", "english": " One of the two women said, ‘O my father, hire him; for the best man that thou canst hire is the one who is strong and trustworthy.’", "french": " L’une des deux dit : « Ô mon père, prends-le à ton service ; car le meilleur que tu puisses engager est celui qui est fort et digne de confiance. »", "german": " Da sprach eine der beiden: \"O mein Vater, dinge ihn; denn der beste Mann, den du dingen kannst, ist einer, der stark ist, ehrlich.\"", "spanish": " Una de las dos mujeres dijo: “Oh, padre mío, contrátalo; pues el mejor hombre al que puedes dar empleo es el que es fuerte y digno de confianza”.", "urdu": " اس پر ان (دونوں لڑکیوں) میں سے ایک نے کہا‘ اے میرے باپ! اس کو تو ملازم رکھ لے کیونکہ جن کو تو ملازم رکھے ان میں سے بہتر شخص وہی ہوگا جو مضبوط بھی ہو اور امانت دار بھی۔"}, {"arabic": " قَالَ اِنِّیۡۤ اُرِیۡدُ اَنۡ اُنۡکِحَکَ اِحۡدَی ابۡنَتَیَّ ہٰتَیۡنِ عَلٰۤی اَنۡ تَاۡجُرَنِیۡ ثَمٰنِیَ حِجَجٍ ۚ فَاِنۡ اَتۡمَمۡتَ عَشۡرًا فَمِنۡ عِنۡدِکَ ۚ وَ مَاۤ اُرِیۡدُ اَنۡ اَشُقَّ عَلَیۡکَ ؕ سَتَجِدُنِیۡۤ اِنۡ شَآءَ اللّٰہُ مِنَ الصّٰلِحِیۡنَ ﴿۲۸﴾", "english": " He said, ‘I intend to marry one of these two daughters of mine to thee on condition that thou serve me on hire for eight years. But if thou complete ten years , it will be of thine own accord. And I would not lay any hardship upon thee; thou wilt find me, if Allah wills, of the righteous.’", "french": " Il dit : « J’ai l’intention de te donner en mariage l’une de mes deux filles que voici, à condition que tu restes à mon service pendant huit ans. Mais si tu complètes dix ans , ce sera de ton propre gré. Et je ne voudrais t’imposer aucun fardeau ; tu me trouveras, si Allāh le veut, du nombre des justes. »", "german": " Er sprach: \"Ich will dir eine von diesen meinen zwei Töchtern zur Frau geben unter der Bedingung, dass du dich mir auf acht Jahre zum Dienst verpflichtest. Willst du dann zehn (Jahre) vollmachen, so steht es bei dir. Ich möchte aber nicht hart sein zu dir; du wirst mich, so Allah will, als einen der Rechtschaffenen finden.\"", "spanish": " Le dijo: “Pienso casar contigo a una de estas dos hijas mías a ondición de que me sirvas durante ocho años. Pero si completas diez años, será por tu propia voluntad. No quisiera imponerte nada exce­sivo. Comprobarás, si lo quiere Al-­lah, que soy de los justos”.", "urdu": " تب وہ شخص بولا (اے موسیٰ) میں چاہتا ہوں کہ اس شرط پر اپنی ان دو بیٹیوں میں سے ایک کا تجھ سے نکاح کر دوں کہ تو آٹھ سال تک میری خدمت کرے پس اگر تو (آٹھ کے عدد کی جگہ پر) دس کے عدد سے اپنے وعدہ کو مکمل کر دے تو یہ تیرا احسان ہوگا اور میں تجھ پر کوئی بوجھ ڈالنا نہیں چاہتا۔ اگر اللہ نے چاہا تو تو مجھے نیک معاملہ کرنے والوں میں سے پائے گا۔"}, {"arabic": " قَالَ ذٰلِکَ بَیۡنِیۡ وَ بَیۡنَکَ ؕ اَیَّمَا الۡاَجَلَیۡنِ قَضَیۡتُ فَلَا عُدۡوَانَ عَلَیَّ ؕ وَ اللّٰہُ عَلٰی مَا نَقُوۡلُ وَکِیۡلٌ ﴿٪۲۹﴾", "english": " He said, ‘That is settled between me and thee. Whichever of the two terms I fulfil, there shall be no injustice to me; and Allah watches over what we say.’", "french": " Moïse dit : « Cela est réglé entre moi et toi. Quel que soit celui des deux termes que je remplirai, il n’y aura aucune injustice envers moi ; et Allāh est Garant de ce que nous disons. »", "german": " Er sprach: \"Das sei zwischen mir und dir. Welche der beiden Fristen ich auch erfülle, es soll mich kein Vorwurf treffen; und Allah ist Zeuge dessen, was wir sagen.\"", "spanish": " Respondió: “Esto queda convenido entre tú y yo. En cualquiera de los dos plazos que cumpla, no habrá injusticia para mí; pues Al‑lah es Testigo de lo que decimos”.", "urdu": " (اس پر موسیٰ نے) کہا‘ یہ بات میرے اور تیرے درمیان پختہ ہوگئی۔ ان دونوں مدتوں میں سے جو بھی میں پوری کروں مجھ پر کوئی الزام نہیں ہوگا اور جو کچھ ہم کہتے ہیں‘ اللہ اس پر گواہ ہے۔"}, {"arabic": " فَلَمَّا قَضٰی مُوۡسَی الۡاَجَلَ وَ سَارَ بِاَہۡلِہٖۤ اٰنَسَ مِنۡ جَانِبِ الطُّوۡرِ نَارًا ۚ قَالَ لِاَہۡلِہِ امۡکُثُوۡۤا اِنِّیۡۤ اٰنَسۡتُ نَارًا لَّعَلِّیۡۤ اٰتِیۡکُمۡ مِّنۡہَا بِخَبَرٍ اَوۡ جَذۡوَۃٍ مِّنَ النَّارِ لَعَلَّکُمۡ تَصۡطَلُوۡنَ ﴿۳۰﴾", "english": " And when Moses had fulfilled the term, and journeyed with his family, he perceived a fire in the direction of the Mount. He said to his family, ‘Wait, I perceive a fire; haply I may bring you some useful information therefrom, or a burning brand from the fire that you may warm yourselves.’", "french": " Et lorsque Moïse eut rempli son terme, et fut parti avec sa famille, il aperçut un feu du côté du Mont. Il dit à sa famille : « Restez ici ; j’aperçois un feu ; il se peut que je vous en rapporte une information utile , ou un tison, afin que vous puissiez vous réchauffer «", "german": " Als Moses nun die Frist erfüllt hatte und mit seinen Angehörigen reiste, gewahrte er in der Richtung des Berges ein Feuer. Er sprach zu den Seinen: \"Bleibt zurück, ich gewahre ein Feuer; vielleicht kann ich euch eine Kunde davon bringen oder einen Feuerbrand, so dass ihr euch wärmen könnt.\"", "spanish": " Y cuando Moisés hubo cum­plido el plazo y viajaba con su fa­milia, percibió un fuego en la direc­ción del Monte. Dijo a su familia: Aguardad, veo un fuego; tal vez os traiga alguna información útil de él, o un tizón ardiendo del fuego con el que calentaros”.", "urdu": " جب موسیٰ نے وقت مقررہ کو پورا کر لیا اور اپنے گھر والوں کو لے کے چلا تو اس نے طور کی طرف سے ایک آگ دیکھی (اور) اپنے گھر والوں سے کہا تم یہاں ٹھہرو‘ میں نے ایک آگ دیکھی ہے‘ شاید میں وہاں سے تمہارے لئے کوئی (ضروری) خبر لاٶں یا کوئی آگ کا انگارہ لاٶں تاکہ تم سینکو۔"}, {"arabic": " فَلَمَّاۤ اَتٰٮہَا نُوۡدِیَ مِنۡ شَاطِیَٴ الۡوَادِ الۡاَیۡمَنِ فِی الۡبُقۡعَۃِ الۡمُبٰرَکَۃِ مِنَ الشَّجَرَۃِ اَنۡ یّٰمُوۡسٰۤی اِنِّیۡۤ اَنَا اللّٰہُ رَبُّ الۡعٰلَمِیۡنَ ﴿ۙ۳۱﴾", "english": " And when he came to it, he was called by a voice from the right side of the Valley, in the blessed spot, out of the tree: ‘O Moses, verily I am, I am Allah, the Lord of the worlds.’", "french": " Et lorsqu’il y arriva, il fut appelé par une voix venant du côté droit de la Vallée, du lieu béni, de l’arbre : « Ô Moïse, en vérité, Moi-Seul, Je suis Allāh, le Seigneur des mondes ;", "german": " Und als er zu ihm kam, da ward er angerufen von der rechten Seite des Tales, aus dem Baume, am gesegneten Ort: \"O Mose, wahrlich Ich, Ich bin Allah, der Herr der Welten.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=28:31&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=28:31&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic32\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic32\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/28:32' style='text-decoration:underline'>28:32</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(32)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control32\"></i></button> <audio id=\"player32\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اَنۡ اَلۡقِ عَصَاکَ ؕ فَلَمَّا رَاٰہَا تَہۡتَزُّ کَاَنَّہَا جَآنٌّ وَّلّٰی مُدۡبِرًا وَّ لَمۡ یُعَقِّبۡ ؕ یٰمُوۡسٰۤی اَقۡبِلۡ وَ لَا تَخَفۡ ۟ اِنَّکَ مِنَ الۡاٰمِنِیۡنَ ﴿۳۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And <em>it also said</em>: ‘Throw down thy rod.’ And when he saw it move as though it were a serpent, he turned back retreating and did not wait. ‘ O Moses, come forward and fear not; surely thou art of those who are safe.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_28_32_*' href='#'>*</a>]</sup> <sup class='ref'>[<a class='ref' data-id='ref_28_32_c' href='#'>c</a>]</sup>And <i>it is also said</i>, ‘Throw down thy rod.’ And when he saw it move as though it were a serpent, he turned back retreating and did not look back. ‘O Moses,’ <i>said the voice</i>, ‘Come forward and fear not; surely, thou art of those who are safe, <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_28_32_*'>*</span><span class='collapsible plus' data-id='ref_28_32_c'>c</span></div> <div><a name='*'></a><div class='reference' data-id='ref_28_32_*' style='display:none'> <p><b>*.</b> In the original translation of the Short Commentary a part of the verse i.e. وَاَنْ is left out. In the Five Volume Commentary the verse is translated fully. After the insertions of the translation of the relevant phrase in the present translation, the first clause of the verse will read as: “And <i>it also said, </i>‘Throw down thy rod’.” (Publisher) (<a href='javascript:void(0)' data-id='ref_28_32_*' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_28_32_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:118' target=_blank>7:118</a>; <a href='/quran/20:20' target=_blank>20:20</a>; <a href='/quran/26:46' target=_blank>26:46</a>. (<a href='javascript:void(0)' data-id='ref_28_32_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ( کہا گیا) کہ اپنا عصا پھینک۔ پس جب اُس نے اُس (عصا) کو دیکھا کہ وہ حرکت کر رہا ہے گویا سانپ ہو تو وہ پیٹھ دکھاتا ہوا مُڑ گیا اور پلٹ کر بھی نہ دیکھا۔ اے موسیٰ! آگے بڑھ اور نہ ڈر۔ تُو یقیناً سلامت رہنے والوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور یہ کہ تو اپنا عصا پھینک دے۔ پس جب اس نے اُس (عصا) کو حرکت کرتے ہوئے دیکھا گویا کہ وہ ایک چھوٹا سانپ ہے‘ وہ پیٹھ پھیر کر بھاگا اور پیچھے مڑ کر نہ دیکھا (تب اسے کہا گیا) اے موسیٰ! آگے بڑھ اور ڈر نہیں تو سلامتی پانے والے لوگوں میں سے ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et <em>la voix dit aussi</em> : « Jette ton bâton <em>par terre</em>. » Et lorsqu’il le vit se mouvoir comme si c’était un serpent, il tourna le dos <em>et s’éloigna</em> sans se retourner. « Ô Moïse, avance et ne crains pas ; sûrement tu es de ceux qui sont en sécurité.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em></em>Y<em> dijo también: </em>“Arroja tu cayado”. Y cuando lo vio moverse como si fuera una serpiente, huyó dándose la vuelta y no esperó. “Oh, Moisés, acércate y no temas; en ver­dad eres uno de los que están se­guros.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wirf deinen Stab hin.\" Als er ihn sich regen sah, als wäre er eine Schlange, da wandte er sich zur Flucht und schaute nicht zurück. \"O Mose, tritt vor und fürchte dich nicht;: denn du gehörst zu jenen, die sicher sind.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=28:32&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=28:32&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic33\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic33\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/28:33' style='text-decoration:underline'>28:33</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(33)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control33\"></i></button> <audio id=\"player33\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اُسۡلُکۡ یَدَکَ فِیۡ جَیۡبِکَ تَخۡرُجۡ بَیۡضَآءَ مِنۡ غَیۡرِ سُوۡٓءٍ ۫ وَّ اضۡمُمۡ اِلَیۡکَ جَنَاحَکَ مِنَ الرَّہۡبِ فَذٰنِکَ بُرۡہَانٰنِ مِنۡ رَّبِّکَ اِلٰی فِرۡعَوۡنَ وَ مَلَا۠ئِہٖ ؕ اِنَّہُمۡ کَانُوۡا قَوۡمًا فٰسِقِیۡنَ ﴿۳۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Insert thy hand into thy bosom; it will come forth white without evil<I> effect</I>, and draw back thy arm toward thyself <em>to be free </em>from fear. So these <em>shall be </em>two proofs from thy Lord to Pharaoh and his chiefs. Surely they are a rebellious people.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_28_33_a' href='#'>a</a>]</sup>‘Insert thy hand into thy bosom; it will come forth white without evil <i>effect</i>, and draw back thy arm toward thyself <i>in order to still thy </i>fear. So these <i>shall be </i>two proofs from thy Lord to Pharaoh and his chiefs. Surely, they are a rebellious people.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_28_33_a'>a</span></div> <div><div class='reference' data-id='ref_28_33_a' style='display:none'> <p><b>a.</b> <a href='/quran/7:109' target=_blank>7:109</a>; <a href='/quran/20:23' target=_blank>20:23</a>; <a href='/quran/27:13' target=_blank>27:13</a>. (<a href='javascript:void(0)' data-id='ref_28_33_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اپنا ہاتھ اپنے گریبان میں ڈال وہ بغیر کسی عیب کے چمکتا ہوا نکلے گا۔ پھر اپنے بازو کو خوف سے (بچنے کےلئے) اپنے ساتھ چمٹالے۔ پس تیرے ربّ کی طرف سے یہ دو براہین فرعون اور اس کے سرداروں کی طرف (بھیجی جا رہی) ہیں۔ یقیناً وہ بدکردار لوگ ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اور) اپنے ہاتھ کو اپنے گریبان میں ڈال‘ وہ بغیر کسی بیماری کے سفید نکلے گا اور اپنے بازو کو خوف کی وجہ سے (زور سے) کھینچ کر (اپنے جسم سے) ملالے یہ دو دلیلیں (علاوہ دوسری دلیلوں کے) ہیں جو فرعون اور اس کے درباریوں کی طرف تیرے رب کی طرف سے بھیجی گئی ہیں کیونکہ وہ اطاعت سے نکلنے والے لوگ ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Insère ta main dans l’ouverture de ta <em>tunique</em> ; elle en ressortira blanche sans <em>être atteinte d'</em>aucun mal, et ramène ton bras vers toi <em>pour te débarrasser</em> de la peur. Alors ce seront là deux preuves de la part de ton Seigneur pour Pharaon et ses chefs. Assurément, ils sont un peuple rebelle. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Mete tu mano en tu manto, cerca del pecho; saldrá blanca in ningún <em>efecto </em>maligno, y vuelve tu brazo hacia ti mismo <em>para que estés libre </em>del temor. Éstas <em>serán </em>dos prue­bas de tu Señor ante el Faraón y sus jefes. En verdad son un pueblo re­belde”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Stecke deine Hand in deinen Busen; sie wird weiß hervorkommen ohne Übel, und ziehe deinen Arm ohne Furcht an dich. Das sollen nun zwei Beweise von deinem Herrn für Pharao und seine Häupter sein, denn sie sind ein frevelndes Volk.\"", "spanish": " Cuando hubo llegado a él, fue llamado por una voz del lado de­recho del Valle, en el lugar ben­dito, desde un árbol: “Oh, Moisés, en verdad Yo y sólo Yo, soy Al‑lah, el Señor de los mundos”;", "urdu": " پھر جب وہ اس (آگ) کے پاس پہنچا‘ تو مبارک مقام کے ایک مبارک حصہ کی طرف سے ایک درخت کے پاس سے اسے پکارا گیا کہ اے موسیٰ میں اللہ ہوں سب جہانوں کا رب۔"}, {"arabic": " قَالَ رَبِّ اِنِّیۡ قَتَلۡتُ مِنۡہُمۡ نَفۡسًا فَاَخَافُ اَنۡ یَّقۡتُلُوۡنِ ﴿۳۴﴾", "english": " He said, ‘My Lord, I killed a person from among them, and I fear that they will kill me.", "french": " Il dit : « Mon Seigneur, j’ai tué un homme d’entre eux, et je crains qu’ils ne me tuent.", "german": " Er sprach: \"Mein Herr, ich habe einen von ihnen erschlagen und ich fürchte, sie werden mich töten.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=28:34&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=28:34&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic35\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic35\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/28:35' style='text-decoration:underline'>28:35</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(35)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control35\"></i></button> <audio id=\"player35\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اَخِیۡ ہٰرُوۡنُ ہُوَ اَفۡصَحُ مِنِّیۡ لِسَانًا فَاَرۡسِلۡہُ مَعِیَ رِدۡاً یُّصَدِّقُنِیۡۤ ۫ اِنِّیۡۤ اَخَافُ اَنۡ یُّکَذِّبُوۡنِ ﴿۳۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And my brother Aaron — he is more eloquent in speech than I; send him therefore with me as a helper that he may bear witness to my truth. I fear that they will accuse me of falsehood.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And my brother Aaron— he is more eloquent in speech than I; <sup class='ref'>[<a class='ref' data-id='ref_28_35_c' href='#'>c</a>]</sup>send him, therefore, with me as a helper<sup class='ref'>[<a class='ref' data-id='ref_28_35_2215' href='#'>2215</a>]</sup> that he may bear witness to my truth. I fear that they will charge me with falsehood.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_28_35_c'>c</span><span class='collapsible plus' data-id='ref_28_35_2215'>2215</span></div> <div><div class='reference' data-id='ref_28_35_c' style='display:none'> <p><b>c.</b> <a href='/quran/20:30' target=_blank>20:30</a>-33; <a href='/quran/26:14' target=_blank>26:14</a>. (<a href='javascript:void(0)' data-id='ref_28_35_c' class='ref'>close</a>)</p> </div> </div><div><a name='2215'></a><div class='reference' data-id='ref_28_35_2215' style='display:none'> <p><b>2215.</b> <i>Rid</i>’ means, a buttress or the like by means of which a wall is strengthened and supported; a thing by means of which one is helped, aided or assisted; an aider or helper. They say, <i>Fulanun Rid’u Fulanin</i>, i.e. such a one is an aider to such a one (Lane). (<a href='javascript:void(0)' data-id='ref_28_35_2215' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور میرا بھائی ہارون زبان کے لحاظ سے مجھ سے زیادہ فصیح ہے۔ پس میرے مددگار کے طور پر اسے میرے ساتھ بھیج دے وہ میری تصدیق کرے گا۔ یقیناً مجھے (یہ بھی) ڈر ہے کہ وہ مجھے جھٹلا دیں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور میرا بھائی ہارون بات کرنے میں مجھ سے زیادہ فصیح ہے۔ پس اس کو میرے ساتھ مددگار کے طور پر بھیج۔ تا کہ وہ میری تصدیق کرے۔ میں ڈرتا ہوں کہ وہ میری تکذیب نہ کریں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et mon frère Aaron – il est plus éloquent que moi en paroles ; envoie-le donc avec moi comme auxiliaire, afin qu’il puisse rendre témoignage à ma véracité. Vraiment, je crains qu’ils ne m’accusent de mensonges. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y mi hermano Aarón es más elocuente que yo hablando; envíalo por tanto conmigo como ayudante para que sea testigo de mi verdad. Temo que me acusen de falsedad”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und mein Bruder Aaron, er ist beredter als ich mit der Zunge; sende ihn darum mit mir als einen Helfer, dass er mich beglaubige, denn ich fürchte, sie werden mich der Falschheit zeihen.\"", "spanish": " Él dijo: Mi Señor, he ma­tado a uno de ellos, y temo que me maten;", "urdu": " (موسیٰ نے) کہا‘ اے میرے رب! میں نے فرعون کی قوم میں سے ایک شخص کو قتل کیا تھا۔ پس میں ڈرتا ہوں کہ وہ مجھے قتل نہ کر دیں (اور تیرا پیغام نہ پہنچ سکے) ۔"}, {"arabic": " قَالَ سَنَشُدُّ عَضُدَکَ بِاَخِیۡکَ وَ نَجۡعَلُ لَکُمَا سُلۡطٰنًا فَلَا یَصِلُوۡنَ اِلَیۡکُمَا ۚۛ بِاٰیٰتِنَاۤ ۚۛ اَنۡتُمَا وَ مَنِ اتَّبَعَکُمَا الۡغٰلِبُوۡنَ ﴿۳۶﴾", "english": " God said, ‘We will strengthen thy arm with thy brother and We will give power to you both so that they shall not be able to reach you. Go with Our Signs. You two and those who follow you will be the winners.’", "french": " Allāh dit : « Nous fortifierons ton bras par ton frère, et Nous vous accorderons à tous deux un Signe convaincant. Et grâce à Nos Signes, ils ne sauront vous atteindre. Vous deux et ceux qui vous suivront seront les vainqueurs. »", "german": " Er sprach: \"Wir wollen deinen Arm stärken mit deinem Bruder, und Wir wollen euch beiden Macht geben, so dass sie euch nicht erreichen werden. (Gehet nun) mit Unseren Zeichen. Ihr beide und die, welche euch folgen, werden die Sieger sein.\"", "spanish": " Dios dijo: “Fortaleceremos tu brazo con tu hermano, y os da­remos poder a los dos para que nunca puedan alcanzaros. Id con Nuestros Signos. Vosotros dos y quienes os sigan serán los vencedores”.", "urdu": " فرمایا‘ ہم تیرے بھائی کے ساتھ تیرے بازو کو مضبوط کریں گے اور تم دونوں کے لئے غلبہ کے سامان پیدا کریں گے۔ پس وہ تم تک نہیں پہنچ سکیں گے تم دونوں اور جو تم دونوں کے متبع ہوں گے ہماری آیات کے ذریعہ سے غالب ہونگے۔"}, {"arabic": " فَلَمَّا جَآءَہُمۡ مُّوۡسٰی بِاٰیٰتِنَا بَیِّنٰتٍ قَالُوۡا مَا ہٰذَاۤ اِلَّا سِحۡرٌ مُّفۡتَرًی وَّ مَا سَمِعۡنَا بِہٰذَا فِیۡۤ اٰبَآئِنَا الۡاَوَّلِیۡنَ ﴿۳۷﴾", "english": " And when Moses came to them with Our clear Signs, they said, ‘This is nothing but sorcery devised, and we never heard the like of this among our forefathers.’", "french": " Et lorsque Moïse vint à eux avec Nos Signes manifestes, ils dirent : « Ceci n’est que de la magie inventée, et nous n’avons jamais entendu parler de ces choses parmi nos aïeux. »", "german": " Als Moses zu ihnen kam mit Unseren deutlichen Zeichen, da sprachen sie: \"Das ist nichts als ein Zaubertrug, und wir haben unter unseren Vorvätern nie dergleichen gehört.\"", "spanish": " Mas cuando Moisés llegó a ellos con Nuestros Signos evidentes, dijeron: “Esto no es más que brujería inventada, ya que nunca hemos oído nada similar a esto entre nuestros antepasados”.", "urdu": " پس جب موسیٰ ہماری کھلی کھلی آیتیں لے کر آیا تو فرعون کے لوگوں نے کہا‘ یہ تو ایک فریب ہے جو بنا لیا گیا ہے۔ ہم نے اپنے باپ دادوں سے ایسی بات کبھی نہیں سنی۔"}, {"arabic": " وَ قَالَ مُوۡسٰی رَبِّیۡۤ اَعۡلَمُ بِمَنۡ جَآءَ بِالۡہُدٰی مِنۡ عِنۡدِہٖ وَ مَنۡ تَکُوۡنُ لَہٗ عَاقِبَۃُ الدَّارِ ؕ اِنَّہٗ لَا یُفۡلِحُ الظّٰلِمُوۡنَ ﴿۳۸﴾", "english": " Moses said, ‘My Lord knows best who it is that has brought guidance from Him, and whose will be the reward of the final abode. Verily, the wrongdoers never prosper.’", "french": " Moïse dit : « Mon Seigneur sait le mieux qui a apporté la direction de Sa part, et à qui sera la récompense de la Demeure Finale. En vérité, les injustes ne prospèrent jamais. »", "german": " Moses sprach: \"Mein Herr weiß am besten, wer es ist, der Führung von Ihm gebracht hat, und wem der glückselige Lohn der Wohnstatt zuteil werden wird. Wahrlich, die Frevler haben nie Erfolg.\"", "spanish": " Moisés dijo: “Mi Señor sabe mejor que nadie quién ha traído Su guía y de quienes será la recompensa de la morada final. En verdad, los injustos nunca prosperarán”.", "urdu": " اور موسیٰ نے کہا‘ میرا رب اس کو جو اس کی طرف سے ہدایت لائے خوب جانتا ہے اور اس کو بھی جس کا انجام اچھا ہو۔ حق یہ ہے کہ ظالم کبھی کامیاب نہیں ہوتے۔"}, {"arabic": " وَ قَالَ فِرۡعَوۡنُ یٰۤاَیُّہَا الۡمَلَاُ مَا عَلِمۡتُ لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرِیۡ ۚ فَاَوۡقِدۡ لِیۡ یٰہَامٰنُ عَلَی الطِّیۡنِ فَاجۡعَلۡ لِّیۡ صَرۡحًا لَّعَلِّیۡۤ اَطَّلِعُ اِلٰۤی اِلٰہِ مُوۡسٰی ۙ وَ اِنِّیۡ لَاَظُنُّہٗ مِنَ الۡکٰذِبِیۡنَ ﴿۳۹﴾", "english": " And Pharaoh said, ‘O chiefs, I know of no God for you other than myself; so burn me bricks of clay, O Haman, and build me a tower, that I may have a look at the God of Moses, though I believe him to be one of the liars.’", "french": " Et Pharaon dit : « Ô chefs, je ne connais pour vous aucun dieu autre que moi ; allume-moi donc le feu sur des briques d’ argile, ô Hāmān, et construis-moi un édifice élevé, afin que je puisse apercevoir le Dieu de Moïse, et en fait je le crois être du nombre des menteurs. »", "german": " Und Pharao sprach: \"O ihr Häupter, ich kenne keinen anderen Gott für euch außer mir; so brenne mir, o Hâmân, (Ziegel aus) Ton und mache mir einen Turm, damit ich den Gott des Mose erblicken kann, ob ich ihn gleich gewisslich für einen Lügner erachte.\"", "spanish": " El Faraón dijo: “Oh, jefes, no conozco para vosotros otro dios dis­tinto de mí; cuéceme pues ladrillos de arcilla, Oh, Hamán, y constrúyeme una torre, para que alcance a ver al Dios de Moisés, aunque creo que él es uno de los embusteros”.", "urdu": " اور فرعون نے کہا۔ اے درباریو! مجھے اپنے سوا تمہارا کوئی معبود معلوم نہیں۔ پس اے ہامان! میرے لئے گیلی مٹی پر آگ جلا (یعنی اینٹیں بنوا) پھر میرے لئے ایک قلعہ تیار کر۔ شاید اس پر چڑھ کر میں موسیٰ کے خدا کو معلوم کرلوں۔ اور میں تو اس کو جھوٹوں میں سے سمجھتا ہوں۔"}, {"arabic": " وَ اسۡتَکۡبَرَ ہُوَ وَ جُنُوۡدُہٗ فِی الۡاَرۡضِ بِغَیۡرِ الۡحَقِّ وَ ظَنُّوۡۤا اَنَّہُمۡ اِلَیۡنَا لَا یُرۡجَعُوۡنَ ﴿۴۰﴾", "english": " And he and his hosts behaved arrogantly in the land without any justification. And they thought that they would never be brought back to Us.", "french": " Et lui et ses armées se comportèrent avec arrogance sur la terre, sans aucune raison. Et ils pensaient qu’ils ne seraient jamais ramenés auprès de Nous.", "german": " Er und seine Heerscharen betrugen sich hoffärtig im Land ohne irgendeine Rechtfertigung. Und sie wähnten, dass sie nie zu Uns zurückgebracht werden würden.", "spanish": " Él y sus ejércitos se compor­taron arrogantemente en la tierra, sin justificación alguna. Y pensaron que nunca serían devueltos a Nosotros.", "urdu": " اور اس نے بھی اور اس کے لشکروں نے بھی ملک میں بغیر کسی حق کے تکبر سے کام لیا اور خیال کیا کہ وہ ہماری طرف لوٹا کر نہیں لائے جائیں گے۔"}, {"arabic": " فَاَخَذۡنٰہُ وَ جُنُوۡدَہٗ فَنَبَذۡنٰہُمۡ فِی الۡیَمِّ ۚ فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ الظّٰلِمِیۡنَ ﴿۴۱﴾", "english": " So We seized him and his hosts, and cast them into the sea. See, then, how evil was the end of the wrongdoers!", "french": " Alors, Nous le saisîmes, ainsi que ses armées, et Nous les jetâmes dans les flots. Vois donc combien mauvaise fut la fin des injustes !", "german": " So erfassten Wir ihn und seine Heerscharen und setzten sie aus inmitten des Meeres. Schau darum, wie der Ausgang der Missetäter war!", "spanish": " Así pues, los atrapamos a él y a sus huestes, lanzándolos al mar. ¡Ved, pues, qué desgraciado fue el fin de los inicuos!", "urdu": " پس ہم نے اس کو بھی اور اس کے لشکروں کو بھی پکڑ لیا اور ان کو سمندر میں پھینک دیا۔ پس دیکھ کہ ظالموں کا انجام کیسا ہوا؟"}, {"arabic": " وَ جَعَلۡنٰہُمۡ اَئِمَّۃً یَّدۡعُوۡنَ اِلَی النَّارِ ۚ وَ یَوۡمَ الۡقِیٰمَۃِ لَا یُنۡصَرُوۡنَ ﴿۴۲﴾", "english": " And We made them leaders inviting people unto the Fire; and on the Day of Resurrection they will receive no help.", "french": " Et Nous fîmes d’eux des chefs invitant les hommes au Feu ; et le Jour de la Résurrection, ils ne seront pas aidés.", "german": " Und Wir machten sie zu Führern, welche (Menschen) zum Feuer luden; und am Tage der Auferstehung werden sie keinen Beistand finden.", "spanish": " Los convertimos en dirigentes que invitaron al pueblo al Fuego; y en el Día de la Resurrección no recibirán ayuda.", "urdu": " اور ہم نے ان (فرعونیوں) کو سردار بنایا تھا جو (اپنی سرداری کے غرور میں) لوگوں کو دوزخ کی طرف بلاتے تھے اور قیامت کے دن ان کی کوئی مدد نہیں کی جائے گی۔"}, {"arabic": " وَ اَتۡبَعۡنٰہُمۡ فِیۡ ہٰذِہِ الدُّنۡیَا لَعۡنَۃً ۚ وَ یَوۡمَ الۡقِیٰمَۃِ ہُمۡ مِّنَ الۡمَقۡبُوۡحِیۡنَ ﴿٪۴۳﴾", "english": " And We caused them to be followed by a curse in this world; and on the Day of Resurrection they will be among those deprived of all good.", "french": " Et Nous avons fait qu’une malédiction les suive dans ce monde ; et le Jour de la Résurrection ils seront du nombre de ceux qui sont privés de toutes bénédictions.", "german": " Und Wir ließen ihnen einen Fluch folgen in dieser Welt; und am Tage der Auferstehung werden sie unter den Verabscheuten sein.", "spanish": " Hicimos que la maldición los siguiera en este mundo; y en el Día de la Resurrección, estarán entre los privados de todo bien.", "urdu": " اور اس دنیا میں بھی ہم نے ان پر لعنت بھیجی اور قیامت کے دن بھی وہ بدحال لوگوں میں سے ہوں گے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ مِنۡۢ بَعۡدِ مَاۤ اَہۡلَکۡنَا الۡقُرُوۡنَ الۡاُوۡلٰی بَصَآئِرَ لِلنَّاسِ وَ ہُدًی وَّ رَحۡمَۃً لَّعَلَّہُمۡ یَتَذَکَّرُوۡنَ ﴿۴۴﴾", "english": " And We gave the Book to Moses, after We had destroyed the earlier generations, as a source of enlightenment for men, and a guidance and a mercy, that they might reflect.", "french": " Et, après que Nous eûmes anéanti les générations antérieures, Nous donnâmes le Livre à Moïse comme un moyen d’éclairer les hommes et comme une direction et une miséricorde, afin qu’ils réfléchissent.", "german": " Und Wir gaben Moses die Schrift, nachdem Wir die früheren Geschlechter vernichtet hatten, als ein Mittel zur Erleuchtung für die Menschen und als Führung und Barmherzigkeit, auf dass sie ermahnt wären.", "spanish": " Y entregamos a Moisés el Libro, después de que destruyéramos las generaciones anteriores, como fuente de discernimiento para los hombres, y como guía y misericordia, para que reflexionen.", "urdu": " اور ہم نے موسیٰ کے بعد اس کے کہ ہم نے پہلی قوموں کو ہلاک کر دیا تھا‘ کتاب بخشتی۔ اس کی تعلیم لوگوں کو روحانی بینائی بخشتی تھی۔ اور وہ ہدایت اور رحمت کا موجب تھی (اور) اس غرض سے (دی گئی تھی) کہ وہ نصیحت حاصل کریں۔"}, {"arabic": " وَ مَا کُنۡتَ بِجَانِبِ الۡغَرۡبِیِّ اِذۡ قَضَیۡنَاۤ اِلٰی مُوۡسَی الۡاَمۡرَ وَ مَا کُنۡتَ مِنَ الشّٰہِدِیۡنَ ﴿ۙ۴۵﴾", "english": " And thou wast not on the western side of the Mount when We revealed the command to Moses, nor wast thou among the witnesses.", "french": " Et tu n’étais pas du côté occidental du Mont lorsque Nous avions communiqué à Moïse le commandement, et tu n’étais pas parmi les témoins.", "german": " Und du warst nicht auf der westlichen Seite, als Wir Moses den Auftrag gaben, noch warst du unter den Anwesenden.", "spanish": " Tú no estabas en la ladera occidental del Monte cuando reve­lamos la orden a Moisés, ni fuiste uno de los testigos.", "urdu": " اور تو (طور کے) مغربی جانب نہیں تھا جب ہم نے موسیٰ کے سپرد (رسالت کا) کام کیا تھا اور نہ تو (اس وقت) گواہوں میں سے ایک گواہ تھا۔"}, {"arabic": " وَ لٰکِنَّاۤ اَنۡشَاۡنَا قُرُوۡنًا فَتَطَاوَلَ عَلَیۡہِمُ الۡعُمُرُ ۚ وَ مَا کُنۡتَ ثَاوِیًا فِیۡۤ اَہۡلِ مَدۡیَنَ تَتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِنَا ۙ وَ لٰکِنَّا کُنَّا مُرۡسِلِیۡنَ ﴿۴۶﴾", "english": " But We brought forth generations after Moses , and life became prolonged for them. And thou wast not a dweller among the people of Midian, rehearsing Our Signs unto them; but it is We Who sent Messengers.", "french": " Mais, après Moïse , Nous avons créé des générations et la vie se prolongea pour eux. Et tu n’habitais pas parmi les gens de Madian, leur récitant Nos Signes ; mais c’est Nous Qui avons envoyé des Messagers.", "german": " Jedoch Wir ließen (nach Moses) Geschlechter erstehen, und das Leben wurde ihnen lang. Und du verweiltest nicht unter dem Volke von Midian, ihnen Unsere Zeichen vorzutragen; doch Wir, Wir schickten Gesandte.", "spanish": " Pero hicimos surgir varias ge­neraciones después de Moisés, y la vida se prolongó para ellos. Y tú no eras habitante del pueblo de Madián, para recitarles Nuestros Signos; sino que fuimos Nosotros Quienes enviamos a los Mensajeros.", "urdu": " لیکن ہم نے بہت سی قوموں کو پیدا کیا۔ پس ان پر عمر لمبی ہو گئی (اور وہ اپنی پیشگوئیوں کو بھول گئے) اور تو اہل مدین کے ساتھ بھی نہیں رہتا تھا کہ ان کے سامنے ہمارے نشانات پڑھ کر سناتا۔ لیکن ہم ہی رسول بھیجنے والے ہیں۔"}, {"arabic": " وَ مَا کُنۡتَ بِجَانِبِ الطُّوۡرِ اِذۡ نَادَیۡنَا وَ لٰکِنۡ رَّحۡمَۃً مِّنۡ رَّبِّکَ لِتُنۡذِرَ قَوۡمًا مَّاۤ اَتٰٮہُمۡ مِّنۡ نَّذِیۡرٍ مِّنۡ قَبۡلِکَ لَعَلَّہُمۡ یَتَذَکَّرُوۡنَ ﴿۴۷﴾", "english": " And thou wast not at the side of the Mount when We called. But We have sent thee as a mercy from thy Lord, that thou mayest warn a people to whom no Warner had come before thee, that they may reflect.", "french": " Et tu n’étais pas sur le versant du Mont quand Nous avons appelé. Mais Nous t’avons envoyé comme une miséricorde de la part de ton Seigneur, afin que tu puisses avertir un peuple que personne n’était venu avertir avant toi, afin qu’ils fassent attention.", "german": " Und du warst nicht auf der Seite des Berges, da Wir riefen. Doch (Wir haben dich entsandt) als eine Barmherzigkeit von deinem Herrn, damit du ein Volk warnen möchtest dem vor dir kein Warner gekommen war, auf dass sie ermahnt seien.", "spanish": " Tampoco estabas en la ladera del Monte cuando convocamos. Pero te hemos enviado como miseri­cordia de tu Señor para que ad­viertas a un pueblo al que no había llegado Amonestador ninguno antes de ti, a fin de que reflexionen.", "urdu": " اور تو طور کی جانب نہیں تھا۔ جب کہ ہم نے (موسیٰ کو) پکارا لیکن یہ سب کچھ تیرے رب کی طرف سے رحمت ہے تا کہ تو اس قوم کو ہوشیار کرے جن کے پاس تجھ سے پہلے کوئی ہوشیار کرنے والا نہیں آیا تھا تا کہ وہ نصیحت حاصل کریں۔"}, {"arabic": " وَ لَوۡ لَاۤ اَنۡ تُصِیۡبَہُمۡ مُّصِیۡبَۃٌۢ بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ فَیَقُوۡلُوۡا رَبَّنَا لَوۡ لَاۤ اَرۡسَلۡتَ اِلَیۡنَا رَسُوۡلًا فَنَتَّبِعَ اٰیٰتِکَ وَ نَکُوۡنَ مِنَ الۡمُؤۡمِنِیۡنَ ﴿۴۸﴾", "english": " And had it not been for the fact that, if an affliction should befall them because of what their hands have sent before them , they would say, ‘Our Lord, wherefore didst Thou not send a Messenger to us that we might have followed Thy Signs, and been of the believers?’ We should not have sent thee as a Messenger .", "french": " Et pourquoi donc, lorsqu’une affliction leur survient à cause de ce qu’ils ont fait eux-mêmes, ne disent-ils pas : « Notre Seigneur, pourquoi ne nous as-Tu pas envoyé un Messager afin que nous puissions suivre Tes Signes et être du nombre des croyants ? »", "german": " Und wäre es nicht, dass sie, wenn ein Unglück sie treffen sollte um dessentwillen, was ihre Hände vorausgesandt, sprechen könnten: \"Unser Herr, warum hast Du uns nicht einen Gesandten geschickt, dass wir Deine Zeichen hätten befolgen mögen, und wir wären unter den Gläubigen gewesen?\"(, hätten Wir dich nicht entsandt.)", "spanish": " Y por qué no dicen, cuando la desgracia cae sobre ellos como resultado de sus propias acciones: “Señor Nuestro, ¿por qué no nos enviaste un Mensajero para que hubiéramos podido seguir Tus signos y ser de los creyentes?”.", "urdu": " اور اگر یہ خیال نہ ہوتا کہ وہ اپنے اعمال کی وجہ سے کسی مصیبت کے آنے پر کہیں گے اے ہمارے رب! تو نے ہماری طرف کوئی رسول نہ بھیجا‘ تا کہ ہم تیری آیتوں کے پیچھے چلتے اور مومنوں میں سے بن جاتے (تو شاید ہم تجھے رسول بنا کر نہ بھیجتے مگر کفار پر حجت قائم کرنا ضروری تھا)"}, {"arabic": " فَلَمَّا جَآءَہُمُ الۡحَقُّ مِنۡ عِنۡدِنَا قَالُوۡا لَوۡ لَاۤ اُوۡتِیَ مِثۡلَ مَاۤ اُوۡتِیَ مُوۡسٰی ؕ اَوَ لَمۡ یَکۡفُرُوۡا بِمَاۤ اُوۡتِیَ مُوۡسٰی مِنۡ قَبۡلُ ۚ قَالُوۡا سِحۡرٰنِ تَظٰہَرَا ۟ٝ وَ قَالُوۡۤا اِنَّا بِکُلٍّ کٰفِرُوۡنَ ﴿۴۹﴾", "english": " But when the truth came to them from Us, they said, ‘Why has he not been given the like of what was given to Moses?’ Did they not reject that which was given to Moses before? They say, ‘Two works of sorcery — the Torah and the Qur ’ an — that back up each other.’ And they say, ‘We disbelieve in all.’", "french": " Mais maintenant que la vérité leur est parvenue de Notre part, ils disent : « Pourquoi ne lui a-t-il pas été accordé pareil à ce qui a été accordé à Moïse ? » N’avaient-ils pas rejeté ce qui avait été accordé à Moïse auparavant lorsqu ’ils dirent : « Ce ne sont que deux magiciens qui se soutiennent mutuellement » ? Et ils disent : « Nous les rejetons tous sans exception . »", "german": " Doch als ihnen nun die Wahrheit von Uns kam, da sprachen sie: \"Warum ist ihm nicht das gleiche gegeben worden wie das, was Moses gegeben ward?\" Haben sie denn nicht das geleugnet, was Moses zuvor gegeben ward? Sie hatten gesagt: \"Zwei Zauberwerke, die einander stützen.\" Und sie sagten: \"Wir leugnen beide.\"", "spanish": " Pero cuando les llegó Nuestra verdad, dijeron: “¿Por qué no se le ha dado lo mismo que se le dio a Moisés?”. ¿Acaso no rechazaron lo que se le dio a Moisés antes? Dicen: “ Sólo dos Magos que se ayudan mutuamente”. Y afirman: “Les rechazamos por completo”.", "urdu": " پس جب ان کے پاس ہماری طرف سے حق آگیا تو انہوں نے کہا کیوں اس (یعنی محمد رسول اللہ) کو ویسی تعلیم نہیں ملی جیسی کہ موسیٰ کو ملی تھی۔ کیا انہوں نے موسیٰ کی تعلیم کا اس سے پہلے انکار نہیں کیا تھا؟ انہوں نے تو کہہ دیا تھا کہ یہ دو بڑے جادو گر ہیں جو ایک دوسرے کی مدد کرتے ہیں اور کہہ دیا تھا کہ ہم ان میں سے ہر ایک کے دعویٰ کے منکر ہیں۔"}, {"arabic": " قُلۡ فَاۡتُوۡا بِکِتٰبٍ مِّنۡ عِنۡدِ اللّٰہِ ہُوَ اَہۡدٰی مِنۡہُمَاۤ اَتَّبِعۡہُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۵۰﴾", "english": " Say, ‘Then bring a Book from Allah which is a better guide than these two, that I may follow it, if you are truthful.’", "french": " Dis : « Alors, apportez un Livre de la part d’Allāh qui soit un meilleur guide que ces deux Livres – la Torah et le Coran – afin que je puisse le suivre, si vous êtes véridiques. »", "german": " Sprich: \"So bringet ein Buch von Allah herbei, das eine bessere Führung ist als diese beiden, damit ich ihm folge, wenn ihr wahrhaftig seid.\"", "spanish": " Diles: Traed pues un Libro de Al‑lah que sea mejor guía que estos dos - la Torah y el Corán - para que lo siga, si sois verídicos”.", "urdu": " تو کہہ دے کہ (اگر موسیٰ اور ہارون اور محمد رسول اللہ صلی اللہ علیہ وسلم سب کی باتیں جھوٹی ہیں تو) اگر تم سچے ہو تو اللہ کے پاس سے ایک ایسی کتاب لاٶ جو ان دونوں کتابوں سے زیادہ ہدایت دیتی ہو تا کہ میں اس کی اتباع کروں۔"}, {"arabic": " فَاِنۡ لَّمۡ یَسۡتَجِیۡبُوۡا لَکَ فَاعۡلَمۡ اَنَّمَا یَتَّبِعُوۡنَ اَہۡوَآءَہُمۡ ؕ وَ مَنۡ اَضَلُّ مِمَّنِ اتَّبَعَ ہَوٰٮہُ بِغَیۡرِ ہُدًی مِّنَ اللّٰہِ ؕ اِنَّ اللّٰہَ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿٪۵۱﴾", "english": " But if they answer thee not, then know that they only follow their own evil inclinations. And who is more erring than he who follows his evil inclinations without any guidance from Allah? Verily Allah guides not the unjust people.", "french": " Mais s’ils ne te répondent pas, alors sache qu’ils ne suivent que leurs propres mauvais penchants. Et qui s’égare plus que celui qui suit ses propres mauvais penchants sans aucune direction de la part d’Allāh ? En vérité Allāh ne dirige pas le peuple injuste.", "german": " Doch wenn sie dir nicht antworten, dann wisse, dass sie nur ihren eigenen bösen Gelüsten folgen. Und wer ist irrender als der, der seinen bösen Gelüsten folgt ohne Führung von Allah? Wahrlich, Allah leitet das ungerechte Volk nicht.", "spanish": " Pero si te responden que no, sabe entonces que sólo siguen sus malas inclinaciones. ¿Hay alguien que yerre más que quien sigue sus inclinaciones perversas sin guía al­guna de Al‑lah? en verdad, Al‑lah no guía a los injustos.", "urdu": " پھر اگر وہ کوئی جواب نہ دیں‘ تو جان لے کہ وہ صرف اپنی خواہشوں کی پیروی کر رہے ہیں اور اس سے زیادہ کون گمراہ ہے جو اللہ کی ہدایت کو نظر انداز کرکے اپنی خواہش کے پیچھے چلتا ہے اللہ یقیناً ظالم قوم کو کامیابی کا راستہ نہیں دکھاتا۔"}, {"arabic": " وَ لَقَدۡ وَصَّلۡنَا لَہُمُ الۡقَوۡلَ لَعَلَّہُمۡ یَتَذَکَّرُوۡنَ ﴿ؕ۵۲﴾", "english": " And We have, indeed, thoroughly conveyed to them the Word, that they may be admonished.", "french": " Et assurément, Nous leur avons envoyé la révélation continuellement, afin qu’ils en tirent la leçon.", "german": " Und Wir haben ihnen das Wort immer wieder übermittelt, auf dass sie ermahnt seien.", "spanish": " En verdad, les hemos transmitido cuidadosamente la Palabra, para que sean advertidos.", "urdu": " اور ہم ان کے لئے پے در پے وحی اتارتے رہے تاکہ وہ نصیحت حاصل کریں۔"}, {"arabic": " اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ مِنۡ قَبۡلِہٖ ہُمۡ بِہٖ یُؤۡمِنُوۡنَ ﴿۵۳﴾", "english": " Those to whom We gave the Book before it — they believe in it;", "french": " Ceux à qui Nous donnâmes le Livre avant le Coran – ils y croient ;", "german": " Diejenigen, denen Wir die Schrift zuvor gegeben – sie glauben daran.", "spanish": " Aquellos a quienes dimos el libro antes de éste: ésos creen en él;", "urdu": " وہ لوگ جن کو ہم نے اس (قرآن) سے پہلے کتاب دی تھی وہ اس (قرآن) پر (دل میں) ایمان رکھتے ہیں۔"}, {"arabic": " وَ اِذَا یُتۡلٰی عَلَیۡہِمۡ قَالُوۡۤا اٰمَنَّا بِہٖۤ اِنَّہُ الۡحَقُّ مِنۡ رَّبِّنَاۤ اِنَّا کُنَّا مِنۡ قَبۡلِہٖ مُسۡلِمِیۡنَ ﴿۵۴﴾", "english": " And when it is recited unto them, they say, ‘We believe in it. Verily, it is the truth from our Lord. Indeed, even before it we had submitted ourselves to God .’", "french": " Et quand il leur est récité, ils disent : « Nous y croyons. En vérité, c’est la vérité de la part de notre Seigneur. En fait, même avant ceci, nous nous étions soumis à Allāh . »", "german": " Und wenn sie ihnen vorgetragen wird, sagen sie: \"Wir glauben daran. Wahrlich es ist die Wahrheit von unserem Herrn; wir hatten uns schon vordem (Gott) ergeben.\"", "spanish": " Y cuando se les recita, dicen: “Creemos en él. Ciertamente es la verdad de nuestro Señor. En verdad, incluso antes de él nos habíamos sometido a Dios ”.", "urdu": " اور جب وہ (قرآن) ان کے سامنے پڑھا جاتا ہے تو وہ کہتے ہیں ہم اس پر ایمان لاتے ہیں۔ یہ ہمارے رب کی طرف سے برحق کلام ہے ہم تو اس دن سے پہلے ہی مسلمان تھے۔"}, {"arabic": " اُولٰٓئِکَ یُؤۡتَوۡنَ اَجۡرَہُمۡ مَّرَّتَیۡنِ بِمَا صَبَرُوۡا وَ یَدۡرَءُوۡنَ بِالۡحَسَنَۃِ السَّیِّئَۃَ وَ مِمَّا رَزَقۡنٰہُمۡ یُنۡفِقُوۡنَ ﴿۵۵﴾", "english": " These will be given their reward twice, for they have been steadfast and they repel evil with good, and spend out of what We have given them.", "french": " Ceux-ci recevront leur récompense à deux reprises, car ils ont été endurants, et ils repoussent le mal par le bien, et dépensent de ces dons et richesses que Nous leur avons accordés.", "german": " Diese werden ihren Lohn zweimal erhalten, weil sie standhaft waren und das Böse abwehren durch das Gute und spenden von dem, was Wir ihnen gegeben haben.", "spanish": " Éstos recibirán su recompensa dos veces, por haber sido perseve­rantes y haber combatido el mal con el bien, y gastado de lo que les dimos.", "urdu": " ان لوگوں کو ان کا بدلہ ان کے صبر کی وجہ سے دو دفعہ ملے گا اور وہ نیکی سے بدی کا مقابلہ کرتے ہیں اور جو کچھ ہم نے ان کو دیا ہے اس کو خرچ کرتے ہیں۔"}, {"arabic": " وَ اِذَا سَمِعُوا اللَّغۡوَ اَعۡرَضُوۡا عَنۡہُ وَ قَالُوۡا لَنَاۤ اَعۡمَالُنَا وَ لَکُمۡ اَعۡمَالُکُمۡ ۫ سَلٰمٌ عَلَیۡکُمۡ ۫ لَا نَبۡتَغِی الۡجٰہِلِیۡنَ ﴿۵۶﴾", "english": " And when they hear vain talk, they turn away from it and say, ‘Unto us our works and unto you your works. Peace be to you. We seek not the ignorant.’", "french": " Et lorsqu’ils entendent de vains propos, ils s’en détournent et disent : « A nous, nos œuvres, et à vous, les vôtres. La paix soit avec vous. Nous ne recherchons pas le contact avec les ignorants. »", "german": " Und wenn sie eitles Gerede hören, so wenden sie sich davon ab und sprechen: \"Für uns unsere Werke und für euch eure Werke. Friede sei mit euch! Wir suchen nicht die Unwissenden.\"", "spanish": " Cuando escuchan palabras vanas, se apartan de ellas y dicen: “Para nosotros nuestras obras y para vosotros las vuestras. La paz sea con vosotros. No buscamos a los igno­rantes”.", "urdu": " اور (یہودیوں میں سے مسلمان ہونے والے جب) کوئی لغو بات سنتے ہیں تو اُس سے اعراض کرتے ہیں اور کہتے ہیں اے کافرو ہمارے عمل ہمارے لئے ہیں اور تمہارے عمل تمہارے لئے ہیں۔ تم پر سلامتی نازل ہو (یعنی خدا تمہیں ایمان نصیب کرے) ہم جاہلوں سے تعلق رکھنا پسند نہیں کرتے۔"}, {"arabic": " اِنَّکَ لَا تَہۡدِیۡ مَنۡ اَحۡبَبۡتَ وَ لٰکِنَّ اللّٰہَ یَہۡدِیۡ مَنۡ یَّشَآءُ ۚ وَ ہُوَ اَعۡلَمُ بِالۡمُہۡتَدِیۡنَ ﴿۵۷﴾", "english": " Surely thou wilt not be able to guide all whom thou lovest; but Allah guides whomsoever He pleases; and He knows best those who would accept guidance.", "french": " Assurément, tu ne réussiras pas à diriger tous ceux que tu aimes ; mais Allāh guide qui Il veut ; et Il connaît le mieux ceux qui acceptent la direction.", "german": " Du kannst nicht dem den Weg weisen, den du liebst; Allah aber weist den Weg, wem Er will; und Er kennt am besten jene, die die Führung annehmen.", "spanish": " En verdad, no conseguirás guiar a quien amas; pero Al‑lah guía quien le place; pues Él conoce mejor aquellos que aceptarían la guía.", "urdu": " تو جس کو پسند کرے ہدایت نہیں دے سکتا۔ لیکن اللہ جسے چاہے ہدایت دیتا ہے اور وہ ہدایت پانے والوں کو خوب جانتا ہے۔"}, {"arabic": " وَ قَالُوۡۤا اِنۡ نَّتَّبِعِ الۡہُدٰی مَعَکَ نُتَخَطَّفۡ مِنۡ اَرۡضِنَا ؕ اَوَ لَمۡ نُمَکِّنۡ لَّہُمۡ حَرَمًا اٰمِنًا یُّجۡبٰۤی اِلَیۡہِ ثَمَرٰتُ کُلِّ شَیۡءٍ رِّزۡقًا مِّنۡ لَّدُنَّا وَ لٰکِنَّ اَکۡثَرَہُمۡ لَا یَعۡلَمُوۡنَ ﴿۵۸﴾", "english": " And they say, ‘If we were to follow the guidance with thee, we should be snatched away from our land.’ Have We not established for them a safe sanctuary, to which are brought the fruits of all things, as a provision from Us? But most of them know not.", "french": " Et ils disent : « Si nous devions suivre la direction avec toi, nous serions arrachés de notre terre. » N’avons-Nous pas établi pour eux un sanctuaire sûr où sont apportés les fruits de toutes choses, comme une provision de Notre part ? Mais la plupart d’entre eux ne savent pas.", "german": " Sie sprechen: \"Wenn wir der Führung mit dir folgten, so würden wir von unserem Land weggerissen werden.\" Haben Wir ihnen denn nicht eine sichere Freistatt aufgerichtet, zu der die Früchte aller Dinge gebracht werden, als eine Versorgung von Uns? Jedoch die meisten von ihnen wissen es nicht.", "spanish": " Ellos dicen: “Si siguiéramos la guía contigo, seríamos expulsa­dos de nuestro país”. ¿Acaso no hemos establecido para ellos un san­tuario eguro al que son llevados los frutos de todas las cosas, como pro­visión Nuestra? Mas la mayoría de ellos lo desconocen.", "urdu": " اور وہ کہتے ہیں کہ اگر ہم اس ہدایت کی جو تجھ پر نازل ہوتی ہے اتباع کریں تو اپنے ملک سے اُچک لیے جائیں گے (تو کہہ دے) کیا ہم نے ان کو محفوظ اور امن والے مقام میں جگہ نہیں دی۔ جس کی طرف ہر قسم کے پھل لائے جاتے ہیں۔ یہ ہماری طرف سے عطیہ ہے۔ مگر ان میں سے اکثر جانتے نہیں۔"}, {"arabic": " وَ کَمۡ اَہۡلَکۡنَا مِنۡ قَرۡیَۃٍۭ بَطِرَتۡ مَعِیۡشَتَہَا ۚ فَتِلۡکَ مَسٰکِنُہُمۡ لَمۡ تُسۡکَنۡ مِّنۡۢ بَعۡدِہِمۡ اِلَّا قَلِیۡلًا ؕ وَ کُنَّا نَحۡنُ الۡوٰرِثِیۡنَ ﴿۵۹﴾", "english": " And how many a habitation have We destroyed which exulted in its manner of life! And these are their dwellings which have not been inhabited after them except a little. And it is We Who became the Inheritors.", "french": " Et que de villes n’avons-Nous détruites qui exultaient dans l’aisance et la plénitude de leur vie ! Et voici leurs habitations qui ont à peine été habitées après eux. Et c’est Nous Qui en sommes devenus les héritiers.", "german": " Und wie so manche Stadt haben Wir zerstört, die in ihrer Fülle des Unterhalts frohlockte! Und dort stehen ihre Wohnstätten, die nicht bewohnt worden sind nach ihnen. Und Wir, Wir wurden die Erben.", "spanish": " ¡Cuántas viviendas que vi­vían en la exultación, por su estilo de vida, hemos destruido! Y éstos son sus hogares que no han vuelto a ser habi­tados tras ellos salvo por escaso tiem­po. Somos Nosotros Quienes nos convertimos en los Herederos.", "urdu": " اور بہت سے بستیاں ہیں جن کو ہم نے ہلاک کیا جو اپنی معیشت (کے افراط) کی وجہ سے متکبر ہو گئی تھیں۔ پس (دیکھ) یہ ان کی بستیاں ہیں جن میں ان کے بعد کوئی نہیں رہا اور ہم ہی ان کے وارث بنے۔"}, {"arabic": " وَ مَا کَانَ رَبُّکَ مُہۡلِکَ الۡقُرٰی حَتّٰی یَبۡعَثَ فِیۡۤ اُمِّہَا رَسُوۡلًا یَّتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِنَا ۚ وَ مَا کُنَّا مُہۡلِکِی الۡقُرٰۤی اِلَّا وَ اَہۡلُہَا ظٰلِمُوۡنَ ﴿۶۰﴾", "english": " And thy Lord would never destroy the towns until He has raised in the mother town thereof a Messenger, reciting unto them Our Signs; nor would We destroy the towns unless the people thereof are wrongdoers.", "french": " Et ton Seigneur ne détruirait jamais les villes sans avoir suscité dans la ville -mère un Messager leur récitant Nos Signes ; et Nous ne détruirions pas les villes à moins que leurs habitants ne soient des injustes.", "german": " Und dein Herr würde nie die Städte zerstören, Er hätte denn zuvor in derer Mutterstadt einen Gesandten erweckt, ihnen Unsere Zeichen vorzutragen; noch zerstören Wir Städte, ohne dass ihre Bewohner voll Ungerechtigkeit sind.", "spanish": " Mas tu Señor nunca destruiría las ciudades mientras no susci­tara en la ciudad madre de las mis­mas un Mensajero que les reci­tara Nuestros Signos; ni destruiría­mos las ciudades a menos que sus gen­tes fuesen malvadas.", "urdu": " اور تیرا رب جب تک کسی مرکزی بستی میں ایسا رسول نہ بھیج دے جو ان کے سامنے ہماری آیتیں پڑھ کر سنائے ان بستیوں کے مجموعہ (یعنی ملک) کو ہلاک کرنے کا ارتکاب نہیں کر سکتا تھا (کیونکہ یہ انصاف کے خلاف ہے) اور ہم بستیوں کو کبھی ہلاک نہیں کرتے سوائے اس کے کہ ان کے رہنے والے ظالم ہو جائیں۔"}, {"arabic": " وَ مَاۤ اُوۡتِیۡتُمۡ مِّنۡ شَیۡءٍ فَمَتَاعُ الۡحَیٰوۃِ الدُّنۡیَا وَ زِیۡنَتُہَا ۚ وَ مَا عِنۡدَ اللّٰہِ خَیۡرٌ وَّ اَبۡقٰی ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿٪۶۱﴾", "english": " And whatever of the things of this world you are given is only a temporary enjoyment of the present life and an adornment thereof; and that which is with Allah is better and more lasting. Will you not then understand?", "french": " Et quelles que soient les choses qui vous sont données, elles ne sont qu’une jouissance pour un temps et un ornement de la vie de ce monde ; et ce qui est avec Allāh est meilleur et plus durable. Ne voulez-vous donc pas comprendre ?", "german": " Und was euch auch an Dingen gegeben ward, es ist nur ein zeitweiliger Genuss dieses Lebens und sein Schmuck; und das, was bei Allah ist, ist besser und bleibender. Wollt ihr denn nicht begreifen?", "spanish": " Y cualquiera de las cosas de este mundo que se os dé no es más que un goce temporal de la vida presente y un ornamento suyo; pero lo que está junto a Al‑lah es mejor y más duradero. ¿Acaso no entende­réis?", "urdu": " اور جو کچھ تمہیں دیا جاتا ہے وہ تو صرف ورلی زندگی کا سامان ہے اور اس کی زینت ہے اور جو اللہ کے پاس ہے وہ بہتر اور باقی رہنے والا ہے۔ کیا تم عقل نہیں کرتے۔"}, {"arabic": " اَفَمَنۡ وَّعَدۡنٰہُ وَعۡدًا حَسَنًا فَہُوَ لَاقِیۡہِ کَمَنۡ مَّتَّعۡنٰہُ مَتَاعَ الۡحَیٰوۃِ الدُّنۡیَا ثُمَّ ہُوَ یَوۡمَ الۡقِیٰمَۃِ مِنَ الۡمُحۡضَرِیۡنَ ﴿۶۲﴾", "english": " Is he, then to whom We have promised a goodly promise the fulfilment of which he will meet, like the one whom We have provided with the good things of this life, and then on the Day of Resurrection he will be of those who will be brought arraigned before God ?", "french": " Ainsi, celui à qui Nous avons fait une bonne promesse, dont il verra l’accomplissement , est-il pareil à celui à qui Nous avons accordé uniquement des avantages temporaires de cette vie, et qui ensuite, au Jour de la Résurrection, sera de ceux qui seront amenés devant Allāh pour rendre compte de leurs actions ?", "german": " Ist denn der, dem Wir eine schöne Verheißung gaben, die er erfüllt sehen wird, gleich jenem, den Wir mit den guten Dingen dieses Lebens versorgt haben? Doch dann, am Tage der Auferstehung, wird er unter den Vorgeladenen sein.", "spanish": " ¿Acaso será aquel a quien hemos hecho una promesa divina cuyo cumplimiento alcanzará, igual a aquel al que hemos proporcionado las cosas buenas de esta vida y más tarde, en el Día de la Resurrección, será de los que sean traídos empla­zados ante Dios ?", "urdu": " کیا وہ شخص جس سے ہم نے اچھا (یعنی اُخروی زندگی کی کامیابی کا) وعدہ کیا ہو اور وہ اسے (یقیناً) پا لینے والا ہو اس شخص کی طرح ہو سکتا ہے جس کو ہم نے صرف دنیوی زندگی کا کچھ سامان دیا ہو۔ پھر وہ قیامت کے دن (خدا کے رُوبرو جواب دہی کے لئے) پیش کیا جانے والا ہو۔"}, {"arabic": " وَ یَوۡمَ یُنَادِیۡہِمۡ فَیَقُوۡلُ اَیۡنَ شُرَکَآءِیَ الَّذِیۡنَ کُنۡتُمۡ تَزۡعُمُوۡنَ ﴿۶۳﴾", "english": " And on that day He will call to them, and say, ‘Where are My ‘partners’ that you so imagined?’", "french": " Et ce jour-là, Il les appellera et dira : « Où sont ceux que vous prétendiez être Mes associés ? »", "german": " An jenem Tage wird Er sie rufen und sprechen: \"Wo sind nun Meine Nebengötter, die ihr wähntet?\"", "spanish": " En ese día los llamará y dirá: “¿Dónde están los “partícipes” que así imaginasteis?”.", "urdu": " اور (یاد کرو) جس دن وہ (اللہ) ان کو بلائے گا پھر پوچھے گا میرے وہ شرکاء کہاں ہیں جو تمہارے تصور نے بنا رکھے تھے جن کو تم میرے مقابل پر معبود قرار دیتے تھے۔"}, {"arabic": " قَالَ الَّذِیۡنَ حَقَّ عَلَیۡہِمُ الۡقَوۡلُ رَبَّنَا ہٰۤؤُلَآءِ الَّذِیۡنَ اَغۡوَیۡنَا ۚ اَغۡوَیۡنٰہُمۡ کَمَا غَوَیۡنَا ۚ تَبَرَّاۡنَاۤ اِلَیۡکَ ۫ مَا کَانُوۡۤا اِیَّانَا یَعۡبُدُوۡنَ ﴿۶۴﴾", "english": " Those against whom the sentence will become due, will say, ‘Our Lord, these are those whom we led astray. We led them astray, even as we had gone astray ourselves . We now dissociate ourselves from them and turn to Thee. It was not us that they worshipped.’", "french": " Ceux qui sont passibles de la sentence diront : « Notre Seigneur, voici ceux que nous avons égarés. Nous les avons égarés tout comme nous nous étions égarés nous-mêmes. Maintenant nous nous dissocions d’eux, et nous nous tournons vers Toi. Ce n’est pas nous qu’ils adoraient. »", "german": " Diejenigen, über die der Spruch fällig ist, werden sprechen: \"Unser Herr, dies sind jene, die wir irreführten. Wir führten sie irre, wie wir selbst irregingen. Wir sprechen uns los vor Dir. Nicht wir waren es, die sie anbeteten.\"", "spanish": " Aquellos contra quienes se vaya a dictar sentencia dirán: “Se­ñor nuestro, éstos son aquellos a quienes extraviamos. Los extravia­mos al igual que nos extraviamos nosotros mismos. Ahora nos sepa­ramos de ellos y volvemos a Ti. No era a nosotros a quienes adoraban”.", "urdu": " (تب) جن پر ہمارے عذاب کی خبر پوری ہو چکی ہوگی کہیں گے اے ہمارے رب! یہ وہ لوگ ہیں جن کو ہم نے بہکایا تھا۔ ہم نے ان کو اسی طرح بہکایا تھا جس طرح ہم خود بہک گئے تھے۔ آج ہم تیرے پاس اپنی گمراہی سے برأت ظاہرکرتے ہیں۔ وہ لوگ ہمارے عبادت گزار نہیں تھے (بلکہ اپنے خیالوں کے پیچھے چلتے تھے) ۔"}, {"arabic": " وَ قِیۡلَ ادۡعُوۡا شُرَکَآءَکُمۡ فَدَعَوۡہُمۡ فَلَمۡ یَسۡتَجِیۡبُوۡا لَہُمۡ وَ رَاَوُا الۡعَذَابَ ۚ لَوۡ اَنَّہُمۡ کَانُوۡا یَہۡتَدُوۡنَ ﴿۶۵﴾", "english": " And it will be said, ‘Call upon your partners.’ And they will call upon them, but they will not answer them. And they will see the punishment. Would that they had followed the guidance!", "french": " Et il sera dit : « Invoquez vos soi-disant associés. » Et ils les invoqueront, mais ceux-ci ne leur répondront pas. Et ils verront le châtiment. Hélas, que n’ont-ils suivi la direction !", "german": " Und es wird gesprochen werden: \"Ruft eure Götter an.\" Und sie werden sie anrufen, doch jene werden ihnen nicht antworten. Und sie werden die Strafe schauen. Wären sie doch dem rechten Weg gefolgt!", "spanish": " Mas se dirá: “Llamad a vuestros compañeros”. Los llamarán pero no les contestarán. Y verán el cas­tigo. ¡Ojalá hubiesen seguido la guía!", "urdu": " اور کہا جائے گا‘ تم اپنے شریکوں کو بلاٶ‘ پس وہ ان کو بلائیں گے مگر وہ ان کا جواب نہ دیں گے اور (مشرک) مقررہ عذاب دیکھ لیں گے۔ کاش کہ وہ ہدایت پاجاتے۔"}, {"arabic": " وَ یَوۡمَ یُنَادِیۡہِمۡ فَیَقُوۡلُ مَاذَاۤ اَجَبۡتُمُ الۡمُرۡسَلِیۡنَ ﴿۶۶﴾", "english": " And on that day He will call to them and say, ‘What answer did you give to the Messengers?’", "french": " Et ce jour-là Il les appellera et dira : « Quelle réponse avez-vous faite aux Messagers ? »", "german": " An jenem Tage wird Er sie rufen und sprechen: \"Welche Antwort gabet ihr den Gesandten?\"", "spanish": " Y en ese día, Él se dirigirá a ellos y les dirá: “¿Qué respuesta disteis a los Mensajeros?”.", "urdu": " اور اس دن کو بھی یاد کرو جب خدا ان کو پکارے گا اور کہے گا تم نے رسولوں (کے وعظ) کا کیا جواب دیا تھا؟"}, {"arabic": " فَعَمِیَتۡ عَلَیۡہِمُ الۡاَنۡۢبَآءُ یَوۡمَئِذٍ فَہُمۡ لَا یَتَسَآءَلُوۡنَ ﴿۶۷﴾", "english": " Then all excuses will become obscure to them on that day, and they shall not even ask each other.", "french": " Alors, ce jour-là, toutes les affaires seront obscures pour eux, et ils ne pourront même pas s’interroger les uns les autres.", "german": " Dann werden alle Ausreden ihnen dunkel werden an jenem Tage, und sie werden einander nicht befragen können.", "spanish": " En ese día, todos los asuntos quedarán oscurecidos para ellos, y ni siquiera se preguntarán mutuamente.", "urdu": " پس اس دن ساری دلیلیں انہیں بھول جائیں گی اور وہ ایک دوسرے سے کوئی سوال نہ کر سکیں گے۔"}, {"arabic": " فَاَمَّا مَنۡ تَابَ وَ اٰمَنَ وَ عَمِلَ صَالِحًا فَعَسٰۤی اَنۡ یَّکُوۡنَ مِنَ الۡمُفۡلِحِیۡنَ ﴿۶۸﴾", "english": " But as for him who repents and believes and does righteous deeds, maybe he will be among the prosperous.", "french": " Mais quant à celui qui se repent et croit et qui fait de bonnes œuvres, il se peut qu’il se trouve au nombre de ceux qui seront prospères.", "german": " Der aber bereut und glaubt und das Rechte wirkt – wohl möglich, dass er unter den Erfolgreichen sein wird.", "spanish": " Pero quien se arrepienta, crea y realice buenas acciones, tal vez se cuente entre los prósperos.", "urdu": " پس جو کوئی توبہ کرے گا اور ایمان لائے گا اور مناسب حال عمل کرے گا قریب ہوگا کہ وہ بامراد لوگوں میں شامل ہوجائے۔"}, {"arabic": " وَ رَبُّکَ یَخۡلُقُ مَا یَشَآءُ وَ یَخۡتَارُ ؕ مَا کَانَ لَہُمُ الۡخِیَرَۃُ ؕ سُبۡحٰنَ اللّٰہِ وَ تَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿۶۹﴾", "english": " And thy Lord creates whatever He pleases and chooses whomsoever He pleases . It is not for them to choose. Glorified be Allah, and far is He above all that they associate with Him .", "french": " Et ton Seigneur crée tout ce qu’Il veut, et choisit qui Il veut . Ce n’est pas à eux de choisir. Gloire à Allāh ! Il est bien au-dessus de ce qu’ils Lui associent .", "german": " Dein Herr erschafft und erwählt, was Ihm gefällt. Nicht ihnen steht die Wahl zu. Gepriesen sei Allah und hoch erhaben über das, was sie anbeten!", "spanish": " Y tu Señor crea todo lo que Le agrada y elige a quien Le place. No les corresponde a ellos elegir. lori­ficado sea Al-lah, pues Él está muy por encima de todo lo que Le asocian.", "urdu": " اور تیرا رب جو چاہتا ہے پیدا کرتا ہے اور جس کو چاہتا ہے چن لیتا ہے۔ ان کو اس بارہ میں کوئی اختیار حاصل نہیں۔ اللہ پاک ہے اور ان کی مشرکانہ باتوں سے بلند ہے۔"}, {"arabic": " وَ رَبُّکَ یَعۡلَمُ مَا تُکِنُّ صُدُوۡرُہُمۡ وَ مَا یُعۡلِنُوۡنَ ﴿۷۰﴾", "english": " And thy Lord knows what their breasts conceal, and what they reveal.", "french": " Et ton Seigneur sait ce que cachent leurs poitrines et ce qu’ils révèlent.", "german": " Dein Herr weiß, was ihre Herzen verbergen und was sie offenbaren.", "spanish": " Pues tu Señor conoce lo que ocultan sus corazones y lo que revelan.", "urdu": " اور تیرا رب اس کو بھی جانتا ہے جس کو وہ سینہ میں چھپاتے ہیں اور اسے بھی جسے وہ ظاہر کرتے ہیں۔"}, {"arabic": " وَ ہُوَ اللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَ ؕ لَہُ الۡحَمۡدُ فِی الۡاُوۡلٰی وَ الۡاٰخِرَۃِ ۫ وَ لَہُ الۡحُکۡمُ وَ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۷۱﴾", "english": " And He is Allah; there is no God but He. To Him belongs all praise in the beginning and the Hereafter. His is the judgment and to Him shall you be brought back.", "french": " Et Il est Allāh ; il n’y a de dieu que Lui. A Lui appartiennent toutes les louanges au commencement et dans l’au-delà. A Lui le jugement, et à Lui vous serez ramenés.", "german": " Und Er ist Allah; es gibt keinen Gott außer Ihm. Ihm gebührt aller Preis am Anfang und am Ende. Sein ist die Herrschaft, und zu Ihm sollt ihr zurückgebracht werden.", "spanish": " Él es Al‑lah; no hay más dios que Él. A Él corresponde toda la alabanza en el comienzo y en el Más Allá. Suyo es el juicio, y a Él seréis devueltos.", "urdu": " اور حقیقت یہ ہے کہ اللہ کی ذات ایسی ہے کہ اس کے سوا کوئی معبود نہیں ابتدائے آفرینش میں بھی وہ تعریف کا مستحق تھا۔ اور آخرت میں بھی وہی تعریف کا مستحق ہوگا۔ سب بادشاہت اسی کے قبضہ میں ہے اور تم سب کو اسی کی طرف لوٹ کر جانا ہوگا۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ اِنۡ جَعَلَ اللّٰہُ عَلَیۡکُمُ الَّیۡلَ سَرۡمَدًا اِلٰی یَوۡمِ الۡقِیٰمَۃِ مَنۡ اِلٰہٌ غَیۡرُ اللّٰہِ یَاۡتِیۡکُمۡ بِضِیَآءٍ ؕ اَفَلَا تَسۡمَعُوۡنَ ﴿۷۲﴾", "english": " Say, ‘Tell me, if Allah make the night continue over you till the Day of Resurrection, what God is there besides Allah who could bring you light? Will you not then hearken?’", "french": " Dis : « Dites- moi , si Allāh faisait durer sur vous la nuit jusqu’au Jour de la Résurrection, quel dieu y a-t-il en dehors d’Allāh qui pourrait vous apporter la lumière ? Ne voulez-vous donc pas prêter l’oreille ? »", "german": " Sprich: \"Saget mir, wenn Allah die Nacht dauern ließe über euch bis zum Tage der Auferstehung, welcher Gott außer Allah könnte euch ein Licht bringen? Wollt ihr denn nicht hören?\"", "spanish": " Diles: “Decidme, si Al‑lah hi­ciera la noche continua sobre voso­tros hasta el Día de la Resurrección; ¿qué dios existe fuera de Al‑lah que pudiera devolveros la luz? ¿No escu­charéis pues?", "urdu": " تو (ان سے) کہہ‘ مجھے بتاٶ تو سہی اگر اللہ تمہارے لئے قیامت کے دن تک رات کو لمبا کر دے تو اللہ کے سوا اور کون ہے جو تمہارے پاس روشنی لائے گا؟ کیا تم سنتے نہیں۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ اِنۡ جَعَلَ اللّٰہُ عَلَیۡکُمُ النَّہَارَ سَرۡمَدًا اِلٰی یَوۡمِ الۡقِیٰمَۃِ مَنۡ اِلٰہٌ غَیۡرُ اللّٰہِ یَاۡتِیۡکُمۡ بِلَیۡلٍ تَسۡکُنُوۡنَ فِیۡہِ ؕ اَفَلَا تُبۡصِرُوۡنَ ﴿۷۳﴾", "english": " Say, ‘Tell me, if Allah make the day continue over you till the Day of Resurrection, what God is there besides Allah who could bring you a night wherein you could rest? Will you not then see?’", "french": " Dis : « Dites- moi , si Allāh faisait durer sur vous le jour jusqu’au Jour de la Résurrection, quel dieu y a-t-il en dehors d’Allāh, qui pourrait vous apporter la nuit où vous pourriez vous reposer ! Ne voulez-vous donc pas voir ?", "german": " Sprich: \"Saget mir, wenn Allah den Tag dauern ließe über euch bis zum Tage der Auferstehung, welcher Gott außer Allah könnte euch eine Nacht bringen, worin ihr ruhtet? Wollt ihr denn nicht einsehen?\"", "spanish": " Diles “Decidme, si Al-lah hiciera el día continuo sobre vosotros hasta el Día de la Resurrección, ¿qué dios existe fuera de Al‑lah que pu­diera devolveros la noche en la que podáis descansar? ¿No veréis pues?”.", "urdu": " تو کہہ دے مجھے بتاٶ تو سہی کہ اگر اللہ دن کو قیامت کے دن تک تمہارے لئے لمبا کر دے تو اللہ کے سوا کونسا معبود ہے جو تمہارے پاس رات کو لے آئے جس میں تم سکون پاٶ۔ کیا تم دیکھتے نہیں۔"}, {"arabic": " وَ مِنۡ رَّحۡمَتِہٖ جَعَلَ لَکُمُ الَّیۡلَ وَ النَّہَارَ لِتَسۡکُنُوۡا فِیۡہِ وَ لِتَبۡتَغُوۡا مِنۡ فَضۡلِہٖ وَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۷۴﴾", "english": " And of His mercy He has made for you the night and the day, that you may rest therein, and that you may seek of His bounty, and that you may be grateful.", "french": " Et c’est par Sa miséricorde qu’Il a fait pour vous la nuit et le jour, afin que vous vous y reposiez, et que vous vous mettiez en quête de Sa munificence, et que vous soyez reconnaissants.", "german": " Aus Seiner Barmherzigkeit schuf Er für euch die Nacht und den Tag, dass ihr darin ruhen möchtet und dass ihr nach Seiner Huld trachtet und dass ihr dankbar wäret.", "spanish": " Y con Su misericordia ha hecho para vosotros el día y la noche, para que descanséis en ellos, y po­dáis buscar de Su gracia, y seáis agradecidos.", "urdu": " اور یہ اس کی رحمت ہے کہ اس نے تمہارے لئے رات اور دن بنائے ہیں کہ اس (رات) میں تم سکون حاصل کرو۔ اور (اس دن میں) تم اس کا فضل تلاش کرو۔ تا کہ تم شکر گذار بنو۔"}, {"arabic": " وَ یَوۡمَ یُنَادِیۡہِمۡ فَیَقُوۡلُ اَیۡنَ شُرَکَآءِیَ الَّذِیۡنَ کُنۡتُمۡ تَزۡعُمُوۡنَ ﴿۷۵﴾", "english": " And on that day He will call to them and say, “Where are My ‘partners,’ whom you so imagined?”", "french": " Et ce jour-là Il les appellera et dira : « Où sont ceux que vous prétendiez être Mes associés ? »", "german": " An jenem Tage wird Er sie rufen und sprechen: \"Wo sind nun Meine Nebengötter, die ihr wähntet?\"", "spanish": " Y en ese día, los convocará y les dirá: “¿En dónde están Mis “par­tícipes”, a quienes imaginasteis de ese modo?”.", "urdu": " اور جس دن وہ ان کو پکارے گا اور کہے گا کہ کہاں ہیں وہ میرے مزعومہ شرکا ء جن کو تم (معبود) خیال کرتے تھے۔"}, {"arabic": " وَ نَزَعۡنَا مِنۡ کُلِّ اُمَّۃٍ شَہِیۡدًا فَقُلۡنَا ہَاتُوۡا بُرۡہَانَکُمۡ فَعَلِمُوۡۤا اَنَّ الۡحَقَّ لِلّٰہِ وَ ضَلَّ عَنۡہُمۡ مَّا کَانُوۡا یَفۡتَرُوۡنَ ﴿٪۷۶﴾", "english": " And We shall draw from every people a witness and We shall say, ‘Bring your proof.’ Then they will know that the truth belongs to Allah. And that which they used to forge will be lost unto them.", "french": " Et Nous produirons de chaque peuple un témoin, et Nous dirons : « Apportez votre preuve. » Alors ils sauront que la vérité appartient à Allāh Seul . Et ce qu’ils avaient l’habitude de fabriquer ne leur sera d’aucun recours.", "german": " Und Wir werden aus jedem Volke einen Zeugen holen und sprechen: \"Bringt euren Beweis herbei.\" Dann werden sie erkennen, dass die Wahrheit Allahs ist. Und das, was sie zu erdichten pflegten, wird für sie verloren sein.", "spanish": " Y sacaremos un testigo de cada pueblo y les diremos: “Pre­sentad vuestra prueba”. Entonces sabrán que la verdad pertenece a Al-­lah. Y que lo que solían tramar se les esfumará.", "urdu": " اور ہم ہر ایک امت میں سے ایک گواہ نکال کھڑا کریں گے پھر کہیں گے اپنی دلیل لاٶ۔ تب وہ جان لیں گے کہ کامل حق اللہ ہی کے پاس ہے اور ان کا سب افترا ان سے کھویا جائے گا۔"}, {"arabic": " اِنَّ قَارُوۡنَ کَانَ مِنۡ قَوۡمِ مُوۡسٰی فَبَغٰی عَلَیۡہِمۡ ۪ وَ اٰتَیۡنٰہُ مِنَ الۡکُنُوۡزِ مَاۤ اِنَّ مَفَاتِحَہٗ لَتَنُوۡٓاُ بِالۡعُصۡبَۃِ اُولِی الۡقُوَّۃِ ٭ اِذۡ قَالَ لَہٗ قَوۡمُہٗ لَا تَفۡرَحۡ اِنَّ اللّٰہَ لَا یُحِبُّ الۡفَرِحِیۡنَ ﴿۷۷﴾", "english": " Verily, Korah was of the people of Moses, but he behaved arrogantly towards them. And We had given him of treasures so much that his hoardings would have weighed down a party of strong men. When his people said to him, ‘Exult not, surely Allah loves not those who exult.", "french": " En vérité Korah était du peuple de Moïse, mais il se comporta comme un tyran envers eux. Et Nous lui avions donné tant de trésors, que leurs clés auraient assurément pesé lourd même pour un groupe d’hommes forts. Lorsque son peuple lui dit : « N’exulte pas ; assurément Allāh n’aime pas ceux qui exultent.", "german": " Korah gehörte zum Volke Mose, doch er bedrückte sie. Und Wir hatten ihm so viel an Schätzen gegeben, dass ihre Schlüssel sicherlich eine Bürde für eine Schar von Starken gewesen wären. Da sein Volk zu ihm sprach: \"Frohlocke nicht, denn Allah liebt nicht die Frohlockenden,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=28:77&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=28:77&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic78\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic78\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/28:78' style='text-decoration:underline'>28:78</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(78)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control78\"></i></button> <audio id=\"player78\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ ابۡتَغِ فِیۡمَاۤ اٰتٰٮکَ اللّٰہُ الدَّارَ الۡاٰخِرَۃَ وَ لَا تَنۡسَ نَصِیۡبَکَ مِنَ الدُّنۡیَا وَ اَحۡسِنۡ کَمَاۤ اَحۡسَنَ اللّٰہُ اِلَیۡکَ وَ لَا تَبۡغِ الۡفَسَادَ فِی الۡاَرۡضِ ؕ اِنَّ اللّٰہَ لَا یُحِبُّ الۡمُفۡسِدِیۡنَ ﴿۷۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And seek, in that which Allah has given thee, the Home of the Hereafter; and neglect not thy lot in this world; and do good <em>to others </em>as Allah has done good to thee; and seek not to make mischief in the earth, verily Allah loves not those who make mischief.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And seek, in that which Allah has given thee, the Home of the Hereafter; and neglect not thy lot in this world; and do good to <i>others </i>as Allah has done good to thee; and seek not to create mischief in the land. Verily, Allah loves not those who create mischief;’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور جو کچھ اللہ نے تجھے عطا کیا ہے اس کے ذریعہ دارِآخرت کمانے کی خواہش کر اور دنیا میں سے بھی اپنا معیّن حصہ نظرانداز نہ کر اور احسان کا سلوک کر جیسا کہ اللہ نے تجھ سے احسان کا سلوک کیا اور زمین میں فساد (پھیلانا) پسند نہ کر۔ یقیناً اللہ فسادیوں کو پسند نہیں کرتا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور جو کچھ تجھے اللہ نے دیا ہے اس سے اُخروی زندگی کے گھر کی تلاش کر۔ اور دنیوی زندگی سے تجھے جو حصہ ملا ہے اسے بھی بھول نہیں (ہم تجھے ایک حد تک دنیا کی آسائشوں کے استعمال سے روکتے نہیں) اور جس طرح اللہ نے تجھ پر احسان کیا ہے تو بھی لوگوں پر احسان کر اور ملک میں فساد پھیلانے کی کوشش نہ کر۔ اللہ یقیناً مفسدوں کو پسند نہیں کرتا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et recherche la Demeure de l’au-delà dans ce qu’Allāh t’a donné ; et ne néglige pas ta part dans ce monde ; et fais du bien <em>aux autres</em> comme Allāh t’a fait du bien ; et ne cherche pas à créer le désordre sur la terre. En vérité, Allāh n’aime pas ceux qui créent le désordre. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y busca, en lo que Al‑lah te ha dado, la morada del Más Allá; no olvides tu parte en este mundo; y haz el bien <em>a los demás </em>como Al‑lah lo ha hecho contigo; no pretendas hacer el mal en la tierra pues en verdad Al­-lah no ama a quienes hacen el mal”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">sondern suche in dem, was Allah dir gegeben, die Wohnstatt des Jenseits, und vernachlässige deinen Teil an der Welt nicht; und tue Gutes, wie Allah dir Gutes getan hat; und begehre nicht Unheil auf Erden, denn Allah liebt die Unheilstifter nicht.\"", "spanish": " En verdad, Korah pertenecía al pueblo de Moisés, pero se comportó como un tirano respecto a ellos. Y le habíamos dado de los tesoros en cantidad tal que sus llaves no hubieran podido ser trans­portadas por un grupo de hombres fuertes. Cuando su pueblo le dijo: “No te exultes, en verdad Al‑lah no ama a quienes se enorgullecen”.", "urdu": " قارون (دراصل) موسیٰ کی قوم میں سے تھا۔ مگر وہ انہی کے خلاف ظلم پر آمادہ ہو گیا اور ہم نے اس کو اتنے خزانے دئیے تھے کہ جن کی کنجیاں ایک مضبوط جماعت کے لئے بھی اٹھانا مشکل تھیں۔ (یاد کر) جب اس کی قوم نے اسے کہا کہ (اتنا) فخر مت کر۔ اللہ فخر کرنے والوں کو یقیناً پسند نہیں کرتا۔"}, {"arabic": " قَالَ اِنَّمَاۤ اُوۡتِیۡتُہٗ عَلٰی عِلۡمٍ عِنۡدِیۡ ؕ اَوَ لَمۡ یَعۡلَمۡ اَنَّ اللّٰہَ قَدۡ اَہۡلَکَ مِنۡ قَبۡلِہٖ مِنَ الۡقُرُوۡنِ مَنۡ ہُوَ اَشَدُّ مِنۡہُ قُوَّۃً وَّ اَکۡثَرُ جَمۡعًا ؕ وَ لَا یُسۡـَٔلُ عَنۡ ذُنُوۡبِہِمُ الۡمُجۡرِمُوۡنَ ﴿۷۹﴾", "english": " He said, ‘This has been given to me because of the knowledge I possess.’ Did he not know that Allah had destroyed before him generations that were mightier than he and greater in riches? And the guilty shall not be asked to offer an explanation of their sins.", "french": " Il dit : « Tout ceci ne m’a été donné qu’en raison des connaissances que je possède. » Ne savait-il pas qu’avant lui, Allāh avait anéanti des générations qui étaient plus puissantes que lui, et plus importantes en nombre ? Et il ne sera pas requis des coupables de fournir une explication de leurs péchés.", "german": " Er antwortete: \"Es ward mir nur um des Wissens willen, das ich besitze, gegeben.\" Wusste er denn nicht, dass Allah vor ihm schon Geschlechter vernichtet hatte, die stärker waren als er an Kraft und größer an Reichtum? Und die Schuldigen werden nicht nach ihren Sünden befragt.", "spanish": " Él respondió: “Esto se me ha dado por los conocimientos que po­seo”. ¿No sabía acaso que Al‑lah destruyó antes que él a generaciones más poderosas que él y de mayores riquezas? Mas al culpable no se le pedirá que ofrezca una explicación de sus pecados.", "urdu": " (قارون نے) کہا۔ یہ سب رتبہ مجھے ایک ایسے علم کی وجہ سے ملا ہے‘ جو صرف مجھے حاصل ہے۔ کیا وہ جانتا نہیں تھا کہ اس سے پہلے اللہ نے بہت سی نسلوں کو جو اس سے زیادہ طاقت ور اور اس سے زیادہ مالدار تھیں ہلاک کر دیا تھا اور مجرموں کو (جب عذاب دیا جاتا ہے تو) ان کے گناہوں کے متعلق ان سے پوچھ گچھ نہیں کی جاتی۔"}, {"arabic": " فَخَرَجَ عَلٰی قَوۡمِہٖ فِیۡ زِیۡنَتِہٖ ؕ قَالَ الَّذِیۡنَ یُرِیۡدُوۡنَ الۡحَیٰوۃَ الدُّنۡیَا یٰلَیۡتَ لَنَا مِثۡلَ مَاۤ اُوۡتِیَ قَارُوۡنُ ۙ اِنَّہٗ لَذُوۡ حَظٍّ عَظِیۡمٍ ﴿۸۰﴾", "english": " So he went forth before his people in his pomp. Those who were desirous of the life of this world said, ‘O would that we had the like of what Korah has been given! Truly, he is the master of great fortune.’", "french": " Alors il parut en grand apparat devant son peuple. Ceux qui étaient désireux de la vie de ce monde, dirent : « Que n’avons-nous des richesses pareilles à celles qui ont été accordées à Korah ! En vérité, il possède une grande fortune. »", "german": " So ging er denn hinaus zu seinem Volk in seinem Schmuck. Jene nun, die nach dem Leben in dieser Welt begierig waren, sprachen: \"O dass wir doch das gleiche besäßen wie das, was Korah gegeben ward! Fürwahr, er ist der Herr gewaltigen Glückes.\"", "spanish": " Así se presentó ante su pueblo con su pompa. Los que ambiciona­ban la vida de este mundo, dijeron: “¡Oh, ojalá tuviésemos algo similar a lo que se ha dado a Korah! En verdad, es el dueño de una gran fortuna”.", "urdu": " (ایک دن ایسا ہوا کہ) وہ اپنی قوم کے سامنے اپنی زینت (یعنی اپنے باڈی گارڈ) کے ساتھ نکلا۔ اس پر وہ لوگ جو کہ دنیا کی زندگی کا سامان چاہتے تھے بول اٹھے‘ اے کاش! ہمیں بھی وہی کچھ ملتا جو قارون کو دیا گیا‘ اس کو تو (دنیا کا ایک) بہت بڑا حصہ ملا ہے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ وَیۡلَکُمۡ ثَوَابُ اللّٰہِ خَیۡرٌ لِّمَنۡ اٰمَنَ وَ عَمِلَ صَالِحًا ۚ وَ لَا یُلَقّٰہَاۤ اِلَّا الصّٰبِرُوۡنَ ﴿۸۱﴾", "english": " But those who had been given knowledge said, ‘Woe to you, Allah’s reward is best for those who believe and do good works; and it shall be granted to none except those who are steadfast.’", "french": " Mais ceux à qui la connaissance avait été donnée, dirent : « Malheur à vous ! La récompense d'Allāh est meilleure pour ceux qui croient et font de bonnes œuvres ; et elle ne sera accordée à personne sauf à ceux qui sont endurants. »", "german": " Die aber, denen Wissen zuteil geworden war, sprachen: \"Wehe euch, Allahs Lohn ist besser für den, der glaubt und gute Werke übt; und keiner wird ihn erlangen außer den Standhaften.\"", "spanish": " Pero aquellos que recibieron el conocimiento dijeron: “Ay de voso­tros, la recompensa de Al‑lah es mejor para quienes creen y hacen buenas obras; y no se concederá a ninguno salvo a quienes sean per­severantes”.", "urdu": " اور جن لوگوں کو علم دیا گیا تھا وہ بولے‘ تمہارا ستیاناس۔ اللہ کی طرف سے ملنے والی جزا مومن اور ایمان کے مناسب حال عمل کرنے والے کے لئے بہت اچھی ہوتی ہے اور یہ (جزا) صرف صبر کرنے والوں کا گروہ ہی پاتا ہے۔"}, {"arabic": " فَخَسَفۡنَا بِہٖ وَ بِدَارِہِ الۡاَرۡضَ ۟ فَمَا کَانَ لَہٗ مِنۡ فِئَۃٍ یَّنۡصُرُوۡنَہٗ مِنۡ دُوۡنِ اللّٰہِ ٭ وَ مَا کَانَ مِنَ الۡمُنۡتَصِرِیۡنَ ﴿۸۲﴾", "english": " Then We caused the earth to swallow him up and his dwelling; and he had no party to help him against Allah, nor was he of those who can defend themselves.", "french": " Puis Nous avons fait que la terre l’engloutît, lui et sa maison ; et il n’avait aucune troupe pour lui venir en aide contre Allāh, et il n’était pas non plus de ceux qui peuvent triompher du décret d’Allāh .", "german": " Dann ließen Wir die Erde ihn und sein Haus verschlingen; und er hatte keine Schar, ihm zu helfen gegen Allah, noch konnte er sich retten.", "spanish": " Entonces hicimos que la tierra se lo tragara, a él y a su morada; y no obtuvo grupo alguno que lo ayudara contra Al‑lah, ni era de los que pudiera dominar al decreto de Al-lah .", "urdu": " پھر ہم نے اس کو اور اس کے قبیلہ کو مکروہات میں مبتلا کر دیا اور کوئی جماعت ایسی نہ نکلی جو اللہ کے سوا اس کی مدد کرتی۔ اور کسی تدبیر سے بھی وہ (اپنے دشمن سے) بچ نہ سکا۔"}, {"arabic": " وَ اَصۡبَحَ الَّذِیۡنَ تَمَنَّوۡا مَکَانَہٗ بِالۡاَمۡسِ یَقُوۡلُوۡنَ وَیۡکَاَنَّ اللّٰہَ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ وَ یَقۡدِرُ ۚ لَوۡ لَاۤ اَنۡ مَّنَّ اللّٰہُ عَلَیۡنَا لَخَسَفَ بِنَا ؕ وَیۡکَاَنَّہٗ لَا یُفۡلِحُ الۡکٰفِرُوۡنَ ﴿٪۸۳﴾", "english": " And those who had coveted his position the day before began to say, ‘Ah! it is indeed Allah Who enlarges the provision for such of His servants as He pleases and straitens it for whom He pleases . Had not Allah been gracious to us, He would have caused it to swallow us up also. Ah! the ungrateful never prosper.’", "french": " Et ceux qui la veille avaient convoité son rang, se mirent à dire : « Ah ! C’est assurément Allāh Qui accroît la provision pour qui Il veut d'entre Ses serviteurs, et Qui la réduit pour qui Il veut . Si Allāh n’avait pas été gracieux envers nous, certainement Il nous aurait fait engloutir aussi. Ah ! Les ingrats ne prospèrent jamais ! »", "german": " Und jene, die noch tags zuvor sich an seine Stelle gewünscht hatten, sprachen: \"Ah sieh! es ist fürwahr Allah, Der die Mittel zum Unterhalt weitet und beschränkt, wem Er will unter Seinen Dienern. Wäre uns Allah nicht gnädig gewesen, Er hätte (die Erde) uns verschlingen lassen. Ah sieh! die Undankbaren haben nie Erfolg.\"", "spanish": " Y quienes codiciaron su posi­ción el día anterior comenzaron a decir: “¡Ah! en verdad es Al‑lah quien amplía la provisión para quellos de Sus siervos que Le place y la es­trecha para quien Él quiere. De no haber sido Al‑lah Clemente con o­sotros, habría hecho que la tierra nos tragara también. ¡Ah! los ingratos nunca prosperan”.", "urdu": " اور وہ لوگ جو کل تک اس کے مقام پر ہونے کی تمنا کرتے تھے کہنے لگ گئے تجھ پر ہلاکت ہو۔ اللہ ہی یقیناً اپنے بندوں میں سے جس کے لئے چاہتا ہے رزق میں فراخی دیتا ہے اور جس کے لئے چاہتا ہے تنگی کرتا ہے اگر ہم پر اللہ نے احسان نہ کیا ہوتا تو ہمیں بھی مصیبتوں کا شکار کر دیتا۔ تجھ پر ہلاکت ہو (بات یہی ہے کہ) کافر کبھی کامیاب نہیں ہوتے۔"}, {"arabic": " تِلۡکَ الدَّارُ الۡاٰخِرَۃُ نَجۡعَلُہَا لِلَّذِیۡنَ لَا یُرِیۡدُوۡنَ عُلُوًّا فِی الۡاَرۡضِ وَ لَا فَسَادًا ؕ وَ الۡعَاقِبَۃُ لِلۡمُتَّقِیۡنَ ﴿۸۴﴾", "english": " This is the Home of the Hereafter! We give it to those who desire not self-exaltation in the earth, nor corruption. And the end is for the righteous.", "french": " Ceci est la Demeure de l’au-delà ! Nous l’accordons à ceux qui ne désirent ni la gloriole sur la terre, ni la corruption. Et la fin est pour les vertueux.", "german": " Jene Wohnstatt im Jenseits! Wir geben sie denen, die weder Selbsterhöhung auf Erden begehren noch irgendeine Verderbnis. Und der Ausgang ist für die Rechtschaffenen.", "spanish": " ¡Ésta es la Morada del Más Allá! Nosotros la damos a quienes no desean la propia exaltación en la tierra ni la corrupción. Y el final es para el justo.", "urdu": " یہ (جو) اخروی زندگی (ہے) ہم اسے انہی کے لئے مخصوص کر دیتے ہیں جو ملک میں ناجائز غلبہ اور فساد نہیں چاہتے۔ اور انجام متقیوں کا ہی (اچھا) ہوتا ہے۔"}, {"arabic": " مَنۡ جَآءَ بِالۡحَسَنَۃِ فَلَہٗ خَیۡرٌ مِّنۡہَا ۚ وَ مَنۡ جَآءَ بِالسَّیِّئَۃِ فَلَا یُجۡزَی الَّذِیۡنَ عَمِلُوا السَّیِّاٰتِ اِلَّا مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۸۵﴾", "english": " He who does a good deed shall have better reward than that; and as for him who does an evil deed — those who do evil deeds shall not be rewarded but according to what they did.", "french": " Celui qui fait un bien aura en récompense meilleur que cela ; et quant à celui qui fait une mauvaise action, qu'il sache que ceux qui font de mauvaises actions ne seront récompensés que dans la mesure de ce qu’ils auront fait.", "german": " Wer Gutes vollbringt, soll Besseres als das erhalten; wer jedoch eine böse Tat vollbringt – jene, die böse Werke tun, sollen nur nach dem belohnt werden, was sie getan.", "spanish": " Quien hace una buena obra tendrá una recompensa mejor que ella; y quien cometa una mala acción sepa que quienes cometen malas cciones no serán retribuidos salvo de acuerdo con lo que hicieron.", "urdu": " جو شخص پسندیدہ عمل کرے‘ اسے اس سے بہتر بدلہ ملے گا۔ اور جو کوئی برا عمل کرے گا تو برے اعمال کرنے والوں کو ان کے اپنے عمل کے برابر جزا دی جائے گی۔"}, {"arabic": " اِنَّ الَّذِیۡ فَرَضَ عَلَیۡکَ الۡقُرۡاٰنَ لَرَآدُّکَ اِلٰی مَعَادٍ ؕ قُلۡ رَّبِّیۡۤ اَعۡلَمُ مَنۡ جَآءَ بِالۡہُدٰی وَ مَنۡ ہُوَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۸۶﴾", "english": " Most surely He Who had made the teaching of Qur’an binding on thee will bring these back to thy place of return. Say, ‘My Lord knows best who brings the guidance, and who is in manifest error.’", "french": " Très certainement, Celui Qui t'a rendu obligatoires le s injonctions du Coran te ramènera sûrement à ton lieu de retour. Dis : « Mon Seigneur sait le mieux qui apporte la direction, et qui est dans une erreur manifeste. »", "german": " Wahrlich, Er, Der den Qur-ân bindend für dich gemacht hat, Er wird dich zurückbringen zur Stätte der Wiederkehr. Sprich: \"Mein Herr weiß am besten, wer es ist, der auf dem rechten Weg ist, und wer in offenbarem Irrtum ist.\"", "spanish": " Con certeza que Quien te ha impuesto las enseñanzas del Corán te devolverá a tu lugar de retorno. Diles: “Mi Señor sabe mejor quién trae la guía y quién está en error evidente”.", "urdu": " وہ خدا جس نے تجھ پر یہ قرآن فرض کیا ہے اپنی ذات کی قسم کھا کر کہتا ہے کہ وہ تجھے اس مقام کی طرف لوٹا کر لائے گا جس کی طرف لوگ لوٹ لوٹ کر آتے ہیں۔ تو کہہ دے‘ میرا رب (اس کو بھی) خوب جانتا ہے جو ہدایت پر قائم ہوتا ہے اور (اس کو بھی) جو کھلی گمراہی میں مبتلا ہوتا ہے۔"}, {"arabic": " وَ مَا کُنۡتَ تَرۡجُوۡۤا اَنۡ یُّلۡقٰۤی اِلَیۡکَ الۡکِتٰبُ اِلَّا رَحۡمَۃً مِّنۡ رَّبِّکَ فَلَا تَکُوۡنَنَّ ظَہِیۡرًا لِّلۡکٰفِرِیۡنَ ﴿۫۸۷﴾", "english": " And thou didst never expect that the Book would be revealed to thee; but it is a mercy from thy Lord; so never be a helper of those who disbelieve.", "french": " Et tu ne t’attendais jamais à ce que le Livre te soit révélé ; mais c’est une miséricorde de la part de ton Seigneur ; ne sois donc jamais un soutien pour ceux qui refusent de croire.", "german": " Und du hattest selbst keine Hoffnung, dass dir das Buch offenbart würde; allein es ist eine Barmherzigkeit von deinem Herrn; darum sei den Ungläubigen nie ein Beistand.", "spanish": " Y nunca esperaste que el Libro te fuese revelado; sino que se trata de una misericordia de tu Señor; no seas, pues, ayudante de quienes no creen.", "urdu": " اور تو (کوئی) امید نہیں رکھتا تھا کہ تجھ پر ایک مکمل کتاب نازل کی جائے گی مگر تیرے رب کی طرف سے رحمت کے طور پر ایسا ہوا۔ پس تو کافروں کا مددگار کبھی نہ بنیئو۔"}, {"arabic": " وَ لَا یَصُدُّنَّکَ عَنۡ اٰیٰتِ اللّٰہِ بَعۡدَ اِذۡ اُنۡزِلَتۡ اِلَیۡکَ وَ ادۡعُ اِلٰی رَبِّکَ وَ لَا تَکُوۡنَنَّ مِنَ الۡمُشۡرِکِیۡنَ ﴿ۚ۸۸﴾", "english": " And let them not turn thee away from the Signs of Allah, after they have been sent down to thee; and call mankind to thy Lord, and be not of those who attribute partners to Him .", "french": " Et ne leur permets pas de te détourner des Signes d’Allāh, après qu’ils t’aient été envoyés ; et appelle l’humanité entière vers ton Seigneur, et ne sois pas du nombre des associateurs.", "german": " Lass niemand dich abwendig machen von den Zeichen Allahs, nachdem sie zu dir niedergesandt worden; und rufe zu deinem Herrn und sei nicht der Götzendiener einer.", "spanish": " Y no dejes que te aparten de los Signos de Al‑lah, después de que te han sido revelados; llama a la humanidad ante tu Señor; y no seas de aquellos que Le atribuyen par­tícipes.", "urdu": " اور تجھے کوئی شخص اس کے بعد کہ اللہ کی آیتیں تجھ پر اتاری گئیں ان سے روکنے والا نہ بنے اور تو اپنے رب کی طرف (لوگوں کو) بلا اور مشرکوں میں شامل نہ ہو۔"}, {"arabic": " وَ لَا تَدۡعُ مَعَ اللّٰہِ اِلٰـہًا اٰخَرَ ۘ لَاۤ اِلٰہَ اِلَّا ہُوَ ۟ کُلُّ شَیۡءٍ ہَالِکٌ اِلَّا وَجۡہَہٗ ؕ لَہُ الۡحُکۡمُ وَ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿٪۸۹﴾", "english": " And call not on any other God beside Allah. There is no God but He. Everything will perish except Himself. His is the judgement, and to Him will you be brought back.", "french": " Et n’invoque aucun autre dieu avec Allāh. Il n’y a pas de dieu que Lui. Tout est apte à périr sauf Sa manifestation. A Lui le jugement et à Lui vous serez tous ramenés.", "german": " Und rufe neben Allah nicht einen anderen Gott an. Es gibt keinen Gott außer Ihm. Alle Dinge sind vergänglich, bis auf Sein Angesicht. Sein ist die Herrschaft und zu Ihm werdet ihr zurückgebracht werden.", "spanish": " No invoques a ningún otro dios fuera de Al‑lah. No hay más Dios que Él. Todo perecerá excepto Él. Suyo es el juicio, y a Él seréis devueltos.", "urdu": " اور (اے مخاطب) اللہ کے سوا کسی معبود کو مت پکار۔ اس کے سوا کوئی معبود نہیں۔ ہر ایک چیز ہلاک ہونے والی ہے سوائے اس کے جس کی طرف اس (اللہ) کی توجہ ہو۔ حکم اسی کے اختیار میں ہے اور تم سب اسی کی طرف لوٹا کر لے جائے جاٶ گے۔"}], "Surah": 28}