{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el Nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سُوۡرَۃٌ اَنۡزَلۡنٰہَا وَ فَرَضۡنٰہَا وَ اَنۡزَلۡنَا فِیۡہَاۤ اٰیٰتٍۭ بَیِّنٰتٍ لَّعَلَّکُمۡ تَذَکَّرُوۡنَ ﴿۲﴾", "english": " This is a Surah which We have revealed and which We have made obligatory; and We have revealed therein clear Signs, that you may take heed.", "french": " Ceci est une sourate que Nous avons révélée, et que Nous avons rendue obligatoire ; et Nous y avons révélé des commandements clairs, afin que vous preniez garde.", "german": " Eine Sura, die Wir hinabsandten und die Wir zum Gesetz erhoben. Wir haben darin deutliche Zeichen hinabgesandt, auf dass ihr ermahnt seiet.", "spanish": " Este es un Surah que hemos revelado y hemos hecho obliga­torio; en él hemos revelado Signos claros, para que prestéis atención .", "urdu": " (یہ) ایک ایسی سورۃ ہے جو ہم نے اتاری ہے اور (جس پر عمل کرنا) ہم نے فرض کیا ہے اور اس میں ہم نے اپنے روشن احکام بیان کیے ہیں تا کہ تم نصیحت حاصل کرو۔"}, {"arabic": " اَلزَّانِیَۃُ وَ الزَّانِیۡ فَاجۡلِدُوۡا کُلَّ وَاحِدٍ مِّنۡہُمَا مِائَۃَ جَلۡدَۃٍ ۪ وَّ لَا تَاۡخُذۡکُمۡ بِہِمَا رَاۡفَۃٌ فِیۡ دِیۡنِ اللّٰہِ اِنۡ کُنۡتُمۡ تُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ۚ وَ لۡیَشۡہَدۡ عَذَابَہُمَا طَآئِفَۃٌ مِّنَ الۡمُؤۡمِنِیۡنَ ﴿۳﴾", "english": " The adulteress and the adulterer (or the fornicatress and the fornicator) — flog each one of them with a hundred stripes. And let not pity for the twain take hold of you in executing the judgment of Allah, if you believe in Allah and the Last Day. And let a party of the believers witness their punishment.", "french": " La femme adultère et l’homme adultère (ou la fornicatrice et le fornicateur) – fouettez chacun d’eux de cent coups de fouet. Et ne laissez pas la pitié pour les deux vous gagner en ce qui concerne la mise à exécution du commandement divin, si vous croyez en Allāh et au Jour Dernier. Et qu’un groupe de croyants assiste à leur punition.", "german": " Weib und Mann, die des Ehebruchs schuldig sind, geißelt beide mit einhundert Streichen. Und lasst nicht Mitleid mit den beiden euch überwältigen vor dem Gesetze Allahs, so ihr an Allah und an den Jüngsten Tag glaubt. Und eine Anzahl der Gläubigen soll ihrer Strafe beiwohnen.", "spanish": " A la adúltera y al adúltero (o a la fornicadora y al fornicador), castigadlos con cien azotes a cada uno. Y no dejéis que la compasión os conmueva al ejecutar la ley divina, si creéis en l‑lah y en el Ultimo Día. Y que una parte de los creyentes sea testigo de su castigo.", "urdu": " زانیہ عورت اور زانی مرد (اگر ان پر الزام ثابت ہوجائے تو) ان میں سے ہر ایک کو سو کوڑے لگاٶ۔ اور اگر تم اللہ اور یوم آخرت پر ایمان لاتے ہو تو اللہ کے حکم کے بجالانے میں ان دونوں قسم کے مجرموں کے متعلق تمہیں رحم نہ آئے اور چاہیئے کہ ان دونوں کی سزا کو مومنوں کی ایک جماعت مشاہدہ کرے۔"}, {"arabic": " اَلزَّانِیۡ لَا یَنۡکِحُ اِلَّا زَانِیَۃً اَوۡ مُشۡرِکَۃً ۫ وَّ الزَّانِیَۃُ لَا یَنۡکِحُہَاۤ اِلَّا زَانٍ اَوۡ مُشۡرِکٌ ۚ وَ حُرِّمَ ذٰلِکَ عَلَی الۡمُؤۡمِنِیۡنَ ﴿۴﴾", "english": " The adulterer (or fornicator) shall not marry but an adulteress (or fornicatress) or an idolatrous woman, and an adulteress (or fornicatress) shall not marry but an adulterer (or fornicator) or an idolatrous man. That indeed is forbidden to the believers.", "french": " L’homme adultère (ou fornicateur) ne peut avoir de relation sexuelle qu’avec une femme adultère (ou fornicatrice) ou une idolâtre ; et la femme adultère (ou fornicatrice) ne peut avoir de relation sexuelle qu’avec un homme adultère (ou fornicateur) ou un idolâtre. Cela est certainement interdit aux croyants.", "german": " Ein Ehebrecher wohnt nur einer Ehebrecherin oder einer Götzendienerin bei, und eine Ehebrecherin wohnt nur einem Ehebrecher oder Götzendiener bei; den Gläubigen ist das verwehrt.", "spanish": " El adúltero (o fornicador) sólo podrá casarse con una adúltera (o fornicadora) o con una mujer idó­latra, y una adúltera (o fornicadora) sólo podrá casarse con un adúltero (o fornicador) o con un hombre idó­latra. Esto está en verdad prohibido a los creyentes.", "urdu": " ایک زانی‘ زانیہ یا مشرکہ کے سوا کسی سے ہم صحبت نہیں ہوتا اور نہ زانیہ زانی یا مشرک کے سوا کسی سے ہم صحبت ہوتی ہے۔ اور مومنوں پر یہ (بات) حرام کی گئی ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یَرۡمُوۡنَ الۡمُحۡصَنٰتِ ثُمَّ لَمۡ یَاۡتُوۡا بِاَرۡبَعَۃِ شُہَدَآءَ فَاجۡلِدُوۡہُمۡ ثَمٰنِیۡنَ جَلۡدَۃً وَّ لَا تَقۡبَلُوۡا لَہُمۡ شَہَادَۃً اَبَدًا ۚ وَ اُولٰٓئِکَ ہُمُ الۡفٰسِقُوۡنَ ۙ﴿۵﴾", "english": " And those who calumniate chaste women but bring not four witnesses — flog them with eighty stripes, and never admit their evidence thereafter , and it is they that are the transgressors,", "french": " Et ceux qui calomnient des femmes chastes puis ne produisent pas quatre témoins – fouettez-les de quatre-vingts coups de fouet, et n’acceptez plus jamais leur témoignage, et ceux-là sont des transgresseurs –", "german": " Und diejenigen, die züchtige Frauen verleumden, jedoch nicht vier Zeugen beibringen – geißelt sie mit achtzig Streichen und lasset ihre Aussage niemals gelten, denn sie sind es, die ruchlose Frevler sind,", "spanish": " Mas a quienes calumnien a las mujeres castas sin presentar cuatro testigos: castigadlos con ochenta azotes, y no admitáis nunca su tes­timonio después, pues son ellos los transgresores.", "urdu": " اور جو لوگ پاک دامن عورتوں پر الزام لگاتے ہیں۔ پھر چار گواہ مہیا نہیں کرتے تو (ان کی سزا یہ ہے کہ) ان کو اسی کوڑے لگاٶ اوران کی گواہی کبھی قبول نہ کرو۔ اور وہ لوگ (اپنے اس فعل کی وجہ سے شریعت اسلامی کی) اطاعت سے خارج ہیں۔"}, {"arabic": " اِلَّا الَّذِیۡنَ تَابُوۡا مِنۡۢ بَعۡدِ ذٰلِکَ وَ اَصۡلَحُوۡا ۚ فَاِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۶﴾", "english": " Except those who repent thereafter and make amends, for truly Allah is Most Forgiving, Merciful.", "french": " Sauf ceux qui s’ en repentent par la suite et se corrigent : car en vérité Allāh est Très-Pardonnant, Miséricordieux.", "german": " außer jenen, die hernach bereuen und sich bessern; denn wahrlich, Allah ist allvergebend, barmherzig.", "spanish": " Excepto quienes se arrepientan después y se enmienden, pues en verdad Al‑lah es el Sumo Indul­gente, Misericordioso.", "urdu": " سوائے ان کے جو بعد میں توبہ کر لیں اور اصلاح کر لیں۔ سو (ایسا کرنے پر) اللہ یقیناً بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یَرۡمُوۡنَ اَزۡوَاجَہُمۡ وَ لَمۡ یَکُنۡ لَّہُمۡ شُہَدَآءُ اِلَّاۤ اَنۡفُسُہُمۡ فَشَہَادَۃُ اَحَدِہِمۡ اَرۡبَعُ شَہٰدٰتٍۭ بِاللّٰہِ ۙ اِنَّہٗ لَمِنَ الصّٰدِقِیۡنَ ﴿۷﴾", "english": " And as for those who calumniate their wives, and have not witnesses except themselves — the evidence of any one of such people shall suffice if he bears witness four times in the name of Allah saying that he is surely of those who speak the truth.", "french": " Et quant à ceux qui calomnient leurs épouses, et qui n’ont de témoins qu’eux-mêmes – le témoignage d’un seul homme de ceux-là suffira s’il témoigne quatre fois au nom d’Allāh, en disant qu’il est assurément de ceux qui disent la vérité.", "german": " Und jene, die ihre Gattinnen verleumden und keine Zeugen haben außer sich selber – die Aussage eines Mannes allein von solchen Leuten soll (genügen), wenn er viermal im Namen Allahs Zeugenschaft leistet, dass er zweifelsohne die Wahrheit redet;", "spanish": " Y en cuanto a quienes calum­nian a sus esposas, y no tienen testigos xcepto ellos mismos: la prueba de cualquiera de ellos bastará si presta testimonio cuatro veces en el Nombre de Al‑lah, diciendo que él es ciertamente de quienes dicen la verdad;", "urdu": " اور جو لوگ اپنی بیویوں پر الزام لگاتے ہیں اور ان کے پاس سوائے اپنے وجود کے اور کوئی گواہ نہیں ہوتا تو ان میں سے ہر شخص کو ایسی گواہی دینی چاہیئے جو اللہ کی قسم کھا کر چار گواہیوں پر مشتمل ہو اور (ہر گواہی میں) وہ یہ کہے کہ وہ راست بازوں میں سے ہے۔"}, {"arabic": " وَ الۡخَامِسَۃُ اَنَّ لَعۡنَتَ اللّٰہِ عَلَیۡہِ اِنۡ کَانَ مِنَ الۡکٰذِبِیۡنَ ﴿۸﴾", "english": " And his fifth oath shall be to say that Allah’s curse be upon him if he be of the liars.", "french": " Et son cinquième serment sera pour dire que la malédiction d’Allāh soit sur lui s’il est du nombre des menteurs.", "german": " und (sein) fünfter (Eid) soll sein, dass der Fluch Allahs auf ihm sein möge, falls er ein Lügner ist.", "spanish": " Y su quinto juramento será para decir que la maldición de Al‑lah caiga sobre él si pertenece a los mentirosos.", "urdu": " اور پانچویں (گواہی) میں (کہے) کہ اس پر خدا کی لعنت ہو‘ اگر وہ جھوٹوں میں سے ہو۔"}, {"arabic": " وَ یَدۡرَؤُا عَنۡہَا الۡعَذَابَ اَنۡ تَشۡہَدَ اَرۡبَعَ شَہٰدٰتٍۭ بِاللّٰہِ ۙ اِنَّہٗ لَمِنَ الۡکٰذِبِیۡنَ ۙ﴿۹﴾", "english": " But it shall avert the punishment from her if she bears witness four times in the name of Allah saying that he is of the liars.", "french": " Mais cela écartera le châtiment d’elle si elle jure par quatre fois au nom d’Allāh, en disant qu’il est du nombre des menteurs.", "german": " Von ihr aber soll es die Strafe abwenden, wenn sie viermal im Namen Allahs Zeugenschaft leistet, dass er ein Lügner ist.", "spanish": " Pero se apartará el castigo de ella si la mujer presta cuatro veces testimonio en el Nombre de Al‑lah diciendo que él es de los mentirosos.", "urdu": " اور اس بیوی سے (جس پر اس کا خاوند الزام لگائے) اس کا اللہ کی قسم کھا کر چار گواہیاں دینا کہ وہ (خاوند) جھوٹا ہے عذاب دور کر دے گا۔"}, {"arabic": " وَ الۡخَامِسَۃَ اَنَّ غَضَبَ اللّٰہِ عَلَیۡہَاۤ اِنۡ کَانَ مِنَ الصّٰدِقِیۡنَ ﴿۱۰﴾", "english": " And her fifth oath shall be to say that the wrath of Allah be upon her if he speaks the truth.", "french": " Et son cinquième serment sera pour dire que le courroux d’Allāh soit sur elle s’il est du nombre des véridiques.", "german": " Und (ihr) fünfter (Eid) soll sein, dass Allahs Zorn auf ihr sein möge, falls er die Wahrheit redet.", "spanish": " Y su quinto juramento será para decir que la cólera de Al‑lah caiga sobre ella si él dice la ver­dad.", "urdu": " اور پانچویں (قسم) اس طرح (کھائے) کہ اللہ کا غضب اس (عورت) پر نازل ہو اگر وہ (الزام لگانے والا خاوند) سچا ہے۔"}, {"arabic": " وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ وَ اَنَّ اللّٰہَ تَوَّابٌ حَکِیۡمٌ ﴿٪۱۱﴾", "english": " And were it not for Allah’s grace and His mercy upon you, and the fact that Allah is Compassionate and Wise, you would have come to grief.", "french": " Et n’était-ce la grâce d’Allāh sur vous et Sa miséricorde, et le fait qu’Allāh revient sans cesse avec compassion et est Sage, vous auriez été en détresse .", "german": " Wäre nicht Allahs Huld und Seine Barmherzigkeit über euch und (wäre es nicht) dass Allah vielvergebend, allweise ist (ihr wäret verloren gewesen).", "spanish": " Y si no fuera por la gracia de Al‑lah y Su Misericordia con voso­tros, y por el hecho de que Al‑lah es Compasivo y Sabio, os habríais ape­sadumbrado.", "urdu": " اور اگر اللہ کا فضل اور اس کی رحمت تم پر نہ ہوتی اور یہ نہ ہوتا کہ اللہ بڑا فضل کرنے والا (اور) بڑی حکمتوں والا ہے (تو تم لوگ تباہی میں پڑجاتے)"}, {"arabic": " اِنَّ الَّذِیۡنَ جَآءُوۡ بِالۡاِفۡکِ عُصۡبَۃٌ مِّنۡکُمۡ ؕ لَا تَحۡسَبُوۡہُ شَرًّا لَّکُمۡ ؕ بَلۡ ہُوَ خَیۡرٌ لَّکُمۡ ؕ لِکُلِّ امۡرِیًٴ مِّنۡہُمۡ مَّا اکۡتَسَبَ مِنَ الۡاِثۡمِ ۚ وَ الَّذِیۡ تَوَلّٰی کِبۡرَہٗ مِنۡہُمۡ لَہٗ عَذَابٌ عَظِیۡمٌ ﴿۱۲﴾", "english": " Verily, those who brought forth the lie are a party from among you. Think it not to be an evil for you; nay, it is good for you. Every one of them shall have his share of what he has earned of the sin; and he among them who took the chief part therein shall have a grievous punishment.", "french": " En vérité, ceux qui inventèrent le mensonge sont un groupe de parmi vous. Ne croyez pas que ce soit une mauvaise chose pour vous ; au contraire, c’est un bien pour vous. Chacun d’entre eux aura sa part de ce qu’il s’est acquis du péché et celui d’entre eux qui y a joué le rôle principal recevra un très grand châtiment.", "german": " Diejenigen, welche die große Lüge vorbrachten, sind eine Gruppe unter euch. Glaubt nicht, es sei ein Übel für euch; im Gegenteil, es ist euch zum Guten. Jedem von ihnen soll die Vergeltung für die Sünde, die er begangen hat; und der unter ihnen, der den Hauptanteil daran hatte, soll eine schwere Strafe erleiden.", "spanish": " En verdad, quienes lanzaron la mentira son un grupo de entre vosotros. No penséis que sea un mal para vosotros; no, es un bien. Cada uno de ellos tendrá su parte en lo que ha conseguido del pecado; y el que haya tomado la parte principal de él sufrirá un doloroso castigo.", "urdu": " یقیناً وہ لوگ جنہوں نے ایک بڑا اتہام باندھا تھا۔ تمہیں میں سے ایک گروہ ہے تم اس (فعل) کو اپنے لئے برا نہ سمجھو بلکہ وہ تمہارے لئے بہت اچھا تھا (کیونکہ اس کی وجہ سے ایک پرحکمت تعلیم تم کو مل گئی) ان میں سے ہر شخص کو اس نے جتنا گناہ کیا تھا اس کی سزا مل جائے گی اور جو شخص اس گناہ کے بڑے حصے کا ذمہ وار تھا اس کو بہت بڑا عذاب ملے گا۔"}, {"arabic": " لَوۡ لَاۤ اِذۡ سَمِعۡتُمُوۡہُ ظَنَّ الۡمُؤۡمِنُوۡنَ وَ الۡمُؤۡمِنٰتُ بِاَنۡفُسِہِمۡ خَیۡرًا ۙ وَّ قَالُوۡا ہٰذَاۤ اِفۡکٌ مُّبِیۡنٌ ﴿۱۳﴾", "english": " Why did not the believing men and believing women, when you heard of it, think well of their own people, and say, ‘This is a manifest lie?’", "french": " Pourquoi les croyants et les croyantes, quand vous avez entendu parler de l’affaire, n’avez-vous pas pensé du bien de vos propres gens, et dit : « Ceci est un mensonge manifeste. » ?", "german": "", "spanish": " ¿Por qué los hombres y mu­jeres creyentes, cuando oyeron hablar de ello, no pensaron bien de sus propias gentes, y dijeron: es una mentira evidente\"?</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Warum dachten die gläubigen Männer und Frauen, als ihr es hörtet, nicht Gutes von ihren eigenen Leuten und sprachen: \"Das ist eine offenkundige Lüge.\"?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=24:13&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=24:13&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic14\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic14\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/24:14' style='text-decoration:underline'>24:14</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(14)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control14\"></i></button> <audio id=\"player14\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَوۡ لَا جَآءُوۡ عَلَیۡہِ بِاَرۡبَعَۃِ شُہَدَآءَ ۚ فَاِذۡ لَمۡ یَاۡتُوۡا بِالشُّہَدَآءِ فَاُولٰٓئِکَ عِنۡدَ اللّٰہِ ہُمُ الۡکٰذِبُوۡنَ ﴿۱۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">Why did they not bring four witnesses to <em>prove </em>it? Since they have not brought the <em>required</em> witnesses, they are indeed liars in the sight of Allah!</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> Why did not those, <i>who gave currency to this charge</i>, bring four witnesses to <i>prove </i>it? Since they have not brought the <i>required </i>witnesses, they are indeed liars in the sight of Allah.<sup class='ref'>[<a class='ref' data-id='ref_24_14_2034' href='#'>2034</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_24_14_2034'>2034</span></div> <div><a name='2034'></a><div class='reference' data-id='ref_24_14_2034' style='display:none'> <p><b>2034.</b> He, who accuses a Muslim man or woman of adultery and does not produce four witnesses to prove his allegation, shall be held to be a liar and treated as such by the Islamic Law if he can produce only one, two or even three persons as eyewitnesses to the act. The fact of one person seeing another person committing this immoral act does not entitle him to go about spreading the evil report. (<a href='javascript:void(0)' data-id='ref_24_14_2034' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\"> کیوں نہ وہ اس بارہ میں چار گواہ لے آئے۔ پس جب وہ گواہ نہیں لائے تو وہی ہیں جو اللہ کے نزدیک جھوٹے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور کیوں نہ وہ لوگ (جنہوں نے یہ جھوٹ پھیلایا تھا) اس پر چار گواہ لائے پس جبکہ وہ گواہ نہیں لائے تو اللہ کے فیصلہ کے مطابق وہ جھوٹے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Pourquoi n’ont-ils pas produit quatre témoins pour le <em>prouver</em> ? Puisqu’ils n’ont pas produit les témoins <em>nécessaires</em>, ceux-là sont donc les menteurs aux yeux d’Allāh !</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">¿Por qué no presentaron cua­tro testigos para<em>demostrarlo? </em>¡Dado que no han presentado los testigos <em>requeridos, </em>son en verdad embus­teros a los ojos de Al‑lah!</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Warum brachten sie nicht vier Zeugen dafür? Da sie keine Zeugen gebracht haben, sind sie es also, die vor Allah die Lügner sind.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=24:14&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=24:14&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic15\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic15\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/24:15' style='text-decoration:underline'>24:15</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(15)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control15\"></i></button> <audio id=\"player15\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ لَمَسَّکُمۡ فِیۡ مَاۤ اَفَضۡتُمۡ فِیۡہِ عَذَابٌ عَظِیۡمٌ ﴿ۚۖ۱۵﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">Were it not for the grace of Allah and His mercy upon you, in this world and the Hereafter, a great punishment would have befallen you for <em>the slander </em>into which you plunged.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_24_15_a' href='#'>a</a>]</sup>Were it not for the grace of Allah and His mercy upon you, in this world and the Hereafter, a great punishment would have befallen you on account of <i>the slander </i>you plunged in; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_24_15_a'>a</span></div> <div><div class='reference' data-id='ref_24_15_a' style='display:none'> <p><b>a.</b> <a href='/quran/2:65' target=_blank>2:65</a>; <a href='/quran/4:84' target=_blank>4:84</a>. (<a href='javascript:void(0)' data-id='ref_24_15_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اگر دنیا اور آخرت میں تم پر اللہ کا فضل اور اس کی رحمت نہ ہوتے تو اس (فتنہ) کے نتیجہ میں جس میں تم پڑ گئے تھے ضرور تمہیں ایک بہت بڑا عذاب آ لیتا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اگر اللہ کا فضل اور رحمت تم پر دنیا اور آخرت میں نہ ہوتے تو تم کو اس کام (کی وجہ) سے جس میں تم پڑ گئے تھے بہت بڑا عذاب پہنچتا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et n’était-ce la grâce d’Allāh sur vous et Sa miséricorde, dans ce monde et dans l’au-delà, un très grand châtiment vous aurait frappé pour la <em>calomnie</em> dans laquelle vous vous êtes plongés,</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">De no haber sido por la gracia de Al‑lah y su misericordia con vo­sotros, en este mundo y en el Más Allá, un gran castigo habría caído sobre vosotros por <em>la calumnia </em>en la que caísteis;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wäre nicht Allahs Huld und Seine Barmherzigkeit über euch, hienieden und im Jenseits, eine schwere Strafe hätte euch getroffen für das, worin ihr euch einließet.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=24:15&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=24:15&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic16\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic16\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/24:16' style='text-decoration:underline'>24:16</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(16)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control16\"></i></button> <audio id=\"player16\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِذۡ تَلَقَّوۡنَہٗ بِاَلۡسِنَتِکُمۡ وَ تَقُوۡلُوۡنَ بِاَفۡوَاہِکُمۡ مَّا لَیۡسَ لَکُمۡ بِہٖ عِلۡمٌ وَّ تَحۡسَبُوۡنَہٗ ہَیِّنًا ٭ۖ وَّ ہُوَ عِنۡدَ اللّٰہِ عَظِیۡمٌ ﴿۱۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">When you received it <I>and then talked about it </I>with your tongues, and you uttered with your mouths that of which you had no knowledge, and you thought it to be a light matter, while in the sight of Allah it was <em>a </em>grievous <em>thing</em>.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> For, you began to learn it from each other’s tongue and <i>then </i>you uttered with your mouths that of which you had no knowledge, and you thought it to be a light <i>matter</i>, while in the sight of Allah it was a grievous <i>thing</i>. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">جب تم اُس (جھوٹ) کو اپنی زبانوں پر لیتے تھے اور اپنے مونہوں سے وہ کہتے تھے جس کا تمہیں کوئی علم نہیں تھا اور تم اس کو معمولی بات سمجھتے تھے حالانکہ اللہ کے نزدیک وہ بہت بڑی تھی۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اس وجہ سے کہ) تم اس (بات) کو ایک دوسرے سے لیکر زبان در زبان اچھالتے چلے گئے اور اپنے مونہوں سے وہ بات کہنے لگ گئے جس کا تم کو کوئی علم نہیں تھا (خدا تم پر ناراض ہوا) اور تم اس بات کو معمولی سمجھتے تھے حالانکہ وہ اللہ کے نزدیک بہت بڑی تھی۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Lorsque vous reprenez la parole propagée par vos langues et commencez à prononcer de vos bouches ce dont vous n’avez aucune connaissance <em>réelle</em> et le considérez comme sans grande importance, alors qu’aux yeux d’Allāh c’est une chose extrêmement grave.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Cuando recogisteis la pala­bra emitida por vuestras lenguas y la proferisteis por vuestras bocas, sin tener conocimiento real de ello, y pensando que era un asunto sin importancia, cuando ante los ojos de Al‑lah, se trataba de una enormidad<em>.</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Als ihr es übernahmt mit euren Zungen und ihr mit eurem Munde das aussprachet, wovon ihr keine Kenntnis hattet, da hieltet ihr es für eine geringe Sache, indes es vor Allah eine große war.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=24:16&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=24:16&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic17\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic17\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/24:17' style='text-decoration:underline'>24:17</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(17)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control17\"></i></button> <audio id=\"player17\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَوۡ لَاۤ اِذۡ سَمِعۡتُمُوۡہُ قُلۡتُمۡ مَّا یَکُوۡنُ لَنَاۤ اَنۡ نَّتَکَلَّمَ بِہٰذَا ٭ۖ سُبۡحٰنَکَ ہٰذَا بُہۡتَانٌ عَظِیۡمٌ ﴿۱۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And wherefore did you not say, when you heard of it, ‘It is not proper for us to talk about it. Holy art Thou, <em>O God</em>, this is a grievous calumny!’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And wherefore did you not say, when you heard of it, ‘It is not proper for us to talk about it. Holy art Thou, <i>O God</i>, this is a grievous calumny.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ایسا کیوں نہ ہوا کہ جب تم نے اسے سُنا تو تم کہہ دیتے ہمیں کوئی حق نہیں کہ ہم اس معاملے میں زبان کھولیں۔ پاک ہے تُو (اے اللہ!)۔ یہ تو ایک بہت بڑا بہتان ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور کیوں نہ ہوا کہ جب تم نے اس بات کو سنا تھا تو فوراً کہہ دیا کہ یہ ہمارا کام نہیں کہ ہم اس بات کو آگے دہرائیں‘ اے خدا تو پاک ہے یہ بہت بڑا بہتان ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et pourquoi, quand vous l’avez apprise, n’avez-vous pas dit : « Il ne nous convient pas d’en parler. Saint es-Tu, <em>ô Allāh</em>, ceci est une grave calomnie ! » ?</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">¿Y por qué no dijisteis, cuando lo oísteis: \"no nos corresponde hablar sobre ello. ¡Santo eres Tú, oh Dios,", "urdu": " جب تم نے یہ بات سنی تھی تو کیوں نہ مومن مردوں اور مومن عورتوں نے اپنی قوم کے متعلق نیک گمان کیا اور یہ کہہ دیا کہ یہ تو ایک بہت بڑا جھوٹ ہے۔"}, {"arabic": " لَوۡ لَا جَآءُوۡ عَلَیۡہِ بِاَرۡبَعَۃِ شُہَدَآءَ ۚ فَاِذۡ لَمۡ یَاۡتُوۡا بِالشُّہَدَآءِ فَاُولٰٓئِکَ عِنۡدَ اللّٰہِ ہُمُ الۡکٰذِبُوۡنَ ﴿۱۴﴾", "english": " Why did they not bring four witnesses to prove it? Since they have not brought the required witnesses, they are indeed liars in the sight of Allah!", "french": " Pourquoi n’ont-ils pas produit quatre témoins pour le prouver ? Puisqu’ils n’ont pas produit les témoins nécessaires , ceux-là sont donc les menteurs aux yeux d’Allāh !", "german": " Warum brachten sie nicht vier Zeugen dafür? Da sie keine Zeugen gebracht haben, sind sie es also, die vor Allah die Lügner sind.", "spanish": " ¿Por qué no presentaron cua­tro testigos para demostrarlo? ¡Dado que no han presentado los testigos requeridos, son en verdad embus­teros a los ojos de Al‑lah!", "urdu": " اور کیوں نہ وہ لوگ (جنہوں نے یہ جھوٹ پھیلایا تھا) اس پر چار گواہ لائے پس جبکہ وہ گواہ نہیں لائے تو اللہ کے فیصلہ کے مطابق وہ جھوٹے ہیں۔"}, {"arabic": " وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ لَمَسَّکُمۡ فِیۡ مَاۤ اَفَضۡتُمۡ فِیۡہِ عَذَابٌ عَظِیۡمٌ ﴿ۚۖ۱۵﴾", "english": " Were it not for the grace of Allah and His mercy upon you, in this world and the Hereafter, a great punishment would have befallen you for the slander into which you plunged.", "french": " Et n’était-ce la grâce d’Allāh sur vous et Sa miséricorde, dans ce monde et dans l’au-delà, un très grand châtiment vous aurait frappé pour la calomnie dans laquelle vous vous êtes plongés,", "german": " Wäre nicht Allahs Huld und Seine Barmherzigkeit über euch, hienieden und im Jenseits, eine schwere Strafe hätte euch getroffen für das, worin ihr euch einließet.", "spanish": " De no haber sido por la gracia de Al‑lah y su misericordia con vo­sotros, en este mundo y en el Más Allá, un gran castigo habría caído sobre vosotros por la calumnia en la que caísteis;", "urdu": " اور اگر اللہ کا فضل اور رحمت تم پر دنیا اور آخرت میں نہ ہوتے تو تم کو اس کام (کی وجہ) سے جس میں تم پڑ گئے تھے بہت بڑا عذاب پہنچتا۔"}, {"arabic": " اِذۡ تَلَقَّوۡنَہٗ بِاَلۡسِنَتِکُمۡ وَ تَقُوۡلُوۡنَ بِاَفۡوَاہِکُمۡ مَّا لَیۡسَ لَکُمۡ بِہٖ عِلۡمٌ وَّ تَحۡسَبُوۡنَہٗ ہَیِّنًا ٭ۖ وَّ ہُوَ عِنۡدَ اللّٰہِ عَظِیۡمٌ ﴿۱۶﴾", "english": " When you received it and then talked about it with your tongues, and you uttered with your mouths that of which you had no knowledge, and you thought it to be a light matter, while in the sight of Allah it was a grievous thing .", "french": " Lorsque vous reprenez la parole propagée par vos langues et commencez à prononcer de vos bouches ce dont vous n’avez aucune connaissance réelle et le considérez comme sans grande importance, alors qu’aux yeux d’Allāh c’est une chose extrêmement grave.", "german": " Als ihr es übernahmt mit euren Zungen und ihr mit eurem Munde das aussprachet, wovon ihr keine Kenntnis hattet, da hieltet ihr es für eine geringe Sache, indes es vor Allah eine große war.", "spanish": " Cuando recogisteis la pala­bra emitida por vuestras lenguas y la proferisteis por vuestras bocas, sin tener conocimiento real de ello, y pensando que era un asunto sin importancia, cuando ante los ojos de Al‑lah, se trataba de una enormidad .", "urdu": " (اس وجہ سے کہ) تم اس (بات) کو ایک دوسرے سے لیکر زبان در زبان اچھالتے چلے گئے اور اپنے مونہوں سے وہ بات کہنے لگ گئے جس کا تم کو کوئی علم نہیں تھا (خدا تم پر ناراض ہوا) اور تم اس بات کو معمولی سمجھتے تھے حالانکہ وہ اللہ کے نزدیک بہت بڑی تھی۔"}, {"arabic": " وَ لَوۡ لَاۤ اِذۡ سَمِعۡتُمُوۡہُ قُلۡتُمۡ مَّا یَکُوۡنُ لَنَاۤ اَنۡ نَّتَکَلَّمَ بِہٰذَا ٭ۖ سُبۡحٰنَکَ ہٰذَا بُہۡتَانٌ عَظِیۡمٌ ﴿۱۷﴾", "english": " And wherefore did you not say, when you heard of it, ‘It is not proper for us to talk about it. Holy art Thou, O God , this is a grievous calumny!’", "french": " Et pourquoi, quand vous l’avez apprise, n’avez-vous pas dit : « Il ne nous convient pas d’en parler. Saint es-Tu, ô Allāh , ceci est une grave calomnie ! » ?", "german": " Und warum sprachet ihr nicht, als ihr es hörtet: \"Es kommt uns nicht zu, darüber zu reden. Heilig bist Du! Dies ist eine arge Verleumdung.\"?", "spanish": " ¿Y por qué no dijisteis, cuando lo oísteis: \"no nos corresponde hablar sobre ello. ¡Santo eres <em>Tú, oh Dios, </em>ésta es una grave calumnia!\"", "urdu": " اور کیوں نہ ہوا کہ جب تم نے اس بات کو سنا تھا تو فوراً کہہ دیا کہ یہ ہمارا کام نہیں کہ ہم اس بات کو آگے دہرائیں‘ اے خدا تو پاک ہے یہ بہت بڑا بہتان ہے۔"}, {"arabic": " یَعِظُکُمُ اللّٰہُ اَنۡ تَعُوۡدُوۡا لِمِثۡلِہٖۤ اَبَدًا اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿ۚ۱۸﴾", "english": " Allah admonishes you never to return to the like thereof, if you are believers.", "french": " Allāh vous exhorte à ne jamais retourner à une chose pareille, si vous êtes croyants.", "german": " Allah ermahnt euch, nie wieder dergleichen zu begehen, wenn ihr Gläubige seid.", "spanish": " Al‑lah os exhorta a que no reincidáis nunca en nada semejante, si sois creyentes.", "urdu": " اللہ تم کو اس قسم کی بات کے دوبارہ کرنے سے ہمیشہ کے لئے روکتا ہے‘ اگر تم مومن ہو۔"}, {"arabic": " وَ یُبَیِّنُ اللّٰہُ لَکُمُ الۡاٰیٰتِ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۱۹﴾", "english": " And Allah explains to you the commandments; and Allah is All- Knowing, Wise.", "french": " Et Allāh vous explique les commandements ; et Allāh est Omniscient, Sage.", "german": " Und Allah erklärt euch die Gebote; denn Allah ist allwissend, allweise.", "spanish": " Pues Al‑lah os explica los mandamientos; y Al‑lah es Omnis­ciente, Sabio.", "urdu": " اور اللہ تمہارے لئے اپنے احکام بیان کرتا ہے اور اللہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یُحِبُّوۡنَ اَنۡ تَشِیۡعَ الۡفَاحِشَۃُ فِی الَّذِیۡنَ اٰمَنُوۡا لَہُمۡ عَذَابٌ اَلِیۡمٌ ۙ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ؕ وَ اللّٰہُ یَعۡلَمُ وَ اَنۡتُمۡ لَا تَعۡلَمُوۡنَ ﴿۲۰﴾", "english": " Those who love that immorality should spread among the believers, will have a painful punishment in this world and the Hereafter. And Allah knows, and you know not.", "french": " Ceux qui aiment que l’immoralité se répande parmi les croyants, auront un châtiment douloureux dans ce monde ainsi que dans l’au-delà. Et Allāh sait, et vous ne savez pas.", "german": " Jenen, die wünschen, dass Unsittlichkeit unter den Gläubigen sich verbreite, wird hienieden und im Jenseits schmerzliche Strafe. Allah weiß, und ihr wisset nicht.", "spanish": " Quienes desean que la inmo­ralidad se extienda entre los cre­yentes, sufrirán un doloroso castigo en este mundo y en el Más Allá. Porque Al‑lah sabe y vosotros ig­noráis.", "urdu": " یقیناً جو لوگ چاہتے ہیں کہ مومنوں میں بدی پھیل جائے ان کے لئے بڑا دردناک عذاب ہے دنیا میں بھی اور آخرت میں بھی اور اللہ جانتا ہے اور تم نہیں جانتے۔"}, {"arabic": " وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ وَ اَنَّ اللّٰہَ رَءُوۡفٌ رَّحِیۡمٌ ﴿٪۲۱﴾", "english": " And but for the grace of Allah and His mercy upon you and the fact that Allah is Compassionate and Merciful, you would have been ruined .", "french": " Et n’était-ce la grâce d’Allāh sur vous et Sa miséricorde et le fait qu’Allāh est Compatissant et Miséricordieux, vous auriez été ruinés .", "german": " Wäre nicht Allahs Huld und Seine Barmherzigkeit über euch und dass Allah gütig, erbarmend ist (ihr wäret zugrunde gegangen).", "spanish": " Y de no ser por la gracia de Al‑lah, Su misericordia con vosotros y por el hecho de que Al‑lah es Compa­sivo y Misericordioso, habríais que­dado perdidos.", "urdu": " اور اگر اللہ کا فضل اور رحم تم پر نہ ہوتا اور اگر اللہ بہت مہربان (اور) باربار رحم کرنے والا نہ ہوتا (تو تم دکھ میں پڑجاتے)۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَّبِعُوۡا خُطُوٰتِ الشَّیۡطٰنِ ؕ وَ مَنۡ یَّتَّبِعۡ خُطُوٰتِ الشَّیۡطٰنِ فَاِنَّہٗ یَاۡمُرُ بِالۡفَحۡشَآءِ وَ الۡمُنۡکَرِ ؕ وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ مَا زَکٰی مِنۡکُمۡ مِّنۡ اَحَدٍ اَبَدًا ۙ وَّ لٰکِنَّ اللّٰہَ یُزَکِّیۡ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۲۲﴾", "english": " O ye who believe! follow not the footsteps of Satan, and whoso follows the footsteps of Satan should know that he surely enjoins immorality and manifest evil. And but for the grace of Allah and His mercy upon you, not one of you would ever be pure, but Allah purifies whom He pleases. And Allah is All-Hearing, All-Knowing.", "french": " Ô vous qui croyez ! Ne suivez pas les pas de Satan, et quiconque suit les pas de Satan doit savoir que celui-ci enjoint assurément l’immoralité et le mal manifeste. Et si ce n’était la grâce d’Allāh sur vous et Sa miséricorde, pas un seul de vous ne serait jamais pur ; mais Allāh purifie qui Il veut. Et Allāh entend tout et sait tout.", "german": " O die ihr glaubt, folget nicht den Fußstapfen Satans. Und wer den Fußstapfen Satans folgt – er gebietet gewiss Schändliches und Unrechtes. Und wäre nicht Allahs Huld und Seine Barmherzigkeit über euch, nicht einer von euch wäre je rein geworden; doch Allah spricht rein, wen Er will. Und Allah ist allhörend, allwissend.", "spanish": " ¡Oh, vosotros, los que creéis! no sigáis las huellas de Satanás, pues quienes siguen las huellas de Satanás, han de saber que él reco­mienda ciertamente la inmoralidad y la perversidad manifiesta. Pues de no ser por la gracia de Al‑lah y Su Misericordia para con vosotros, nin­guno de vosotros hubiese sido nunca puro; pero Al‑lah purifica a quien Le agrada. Al‑lah es Quien Todo lo oye, Omnisciente.", "urdu": " اے مومنو! شیطان کے قدموں پر مت چلو۔ اور جو کوئی شیطان کے قدموں پر چلتا ہے تو وہ جان لے کہ شیطان بدیوں اور ناپسندیدہ باتوں کا حکم دیتا ہے اور اگر اللہ کا فضل اور رحم تم پر نہ ہوتا تو کبھی بھی تم میں سے کوئی پاکباز نہ ہوتا۔ لیکن اللہ جس کو چاہتا ہے پاکباز بنا دیتا ہے اور اللہ بہت دعائیں سننے والا بہت جاننے والا ہے۔"}, {"arabic": " وَ لَا یَاۡتَلِ اُولُوا الۡفَضۡلِ مِنۡکُمۡ وَ السَّعَۃِ اَنۡ یُّؤۡتُوۡۤا اُولِی الۡقُرۡبٰی وَ الۡمَسٰکِیۡنَ وَ الۡمُہٰجِرِیۡنَ فِیۡ سَبِیۡلِ اللّٰہِ ۪ۖ وَ لۡیَعۡفُوۡا وَ لۡیَصۡفَحُوۡا ؕ اَلَا تُحِبُّوۡنَ اَنۡ یَّغۡفِرَ اللّٰہُ لَکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۲۳﴾", "english": " And let not those who possess wealth and plenty among you swear not to give aught to the kindred and to the needy and to those who have left their homes in the cause of Allah. Let them forgive and pass over the offence . Do you not desire that Allah should forgive you? And Allah is Most Forgiving, Merciful.", "french": " Et que ceux d’entre vous qui possèdent des moyens et de l’abondance ne jurent pas qu’ils ne donneront point aux parents proches et aux nécessiteux, et à ceux qui ont émigré pour la cause d’Allāh. Qu’ils pardonnent et montrent de la tolérance. Ne désirez-vous pas qu’Allāh vous pardonne ? Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und die unter euch, die Reichtum und Überfluss besitzen, sollen nicht schwören, den Anverwandten und den Bedürftigen und den auf Allahs Pfad Ausgewanderten nicht zu geben. Sie sollen vergeben und verzeihen. Wünscht ihr nicht, dass Allah euch vergebe? Und Allah ist allvergebend, barmherzig.", "spanish": " Y que aquellos de entre vosotros que poseen medios y riqueza no juren retirar su ayuda a los parientes y a los necesitados, así como a quie­nes han abandonado sus casas por la causa de Al‑lah. Que perdonen y se abstengan. ¿No deseáis que Al‑lah os perdone? Pues Al‑lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور تم میں سے (دین و دنیا میں) فضیلت رکھنے والے اور کشائش رکھنے والے لوگ قسم نہ کھائیں کہ اپنے رشتہ داروں اور مسکینوں اور اللہ کے راستہ میں ہجرت کرنے والوں کی مدد نہ کریں گے اور چاہیئے کہ وہ عفو سے کام لیں اور درگذر کریں کیا تم نہیں چاہتے کہ اللہ تمہارے قصور معاف کرے۔ اور اللہ بہت معاف کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یَرۡمُوۡنَ الۡمُحۡصَنٰتِ الۡغٰفِلٰتِ الۡمُؤۡمِنٰتِ لُعِنُوۡا فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۪ وَ لَہُمۡ عَذَابٌ عَظِیۡمٌ ﴿ۙ۲۴﴾", "english": " Verily, those who accuse chaste, unwary, believing women are cursed in this world and the Hereafter. And for them is a grievous chastisement,", "french": " En vérité, ceux qui calomnient les femmes chastes, sans méfiance et croyantes, sont maudits dans ce monde et dans l’au-delà. Et pour eux il y aura un très grand châtiment,", "german": " Diejenigen, welche züchtige, ahnungslose, gläubige Frauen verleumden, sind verflucht hienieden und im Jenseits. Ihrer harrt schwere Strafe", "spanish": " En verdad, aquellos que acusan a las mujeres castas, inocen­tes y creyentes, son malditos en este mundo y en el Más Allá. Y para ellos habrá el más severo castigo,", "urdu": " وہ لوگ جو کہ پاک دامن عورتوں پر الزام لگاتے ہیں۔ جو (شریروں کی شرارت سے) غافل ہیں اور ایمان دار ہیں ان پر دنیا اور آخرت میں لعنت کی جائے گی اور ان کے لئے بڑا عذاب ہوگا۔"}, {"arabic": " یَّوۡمَ تَشۡہَدُ عَلَیۡہِمۡ اَلۡسِنَتُہُمۡ وَ اَیۡدِیۡہِمۡ وَ اَرۡجُلُہُمۡ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۲۵﴾", "english": " On the day when their tongues and their hands and their feet will bear witness against them as to what they used to do.", "french": " Le jour où leur langue et leurs mains et leurs pieds porteront témoignage contre eux sur ce qu’ils faisaient.", "german": " an dem Tage, wo ihre Zungen und ihre Hände und ihre Füße wider sie zeugen werden von dem, was sie getan.", "spanish": " En el día en que sus lenguas, manos y pies sean testigos contra ellos de lo que solían hacer.", "urdu": " اس دن جبکہ ان کی زبانیں بھی اور ان کے ہاتھ بھی اور ان کے پاٶں بھی ان کے ان اعمال کے متعلق جو وہ کرتے تھے ان کے خلاف گواہی دیں گے۔"}, {"arabic": " یَوۡمَئِذٍ یُّوَفِّیۡہِمُ اللّٰہُ دِیۡنَہُمُ الۡحَقَّ وَ یَعۡلَمُوۡنَ اَنَّ اللّٰہَ ہُوَ الۡحَقُّ الۡمُبِیۡنُ ﴿۲۶﴾", "english": " On that day will Allah pay them their just due, and they will know that Allah alone is the Manifest Truth.", "french": " Ce jour-là Allāh leur paiera exactement ce qui leur est dû, et ils sauront qu’Allāh Seul est la Vérité Manifeste.", "german": " An dem Tage wird Allah ihnen heimzahlen nach Gebühr, und sie werden erfahren, dass Allah allein die lautere Wahrheit ist.", "spanish": " En ese día, Al‑lah les pagará lo que se merecen, y sabrán que sólo Al‑lah es la Verdad Manifiesta.", "urdu": " اس دن اللہ ان کو ان کا صحیح بدلہ دے گا اور وہ جان لیں گے کہ اللہ ہی صدق کامل ہے ایسا صدق جو اپنے آپ کو آپ ظاہر کر دیتا ہے۔"}, {"arabic": " اَلۡخَبِیۡثٰتُ لِلۡخَبِیۡثِیۡنَ وَ الۡخَبِیۡثُوۡنَ لِلۡخَبِیۡثٰتِ ۚ وَ الطَّیِّبٰتُ لِلطَّیِّبِیۡنَ وَ الطَّیِّبُوۡنَ لِلطَّیِّبٰتِ ۚ اُولٰٓئِکَ مُبَرَّءُوۡنَ مِمَّا یَقُوۡلُوۡنَ ؕ لَہُمۡ مَّغۡفِرَۃٌ وَّ رِزۡقٌ کَرِیۡمٌ ﴿٪۲۷﴾", "english": " Bad things are for bad men, and bad men are for bad things. And good things are for good men, and good men are for good things; these are innocent of all that they (calumniators) allege. For them is forgiveness and an honourable provision.", "french": " Les mauvaises choses sont pour les mauvais hommes, et les mauvais hommes sont enclins aux mauvaises choses. Et les bonnes choses caractérisent les hommes justes, et les hommes justes sont enclins aux bonnes choses. Ceux-là sont innocents de tout ce qu’allèguent les calomniateurs . Pour eux, il y aura le pardon et une provision honorable.", "german": " Schlechte Dinge sind für schlechte Menschen, und schlechte Menschen sind für schlechte Dinge. Und gute Dinge sind für gute Menschen, und gute Menschen sind für gute Dinge; sie sind frei von all dem, was sie (die Verleumder) sprechen. Ihrer harrt Vergebung und eine ehrenvolle Versorgung.", "spanish": " Las mujeres malvadas mere­cen hombres malvados y los hombres malvados merecen mujeres malvadas; y los hombres buenos merecen mujeres buenas y las mujeres buenas hombres buenos; ésos son ino­centes de todo lo que ellos (los calum­niadores) alegan. Para ellos será el perdón y una provisión honorable.", "urdu": " خبیث باتیں خبیث مردوں کے لئے ہیں اور خبیث مرد خبیث باتوں کے لئے ہیں اور پاک باتیں پاک مردوں کے لئے ہیں اور پاک مرد پاک باتوں کے لئے ہیں۔ یہ سب لوگ ان باتوں سے جو (دشمن) کہتے ہیں پاک ہیں۔ ان کے لئے بخشش اور معزز رزق (مقدر) ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَدۡخُلُوۡا بُیُوۡتًا غَیۡرَ بُیُوۡتِکُمۡ حَتّٰی تَسۡتَاۡنِسُوۡا وَ تُسَلِّمُوۡا عَلٰۤی اَہۡلِہَا ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ لَعَلَّکُمۡ تَذَکَّرُوۡنَ ﴿۲۸﴾", "english": " O ye who believe! enter not houses other than your own until you have asked leave and saluted the inmates thereof. That is better for you, that you may be heedful.", "french": " Ô vous qui croyez ! N’entrez pas dans des maisons autres que les vôtres sans en avoir demandé la permission et sans avoir salué leurs occupants. Cela vaut mieux pour vous, afin que vous preniez garde.", "german": " O die ihr glaubt, betretet nicht andere Häuser als die euren, bevor ihr um Erlaubnis gebeten und ihre Bewohner begrüßt habt. Das ist besser für euch, auf dass ihr achtsam seiet.", "spanish": " ¡Oh, vosotros, los que creéis! no entréis en otra casa que no sea la vuestra, mientras no hayáis pedido permiso y saludado a sus moradores. Esto es lo mejor para vosotros, que estéis atentos.", "urdu": " اے مومنو! اپنے گھروں کے سوا دوسرے گھروں میں نہ داخل ہوا کرو جب تک کہ اجازت نہ لے لو۔ اور (داخل ہونے سے پہلے) ان گھروں میں بسنے والوں کو سلام نہ کر لو۔ یہ تمہارے لئے اچھا ہوگا اور اس (فعل) کا نتیجہ یہ ہوگا کہ تم (نیک باتوں کو ہمیشہ) یاد رکھو گے۔"}, {"arabic": " فَاِنۡ لَّمۡ تَجِدُوۡا فِیۡہَاۤ اَحَدًا فَلَا تَدۡخُلُوۡہَا حَتّٰی یُؤۡذَنَ لَکُمۡ ۚ وَ اِنۡ قِیۡلَ لَکُمُ ارۡجِعُوۡا فَارۡجِعُوۡا ہُوَ اَزۡکٰی لَکُمۡ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ عَلِیۡمٌ ﴿۲۹﴾", "english": " And if you find no one therein, do not enter them until you are given permission. And if it be said to you, ‘Go back’ then go back; that is purer for you. And Allah knows well what you do.", "french": " Et si vous n’y trouvez personne, n’y entrez pas, avant que l’on ne vous en donne la permission. Et s’il vous est dit : « Retirez-vous, » alors retirez-vous ; cela est plus pur pour vous. Et Allāh sait très bien ce que vous faites.", "german": "", "spanish": "", "urdu": " اور اگر تم ان گھروں میں کسی کو نہ پاٶ‘تب بھی ان میں داخل نہ ہو جب تک کہ تمہیں (گھر والوں کی طرف سے) اجازت نہ مل گئی ہو۔ اور اگر (کوئی گھر میں ہو اور) تم سے کہا جائے کہ اس وقت چلے جاٶ تو تم چلے آٶ‘ یہ تمہارے لئے زیادہ پاکیزہ ہوگا‘ اور اللہ تمہارے کاموں کو خوب جانتا ہے۔"}, {"arabic": " لَیۡسَ عَلَیۡکُمۡ جُنَاحٌ اَنۡ تَدۡخُلُوۡا بُیُوۡتًا غَیۡرَ مَسۡکُوۡنَۃٍ فِیۡہَا مَتَاعٌ لَّکُمۡ ؕ وَ اللّٰہُ یَعۡلَمُ مَا تُبۡدُوۡنَ وَ مَا تَکۡتُمُوۡنَ ﴿۳۰﴾", "english": " It is no sin on your part to enter uninhabited houses wherein are your goods. And Allah knows what you reveal and what you conceal.", "french": " Ce n’est pas un péché de votre part que d’entrer dans des maisons inhabitées où se trouvent vos biens. Et Allāh sait ce que vous révélez et ce que vous cachez.", "german": " Es ist eurerseits keine Sünde, wenn ihr in unbewohnte Häuser tretet, worin sich eure Güter befinden. Allah weiß, was ihr kundtut und was ihr verhehlt.", "spanish": " No hay pecado alguno para vosotros si entráis en casas deshabi­tadas en las que se encuentren vues­tros bienes. Pues Al‑lah sabe lo que reveláis y lo que ocultáis.", "urdu": " تمہارے لئے ان گھروں میں داخل ہونا گناہ کا موجب نہیں جن میں کوئی رہتا نہیں اور تمہارا سامان اس میں پڑا ہے اور اللہ اسے بھی جانتا ہے جسے تم ظاہر کرتے ہو اور اسے بھی جسے تم چھپاتے ہو۔"}, {"arabic": " قُلۡ لِّلۡمُؤۡمِنِیۡنَ یَغُضُّوۡا مِنۡ اَبۡصَارِہِمۡ وَ یَحۡفَظُوۡا فُرُوۡجَہُمۡ ؕ ذٰلِکَ اَزۡکٰی لَہُمۡ ؕ اِنَّ اللّٰہَ خَبِیۡرٌۢ بِمَا یَصۡنَعُوۡنَ ﴿۳۱﴾", "english": " Say to the believing men that they restrain their eyes and guard their private parts. That is purer for them. Surely, Allah is well aware of what they do.", "french": " Dis aux croyants de restreindre leurs regards et de préserver leurs parties intimes. Cela est plus pur pour eux. Assurément, Allāh est très conscient de ce qu’ils font.", "german": " Sprich zu den gläubigen Männern, dass sie ihre Blicke zu Boden schlagen und ihre Keuschheit wahren sollen. Das ist reiner für sie. Wahrlich, Allah ist recht wohl kundig dessen, was sie tun.", "spanish": " Di a los hombres creyentes que recaten su mirada y guarden sus partes privadas. Esto es más puro para ellos. En verdad, Al‑lah sabe perfectamente lo que hacéis.", "urdu": " تو مومنوں سے کہہ دے کہ وہ اپنی آنکھیں نیچی رکھا کریں اور اپنی شرم گاہوں کی حفاظت کیا کریں‘ یہ ان کے لئے بہت پاکیزگی کا موجب ہوگا۔ جو کچھ وہ کرتے ہیں اللہ اس سے اچھی طرح خبردار ہے۔"}, {"arabic": " وَ قُلۡ لِّلۡمُؤۡمِنٰتِ یَغۡضُضۡنَ مِنۡ اَبۡصَارِہِنَّ وَ یَحۡفَظۡنَ فُرُوۡجَہُنَّ وَ لَا یُبۡدِیۡنَ زِیۡنَتَہُنَّ اِلَّا مَا ظَہَرَ مِنۡہَا وَ لۡیَضۡرِبۡنَ بِخُمُرِہِنَّ عَلٰی جُیُوۡبِہِنَّ ۪ وَ لَا یُبۡدِیۡنَ زِیۡنَتَہُنَّ اِلَّا لِبُعُوۡلَتِہِنَّ اَوۡ اٰبَآئِہِنَّ اَوۡ اٰبَآءِ بُعُوۡلَتِہِنَّ اَوۡ اَبۡنَآئِہِنَّ اَوۡ اَبۡنَآءِ بُعُوۡلَتِہِنَّ اَوۡ اِخۡوَانِہِنَّ اَوۡ بَنِیۡۤ اِخۡوَانِہِنَّ اَوۡ بَنِیۡۤ اَخَوٰتِہِنَّ اَوۡ نِسَآئِہِنَّ اَوۡ مَا مَلَکَتۡ اَیۡمَانُہُنَّ اَوِ التّٰبِعِیۡنَ غَیۡرِ اُولِی الۡاِرۡبَۃِ مِنَ الرِّجَالِ اَوِ الطِّفۡلِ الَّذِیۡنَ لَمۡ یَظۡہَرُوۡا عَلٰی عَوۡرٰتِ النِّسَآءِ ۪ وَ لَا یَضۡرِبۡنَ بِاَرۡجُلِہِنَّ لِیُعۡلَمَ مَا یُخۡفِیۡنَ مِنۡ زِیۡنَتِہِنَّ ؕ وَ تُوۡبُوۡۤا اِلَی اللّٰہِ جَمِیۡعًا اَیُّہَ الۡمُؤۡمِنُوۡنَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿۳۲﴾", "english": " And say to the believing women that they restrain their eyes and guard their private parts, and that they disclose not their natural and artificial beauty except that which is apparent thereof, and that they draw their head-coverings over their bosoms, and that they disclose not their beauty save to their husbands, or to their fathers, or the fathers of their husbands or their sons or the sons of their husbands or their brothers, or the sons of their brothers, or the sons of their sisters, or their women, or what their right hands possess, or such of male attendants as have no sexual appetite, or young children who have no knowledge of the hidden parts of women. And they strike not their feet so that what they hide of their ornaments may become known. And turn ye to Allah all together, O believers, that you may succeed.", "french": " Et dis aux croyantes qu’elles restreignent leurs yeux et veillent sur leurs parties intimes, et elles ne doivent pas exposer leur beauté naturelle et ses parures, excepté ce qui en est apparent de soi, et qu’elles tirent sur leurs poitrines leurs voiles dont elles se couvrent la tête , et elles ne doivent pas exposer leur beauté naturelle et ses parures excepté à leurs maris, ou à leurs pères, ou aux pères de leurs maris, ou à leurs fils, ou aux fils de leurs maris, ou à leurs frères, ou aux fils de leurs frères, ou aux fils de leurs sœurs, ou à leurs femmes, ou à ceux que leurs mains droites possèdent, ou à de tels serviteurs mâles qui sont dépourvus de vils désirs, ou aux jeunes enfants qui n’ont pas encore aucune conscience des parties intimes des femmes. Et qu’elles ne marchent pas avec une telle démarche que des aspects de leur beauté qu’elles dissimulent normalement soient révélés. Et tournez-vous vers Allāh tous ensemble avec repentir, ô croyants, afin que vous puissiez réussir.", "german": " Und sprich zu den gläubigen Frauen, dass sie ihre Blicke zu Boden schlagen und ihre Keuschheit wahren sollen und dass sie ihre Reize nicht zur Schau tragen sollen, bis auf das, was davon sichtbar sein muss, und dass sie ihre Tücher über ihren Busen ziehen sollen und ihre Reize vor niemandem enthüllen als vor ihren Gatten, oder ihren Vätern, oder den Vätern ihrer Gatten, oder ihren Söhnen, oder den Söhnen ihrer Gatten, oder ihren Brüdern, oder den Söhnen ihrer Brüder, oder den Söhnen ihrer Schwestern, oder ihren Frauen, oder denen, die ihre Rechte besitzen, oder solchen von ihren männlichen Dienern, die keinen Geschlechtstrieb haben, und den Kindern, die von der Blöße der Frauen nichts wissen. Und sie sollen ihre Füße nicht zusammenschlagen, so dass bekannt wird, was sie von ihrem Zierat verbergen. Und bekehret euch zu Allah insgesamt, o ihr Gläubigen, auf dass ihr erfolgreich seiet.", "spanish": " Y di a las mujeres creyentes que recaten su mirada y protejan sus partes privadas, y no muestren su belleza y sus adornos, excepto lo que sea visible de ellos, y coloquen sus velos sobre sus pechos, y no muestren su belleza y sus ornamentos más que a sus maridos, o a sus padres, o a los padres de sus maridos o a sus hijos, o a los hijos de sus maridos, o a sus her­manos, o a los hijos de sus hermanos, o a los hijos de sus hermanas o a sus mujeres o a lo que poseen sus diestras o a aquellos de los criados varones que no tengan maldad, o a los niños que no han llegado a tener conocimiento de las partes privadas de las mujeres. Y que no caminen de manera que pueda mostrarse lo que ocultan de su belleza. Y vol­veos todos juntos a Al‑lah, Oh creyentes, para que triunféis.", "urdu": " اور مومن عورتوں سے کہہ دے کہ وہ بھی اپنی آنکھیں نیچی رکھا کریں اور اپنی شرم گاہوں کی حفاظت کیا کریں اور اپنی زینت کو ظاہر نہ کیا کریں سوائے اس کے جو آپ ہی آپ بے اختیار ظاہر ہوتی ہو۔ اور اپنی اوڑھنیوں کو اپنے سینہ پر سے گذار کر اور اس کو ڈھانک کر پہنا کریں‘ اور وہ صرف اپنے خاوندوں‘ یا اپنے باپوں‘ یا اپنے خاوندوں کے باپوں‘ یا اپنے بیٹوں‘ یا اپنے خاوندوں کے بیٹوں‘ یا اپنے بھائیوں یا اپنے بھائیوں کے بیٹوں‘ یا اپنی بہنوں کے بیٹوں‘یا اپنی (ہم کفو) عورتوں‘ یا جن کے مالک ان کے داہنے ہاتھ ہوئے ہیں یا ایسے ماتحت مردوں پر جو ابھی جوان نہیں ہوئے‘ یا ایسے بچوں پر جن کو ابھی عورتوں کے خاص تعلقات کا علم حاصل نہیں ہوا‘ اپنی زینت ظاہر کریں (ان کے سوا کسی پر ظاہر نہ کریں) اور اپنے پاٶں (زور سے زمین پر) اس لئے نہ مارا کریں کہ وہ چیز ظاہر ہو جائے جس کو وہ اپنی زینت سے چھپا رہی ہیں‘ اور اے مومنو! سب کے سب اللہ کی طرف رجوع کرو تا کہ تم کامیاب ہو جاٶ۔"}, {"arabic": " وَ اَنۡکِحُوا الۡاَیَامٰی مِنۡکُمۡ وَ الصّٰلِحِیۡنَ مِنۡ عِبَادِکُمۡ وَ اِمَآئِکُمۡ ؕ اِنۡ یَّکُوۡنُوۡا فُقَرَآءَ یُغۡنِہِمُ اللّٰہُ مِنۡ فَضۡلِہٖ ؕ وَ اللّٰہُ وَاسِعٌ عَلِیۡمٌ ﴿۳۳﴾", "english": " And marry widows from among you, and your male slaves and female slaves who are fit for marriage . If they be poor, Allah will grant them means out of His bounty; and Allah is Bountiful, All-knowing.", "french": " Et mariez les veuves parmi vous, et ceux de vos esclaves, hommes et femmes, qui sont bons pour le mariage . S’ils sont pauvres, Allāh leur accordera des moyens de Sa munificence ; et Allāh est Munificent, Omniscient.", "german": " Und verheiratet eure Witwen und die (heirats-)fähigen unter euren Sklaven (Kriegsgefangenen), männliche wie weibliche. Wenn sie arm sind, so wird Allah sie aus Seiner Fülle reich machen, denn Allah ist freigebig, allwissend.", "spanish": " Y casad a las viudas de entre vosotros, y a vuestros esclavos y esclavas que sean apropiados para el matrimonio. Si son pobres, Al‑lah les concederá medios de Su Magnani­midad; pues Al‑lah es Magnánimo, Omnisciente.", "urdu": " اور اپنے میں سے جو بیوائیں ہیں اور جو اپنے غلاموں یا لونڈیوں میں سے نیک ہوں‘ ان کی شادیاں کر دیا کرو۔ اگر وہ غریب ہیں تو اللہ اپنے فضل سے ان کو غنی بنا دے گا اور اللہ بہت وسعت رکھنے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ لۡیَسۡتَعۡفِفِ الَّذِیۡنَ لَا یَجِدُوۡنَ نِکَاحًا حَتّٰی یُغۡنِیَہُمُ اللّٰہُ مِنۡ فَضۡلِہٖ ؕ وَ الَّذِیۡنَ یَبۡتَغُوۡنَ الۡکِتٰبَ مِمَّا مَلَکَتۡ اَیۡمَانُکُمۡ فَکَاتِبُوۡہُمۡ اِنۡ عَلِمۡتُمۡ فِیۡہِمۡ خَیۡرًا ٭ۖ وَّ اٰتُوۡہُمۡ مِّنۡ مَّالِ اللّٰہِ الَّذِیۡۤ اٰتٰٮکُمۡ ؕ وَ لَا تُکۡرِہُوۡا فَتَیٰتِکُمۡ عَلَی الۡبِغَآءِ اِنۡ اَرَدۡنَ تَحَصُّنًا لِّتَبۡتَغُوۡا عَرَضَ الۡحَیٰوۃِ الدُّنۡیَا ؕ وَ مَنۡ یُّکۡرِہۡہُّنَّ فَاِنَّ اللّٰہَ مِنۡۢ بَعۡدِ اِکۡرَاہِہِنَّ غَفُوۡرٌ رَّحِیۡمٌ ﴿۳۴﴾", "english": " And those who find no means of marriage should keep themselves chaste, until Allah grants them means out of His bounty. And such as desire a deed of manumission in writing from among those whom your right hands possess, write it for them if you know any good in them; and give them out of the wealth of Allah which He has bestowed upon you. And force not your maids to unchaste life by keeping them unmarried if they desire to keep chaste, in order that you may seek the gain of the present life. But if any one forces them, then after their compulsion Allah will be Forgiving and Merciful to them .", "french": " Et ceux qui ne trouvent point de moyens pour le mariage doivent se garder chastes jusqu’à ce qu’Allāh leur octroie des moyens de par Sa libéralité. Et ceux de vos esclaves qui désirent que soit établi sous forme de contrat un acte d’affranchissement , rédigez-le pour eux si vous trouvez en eux quelque bien potentiel et donnez-leur à partir de ces biens qui appartiennent en réalité à Allāh qu’Il vous a octroyés. Et, dans le but de vous procurer des gains de la vie de ce monde, ne poussez pas vos servantes à une vie impudique en les gardant non-mariées , si elles désirent rester chastes, Mais si quelqu’un les contraint, alors, après qu’elles aient été contraintes, Allāh sera Très- Pardonnant et Miséricordieux envers elles .", "german": " Und diejenigen, die keine (Gelegenheit) zur Ehe finden, sollen sich keusch halten, bis Allah sie aus Seiner Fülle reich macht. Und jene, die eure Rechte besitzen – wenn welche von ihnen eine Freilassungsurkunde begehren, stellt sie ihnen aus, falls ihr in ihnen Gutes wisset; und gebet ihnen von Allahs Reichtum, den Er euch gegeben hat. Und zwingt eure Mägde nicht zur Unzucht (indem ihr sie nicht verheiratet), wenn sie keusch zu bleiben wünschen, nur damit ihr die Güter des irdischen Lebens erlanget. Zwingt sie aber einer, dann wird Allah gewiss allvergebend und barmherzig (zu ihnen) sein nach ihrem Zwang.", "spanish": " Y quienes no encuentren me­dios para el matrimonio, deben con­servarse castos hasta que Al‑lah les conceda medios de Su agnanimi­dad. Y aquellos de vuestros esclavos que desean contratar una escri­tura de emancipación , extendédsela si veis que poseen lguna buena capacidad ; y dadles de la riqueza que verdaderamente pertenece a Al‑lah y que Él os ha oncedido. No forcéis a vuestras esclavas a una vida impura manteniéndolas sin casar si desean conservarse castas, para buscar ganancias en la vida presente. Mas si alguno las fuerza, en verdad, Al‑lah, después de haber sido obligadas, será Indulgente y Miseri­cordioso con ellas.", "urdu": " اور چاہیئے کہ وہ لوگ جن کو نکاح کی توفیق نہیں پاکیزگی اختیار کریں‘ یہاں تک کہ اللہ ان کو اپنے فضل سے غنی بنا دے‘ اور تمہارے غلاموں میں سے جو لوگ مکاتبت کا مطالبہ کریں اگر تم ان میں بھلائی دیکھو تو ان سے مکاتبت کر لو اور (اگر ان کے پاس پورا مال نہ ہو تو) جو اللہ نے تم کو مال دیا ہے اس میں سے کچھ مال دے (کر ان کی آزادی ممکن بنا) دو۔ اور تم اپنی لونڈیوں کو بدکاری پر مجبور نہ کرو اگر وہ نیک رہنا چاہتی ہوں‘ تا کہ تم اس ذریعہ سے دنیوی زندگی کا سامان جمع کرو۔ اورجو کوئی ان کو مجبور کرے۔ تو اللہ ان عورتوں کی مجبوری کے بعد بہت بخشنے والا (اور) باربار رحم کرنے والا ہے (وہ ان پر گرفت نہیں کرے گا) ۔"}, {"arabic": " وَ لَقَدۡ اَنۡزَلۡنَاۤ اِلَیۡکُمۡ اٰیٰتٍ مُّبَیِّنٰتٍ وَّ مَثَلًا مِّنَ الَّذِیۡنَ خَلَوۡا مِنۡ قَبۡلِکُمۡ وَ مَوۡعِظَۃً لِّلۡمُتَّقِیۡنَ ﴿٪۳۵﴾", "english": " And We sent down to you manifest Signs, and the example of those who have passed away before you, and an exhortation to the God-fearing.", "french": " Et Nous vous avons envoyé des Signes manifestes, et Nous vous avons relaté l’exemple de ceux qui vous ont devancés, et une exhortation à ceux qui craignent Allāh.", "german": " Wir haben euch deutliche Zeichen niedergesandt und das Beispiel derer, die vor euch dahingingen, und eine Ermahnung für die Gottesfürchtigen.", "spanish": " Os hemos revelado Signos manifiestos, y el ejemplo de los que vivieron antes que vosotros y una exhortación para los que temen a Dios.", "urdu": " اور ہم نے تم پر کھلے کھلے نشانات اتارے ہیں اور جو لوگ تم سے پہلے گذر چکے ہیں ان کے حالات بھی بیان کیے ہیں اور متقیوں کے لئے نصیحت کی باتیں بھی بیان کی ہیں۔"}, {"arabic": " اَللّٰہُ نُوۡرُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ مَثَلُ نُوۡرِہٖ کَمِشۡکٰوۃٍ فِیۡہَا مِصۡبَاحٌ ؕ اَلۡمِصۡبَاحُ فِیۡ زُجَاجَۃٍ ؕ اَلزُّجَاجَۃُ کَاَنَّہَا کَوۡکَبٌ دُرِّیٌّ یُّوۡقَدُ مِنۡ شَجَرَۃٍ مُّبٰرَکَۃٍ زَیۡتُوۡنَۃٍ لَّا شَرۡقِیَّۃٍ وَّ لَا غَرۡبِیَّۃٍ ۙ یَّکَادُ زَیۡتُہَا یُضِیۡٓءُ وَ لَوۡ لَمۡ تَمۡسَسۡہُ نَارٌ ؕ نُوۡرٌ عَلٰی نُوۡرٍ ؕ یَہۡدِی اللّٰہُ لِنُوۡرِہٖ مَنۡ یَّشَآءُ ؕ وَ یَضۡرِبُ اللّٰہُ الۡاَمۡثَالَ لِلنَّاسِ ؕ وَ اللّٰہُ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿ۙ۳۶﴾", "english": " Allah is the Light of the heavens and the earth. The similitude of His light is as a lustrous niche, wherein is a lamp. The lamp is in a glass. The glass is as it were a glittering star. It is lit from a blessed tree — an olive — neither of the east nor of the west, whose oil would well-nigh glow forth even though fire touched it not. Light upon light! Allah guides to His light whomsoever He will. And Allah sets forth parables to men, and Allah knows all things full well.", "french": " Allāh est la Lumière des cieux et de la terre. Sa Lumière est pareille à une niche brillante dans laquelle se trouve une lampe. La lampe est à l’intérieur d’un verre. Le verre est comme si c’était une étoile étincelante. La lampe est allumée avec l’huile d’un arbre béni – un olivier – qui n’est ni de l’Est ni de l’Ouest, dont l’huile s’allumerait même si le feu ne la touchait pas. Lumière sur lumière ! Allāh dirige vers Sa lumière qui Il veut. Et Allāh relate des paraboles aux hommes, et Allāh connaît toutes les choses très bien.", "german": " Allah ist das Licht der Himmel und der Erde. Das Gleichnis Seines Lichts ist wie eine Nische, worin sich eine Lampe befindet. Die Lampe ist in einem Glas. Das Glas ist gleichsam ein glitzernder Stern – angezündet von einem gesegneten Baum, einem Ölbaum, weder vom Osten noch vom Westen, dessen Öl beinah leuchten würde, auch wenn das Feuer es nicht berührte. Licht über Licht. Allah leitet zu Seinem Licht, wen Er will. Und Allah prägt Gleichnisse für die Menschen, denn Allah kennt alle Dinge.", "spanish": " Al‑lah es la Luz de los cielos y la tierra. Su luz es semejante a una hornacina brillante, en la que hay una lámpara. La lámpara está en un vaso. El vaso es como una estrella brillante. Se enciende con un árbol bendito -el olivo‑ que no está ni a Oriente ni a Occidente, cuyo aceite podría alumbrar aun cuando no lo tocara el fuego. ¡Luz sobre luz! Al‑lah guía a Su Luz a quien desea. Pues Al‑lah presenta parábolas a los hombres y Al‑lah sabe perfectamente todas las cosas.", "urdu": " اللہ آسمانوں کا بھی نور ہے اور زمین کا بھی۔ اس کے نور کی کیفیت یہ ہے جیسے کہ ایک طاق ہو جس میں ایک دیا پڑا ہو (اور وہ) دیا ایک شیشے کے گلوب کے نیچے ہو (اور) وہ گلوب ایسا چمکدار ہو گویا وہ ایک چمکتا ہوا ستارہ ہے (اور) وہ (چراغ) ایک ایسے برکت والے درخت زیتون (کے تیل) سے جلایا جارہا ہو کہ وہ (درخت) نہ شرقی ہو نہ غربی۔ قریب ہے کہ اس کا تیل خواہ اسے آگ نہ بھی چھوئی ہو بھڑک اٹھے (یہ چراغ) بہت سے نوروں کا مجموعہ (معلوم ہوتا) ہے اللہ اپنے نور کے لئے جن کو چاہتا ہے ہدایت دیتا ہے اور اللہ لوگوں کے لئے (تمام ضروری) باتیں بیان کرتا ہے۔ اور اللہ ہر ایک چیز کو خوب جانتا ہے۔"}, {"arabic": " فِیۡ بُیُوۡتٍ اَذِنَ اللّٰہُ اَنۡ تُرۡفَعَ وَ یُذۡکَرَ فِیۡہَا اسۡمُہٗ ۙ یُسَبِّحُ لَہٗ فِیۡہَا بِالۡغُدُوِّ وَ الۡاٰصَالِ ﴿ۙ۳۷﴾", "english": " This light is now lit in houses with regard to which Allah has ordained that they be exalted and that His name be remembered in them. Therein is He glorified in the mornings and the evenings", "french": " Cette lumière est maintenant allumée dans des maisons à l’égard desquelles Allāh a commandé qu’elles soient élevées et que Son nom y soit souvenu. Ils Le glorifient en ces maisons tous les matins et tous les soirs", "german": " (Es ist) in Häusern, für die Allah verordnet hat, sie sollten erhöht und Sein Name sollte darin verkündet werden. Darin preisen Ihn am Morgen und am Abend", "spanish": " Esta luz está ahora encendida en casas que Al‑lah ha ordenado que sean exaltadas y sea recor­dado en ellas Su nombre. lorificadle allí por las mañanas y por las tardes ;", "urdu": " یہ (دیے) ایسے گھروں میں ہیں جن کے اونچا کیے جانے کا خدا نے حکم دے دیا ہے اور ان میں خدا کا نام لیا جاتا ہے (اور)ان میں صبح و شام تسبیح کرتے رہتے ہیں۔"}, {"arabic": " رِجَالٌ ۙ لَّا تُلۡہِیۡہِمۡ تِجَارَۃٌ وَّ لَا بَیۡعٌ عَنۡ ذِکۡرِ اللّٰہِ وَ اِقَامِ الصَّلٰوۃِ وَ اِیۡتَآءِ الزَّکٰوۃِ ۪ۙ یَخَافُوۡنَ یَوۡمًا تَتَقَلَّبُ فِیۡہِ الۡقُلُوۡبُ وَ الۡاَبۡصَارُ ﴿٭ۙ۳۸﴾", "english": " By men, whom neither merchandise nor traffic diverts from the remembrance of Allah and the observance of Prayer, and the giving of the Zakat. They fear a day in which hearts and eyes will be agitated,", "french": " Des hommes que ni les affaires ni le commerce ne distraient du souvenir d’Allāh et de l’observance de la Prière, et du paiement de la Zakāt. Ils redoutent un jour où les cœurs et les yeux seront bouleversés.", "german": " Männer, die weder Ware noch Handel abhält von dem Gedenken an Allah und der Verrichtung des Gebets, und dem Geben der Zakât. Sie fürchten einen Tag, an dem sich Herzen und Augen verdrehen werden,", "spanish": " Hombres a quienes ni el comercio ni los negocios les apartan del recuerdo de Al‑lah y del cumpli­miento de la Oración y la entrega del Zakat. Temen un día en el que los corazones y ojos estarán agitados .", "urdu": " کچھ مرد۔ جن کو اللہ کے ذکر سے اور نماز کے قائم کرنے سے اور زکٰوۃ کے دینے سے نہ تجارت اور نہ سودا بیچنا غافل کرتا ہے وہ اس دن سے ڈرتے ہیں جس میں دل الٹ جائیں گے اور آنکھیں پلٹ جائیں گی۔"}, {"arabic": " لِیَجۡزِیَہُمُ اللّٰہُ اَحۡسَنَ مَا عَمِلُوۡا وَ یَزِیۡدَہُمۡ مِّنۡ فَضۡلِہٖ ؕ وَ اللّٰہُ یَرۡزُقُ مَنۡ یَّشَآءُ بِغَیۡرِ حِسَابٍ ﴿۳۹﴾", "english": " So that Allah may give them the best reward of their deeds, and give them increase out of His bounty. And Allah does provide for whomsoever He pleases without measure.", "french": " Ainsi Allāh les récompensera selon la meilleure de leurs œuvres, et leur accordera encore plus de Sa munificence. Et Allāh accorde Sa provision sans mesure à qui Il veut.", "german": " dass Allah sie belohne für die besten ihrer Taten und ihnen Mehrung gebe aus Seiner Fülle. Allah versorgt ja, wen Er will, ohne zu rechnen.", "spanish": " Para que Al‑lah les otorgue la mejor recompensa a sus acciones y les dé aumentado de Su magnani­midad. Pues Al‑lah proporciona sin medida a quien Él quiere.", "urdu": " نتیجہ یہ ہوگا کہ اللہ ان کو ان کے اعمال کی بہتر سے بہتر جزا دے گا اور ان کو اپنے فضل سے (مال و اولاد میں) بڑھا دے گا اور اللہ جس کو چاہتا ہے بغیر حساب کے رزق دیتا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡۤا اَعۡمَالُہُمۡ کَسَرَابٍۭ بِقِیۡعَۃٍ یَّحۡسَبُہُ الظَّمۡاٰنُ مَآءً ؕ حَتّٰۤی اِذَا جَآءَہٗ لَمۡ یَجِدۡہُ شَیۡئًا وَّ وَجَدَ اللّٰہَ عِنۡدَہٗ فَوَفّٰٮہُ حِسَابَہٗ ؕ وَ اللّٰہُ سَرِیۡعُ الۡحِسَابِ ﴿ۙ۴۰﴾", "english": " And as to those who disbelieve, their deeds are like a mirage in a desert. The thirsty one thinks it to be water until, when he comes up to it, he finds it to be nothing. And he finds Allah near him, Who then fully pays him his account; and Allah is swift at reckoning.", "french": " Et quant à ceux qui ne croient pas, leurs œuvres sont pareilles à un mirage dans un désert. L’assoiffé pense que c’est de l’eau, jusqu’à ce qu’en y arrivant, il trouve que ce n’est rien. Et là-bas il trouve Allāh, Qui lui règle son compte intégralement ; et Allāh est prompt à calculer.", "german": " Die aber ungläubig sind – ihre Taten sind wie eine Luftspiegelung in einer Ebene. Der Dürstende hält sie für Wasser bis er, wenn er hinzutritt, sie als Nichts findet. Doch er findet Allah nahebei, Der ihm seine Rechnung voll bezahlt; und Allah ist schnell im Abrechnen.", "spanish": " En cuanto a los no creyentes, sus actos son como un espejismo en el desierto. El sediento piensa que hay agua hasta que, cuando llega a ella, encuentra que no es nada. Mas encuentra que Al‑lah está allí, quien le re­tribuye totalmente por sus ac­ciones, pues Al‑lah es rápido en la retribución.", "urdu": " اور وہ لوگ جنہوں نے کفر کیا ان کے اعمال سراب کی طرح ہیںجو ایک وسیع میدان میں نظر آتی ہے جس کو پیاسا پانی سمجھتا ہے یہاں تک کہ جب وہ اس کے پاس آجاتا ہے تو وہ اسے کچھ بھی نہیں پاتا اور اللہ کو اس کے پاس دیکھ لیتا ہے تب اللہ اسے اس کا پورا پورا حساب چکا دیتا ہے اور اللہ بہت جلد حساب چکانے والوں میں سے ہے۔"}, {"arabic": " اَوۡ کَظُلُمٰتٍ فِیۡ بَحۡرٍ لُّجِّیٍّ یَّغۡشٰہُ مَوۡجٌ مِّنۡ فَوۡقِہٖ مَوۡجٌ مِّنۡ فَوۡقِہٖ سَحَابٌ ؕ ظُلُمٰتٌۢ بَعۡضُہَا فَوۡقَ بَعۡضٍ ؕ اِذَاۤ اَخۡرَجَ یَدَہٗ لَمۡ یَکَدۡ یَرٰٮہَا ؕ وَ مَنۡ لَّمۡ یَجۡعَلِ اللّٰہُ لَہٗ نُوۡرًا فَمَا لَہٗ مِنۡ نُّوۡرٍ ﴿٪۴۱﴾", "english": " Or their deeds are like thick darkness in a vast and deep sea, which a wave covers, over which there is another wave, above which are clouds: layers of darkness, one upon another. When he holds out his hand, he can hardly see it: and he whom Allah gives no light — for him there is no light at all.", "french": " Ou, leurs œuvres sont pareilles à des ténèbres dans une mer vaste et profonde, qu’une vague couvre, sur laquelle il y a une autre vague, et au-dessus de laquelle il y a des nuages ; des couches de ténèbres, les unes au-dessus des autres. Lorsqu’il étend sa main, il la voit à peine ; et celui auquel Allāh ne donne pas de lumière – il n’y a pas de lumière pour lui.", "german": " Oder wie Finsternisse in einem tiefen Meer, eine Woge bedeckt es, über ihr ist eine Woge, darüber ist eine Wolke: Finsternisse, eine über der anderen. Wenn er seine Hand ausstreckt, kann er sie kaum sehen; und wem Allah kein Licht gibt – für den ist kein Licht.", "spanish": " O sus acciones son como una espesa oscuridad en un mar ancho y profundo, que cubre una ola, sobre la que hay otra ola, encima de las cuales están las nubes: capas de oscuridad, una sobre otra. Cuando saca la mano, difícilmente puede verla. Pues a quien Al‑lah no le da luz, para él no hay luz en abso­luto.", "urdu": " یا (ان کافروں کے اعمال کی کیفیت) ان تاریکیوں جیسی ہے جو ایک گہرے سمندر پر چھائی ہوئی ہوتی ہے جس پر لہریں اٹھ رہی ہوتی ہیں اور ان لہروں پر اور لہریں اٹھ رہی ہوتی ہیں اور ان سب کے اوپر ایک بادل ہوتا ہے یہ ایسی تاریکیاں ہوتی ہیں کہ ان میں سے بعض بعض کے اوپر چھائی ہوتی ہیں۔ جب انسان اپنا ہاتھ نکالتا ہے تو باوجود کوشش کے اس کو دیکھ نہیں سکتا اور جس کے لئے اللہ نور نہ بنائے اس کو کہیں سے نور نہیں ملتا۔"}, {"arabic": " اَلَمۡ تَرَ اَنَّ اللّٰہَ یُسَبِّحُ لَہٗ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ وَ الطَّیۡرُ صٰٓفّٰتٍ ؕ کُلٌّ قَدۡ عَلِمَ صَلَاتَہٗ وَ تَسۡبِیۡحَہٗ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِمَا یَفۡعَلُوۡنَ ﴿۴۲﴾", "english": " Hast thou not seen that it is Allah Whose praises all who are in the heavens and the earth celebrate, and so do the birds with their wings outspread? Each one knows his own mode of prayer and praise. And Allah knows well what they do.", "french": " N’as-tu pas vu que c’est Allāh que tous ceux qui sont aux cieux et sur la terre glorifient, et qu’ ainsi font les oiseaux avec les ailes déployées ? Chacun connaît le mode de son adoration et sa glorification. Et Allāh sait très bien ce qu’ils font.", "german": " Hast du nicht gesehen, dass es Allah ist, Den alle lobpreisen, die in den Himmeln und auf Erden sind, und die Vögel auch mit ausgebreiteten Schwingen? Jedes kennt seine eigene (Weise von) Gebet und Lobpreisung. Und Allah weiß wohl, was sie tun.", "spanish": " ¿No has visto que es Al‑lah cuyas alabanzas celebran todo lo que hay en los cielos y la tierra, al igual que los ájaros con sus alas extendidas? Cada uno conoce su propio modo de orar y alabar. Y Al‑lah sabe muy bien lo que hacen.", "urdu": " کیا تو دیکھتا نہیں کہ اللہ وہ ہے کہ جو آسمانوں اور زمین میں رہتے ہیں سب اسی کی تسبیح کرتے ہیں اور پرندے صف باندھے ہوئے اس کے سامنے حاضر ہیں۔ اور ان میں سے ہر ایک (اپنی اپنی پیدائش کے مطابق) اپنی نماز اور اپنی تسبیح کو جانتا ہے اور جو کچھ وہ کرتے ہیں اللہ اسے خوب جانتا ہے۔"}, {"arabic": " وَ لِلّٰہِ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ۚ وَ اِلَی اللّٰہِ الۡمَصِیۡرُ ﴿۴۳﴾", "english": " And to Allah belongs the kingdom of the heavens and the earth, and to Allah shall be the return.", "french": " Et c’est à Allāh qu’appartient le royaume des cieux et de la terre, et vers Allāh sera la destination.", "german": " Allahs ist das Königreich der Himmel und der Erde, und zu Allah wird die Heimkehr sein.", "spanish": " A Al‑lah pertenece el Reino de los cielos y la tierra, y a Al‑lah será el retorno.", "urdu": " اور آسمانوں اور زمین کی بادشاہت اللہ ہی کی ہے اور اللہ ہی کی طرف سب کو لوٹ کر جانا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اَنَّ اللّٰہَ یُزۡجِیۡ سَحَابًا ثُمَّ یُؤَلِّفُ بَیۡنَہٗ ثُمَّ یَجۡعَلُہٗ رُکَامًا فَتَرَی الۡوَدۡقَ یَخۡرُجُ مِنۡ خِلٰلِہٖ ۚ وَ یُنَزِّلُ مِنَ السَّمَآءِ مِنۡ جِبَالٍ فِیۡہَا مِنۡۢ بَرَدٍ فَیُصِیۡبُ بِہٖ مَنۡ یَّشَآءُ وَ یَصۡرِفُہٗ عَنۡ مَّنۡ یَّشَآءُ ؕ یَکَادُ سَنَا بَرۡقِہٖ یَذۡہَبُ بِالۡاَبۡصَارِ ﴿ؕ۴۴﴾", "english": " Hast thou not seen that Allah drives the clouds, then joins them together, then piles them up so that thou seest rain issue forth from the midst thereof? And He sends down from the sky clouds like mountains wherein is hail, and He smites therewith whom He pleases, and turns it away from whom He pleases. The flash of its lightning may well-nigh take away the sight.", "french": " N’as-tu pas vu qu’Allāh pousse doucement les nuages, puis les réunit, puis les entasse, de sorte que tu vois de la pluie sortir de leur milieu ? Et Il fait descendre du ciel des nuages comme des montagnes dans lesquels se trouve de la grêle et Il en frappe qui Il veut, et Il l’écarte de qui Il veut. Peu s’en faut que l’éclat de l’éclair n’enlève la vue.", "german": " Hast du nicht gesehen, dass Allah die Wolken einhertreibt, dann sie zusammenfügt, dann sie aufeinander schichtet, dass du Regen hervorströmen siehst aus ihrer Mitte? Und Er sendet vom Himmel Berge (von Wolken) nieder, in denen Hagel ist, und Er trifft damit, wen Er will, und wendet ihn ab, von wem Er will. Der Glanz seines Blitzes benimmt fast das Augenlicht.", "spanish": " ¿No has visto que Al‑lah mueve las nubes, después las reúne, a continuación las apila, para que veas caer la lluvia de en medio de ellas? Él envía desde el cielo nubes como mon­tañas en las que hay granizo, y azota con él a quien Le place y libra de él a quien quiere. El resplandor de su relámpago está a punto de hacer perder la vista .", "urdu": " کیا تو نے نہیں دیکھا کہ اللہ بادلوں کو آہستہ آہستہ ہانک کر لاتا ہے پھر ان کے درمیان اتصال پیدا کر دیتا ہے پھر ان کو تہ بہ تہ بنا دیتا ہے پھر تو دیکھتا ہے کہ ان کے اندر سے بارش ٹپکنے لگتی ہے اور وہ بادل میں سے بہت بڑے حجم کی چیزیں گراتا ہے جن میں سے بعض اولوں کی قسم کی ہوتی ہیں اور اس کو جس (قوم) تک چاہتا ہے پہنچا دیتا ہے اور جس سے چاہتا ہے اسے روک لیتا ہے قریب ہوتا ہے کہ اس کی بجلی کی روشنی بعض آنکھوں کو اندھا کر دے۔"}, {"arabic": " یُقَلِّبُ اللّٰہُ الَّیۡلَ وَ النَّہَارَ ؕ اِنَّ فِیۡ ذٰلِکَ لَعِبۡرَۃً لِّاُولِی الۡاَبۡصَارِ ﴿۴۵﴾", "english": " Allah alternates the night and the day. Therein surely is a lesson for those who have eyes.", "french": " Allāh fait alterner la nuit et le jour. Il se trouve assurément en cela une leçon pour ceux qui ont des yeux.", "german": " Allah lässt wechseln die Nacht und den Tag. Hierin ist wahrlich eine Lehre für solche, die Augen haben.", "spanish": " Al‑lah alterna la noche y el día. Aquí hay ciertamente una lección para quienes tienen ojos.", "urdu": " اللہ رات اور دن کو چکر دیتا رہتا ہے۔ اس میں عقل والے لوگوں کے لئے بڑی عبرت ہے۔"}, {"arabic": " وَ اللّٰہُ خَلَقَ کُلَّ دَآبَّۃٍ مِّنۡ مَّآءٍ ۚ فَمِنۡہُمۡ مَّنۡ یَّمۡشِیۡ عَلٰی بَطۡنِہٖ ۚ وَ مِنۡہُمۡ مَّنۡ یَّمۡشِیۡ عَلٰی رِجۡلَیۡنِ ۚ وَ مِنۡہُمۡ مَّنۡ یَّمۡشِیۡ عَلٰۤی اَرۡبَعٍ ؕ یَخۡلُقُ اللّٰہُ مَا یَشَآءُ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۴۶﴾", "english": " And Allah has created every animal from water. Of them are some that go upon their bellies, and of them are some that go upon two feet, and among them are some that go upon four. Allah creates what He pleases. Surely, Allah has the power to do all that He pleases.", "french": " Et Allāh a créé chaque animal à partir de l’eau. Certains d’entre eux rampent sur leurs ventres, d’autres se déplacent sur deux pattes, et d’autres encore se déplacent sur quatre. Allāh crée ce qui Lui plaît. Assurément, Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Und Allah hat jedes Lebewesen aus Wasser erschaffen. Unter ihnen sind manche, die auf ihren Bäuchen gehen, und unter ihnen sind manche, die auf zwei Beinen gehen, und unter ihnen sind manche, die auf vieren gehen. Allah schafft, was Er will. Wahrlich, Allah hat Macht über alle Dinge.", "spanish": " Y Al‑lah ha creado a cada animal del agua. Entre ellos hay algunos que se arrastran sobre el vientre, otros que andan a dos patas y otros que andan sobre cuatro. Al‑lah crea lo que Le agrada. En verdad, Al‑lah. tiene el poder de hacer todo lo que Le place.", "urdu": " اور اللہ نے ہر چلنے والے جانور کو پانی سے پیدا کیا ہے پس کچھ تو ایسے ہیں جو اپنے پیٹ پر چلتے ہیں اور کچھ ایسے ہیں جو (اپنے) دو پاٶں پر چلتے ہیں اور کچھ ایسے ہیں جو چار پاٶں پر چلتے ہیں۔ اللہ جو چاہتا ہے پیدا کرتا ہے اور اللہ ہر ایک چیز پر قادر ہے۔"}, {"arabic": " لَقَدۡ اَنۡزَلۡنَاۤ اٰیٰتٍ مُّبَیِّنٰتٍ ؕ وَ اللّٰہُ یَہۡدِیۡ مَنۡ یَّشَآءُ اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۴۷﴾", "english": " We have indeed sent down manifest Signs. And Allah guides whom He pleases to the right path.", "french": " Nous avons certainement fait descendre des Signes manifestes. Et Allāh guide qui Il veut vers un droit chemin.", "german": " Wir haben deutliche Zeichen herabgesandt. Und Allah leitet, wen Er will, auf den geraden Weg.", "spanish": " En verdad hemos revelado Signos manifiestos. Pues Al‑lah guía a quien Le agrada al camino recto.", "urdu": " ہم نے کھلے کھلے نشانات اتارے ہیں اور اللہ جسے چاہتا ہے سیدھے راستہ کی طرف ہدایت دیتا ہے۔"}, {"arabic": " وَ یَقُوۡلُوۡنَ اٰمَنَّا بِاللّٰہِ وَ بِالرَّسُوۡلِ وَ اَطَعۡنَا ثُمَّ یَتَوَلّٰی فَرِیۡقٌ مِّنۡہُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ ؕ وَ مَاۤ اُولٰٓئِکَ بِالۡمُؤۡمِنِیۡنَ ﴿۴۸﴾", "english": " And they say, ‘We believe in Allah and in the Messenger and we obey;’ then after that some of them turn away. But such are not believers.", "french": " Et ils disent : « Nous croyons en Allāh et au Messager, et Nous obéissons ; » puis après cela certains d’entre eux se détournent. Mais ceux-là ne sont pas croyants.", "german": " Sie sprechen: \"Wir glauben an Allah und an den Gesandten, und wir gehorchen\"; hierauf aber wenden sich einige von ihnen ab. Und dies sind keine Gläubigen.", "spanish": " Ellos dicen: \"Creemos en Al‑lah y en el Mensajero y obede­cemos\"; después de eso, algunos de ellos se apartan. Pero ésos no son creyentes.", "urdu": " اور وہ کہتے ہیں ہم اللہ اور اس کے رسول پر ایمان لائے‘ اور ہم نے اطاعت کا وعدہ کرلیا۔ پھر ان میں سے ایک گروہ اس کے بعد (اپنے اقرار سے) پھر جاتا ہے۔ اور ایسے لوگ ہرگز مومن نہیں۔"}, {"arabic": " وَ اِذَا دُعُوۡۤا اِلَی اللّٰہِ وَ رَسُوۡلِہٖ لِیَحۡکُمَ بَیۡنَہُمۡ اِذَا فَرِیۡقٌ مِّنۡہُمۡ مُّعۡرِضُوۡنَ ﴿۴۹﴾", "english": " And when they are called to Allah and His Messenger that he may judge between them, lo! a party of them turn away.", "french": " Et quand ils sont appelés vers Allāh et Son Messager afin qu’il juge entre eux, voilà qu’une faction d’entre eux se détourne !", "german": " Und wenn sie zu Allah und Seinem Gesandten gerufen werden, damit er richten möge zwischen ihnen, siehe, dann wendet sich eine Gruppe unter ihnen ab.", "spanish": " Y cuando son convocados a Al‑lah y a Su Mensajero para que juzgue entre ellos, he ahí que un grupo de ellos se aleja.", "urdu": " اور جب ان کواللہ اور اس کے رسول کی طرف اس لئے بلایا جاتا ہے تا کہ وہ ان کے درمیان فیصلہ کرے تو ان میں سے ایک گروہ اعراض کرنے لگتا ہے۔"}, {"arabic": " وَ اِنۡ یَّکُنۡ لَّہُمُ الۡحَقُّ یَاۡتُوۡۤا اِلَیۡہِ مُذۡعِنِیۡنَ ﴿ؕ۵۰﴾", "english": " And if they consider the right to be on their side, they come to him running in all submission.", "french": " Et s ’ils considèrent le droit comme étant de leur côté, ils accourent vers lui en soumission.", "german": " Doch wenn das Recht auf ihrer Seite ist, dann kommen sie zu ihm gelaufen in aller Unterwürfigkeit.", "spanish": " Mas si consideran que la razón está de su lado, acuden a él corriendo con toda sumisión.", "urdu": " اور اگر کوئی بات ان کے حق میں ہو تو وہ فوراً اظہار اطاعت کرتے ہوئے آجاتے ہیں۔"}, {"arabic": " اَفِیۡ قُلُوۡبِہِمۡ مَّرَضٌ اَمِ ارۡتَابُوۡۤا اَمۡ یَخَافُوۡنَ اَنۡ یَّحِیۡفَ اللّٰہُ عَلَیۡہِمۡ وَ رَسُوۡلُہٗ ؕ بَلۡ اُولٰٓئِکَ ہُمُ الظّٰلِمُوۡنَ ﴿٪۵۱﴾", "english": " Is it that there is a disease in their hearts? Or do they doubt, or do they fear that Allah and His Messenger will be unjust to them? Nay, it is they themselves who are the wrongdoers.", "french": " Y a-t-il une maladie dans leur cœur ? Ou doutent-ils ou craignent-ils qu’Allāh et Son Messager ne soient injustes envers eux ? Non , mais ce sont eux qui sont les injustes.", "german": " Ist es, dass Krankheit in ihren Herzen ist? Oder zweifeln sie, oder fürchten sie, dass Allah und Sein Gesandter ungerecht gegen sie sein würden? Nein, sie sind es selbst, die Unrecht begehen.", "spanish": " ¿Hay acaso una enfermedad en sus corazones? ¿O tienen dudas, o temen que Al‑lah y Su Mensajero serán injustos con ellos? No, ellos mismos son los inicuos.", "urdu": " کیا ان کے دلوں میں کوئی بیماری ہے؟ یا وہ شبہ میں پڑے ہوئے ہیں یا وہ ڈرتے ہیں کہ اللہ اور اس کا رسول ان پر ظلم کرے گا۔ ایسا ہرگز نہیں‘ بلکہ وہ خود ظالم ہیں۔"}, {"arabic": " اِنَّمَا کَانَ قَوۡلَ الۡمُؤۡمِنِیۡنَ اِذَا دُعُوۡۤا اِلَی اللّٰہِ وَ رَسُوۡلِہٖ لِیَحۡکُمَ بَیۡنَہُمۡ اَنۡ یَّقُوۡلُوۡا سَمِعۡنَا وَ اَطَعۡنَا ؕ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۵۲﴾", "english": " The response of the believers, when they are called to Allah and His Messenger in order that he may judge between them, is only that they say: ‘We hear and we obey.’ And it is they who will prosper.", "french": " La réponse des croyants, lorsqu’ils sont appelés devant Allāh et Son Messager afin qu’il juge entre eux, est seulement qu’ils disent : « Nous entendons et nous obéissons. »Et ceux-là prospéreront.", "german": "", "spanish": " La respuesta de los creyentes, cuando son convocados a Al‑lah y a Su Mensajero para que él pueda juzgar entre ellos, sólo consiste en decir: \"Oímos y obedecemos” y son ellos los que prosperarán.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Die Rede der Gläubigen, wenn sie zu Allah und Seinem Gesandten gerufen werden, damit er richten möge zwischen ihnen, ist nur, dass sie sprechen: \"Wir hören und wir gehorchen.\" Und sie sind es, die Erfolg haben werden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=24:52&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=24:52&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic53\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic53\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/24:53' style='text-decoration:underline'>24:53</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(53)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control53\"></i></button> <audio id=\"player53\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَنۡ یُّطِعِ اللّٰہَ وَ رَسُوۡلَہٗ وَ یَخۡشَ اللّٰہَ وَ یَتَّقۡہِ فَاُولٰٓئِکَ ہُمُ الۡفَآئِزُوۡنَ ﴿۵۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And whoso obeys Allah and His Messenger, and fears Allah, and takes Him as a shield <em>for protection</em>, it is they who will be successful.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_24_53_a' href='#'>a</a>]</sup>And whoso obeys Allah and His Messenger, and fears Allah, and takes Him as a shield <i>for protection</i>, it is they who will be successful. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_24_53_a'>a</span></div> <div><div class='reference' data-id='ref_24_53_a' style='display:none'> <p><b>a.</b> <a href='/quran/4:14' target=_blank>4:14</a>. (<a href='javascript:void(0)' data-id='ref_24_53_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور جو اللہ اور اس کے رسول کی اطاعت کرے اور اللہ سے ڈرے اور اس کا تقویٰ اختیار کرے تو یہی ہیں جو کامیاب ہونے والے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور جو لوگ اللہ اور اس کے رسول کی اطاعت کریں اور اللہ سے ڈریں اور اس کا تقویٰ اختیار کریں وہ بامراد ہو جاتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et quiconque obéit à Allāh et à Son Messager, et craint Allāh, et Le prend comme bouclier <em>pour se protéger</em>, ceux-là seront triomphants.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y quien obedece a Al‑lah y a Su Mensajero y teme a Al‑lah y lo toma como escudo <em>protector, </em>será de los que tienen éxito.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wer Allah und Seinem Gesandten gehorcht und Allah fürchtet und Ihn zum Schild nimmt: solche sind es, die Glückseligkeit erlangen werden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=24:53&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=24:53&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic54\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic54\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/24:54' style='text-decoration:underline'>24:54</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(54)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control54\"></i></button> <audio id=\"player54\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اَقۡسَمُوۡا بِاللّٰہِ جَہۡدَ اَیۡمَانِہِمۡ لَئِنۡ اَمَرۡتَہُمۡ لَیَخۡرُجُنَّ ؕ قُلۡ لَّا تُقۡسِمُوۡا ۚ طَاعَۃٌ مَّعۡرُوۡفَۃٌ ؕ اِنَّ اللّٰہَ خَبِیۡرٌۢ بِمَا تَعۡمَلُوۡنَ ﴿۵۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And they swear by Allah their strongest oaths that, if thou command them, they will surely go forth. Say, ‘Swear not; <em>what is required is actual</em> obedience in what is right. Surely, Allah is well aware of what you do.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And they swear by Allah their strongest oaths that, if thou command them, they will surely go forth. Say, ‘Swear not; <i>what is required of you is </i><sup class='ref'>[<a class='ref' data-id='ref_24_54_b' href='#'>b</a>]</sup>obedience to what is right. Surely, Allah is Aware of what you do.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_24_54_b'>b</span></div> <div><div class='reference' data-id='ref_24_54_b' style='display:none'> <p><b>b.</b> <a href='/quran/5:93' target=_blank>5:93</a>; <a href='/quran/64:13' target=_blank>64:13</a>. (<a href='javascript:void(0)' data-id='ref_24_54_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور انہوں نے اللہ کی پختہ قسمیں کھائیں کہ اگر تُو انہیں حکم دے تو وہ ضرور نکل کھڑے ہوں گے۔ تُو کہہ دے کہ قسمیں نہ کھاؤ۔ دستور کے مطابق اطاعت (کرو)۔ یقیناً اللہ جو تم کرتے ہو اس سے ہمیشہ باخبر رہتا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور وہ لوگ اللہ کی پکی قسمیں کھاتے ہیں کہ اگر تو ان کو حکم دے تو وہ فوراً گھروں سے نکل کھڑے ہوں گے۔ کہو قسمیں نہ کھاٶ۔ ہمارا حکم تو تمہیں صرف ایسی اطاعت کا ہے جو عرف عام میں اطاعت سمجھی جاتی ہے اللہ اس سے جو تم کرتے ہو‘ یقیناً خبردار ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et ils jurent par Allāh des serments les plus solennels que si tu le leur commandes, ils sortiront assurément. Dis : « Ne jurez pas ; <em>la manière d’agir c’est</em> l’obéissance en ce qui est juste. Assurément, Allāh est très conscient de ce que vous faites. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Juran por Al‑lah con sus jura­mentos más enérgicos que, si se lo rdenas, ciertamente marcharán. Di­les: \"No juréis; lo que se precisa es la obediencia real", "urdu": " مومنوں کاجواب جب وہ اللہ اور اس کے رسول کی طرف بلائے جائیں کہ وہ ان کے درمیان فیصلہ کریں یہ ہوا کرتا ہے کہ ہم نے سنا اور ہم نے مان لیا اور وہی لوگ کامیاب ہوا کرتے ہیں۔"}, {"arabic": " وَ مَنۡ یُّطِعِ اللّٰہَ وَ رَسُوۡلَہٗ وَ یَخۡشَ اللّٰہَ وَ یَتَّقۡہِ فَاُولٰٓئِکَ ہُمُ الۡفَآئِزُوۡنَ ﴿۵۳﴾", "english": " And whoso obeys Allah and His Messenger, and fears Allah, and takes Him as a shield for protection , it is they who will be successful.", "french": " Et quiconque obéit à Allāh et à Son Messager, et craint Allāh, et Le prend comme bouclier pour se protéger , ceux-là seront triomphants.", "german": " Wer Allah und Seinem Gesandten gehorcht und Allah fürchtet und Ihn zum Schild nimmt: solche sind es, die Glückseligkeit erlangen werden.", "spanish": " Y quien obedece a Al‑lah y a Su Mensajero y teme a Al‑lah y lo toma como escudo protector, será de los que tienen éxito.", "urdu": " اور جو لوگ اللہ اور اس کے رسول کی اطاعت کریں اور اللہ سے ڈریں اور اس کا تقویٰ اختیار کریں وہ بامراد ہو جاتے ہیں۔"}, {"arabic": " وَ اَقۡسَمُوۡا بِاللّٰہِ جَہۡدَ اَیۡمَانِہِمۡ لَئِنۡ اَمَرۡتَہُمۡ لَیَخۡرُجُنَّ ؕ قُلۡ لَّا تُقۡسِمُوۡا ۚ طَاعَۃٌ مَّعۡرُوۡفَۃٌ ؕ اِنَّ اللّٰہَ خَبِیۡرٌۢ بِمَا تَعۡمَلُوۡنَ ﴿۵۴﴾", "english": " And they swear by Allah their strongest oaths that, if thou command them, they will surely go forth. Say, ‘Swear not; what is required is actual obedience in what is right. Surely, Allah is well aware of what you do.’", "french": " Et ils jurent par Allāh des serments les plus solennels que si tu le leur commandes, ils sortiront assurément. Dis : « Ne jurez pas ; la manière d’agir c’est l’obéissance en ce qui est juste. Assurément, Allāh est très conscient de ce que vous faites. »", "german": " Sie schwören bei Allah ihre feierlichsten Eide, sie würden, wenn du es ihnen befiehlst, gewisslich ausziehen. Sprich: \"Schwört nicht! Geziemender Gehorsam!\" Wahrlich, Allah ist wohl kundig dessen, was ihr tut.", "spanish": " Juran por Al‑lah con sus jura­mentos más enérgicos que, si se lo rdenas, ciertamente marcharán. Di­les: \"No juréis; <em>lo que se precisa es </em>la obediencia <em>real </em>en lo que es recto. En verdad, Al‑lah es perfectamente Consciente de lo que hacéis\".", "urdu": " اور وہ لوگ اللہ کی پکی قسمیں کھاتے ہیں کہ اگر تو ان کو حکم دے تو وہ فوراً گھروں سے نکل کھڑے ہوں گے۔ کہو قسمیں نہ کھاٶ۔ ہمارا حکم تو تمہیں صرف ایسی اطاعت کا ہے جو عرف عام میں اطاعت سمجھی جاتی ہے اللہ اس سے جو تم کرتے ہو‘ یقیناً خبردار ہے۔"}, {"arabic": " قُلۡ اَطِیۡعُوا اللّٰہَ وَ اَطِیۡعُوا الرَّسُوۡلَ ۚ فَاِنۡ تَوَلَّوۡا فَاِنَّمَا عَلَیۡہِ مَا حُمِّلَ وَ عَلَیۡکُمۡ مَّا حُمِّلۡتُمۡ ؕ وَ اِنۡ تُطِیۡعُوۡہُ تَہۡتَدُوۡا ؕ وَ مَا عَلَی الرَّسُوۡلِ اِلَّا الۡبَلٰغُ الۡمُبِیۡنُ ﴿۵۵﴾", "english": " Say, ‘Obey Allah, and obey the Messenger.’ But if you turn away, then upon him is his burden, and upon you is your burden. And if you obey him, you will be rightly guided. And the messenger is not responsible but for the plain delivery of the Message.", "french": " Dis : « Obéissez à Allāh et obéissez au Messager. » Et s’ils se détournent, alors rappelez-vous , quiconque agira ainsi, il sera tenu responsable de ce qui lui aura été confié, tout comme vous serez tenus responsables de ce qui vous aura été confié. Et si vous lui obéissez, vous serez bien guidés. Et le Messager n’est responsable que de la claire transmission du Message.", "german": " Sprich: \"Gehorchet Allah und gehorchet dem Gesandten.\" Doch wenn ihr euch abkehrt, dann ist er nur für das verantwortlich, was ihm auferlegt wurde, und ihr seid nur für das verantwortlich, was euch auferlegt wurde. Und wenn ihr ihm gehorcht, so werdet ihr dem rechten Weg folgen. Und dem Gesandten obliegt nur die deutliche Verkündigung.", "spanish": " Diles: \"Obedeced a Al‑lah y obedeced al Mensajero\". Pero si se apartan, recordad entonces que quien así actúe será responsa­ble de lo que se le ha confiado, de igual forma que vosotros seréis responsables de lo que se os ha confiado. Mas si le obedecéis, estaréis rectamente guia­dos. Pues el Mensajero sólo es encargado de la simple entrega del Mensaje.", "urdu": " تو کہہ اللہ کی اطاعت کرو اور اس کے رسول کی اطاعت کرو۔ پس اگر وہ پھر جائیں تو اس (رسول) پر صرف اس کی ذمہ داری ہے جو اس کے ذمہ لگایا گیا ہے اور تم پر اس کی ذمہ واری ہے جو تمہارے ذمہ لگایا گیا ہے اور اگر تم اس کی اطاعت کرو تو ہدایت پا جاٶ گے اور رسول کے ذمہ تو صرف بات کو کھول کر پہنچا دینا ہے۔"}, {"arabic": " وَعَدَ اللّٰہُ الَّذِیۡنَ اٰمَنُوۡا مِنۡکُمۡ وَ عَمِلُوا الصّٰلِحٰتِ لَیَسۡتَخۡلِفَنَّہُمۡ فِی الۡاَرۡضِ کَمَا اسۡتَخۡلَفَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ۪ وَ لَیُمَکِّنَنَّ لَہُمۡ دِیۡنَہُمُ الَّذِی ارۡتَضٰی لَہُمۡ وَ لَیُبَدِّلَنَّہُمۡ مِّنۡۢ بَعۡدِ خَوۡفِہِمۡ اَمۡنًا ؕ یَعۡبُدُوۡنَنِیۡ لَا یُشۡرِکُوۡنَ بِیۡ شَیۡئًا ؕ وَ مَنۡ کَفَرَ بَعۡدَ ذٰلِکَ فَاُولٰٓئِکَ ہُمُ الۡفٰسِقُوۡنَ ﴿۵۶﴾", "english": " Allah has promised to those among you who believe and do good works that He will surely make them Successors in the earth, as He made Successors from among those who were before them; and that He will surely establish for them their religion which He has chosen for them; and that He will surely give them in exchange security and peace after their fear: They will worship Me, and they will not associate anything with Me. Then whoso is ungrateful after that, they will be the rebellious.", "french": " Allāh a promis à ceux d’entre vous qui croient, et qui font de bonnes œuvres, qu’Il fera assurément d’eux des Successeurs sur la terre, tout comme Il a fait des Successeurs de parmi ceux qui les ont devancés ; et qu’Il établira assurément pour eux leur religion qu’Il a choisie pour eux ; et qu’Il leur donnera assurément en échange, après leur crainte, sécurité et paix : Ils M’adoreront, et ne M’associeront rien. Puis quiconque sera ingrat après cela, celui-là sera du nombre des rebelles.", "german": " Verheißen hat Allah denen unter euch, die glauben und gute Werke tun, dass Er sie gewisslich zu Nachfolgern auf Erden machen wird, wie Er jene, die vor ihnen waren, zu Nachfolgern machte; und dass Er gewisslich für sie ihre Religion befestigen wird, die Er für sie auserwählt hat; und dass Er gewisslich ihren (Stand), nach ihrer Furcht, in Frieden und Sicherheit verwandeln wird: Sie werden Mich verehren, (und) sie werden Mir nichts zur Seite stellen. Wer aber hernach undankbar ist, das werden die Empörer sein.", "spanish": " Al‑lah ha prometido a aque­llos de vosotros que crean y hagan buenas obras, que en verdad les hará Sucesores en la tierra, tal como nombró Sucesores de entre quienes existieron antes que ellos; y que Él en verdad establecerá para ellos su religión que les ha elegido; y que ciertamente les dará a cambio seguridad y paz des­pués de su temor: Ellos Me adorarán y no asociarán a nadie conmigo. Luego, quienes después de eso, sean desagradecidos, serán los rebel­des.", "urdu": " اللہ نے تم میں سے ایمان لانے والوں اور مناسب حال عمل کرنے والوں سے وعدہ کیا ہے کہ وہ ان کو زمین میں خلیفہ بنا دے گا۔ جس طرح ان سے پہلے لوگوں کو خلیفہ بنا دیا تھا۔ اور جو دین اس نے ان کے لئے پسند کیا ہے وہ ان کے لئے اُسے مضبوطی سے قائم کر دے گا اور ان کے خوف کی حالت کے بعد وہ ان کے لئے امن کی حالت تبدیل کر دے گا۔ وہ میری عبادت کریں گے (اور) کسی چیز کو میرا شریک نہیں بنائیں گے اور جو لوگ اس کے بعد بھی انکار کریں گے وہ نافرمانوں میں سے قرار دیئے جائیں گے۔"}, {"arabic": " وَ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ وَ اَطِیۡعُوا الرَّسُوۡلَ لَعَلَّکُمۡ تُرۡحَمُوۡنَ ﴿۵۷﴾", "english": " And observe Prayer and give the Zakat and obey the Messenger, that you may be shown mercy.", "french": " Et observez la Prière et payez la Zakāt et obéissez au Messager, afin que miséricorde vous soit faite.", "german": " Und verrichtet das Gebet und zahlet die Zakât und gehorchet dem Gesandten, auf dass ihr Barmherzigkeit empfangen möget.", "spanish": " Cumplid la Oración, dad el Zakat y obedeced al Mensajero, para que se os muestre misericordia.", "urdu": " اور تم سب نمازوں کو قائم کرو اور زکٰوتیں دو‘ اور اس رسول کی اطاعت کرو تا کہ تم پر رحم کیا جائے۔"}, {"arabic": " لَا تَحۡسَبَنَّ الَّذِیۡنَ کَفَرُوۡا مُعۡجِزِیۡنَ فِی الۡاَرۡضِ ۚ وَ مَاۡوٰٮہُمُ النَّارُ ؕ وَ لَبِئۡسَ الۡمَصِیۡرُ ﴿٪۵۸﴾", "english": " Think not that those who disbelieve can frustrate Our plan in the earth; their abode is Hell; and it is indeed an evil resort.", "french": " Ne pense pas que ceux qui ne croient pas peuvent faire échouer Notre dessein sur terre ; leur habitation est le Feu, et la destination est vraiment mauvaise !", "german": " Wähne nicht, die da ungläubig sind, könnten auf Erden entrinnen; ihr Aufenthalt ist die Hölle; und eine schlimme Bestimmung ist das fürwahr.", "spanish": " No penséis que los incrédulos pueden frustrar Nuestro plan en la tierra; su morada es el Infierno; ¡qué lugar más malo es en verdad!.", "urdu": " (اور اے مخاطب) کبھی خیال نہ کر کہ کفار زمین میں ہمیں اپنی تدبیروں سے عاجز کر دیں گے اور ان کا ٹھکانا تو دوزخ ہے اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لِیَسۡتَاۡذِنۡکُمُ الَّذِیۡنَ مَلَکَتۡ اَیۡمَانُکُمۡ وَ الَّذِیۡنَ لَمۡ یَبۡلُغُوا الۡحُلُمَ مِنۡکُمۡ ثَلٰثَ مَرّٰتٍ ؕ مِنۡ قَبۡلِ صَلٰوۃِ الۡفَجۡرِ وَ حِیۡنَ تَضَعُوۡنَ ثِیَابَکُمۡ مِّنَ الظَّہِیۡرَۃِ وَ مِنۡۢ بَعۡدِ صَلٰوۃِ الۡعِشَآءِ ۟ؕ ثَلٰثُ عَوۡرٰتٍ لَّکُمۡ ؕ لَیۡسَ عَلَیۡکُمۡ وَ لَا عَلَیۡہِمۡ جُنَاحٌۢ بَعۡدَہُنَّ ؕ طَوّٰفُوۡنَ عَلَیۡکُمۡ بَعۡضُکُمۡ عَلٰی بَعۡضٍ ؕ کَذٰلِکَ یُبَیِّنُ اللّٰہُ لَکُمُ الۡاٰیٰتِ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۵۹﴾", "english": " O ye who believe! let those whom your right hands possess, and those of you who have not attained to puberty, ask leave of you at three times before coming into your presence : before the morning Prayer, and when you take off your clothes at noon in summer, and after the night Prayer. These are three times of privacy for you. At times other than these there is no blame on you or on them, for they have to move about waiting upon you, some of you attending upon others. Thus does Allah make plain to you the Signs; for Allah is All-Knowing, Wise.", "french": " Ô vous qui croyez ! Que ceux que vos mains droites possèdent et ceux d’entre vous qui n’ont pas atteint l’âge de puberté, vous demandent la permission avant d’entrer dans votre chambre à trois moments différents : avant la Prière du matin et lorsque vous enlevez vos vêtements à midi en été et le soir après la Prière d’Ichā. Ce sont là trois moments d’intimité pour vous. A d’autres moments, il n’y a aucun blâme sur vous, ni sur eux, car certains d’entre vous ont à servir les autres et à circuler librement selon le besoin . C’est ainsi qu’Allāh rend les Signes clairs pour vous ; car Allāh est Omniscient, Sage.", "german": " O die ihr glaubt, es sollen die, welche eure Rechte besitzt, und die unter euch, die noch nicht die Reife erlangt haben, euch um Erlaubnis bitten zu dreien Zeiten: vor dem Morgengebet, und wenn ihr eure Kleider ablegt wegen der Mittagshitze, und nach dem Abendgebet – für euch drei Zeiten der Zurückgezogenheit. Nach diesen ist es für euch und für sie keine Sünde, wenn die einen von euch sich um die anderen zu schaffen machen. Also macht euch Allah die Gebote klar, denn Allah ist allwissend, allweise.", "spanish": " ¡Vosotros, los que creéis! haced que aquellos que poseen vuestras diestras y aquellos de vosotros que no han alcanzado la pubertad, os pidan permiso tres veces antes de entrar a vuestra presencia: antes de la Oración de la mañana y cuando os quitéis las ropas al ediodía en ve­rano, y después de la Oración de la noche. Éstos son tres momentos de intimidad para vosotros. En horas distintas a éstas no hay culpa para vosotros ni para ellos, pues tendrán que moverse esperándoos, algunos de vosotros visitando a los demás. Así os aclara Dios los Signos; pues Al‑lah es Omnisciente, Sabio.", "urdu": " اے مومنو! چاہیئے کہ وہ لوگ جن کے مالک تمہارے دائیں ہاتھ ہیں اور وہ لوگ جو ابھی بلوغت کو نہیں پہنچے وہ تین وقتوں میں اجازت لے کراندر آیا کریں‘ صبح کی نماز سے پہلے‘ اور جب تم دوپہر کے وقت اپنے کپڑے اتارتے ہو‘ اور عشاء کی نماز کے بعد۔ یہ تین وقت تمہارے پردے کے وقت ہیں‘ ان وقتوں کے بعد (اندر آنے جانے پر) نہ تم پر کوئی گناہ ہے اور نہ ان پر کوئی گناہ ہے۔ کیونکہ بعض تم میں سے بعض کے پاس اکثر آتے جاتے ہیں۔ اسی طرح اللہ اپنے احکام کھول کر بیان کرتا ہے اور اللہ بہت علم والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ اِذَا بَلَغَ الۡاَطۡفَالُ مِنۡکُمُ الۡحُلُمَ فَلۡیَسۡتَاۡذِنُوۡا کَمَا اسۡتَاۡذَنَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ کَذٰلِکَ یُبَیِّنُ اللّٰہُ لَکُمۡ اٰیٰتِہٖ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۶۰﴾", "english": " And when the children among you attain to puberty, they too should ask permission, even as those mentioned before them asked permission. Thus does Allah make plain to you His commandments; and Allah is All-Knowing, Wise.", "french": " Et lorsque les enfants parmi vous atteignent l’âge de la puberté, eux aussi doivent vous demander la permission, ainsi que leurs aînés avant eux vous demandaient permission. C’est ainsi qu’Allāh rend Ses commandements clairs pour vous ; et Allāh est Omniscient, Sage.", "german": " Wenn die Kinder unter euch ihre Reife erlangen, dann sollen sie (auch) um Erlaubnis bitten, gerade so wie die vor ihnen um Erlaubnis baten. Also macht euch Allah Seine Gebote klar, denn Allah ist allwissend, allweise.", "spanish": " Cuando vuestros hijos alcan­cen la pubertad, tam­bién eberán pedir permiso, al igual que deben pedir permiso los antes mencionados . Así os aclara Al‑lah Sus manda­mientos; pues Al‑lah es Omnisciente, Sabio.", "urdu": " اور جب تمہارے بچے بلوغت کو پہنچ جائیں تو اسی طرح اجازت لیا کریں جس طرح ان سے پہلے (یعنی بڑے) لوگ اجازت لیا کرتے تھے۔ اسی طرح اللہ اپنے احکام تمہارے لئے بیان کرتا ہے اور اللہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ الۡقَوَاعِدُ مِنَ النِّسَآءِ الّٰتِیۡ لَا یَرۡجُوۡنَ نِکَاحًا فَلَیۡسَ عَلَیۡہِنَّ جُنَاحٌ اَنۡ یَّضَعۡنَ ثِیَابَہُنَّ غَیۡرَ مُتَبَرِّجٰتٍۭ بِزِیۡنَۃٍ ؕ وَ اَنۡ یَّسۡتَعۡفِفۡنَ خَیۡرٌ لَّہُنَّ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۶۱﴾", "english": " As to elderly women, who have no desire for marriage — there is no blame on them if they lay aside their outer clothing without displaying their beauty. But to abstain from that even is better for them. And Allah is All-Hearing, All-Knowing.", "french": " Quant aux femmes âgées qui ont dépassé l’âge du mariage – il n’y a rien à leur reprocher si elles laissent de côté leurs vêtements extérieurs , sans étaler leurs charmes. Et qu'elles s' en abstiennent par mesure de discrétion, ce serait encore meilleur pour elles. Et Allāh entend tout et sait tout.", "german": " (Was nun) die älteren Frauen (betrifft), die nicht mehr auf Heirat hoffen können, so trifft sie kein Vorwurf, wenn sie ihre Tücher ablegen, ohne ihre Zierde zur Schau zu stellen. Dass sie sich dessen enthalten, ist besser für sie. Und Allah ist allhörend, allwissend.", "spanish": " En cuanto a las mujeres ma­yores, que han pasado la edad del matri­monio, no hay culpa en ellas si dejan a un lado sus vestiduras exte­riores sin mostrar deliberadamente su tractivo. Pero si prefieren ejercer mayor cautela para guardar su pureza eso es aún mejor para ellas. Pues Al‑lah es Quien lo oye todo, el Omnisciente.", "urdu": " اور وہ عورتیں جو کہ بڑھیا ہو گئی ہیں اور نکاح کے قابل نہیں۔ ان پر کوئی گناہ نہیں ہے کہ اپنے کپڑے اتار کر رکھ دیں اس طرح کہ زینت کو ظاہر نہ کیا کریں۔ اور ان کا بچے رہنا ان کے لئے بہتر ہوگا اور اللہ بہت سننے والا (اور) جاننے والا ہے۔"}, {"arabic": " لَیۡسَ عَلَی الۡاَعۡمٰی حَرَجٌ وَّ لَا عَلَی الۡاَعۡرَجِ حَرَجٌ وَّ لَا عَلَی الۡمَرِیۡضِ حَرَجٌ وَّ لَا عَلٰۤی اَنۡفُسِکُمۡ اَنۡ تَاۡکُلُوۡا مِنۡۢ بُیُوۡتِکُمۡ اَوۡ بُیُوۡتِ اٰبَآئِکُمۡ اَوۡ بُیُوۡتِ اُمَّہٰتِکُمۡ اَوۡ بُیُوۡتِ اِخۡوَانِکُمۡ اَوۡ بُیُوۡتِ اَخَوٰتِکُمۡ اَوۡ بُیُوۡتِ اَعۡمَامِکُمۡ اَوۡ بُیُوۡتِ عَمّٰتِکُمۡ اَوۡ بُیُوۡتِ اَخۡوَالِکُمۡ اَوۡ بُیُوۡتِ خٰلٰتِکُمۡ اَوۡ مَا مَلَکۡتُمۡ مَّفَاتِحَہٗۤ اَوۡ صَدِیۡقِکُمۡ ؕ لَیۡسَ عَلَیۡکُمۡ جُنَاحٌ اَنۡ تَاۡکُلُوۡا جَمِیۡعًا اَوۡ اَشۡتَاتًا ؕ فَاِذَا دَخَلۡتُمۡ بُیُوۡتًا فَسَلِّمُوۡا عَلٰۤی اَنۡفُسِکُمۡ تَحِیَّۃً مِّنۡ عِنۡدِ اللّٰہِ مُبٰرَکَۃً طَیِّبَۃً ؕ کَذٰلِکَ یُبَیِّنُ اللّٰہُ لَکُمُ الۡاٰیٰتِ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿٪۶۲﴾", "english": " There is no harm for the blind and there is no harm for the lame, and there is no harm for the sick and none for yourselves, that you eat from your own houses, or the houses of your fathers, or the houses of your mothers or the houses of your brothers, or the houses of your sisters, or the houses of your fathers’ brothers or the houses of your fathers’ sisters, or the houses of your mothers’ brothers, or the houses of your mothers’ sisters, or from that of which the keys are in your possession, or from the house of a friend of yours. There is no harm for you whether you eat together or separately. But when you enter houses, salute your people — a greeting from your Lord, full of blessing and purity. Thus does Allah make plain to you the commandments, that you may understand.", "french": " Il n’y a aucun mal pour l’aveugle, et il n’y a aucun mal pour le boiteux, et il n’y a aucun mal pour le malade, ni pour vous-mêmes, à ce que vous mangiez dans votre propre maison, ou dans la maison de votre père, ou dans la maison de votre mère, ou dans la maison de vos frères, ou dans la maison de vos soeurs, ou dans la maison des frères de votre père, ou dans la maison des soeurs de votre père, ou dans la maison des frères de votre mère, ou dans la maison des soeurs de votre mère, ou dans celles dont vous possédez les clés, ou dans la maison d’un ami à vous. Il n’y a aucun mal pour vous que vous mangiez ensemble ou séparément. Mais lorsque vous entrez dans les maisons, saluez vos gens avec la salutation de la paix – une salutation de votre Seigneur, pleine de bénédiction et de pureté. C’est ainsi qu’Allāh rend clairs pour vous les commandements, afin que vous compreniez", "german": " Kein Vorwurf trifft den Blinden, noch trifft ein Vorwurf den Lahmen, kein Vorwurf trifft den Kranken oder euch selbst, wenn ihr in euren eigenen Häusern esset, oder den Häusern eurer Väter, oder den Häusern eurer Mütter, oder den Häusern eurer Brüder, oder den Häusern eurer Schwestern, oder den Häusern eurer Vatersbrüder, oder den Häusern eurer Vatersschwestern, oder den Häusern eurer Mutterbrüder, oder den Häusern eurer Mutterschwestern, oder in einem (Haus), dessen Schlüssel in eurer Obhut sind, oder (in dem Haus) eures Freundes. Es ist keine Sünde für euch, ob ihr zusammen esset oder gesondert. Doch wenn ihr Häuser betretet, so grüßet einander mit einem gesegneten, lauteren Gruß von Allah. Also macht euch Allah die Gebote klar, auf dass ihr begreifet.", "spanish": " No habrá culpa para el ciego ni culpa para el cojo, ni culpa para el enfermo, ni para vosotros mismos, si coméis de vuestras propias casas o de las casas de vuestros padres, o las casas de vuestras madres o de vues­tros hermanos, o las casas de vues­tras hermanas, o las de los hermanos o hermanas de vuestros padres, o las casas de los hermanos o hermanas de vuestras madres, o de las casas cuyas llaves estén en vuestro poder, o de la casa de un amigo vuestro. Tampoco seréis culpados si coméis juntos o separados. Pero cuando entréis en las casas, saludad a vues­tras gentes: un saludo de vuestro Señor, lleno de bendiciones y pureza. Así Al‑lah os aclara los mandamien­tos, para que entendáis.", "urdu": " نہ اندھوں پر‘ نہ لنگڑوں پر‘ نہ مریض پر‘ نہ تم پر اپنے گھروں سے یا اپنے باپ دادوں کے گھروں سے یا اپنی ماٶں (یا ننھیال) کے گھر سے یا اپنے بھائیوں کے گھر سے یا اپنی بہنوں کے گھر سے یا اپنے چچوں کے گھر سے یا اپنی پھوپھیوں کے گھر سے یا اپنے ماموٶں کے گھر سے یا اپنی خالاٶں کے گھر سے یا جن کے سامان کے انتظام پر تم مقرر ہو‘ یا اپنے دوستوں کے گھروں سے کوئی چیز لے کر کھا لینے میں کوئی حرج ہے (اسی طرح) تم پر کوئی گناہ نہیں کہ تم سب مل کر کھاٶ یا الگ الگ کھاٶ۔ پس جب گھروں میں داخل ہونے لگو تو اپنے عزیزوں یا دوستوں پر سلام کہہ لیا کرو۔ یہ اللہ کی طرف سے ایک بڑی برکت والی اور پاکیزہ دعا ہے۔ اسی طرح اللہ اپنے احکام تمہیں کھول کر سناتا ہے تا کہ تم عقل سے کام لو۔"}, {"arabic": " اِنَّمَا الۡمُؤۡمِنُوۡنَ الَّذِیۡنَ اٰمَنُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ وَ اِذَا کَانُوۡا مَعَہٗ عَلٰۤی اَمۡرٍ جَامِعٍ لَّمۡ یَذۡہَبُوۡا حَتّٰی یَسۡتَاۡذِنُوۡہُ ؕ اِنَّ الَّذِیۡنَ یَسۡتَاۡذِنُوۡنَکَ اُولٰٓئِکَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِاللّٰہِ وَ رَسُوۡلِہٖ ۚ فَاِذَا اسۡتَاۡذَنُوۡکَ لِبَعۡضِ شَاۡنِہِمۡ فَاۡذَنۡ لِّمَنۡ شِئۡتَ مِنۡہُمۡ وَ اسۡتَغۡفِرۡ لَہُمُ اللّٰہَ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۶۳﴾", "english": " Those only are true believers who believe in Allah and His Messenger, and who, when they are with him on some matter of common importance which has brought them together, go not away until they have asked leave of him. Surely those who ask leave of thee, it is they who really believe in Allah and His Messenger. So, when they ask thy leave for some affair of theirs, give leave to those of them whom thou pleasest, and ask forgiveness for them of Allah. Surely, Allah is Most Forgiving, Merciful.", "french": " Seuls sont de vrais croyants, ceux qui croient en Allāh et en Son Messager, et qui, lorsqu’ils se trouvent avec lui pour quelque affaire d’importance commune, ne s’en vont pas avant de lui en avoir demandé la permission. Assurément, ceux qui te demandent permission, ceux-là croient réellement en Allāh et en Son Messager. Ainsi, lorsqu’ils te demandent la permission de partir pour quelque affaire personnelle, accorde la permission à qui tu veux d’entre eux, et demande pardon pour eux auprès d’Allāh. Assurément, Allāh est Très-Pardonnant, Miséricordieux.", "german": " Nur die sind Gläubige, die an Allah glauben und an Seinen Gesandten und die, wenn sie in einer für alle wichtigen Angelegenheit bei ihm sind, nicht eher fortgehen, als bis sie ihn um Erlaubnis gebeten haben. Die dich um Erlaubnis bitten, das sind diejenigen, die (wirklich) an Allah und Seinen Gesandten glauben. Wenn sie dich also um Erlaubnis bitten für irgendein eigenes Geschäft, so gib Erlaubnis, wem du willst von ihnen, und bitte Allah für sie um Verzeihung. Wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " En verdad, sólo son verdaderos creyentes los que creen en Al‑lah y en Su Mensajero, y no se marchan sin pedirle permiso cuando se encuentran con él reunidos por algún asunto de importancia comunitaria. n verdad, quienes te piden consentimiento son los que creen realmente en Al‑lah y en Su Mensajero. Por ello, cuando te pidan permiso para algún asunto suyo, dáselo a quienes desees y pide perdón por ellos a Al‑lah. En verdad, Al‑lah es el Sumo Indul­gente, Misericordioso.", "urdu": " صرف وہی لوگ مومن کہلانے کے مستحق ہیں جو اللہ اور اس کے رسول پر ایمان لاتے ہیں اور جب کسی قومی کام کے لئے اس (رسول) کے پاس بیٹھے ہوں تو اٹھ کر نہیں جاتے جب تک اس کی اجازت نہ لے لیں۔ وہ لوگ جو کہ اجازت لے کر جاتے ہیں وہی اللہ اور اس کے رسول پر ایمان رکھتے ہیں۔ پس جب وہ اپنے کسی اہم کام کے لئے تجھ سے اجازت لیں تو ان میں سے جن کے متعلق تو چاہے انہیں اجازت دے دے۔ اور اللہ سے ان کے لئے بخشش مانگ۔ اور اللہ یقیناً بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " لَا تَجۡعَلُوۡا دُعَآءَ الرَّسُوۡلِ بَیۡنَکُمۡ کَدُعَآءِ بَعۡضِکُمۡ بَعۡضًا ؕ قَدۡ یَعۡلَمُ اللّٰہُ الَّذِیۡنَ یَتَسَلَّلُوۡنَ مِنۡکُمۡ لِوَاذًا ۚ فَلۡیَحۡذَرِ الَّذِیۡنَ یُخَالِفُوۡنَ عَنۡ اَمۡرِہٖۤ اَنۡ تُصِیۡبَہُمۡ فِتۡنَۃٌ اَوۡ یُصِیۡبَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۶۴﴾", "english": " Treat not the calling of the Messenger among you like the calling of one of you to another. Allah does know those of you who steal away covertly. So let those who go against His command beware lest a trial afflict them or a grievous punishment overtake them.", "french": " Ne considérez pas l’appel du Messager parmi vous comme l’appel de l’un d’entre vous à un autre. Allāh connaît ceux d’entre vous qui s’esquivent en se cachant. Alors, que ceux qui s’opposent à Son commandement prennent garde qu’une épreuve ne les afflige, ou qu’un châtiment douloureux ne les surprenne.", "german": " Erachtet nicht den Ruf des Gesandten unter euch gleich dem Ruf des einen von euch nach dem anderen. Allah kennt diejenigen unter euch, die sich hinwegstehlen, indem sie sich verstecken. So mögen die, die sich seinem Befehl widersetzen, sich hüten, dass sie nicht Drangsal befalle oder eine schmerzliche Strafe sie ereile.", "spanish": " No tratéis la llamada del Men­sajero como la llamada de uno a otro entre vosotros. Al‑lah en verdad conoce a aquellos de vosotros que se retiran furtivamente. Que quienes actúan contra Su mandamiento se prevengan, no sea que les aflija una prueba y caiga sobre ellos un do­loroso castigo.", "urdu": " (اے مومنو)! یہ نہ سمجھو کہ رسول کا تم میں سے کسی کو بلانا ایسا ہی ہے جیسا کہ تم میں سے بعض کا بعض کو بلانا۔ اللہ ان لوگوں کو جانتا ہے جو کہ تم میں سے پہلو بچا کر (مشورہ کی مجلس سے) بھاگ جاتے ہیں۔ پس چاہیئے کہ جو اس (رسول) کے حکم کی مخالفت کرتے ہیں اس سے ڈریں کہ ان کو خدا کی طرف سے کوئی آفت نہ پہنچ جائے یا ان کو دردناک عذاب نہ پہنچ جائے۔"}, {"arabic": " اَلَاۤ اِنَّ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ قَدۡ یَعۡلَمُ مَاۤ اَنۡتُمۡ عَلَیۡہِ ؕ وَ یَوۡمَ یُرۡجَعُوۡنَ اِلَیۡہِ فَیُنَبِّئُہُمۡ بِمَا عَمِلُوۡا ؕ وَ اللّٰہُ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿٪۶۵﴾", "english": " Hearken ye! To Allah belongs whatsoever is in the heavens and the earth. He does know in what condition you are. And on the day when they will be returned unto Him, He will inform them of what they did. And Allah knows everything full well.", "french": " Ecoutez bien ! A Allāh appartient tout ce qui est dans les cieux et sur la terre. Il sait dans quelle condition vous êtes. Et au jour où ils seront ramenés à Lui, Il les informera de ce qu’ils ont fait. Et Allāh connaît toutes choses très bien.", "german": " Höret: Allahs ist, was in den Himmeln und auf der Erde ist. Er kennt euren Zustand wohl. Und an dem Tage, wo sie zu Ihm zurückgebracht werden, da wird Er ihnen ankündigen, was sie getan. Und Allah weiß alle Dinge wohl.", "spanish": " ¡Oíd! A Al‑lah pertenece cuanto hay en los cielos y en la tierra. Ciertamente Él sabe lo que sois. Y en el día en que sean retornados a Él, les informará de lo que hicieron. Pues Al‑lah conoce todo perfecta­mente bien.", "urdu": " سنو‘ جو کچھ آسمانوں اور زمین میں ہے اللہ کا ہی ہے۔ جس (مقام) پر تم (کھڑے) ہو اس کو بھی اللہ ہی جانتا ہے اور جس دن وہ لوگ اللہ کی طرف لوٹائے جائیں گے تو وہ ان کو ان کے اعمال کے حال بتائے گا اور اللہ ہر ایک چیز کو خوب جانتا ہے۔"}], "Surah": 24}