{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰہُ لَکَ ۚ تَبۡتَغِیۡ مَرۡضَاتَ اَزۡوَاجِکَ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۲﴾", "english": " O Prophet! why dost thou forbid thyself that which Allah has made lawful to thee, seeking the pleasure of thy wives? And Allah is Most Forgiving, Merciful.", "french": " Ô Prophète ! pourquoi t’interdis-tu ce qu’Allāh t’a rendu licite ? Tu cherches à plaire à tes épouses ? Et Allāh est Très Pardonnant, Miséricordieux.", "german": " O Prophet! warum untersagst du (dir) das, was Allah dir erlaubt hat? Suchst du deinen Frauen zu gefallen? Und Allah ist allverzeihend, barmherzig.", "spanish": " ¡Oh, Profeta! ¿Por qué te prohíbes lo que Al-lah ha hecho lícito para ti, buscando el agrado de tus esposas? Pues Al-lah es Sumamente Indulgente, Misericordioso.", "urdu": " اے نبی! تو اس (چیز) کو کیوں حرام کرتا ہے جس کو اللہ نے تیرے لئے حلال کیا ہے تو اپنی بیویوں کی خوشی چاہتا ہے اور اللہ بہت بخشنے والا (اور) بے انتہا کرم کرنے والا ہے۔"}, {"arabic": " قَدۡ فَرَضَ اللّٰہُ لَکُمۡ تَحِلَّۃَ اَیۡمَانِکُمۡ ۚ وَ اللّٰہُ مَوۡلٰٮکُمۡ ۚ وَ ہُوَ الۡعَلِیۡمُ الۡحَکِیۡمُ ﴿۳﴾", "english": " Allah has indeed allowed to you the dissolution of your oaths, and Allah is your Friend; and He is All-Knowing, Wise.", "french": " En vérité, Allāh vous a ordonné de vous libérer de vos serments ayant trait à l’affaire susmentionnée , et Allāh est votre Gardien ; et Il est l’ Omniscient, le Sage.", "german": " Allah hat in der Tat euch die Lösung eurer Eide erlaubt, und Allah ist euer Beschützer; und Er ist der Allwissende, der Allweise.", "spanish": " Al-lah ha sancionado la liberación de vuestros juramentos en relación con lo anteriormente citado , pues Al-lah es vuestro Tutor; y Él es Omnisciente, Sabio.", "urdu": " اللہ نے تم پر ایسی قسموں کے کھولنے کو واجب کیا ہے (جن سے فتنہ پیدا ہو) اور اللہ تمہارا آقا ہے اور وہ بہت جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ اِذۡ اَسَرَّ النَّبِیُّ اِلٰی بَعۡضِ اَزۡوَاجِہٖ حَدِیۡثًا ۚ فَلَمَّا نَبَّاَتۡ بِہٖ وَ اَظۡہَرَہُ اللّٰہُ عَلَیۡہِ عَرَّفَ بَعۡضَہٗ وَ اَعۡرَضَ عَنۡۢ بَعۡضٍ ۚ فَلَمَّا نَبَّاَہَا بِہٖ قَالَتۡ مَنۡ اَنۡۢبَاَکَ ہٰذَا ؕ قَالَ نَبَّاَنِیَ الۡعَلِیۡمُ الۡخَبِیۡرُ ﴿۴﴾", "english": " And when the Prophet confided a matter unto one of his wives and she then divulged it, and Allah informed him of it, he made known to her part thereof, and avoided mentioning part of it . And when he informed her of it, she said, ‘Who has informed thee of it?’ He said, ‘The All-Knowing, the All-Aware God has informed me.’", "french": " Et lorsque le Prophète confia une affaire à une de ses épouses, et qu’ensuite elle la divulgua, et qu’Allāh en informa le Prophète , il en fit connaître une partie à son épouse et passa sur une partie. Et lorsqu’il l’en informa, elle dit : « Qui t’en a informé ? » Il répondit : « Le Dieu Omniscient, Très-Conscient m’ en a informé. »", "german": " Als der Prophet einer seiner Frauen einen Vorfall anvertraute und sie ihn dann ausplauderte und Allah ihm davon Kunde gab, da ließ er (sie) einen Teil davon wissen, und verschwieg einen Teil. Und als er es ihr vorhielt, da sprach sie: \"Wer hat dir dies gesagt?\" Er sprach: \"Der Allwissende, der Allkundige hat es mir gesagt.\"", "spanish": " Y cuando el profeta confió un secreto a una de sus esposas y ella lo ivulgó, Al-lah le informó al respecto, y él le dio a conocer a ella parte del mismo y evitó mencionar otra parte. Mas cuando le informó de ello, ella dijo: “¿Quién te lo ha informado?” Él contestó: “El Omnisciente, el Dios que todo lo sabe, me ha informado”.", "urdu": " اور یاد کرو جب نبی نے اپنی بیویوں میں سے کسی ایک سے ایک مخفی بات کہی۔ پھر جب اس نے وہ بات کسی کو بتا دی اور اللہ نے اس (کمزوری) کی خبر اس (یعنی نبی) کو دے دی‘ تو اس نے (بات کا) کچھ حصہ بیوی کو بتا دیا اور کچھ حصہ سے پردہ پوشی کی۔ پھر جب اس نے امر واقعہ کی خبر اس (بیوی) کو دی تو اس نے کہا کہ آپ کو یہ خبر کس نے دی ہے اس پر اس (یعنی نبی) نے کہا کہ مجھے بڑے علم والے (اور) واقف کار خدا نے خبر دی ہے۔"}, {"arabic": " اِنۡ تَتُوۡبَاۤ اِلَی اللّٰہِ فَقَدۡ صَغَتۡ قُلُوۡبُکُمَا ۚ وَ اِنۡ تَظٰہَرَا عَلَیۡہِ فَاِنَّ اللّٰہَ ہُوَ مَوۡلٰٮہُ وَ جِبۡرِیۡلُ وَ صَالِحُ الۡمُؤۡمِنِیۡنَ ۚ وَ الۡمَلٰٓئِکَۃُ بَعۡدَ ذٰلِکَ ظَہِیۡرٌ ﴿۵﴾", "english": " Now if you two turn unto Allah repentant, it will be better for you , and your hearts are already so inclined. But if you back up each other against him, surely Allah is his Helper and Gabriel and the righteous among the believers; and furthermore, all other angels too are his helpers.", "french": " Maintenant , si vous vous tournez toutes deux repentantes vers Allāh, cela sera meilleur pour vous , et votre cœur y est déjà porté. Mais si vous vous soutenez l’une l’autre contre lui, assurément Allāh est son Aide, ainsi que Gabriel et les justes d’entre les croyants ; et en outre, tous les autres anges aussi sont ses aides.", "german": " Wenn ihr beide euch reuig Allah zuwendet, so sind eure Herzen bereits (dazu) geneigt. Doch wenn ihr euch gegenseitig gegen ihn unterstützt, wahrlich, dann ist Allah sein Helfer und Gabriel und die Rechtschaffenen unter den Gläubigen; und außerdem sind die Engel (seine) Helfer.", "spanish": " Ahora bien, si ambas volvéis a Al-lah arrepentidas, será mejor para vosotras, y vuestros corazones están ya así inclinados. Pero si os apoyáis mutuamente contra él, en verdad Al-lah es su Socorredor, y también Gabriel y los más justos entre los creyentes; además, todos los demás ángeles son ayudantes suyos.", "urdu": " پھر اس نے کہا کہ اے دونوں بیویو! اگر تم اپنی غلطی پر اللہ سے توبہ کرو تو تم دونوں کے دل تو پہلے ہی اس بات کی طرف جھکے ہوئے ہیں (اور توبہ کے لئے تیار ہیں) اور اگر تم دونوں ایک دوسرے کی پشت پناہی کے لئے کھڑی ہو جاٶ تو یاد رکھو کہ اللہ اس رسول کا دوست ہے‘ اسی طرح جبریل اور سب مومن اور علاوہ اس کے فرشتے بھی نبی کی پشت پر ہیں۔"}, {"arabic": " عَسٰی رَبُّہٗۤ اِنۡ طَلَّقَکُنَّ اَنۡ یُّبۡدِلَہٗۤ اَزۡوَاجًا خَیۡرًا مِّنۡکُنَّ مُسۡلِمٰتٍ مُّؤۡمِنٰتٍ قٰنِتٰتٍ تٰٓئِبٰتٍ عٰبِدٰتٍ سٰٓئِحٰتٍ ثَیِّبٰتٍ وَّ اَبۡکَارًا ﴿۶﴾", "english": " It may be that, if he divorce you, his Lord will give him instead wives better than you — resigned, believing, obedient, always turning to God, devout in worship, given to fasting, both widows and virgins.", "french": " S’il divorce d’avec vous, il se peut que son Seigneur lui accorde à votre place des épouses qui soient meilleures que vous – soumises, croyantes, obéissantes, repentantes, dévotes, portées aux jeûnes, des veuves aussi bien que des vierges.", "german": " Vielleicht wird sein Herr ihm, wenn er sich von euch scheidet, an eurer Statt bessere Frauen geben, gottergebene, gläubige, gehorsame, reuige, fromme, fastende – Witwen und Jungfrauen.", "spanish": " Podría ocurrir que, si se divorcia de vosotras, su Señor le dé en vuestro lugar esposas mejores, resignadas, creyentes, obedientes, siempre encaminadas a Dios, devotas en la adoración, entregadas al ayuno, tanto viudas como vírgenes.", "urdu": " اس کے رب کے لئے بالکل ممکن ہے کہ اگر وہ تم کو طلاق دے دے تو وہ تم سے زیادہ اچھی بیویاں بدل کر اس کو دے دے جو مسلمان بھی ہوں مومن بھی ہوں فرمانبردار بھی ہوں توبہ کرنے والی‘ عبادت کرنے والی‘ روزہ رکھنے والی‘ بیوہ بھی ہوں اور کنواریاں بھی۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا قُوۡۤا اَنۡفُسَکُمۡ وَ اَہۡلِیۡکُمۡ نَارًا وَّ قُوۡدُہَا النَّاسُ وَ الۡحِجَارَۃُ عَلَیۡہَا مَلٰٓئِکَۃٌ غِلَاظٌ شِدَادٌ لَّا یَعۡصُوۡنَ اللّٰہَ مَاۤ اَمَرَہُمۡ وَ یَفۡعَلُوۡنَ مَا یُؤۡمَرُوۡنَ ﴿۷﴾", "english": " O ye who believe! save yourselves and your families from a Fire whose fuel is men and stones, over which are appointed angels, stern and severe, who disobey not Allah in what He commands them and do as they are commanded.", "french": " Ô vous qui croyez ! Préservez vos propres personnes ainsi que vos familles d’un Feu, dont le combustible est fait d’hommes et de pierres, et auquel sont préposés des anges durs et sévères qui ne désobéissent pas à Allāh en ce qu’Il leur commande, et font ce qu’il leur est commandé.", "german": " O die ihr glaubt, rettet euch und die Euren vor einem Feuer, dessen Brennstoff Menschen und Steine sind, darüber Engel gesetzt sind, streng, gewaltig, die Allah nicht ungehorsam sind in dem, was Er ihnen befiehlt, sondern alles vollbringen, was ihnen geheißen wird.", "spanish": " ¡Oh vosotros, los creyentes! Precaveos, vosotros y vuestras familias, de un Fuego cuyo combustible está formado de hombres y piedras, cuidado por ángeles inexorables y severos que no desobedecen a Al-lah en lo que Él les manda y hacen lo que se les ordena.", "urdu": " اے مومنو! اپنے اہل کو بھی اور اپنی جانوں کو بھی دوزخ سے بچاٶ جس کا ایندھن خاص لوگ (یعنی کافر) ہونگے اور اسی طرح پتھر (جن سے بت بنے) اس (دوزخ) پر ایسے ملائکہ مقرر ہیں جو کسی کی منت سماجت سننے والے نہیں بلکہ اپنے فرض کے ادا کرنے میں بڑے سخت ہیں اور اللہ نے ان کو جو حکم دیا ہے اس کی وہ نافرمانی نہیں کرتے اور جو کچھ کہا جاتا ہے وہی کرتے ہیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ کَفَرُوۡا لَا تَعۡتَذِرُوا الۡیَوۡمَ ؕ اِنَّمَا تُجۡزَوۡنَ مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ٪﴿۸﴾", "english": " O ye who disbelieve! make no excuses this day. You are requited for what you did.", "french": " Ô vous qui ne croyez pas ! ne vous excusez point aujourd’hui. Vous ne serez payés que pour ce que vous avez fait.", "german": " O die ihr ungläubig seid, bringt heute keine Entschuldigungen vor. Ihr werdet nur für das belohnt, was ihr zu tun pflegtet.", "spanish": " ¡Oh vosotros, los incrédulos! No os excuséis en este día. Seréis retribuidos por lo que hicisteis.", "urdu": " اے کافرو! آج عذر نہ کرو۔ تم کو تمہارے اعمال کے مطابق جزا ملے گی۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا تُوۡبُوۡۤا اِلَی اللّٰہِ تَوۡبَۃً نَّصُوۡحًا ؕ عَسٰی رَبُّکُمۡ اَنۡ یُّکَفِّرَ عَنۡکُمۡ سَیِّاٰتِکُمۡ وَ یُدۡخِلَکُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ۙ یَوۡمَ لَا یُخۡزِی اللّٰہُ النَّبِیَّ وَ الَّذِیۡنَ اٰمَنُوۡا مَعَہٗ ۚ نُوۡرُہُمۡ یَسۡعٰی بَیۡنَ اَیۡدِیۡہِمۡ وَ بِاَیۡمَانِہِمۡ یَقُوۡلُوۡنَ رَبَّنَاۤ اَتۡمِمۡ لَنَا نُوۡرَنَا وَ اغۡفِرۡ لَنَا ۚ اِنَّکَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۹﴾", "english": " O ye who believe! turn to Allah in sincere repentance. It may be that your Lord will remove the evil consequences of your deeds and make you enter Gardens through which rivers flow, on the day when Allah will not abase the Prophet nor those who have believed with him. Their light will run before them and on their right hands. They will say, ‘Our Lord, perfect our light for us and forgive us; surely Thou hast power over all things.’", "french": " Ô vous qui croyez ! tournez-vous vers Allāh avec un repentir sincère. Il se peut que votre Seigneur vous enlève vos méfaits, et qu’Il vous fasse entrer dans des Jardins sous lesquels coulent des ruisseaux, le jour où Allāh ne couvrira pas d’ignominie le Prophète ni ceux qui ont cru avec lui. Leur lumière courra devant eux et sur leur côté droit. Ils diront : « Notre Seigneur, rends notre lumière parfaite pour nous et pardonne-nous ; assurément Tu as le pouvoir de faire tout ce que Tu veux. »", "german": " O die ihr glaubt, wendet euch zu Allah in aufrichtiger Reue. Vielleicht wird euer Herr eure Übel von euch nehmen und euch in Gärten führen, durch die Ströme fließen, am Tage, da Allah den Propheten nicht zuschanden machen wird noch jene, die mit ihm glauben. Ihr Licht wird vor ihnen her eilen und auf ihrer Rechten. Sie werden sprechen: \"Unser Herr, mache unser Licht für uns vollkommen und vergib uns, denn Du vermagst alle Dinge zu tun.\"", "spanish": " ¡Oh vosotros, los creyentes! Dirigios a Al-lah con sincero rrepentimiento. Puede que vuestro Señor retire las consecuencias perversas de vuestras acciones y os permita entrar en Jardines por los que corren ríos, en el día en que Al-lah no afrentará al Profeta ni a quienes creyeron con él. Su luz correrá ante ellos y en sus diestras. Dirán: “Señor Nuestro, perfecciónanos nuestra luz y perdónanos; en verdad, Tú tienes poder sobre todas las cosas”.", "urdu": " اے مومنو! اللہ کی طرف خالص طور پر رجوع کرو (منافقت کی کوئی ملاوٹ نہ ہو) کوئی تعجب نہیں کہ تمہارا رب تمہاری بدیوں کو مٹا دے اور تم کو ایسی جنتوں میں داخل کرے جن کے نیچے نہریں بہتی ہیں اس دن جس دن اللہ اپنے نبی کو رسوا نہیں کرے گا اور نہ ان لوگوں کو جو اس کے ساتھ ایمان لائے ہیں ان کا نور ان کے آگے آگے بھی بھاگتا جائے گا اور دائیں پہلو کے ساتھ ساتھ بھی‘ وہ کہیں گے کہ اے ہمارے رب! ہمارا نور ہمارے فائدہ کے لئے پورا کر دے اور ہمیں معاف فرما‘ تو ہر چیز پر قادر ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ جَاہِدِ الۡکُفَّارَ وَ الۡمُنٰفِقِیۡنَ وَ اغۡلُظۡ عَلَیۡہِمۡ ؕ وَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۱۰﴾", "english": " O Prophet! strive hard against the disbelievers and the hypocrites; and be strict against them. Their home is Hell, and an evil destination it is!", "french": " Ô Prophète ! Lutte vigoureusement contre les mécréants et les hypocrites ; et sois sévère envers eux. Leur habitation est l’Enfer, et quelle mauvaise destination que celle-là !", "german": " O Prophet! streite wider die Ungläubigen und die Heuchler; und sei streng gegen sie. Ihr Aufenthalt ist die Hölle, und eine üble Bestimmung ist das!", "spanish": " ¡Oh, Profeta! Esfuérzate con denuedo contra los incrédulos y los hipócritas; y sé estricto contra ellos. Su lugar es el Infierno: ¡qué pésimo destino es!", "urdu": " اے نبی! کافروں اور منافقوں کے خلاف خوب تبلیغ کر اور ان کا کوئی اثر قبول نہ کر‘ اور (سمجھ لے کہ) ان کا ٹھکانا جہنم ہے اور وہ بہت برا ٹھکانا ہے۔"}, {"arabic": " ضَرَبَ اللّٰہُ مَثَلًا لِّلَّذِیۡنَ کَفَرُوا امۡرَاَتَ نُوۡحٍ وَّ امۡرَاَتَ لُوۡطٍ ؕ کَانَتَا تَحۡتَ عَبۡدَیۡنِ مِنۡ عِبَادِنَا صَالِحَیۡنِ فَخَانَتٰہُمَا فَلَمۡ یُغۡنِیَا عَنۡہُمَا مِنَ اللّٰہِ شَیۡئًا وَّ قِیۡلَ ادۡخُلَا النَّارَ مَعَ الدّٰخِلِیۡنَ ﴿۱۱﴾", "english": " Allah sets forth for those who disbelieve the example of the wife of Noah and the wife of Lot. They were under two righteous servants of Ours, but they acted unfaithfully towards them. So they availed them naught against Allah, and it was said to them , ‘Enter the Fire, ye twain, along with those who enter.’", "french": " Allāh propose à l’intention des mécréants l’exemple de la femme de Noé et de la femme de Lot. Elles étaient sous deux de Nos serviteurs pieux, mais elles agirent déloyalement envers eux. Aussi, ils ne leur furent d’aucun recours contre Allāh, et il leur fut dit : « Entrez dans le Feu, vous deux, avec ceux qui entrent. »", "german": " Allah legt denen, die ungläubig sind, das Beispiel vor von Noahs Frau und von Lots Frau. Sie unterstanden zwei Unserer rechtschaffenen Diener, doch sie handelten untreu gegen sie. Drum nützten sie ihnen nichts wider Allah, und es ward gesprochen: \"Gehet ihr beide ein ins Feuer zusammen mit denen, die eingehn!\"", "spanish": " Al-lah presenta para los incrédulos el ejemplo de la esposa de Noé y de la esposa de Lot. Ambas estuvieron sometidas a dos siervos justos Nuestros, pero actuaron infielmente hacia ellos. Por tanto no les sirvieron de nada contra Al-lah y se les dijo: “Entrad en el Fuego, vosotras dos, junto con los demás que entran”.", "urdu": " اللہ کافروں کی حالت نوح اور لوط کی بیویوں کی مانند بیان کرتا ہے۔ وہ دونوں ہمارے نیک بندوں کے نکاح میں تھیں۔ مگر ان دونوں نے ان دونوں (بندوں) کی خیانت کی تھی اور وہ دونوں الٰہی عذاب کے وقت ان (بیویوں) کے کسی کام نہ آسکے۔ اور ان دونوں عورتوں سے کہا گیا تھا کہ جہنم میں جانے والوں کے ساتھ تم بھی جہنم میں چلی جاٶ۔"}, {"arabic": " وَ ضَرَبَ اللّٰہُ مَثَلًا لِّلَّذِیۡنَ اٰمَنُوا امۡرَاَتَ فِرۡعَوۡنَ ۘ اِذۡ قَالَتۡ رَبِّ ابۡنِ لِیۡ عِنۡدَکَ بَیۡتًا فِی الۡجَنَّۃِ وَ نَجِّنِیۡ مِنۡ فِرۡعَوۡنَ وَ عَمَلِہٖ وَ نَجِّنِیۡ مِنَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿ۙ۱۲﴾", "english": " And Allah sets forth for those who believe the example of the wife of Pharaoh when she said, ‘My Lord! build for me a house with Thee in the Garden; and deliver me from Pharaoh and his work, and deliver me from the wrongdoing people;’", "french": " Et Allāh propose aux croyants l’exemple de la femme de Pharaon, lorsqu’elle dit : « Mon Seigneur ! bâtis pour moi une maison auprès de Toi dans le Jardin ; et délivre-moi de Pharaon et de ses œuvres, et délivre-moi du peuple injuste : »", "german": " Und Allah legt denen, die glauben, das Beispiel von Pharaos Frau vor, da sie sprach: \"Mein Herr! baue mir ein Haus bei Dir im Garten und befreie mich von Pharao und seinem Werk und befreie mich von dem Volk der Frevler!\"", "spanish": " Y para los creyentes, Al-lah presenta el ejemplo de la esposa del Faraón, cuando dijo: “¡Mi Señor! Levanta para mí una casa contigo en el Jardín; líbrame del Faraón y de sus acciones y líbrame de los hombres injustos”;", "urdu": " اور مومنوں کی حالت اللہ فرعون کی بیوی کی مانند بیان کرتا ہے جبکہ اس نے اپنے رب سے کہا‘ کہ اے خدا! تو اپنے پاس ایک گھر جنت میں میرے لئے بھی بنا دے اور مجھ کو فرعون اور اس کی بداعمالیوں سے بچا اور اسی طرح (اس کی) ظالم قوم سے نجات دے۔"}, {"arabic": " وَ مَرۡیَمَ ابۡنَتَ عِمۡرٰنَ الَّتِیۡۤ اَحۡصَنَتۡ فَرۡجَہَا فَنَفَخۡنَا فِیۡہِ مِنۡ رُّوۡحِنَا وَ صَدَّقَتۡ بِکَلِمٰتِ رَبِّہَا وَ کُتُبِہٖ وَ کَانَتۡ مِنَ الۡقٰنِتِیۡنَ ﴿٪۱۳﴾", "english": " And the example of Mary, the daughter of ‘Imran, who guarded her private parts — so We breathed into him of Our Spirit — and she fulfilled in her person the words of her Lord and His Books and was one of the obedient.", "french": " Et l’exemple de Marie, la fille d‘Imrān, qui protégea sa chasteté – puis Nous avons insufflé en l’enfant lui- même , de Notre Esprit – et elle accomplit en sa personne la prophétie transmise par les Paroles de son Seigneur, et contenue dans Ses Livres, et elle fut du nombre des obéissants.", "german": " Und der Maria, der Tochter Imrâns, die ihre Keuschheit bewahrte – drum hauchten Wir ihm von Unserem Geist ein –, und sie glaubte an die Worte ihres Herrn und an Seine Schriften und war der Gehorsamen eine.", "spanish": " Y el ejemplo de María, la hija de Imran, que conservó su astidad – por lo que insuflamos en él de Nuestro Espíritu – y cumplió en su persona las palabras de su Señor y Sus Libros y fue de los obedientes.", "urdu": " اور پھر اللہ مومنوں کی حالت مریم کی طرح بیان کرتا ہے جو عمران کی بیٹی تھی۔ جس نے اپنے ناموس کی حفاظت کی اور ہم نے اس میں اپنا کلام ڈال دیا تھا اور اس نے اس کلام کی جو اس کے رب نے اس پر نازل کیا تھا تصدیق کر دی تھی۔ اور اس (خدا) کی کتابوں پر بھی ایمان لائی تھی اور (ہوتے ہوتے ایسی حالت پکڑ لی تھی کہ) اس نے فرمانبرداروں کا مقام حاصل کر لیا تھا۔"}], "Surah": 66}