{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " لَاۤ اُقۡسِمُ بِیَوۡمِ الۡقِیٰمَۃِ ۙ﴿۲﴾", "english": " Nay! I call to witness the Day of Resurrection.", "french": " Non , mais ! Je cite comme témoin le Jour de la Résurrection.", "german": " Nein! Ich rufe zum Zeugen den Tag der Auferstehung.", "spanish": " ¡No! Pongo por testigo al Día de la Resurrección.", "urdu": " میں قیامت کے وقت کی قسم کھاتا ہوں (یعنی اسے شہادت کے طور پر پیش کرتا ہوں)"}, {"arabic": " وَ لَاۤ اُقۡسِمُ بِالنَّفۡسِ اللَّوَّامَۃِ ؕ﴿۳﴾", "english": " And I do call to witness the selfaccusing soul, that the Day of Judgment is a certainty .", "french": " Et je cite comme témoin la conscience qui s’accuse sans cesse.", "german": " Nein! Ich rufe zum Zeugen die sich selbst anklagende Seele.", "spanish": " Y pongo también por testigo a la conciencia frecuentemente acusadora.", "urdu": " اور میں نفس لوامہ کو بھی شہادت کے طور پر پیش کرتا ہوں۔"}, {"arabic": " اَیَحۡسَبُ الۡاِنۡسَانُ اَلَّنۡ نَّجۡمَعَ عِظَامَہٗ ؕ﴿۴﴾", "english": " Does man think that We shall not assemble his bones?", "french": " Est-ce que l’homme s’imagine que Nous ne rassemblerons pas ses os ?", "german": " Wähnt der Mensch, dass Wir seine Gebeine nicht sammeln werden?", "spanish": " ¿Piensa el hombre que no reuniremos sus huesos?", "urdu": " کیا انسان خیال کرتا ہے کہ ہم اس کی ہڈیاں نہیں جمع کریں گے۔"}, {"arabic": " بَلٰی قٰدِرِیۡنَ عَلٰۤی اَنۡ نُّسَوِّیَ بَنَانَہٗ ﴿۵﴾", "english": " Yea, We have the power to restore his very finger-tips.", "french": " Mais si, en vérité Nous sommes capable de reconstituer même les extrémités de ses doigts.", "german": " Fürwahr, Wir sind imstande, (sogar) seine Fingerspitzen zusammenzufügen.", "spanish": " ¡Sí!, tenemos poder para devolverle hasta la punta de los dedos.", "urdu": " نہیں نہیں! ہم تو اس پر قادر ہیں کہ اس کے جوڑ جوڑ کو پھر سے بنا دیں۔"}, {"arabic": " بَلۡ یُرِیۡدُ الۡاِنۡسَانُ لِیَفۡجُرَ اَمَامَہٗ ۚ﴿۶﴾", "english": " But man desires to continue to send forth evil deeds in front of him.", "french": " Mais l’homme désire continuer à pécher au fur et à mesure qu’il avance.", "german": " Doch der Mensch wünscht, Sündhaftigkeit vor sich vorauszuschicken.", "spanish": " Pero el hombre desea continuar en el pecado a medida que prosigue.", "urdu": " حقیقت یہ ہے کہ انسان چاہتا ہے کہ وہ آئندہ بھی فسق و فجور میں مبتلا رہے۔"}, {"arabic": " یَسۡـَٔلُ اَیَّانَ یَوۡمُ الۡقِیٰمَۃِ ؕ﴿۷﴾", "english": " He asks, ‘When will be the Day of Resurrection?’", "french": " Il demande : « Quand sera le Jour de la Résurrection ? »", "german": " Er fragt: \"Wann wird der Tag der Auferstehung sein?\"", "spanish": " Pregunta: “¿Cuándo será el Día de la Resurrección?”.", "urdu": " وہ پوچھتا (رہتا) ہے کہ قیامت کا دن کب ہوگا؟"}, {"arabic": " فَاِذَا بَرِقَ الۡبَصَرُ ۙ﴿۸﴾", "english": " When the eye is dazzled,", "french": " Quand l’oeil sera ébloui,", "german": " Wenn das Auge geblendet ist,", "spanish": " Cuando la vista quede deslumbrada,", "urdu": " سو جب نظر پتھرا جائے گی۔"}, {"arabic": " وَ خَسَفَ الۡقَمَرُ ۙ﴿۹﴾", "english": " And the moon is eclipsed,", "french": " Et la lune sera éclipsée,", "german": " und der Mond sich verfinstert,", "spanish": " Se eclipse la luna,", "urdu": " اور چاند کو خسوف لگے گا۔"}, {"arabic": " وَ جُمِعَ الشَّمۡسُ وَ الۡقَمَرُ ۙ﴿۱۰﴾", "english": " And the sun and the moon are brought together,", "french": " Et le soleil et la lune seront réunis ensemble,", "german": " und die Sonne und der Mond vereinigt werden.", "spanish": " Y el sol y la luna se reúnan,", "urdu": " اور سورج اور چاند دونوں کو خسوف کی حالت میں جمع کر دیا جائے گا۔"}, {"arabic": " یَقُوۡلُ الۡاِنۡسَانُ یَوۡمَئِذٍ اَیۡنَ الۡمَفَرُّ ﴿ۚ۱۱﴾", "english": " On that day man will say, ‘Whither to escape?’", "french": " Ce jour-là l’homme dira : « Où fuir ? »", "german": " An jenem Tage wird der Mensch sprechen: \"Wohin nun fliehen?\"", "spanish": " En ese día el hombre dirá: “¿Adónde escapar?”.", "urdu": " اس وقت انسان کہے گا‘ اب میں بھاگ کر کہاں جا سکتا ہوں۔"}, {"arabic": " کَلَّا لَا وَزَرَ ﴿ؕ۱۲﴾", "english": " Nay! There is no refuge!", "french": " Point du tout ! Aucun refuge !", "german": " Nein! keine Zuflucht!", "spanish": " ¡No! ¡No hay refugio!", "urdu": " سنو! آج عذاب سے بچنے کی کوئی جگہ نہیں۔"}, {"arabic": " اِلٰی رَبِّکَ یَوۡمَئِذِ ۣ الۡمُسۡتَقَرُّ ﴿ؕ۱۳﴾", "english": " With thy Lord alone will be the place of rest that day.", "french": " Avec ton Seigneur Seul sera le lieu de repos ce jour-là.", "german": " (Nur) zu deinem Herrn wird an jenem Tage die Rückkehr sein.", "spanish": " En ese día, el lugar de reposo sólo estará con tu Señor.", "urdu": " مگر اس دن تیرے رب کے پاس ہی ٹھکانا ہوگا۔"}, {"arabic": " یُنَبَّؤُا الۡاِنۡسَانُ یَوۡمَئِذٍۭ بِمَا قَدَّمَ وَ اَخَّرَ ﴿ؕ۱۴﴾", "english": " That day will man be informed of that which he has sent forward and left behind.", "french": " Ce jour-là l’homme sera informé de ce qu’il aura envoyé en avant et laissé en arrière.", "german": " Verkündet wird dem Menschen an jenem Tage, was er vorausgesandt und was er zurückgelassen hat.", "spanish": " En ese día el hombre será informado de lo que ha enviado por delante y de lo que ha dejado atrás.", "urdu": " اس دن انسان کو خبر دی جائے گی‘ ان کاموں کی بھی جو اسے نہیں کرنے چاہیں تھے مگر اس نے کر لئے اور ان کاموں کی بھی جو اسے کرنے چاہئیں تھے مگر اس نے نہیں کیے۔"}, {"arabic": " بَلِ الۡاِنۡسَانُ عَلٰی نَفۡسِہٖ بَصِیۡرَۃٌ ﴿ۙ۱۵﴾", "english": " Nay, man is a witness against himself;", "french": " Non , mais l’homme est un témoin très perspicace contre lui-même,", "german": " Nein, der Mensch ist Zeuge wider sich selber,", "spanish": " ¡No!, el hombre conoce perfectamente su propio ser;", "urdu": " حقیقت یہ ہے کہ انسان اپنے نفس کو خوب دیکھ رہا ہے اور جانتا ہے کہ وہ کتنے پانی میں ہے۔"}, {"arabic": " وَّ لَوۡ اَلۡقٰی مَعَاذِیۡرَہٗ ﴿ؕ۱۶﴾", "english": " Even though he puts forward his excuses.", "french": " Même s’il présente ses excuses.", "german": " auch wenn er Entschuldigungen vorbringt.", "spanish": " Aunque presente excusas.", "urdu": " خواہ وہ زبان سے کتنی ہی صفائی پیش کرے۔"}, {"arabic": " لَا تُحَرِّکۡ بِہٖ لِسَانَکَ لِتَعۡجَلَ بِہٖ ﴿ؕ۱۷﴾", "english": " Move not thy tongue with this revelation that thou mayest hasten to preserve it.", "french": " Ne remue pas ta langue avec cette révélation afin de te hâter pour la préserver .", "german": " Rühre nicht deine Zunge mit dieser (Offenbarung), sie zu beschleunigen.", "spanish": " No muevas tu lengua con esta revelación para apresurarte a preservarla.", "urdu": " (اے نبی) تو اپنی زبان کو حرکت نہ دے تا کہ یہ قرآن جلدی نازل ہو جائے۔"}, {"arabic": " اِنَّ عَلَیۡنَا جَمۡعَہٗ وَ قُرۡاٰنَہٗ ﴿ۚۖ۱۸﴾", "english": " Surely upon Us rests its collection and its recital.", "french": " Assurément, c’est à Nous qu’incombent son recueil et sa récitation.", "german": " Uns obliegt ihre Sammlung und ihre Lesung.", "spanish": " En verdad, a Nosotros corresponde su recopilación y su recitación.", "urdu": " اس کا جمع کرنا بھی ہمارے ذمہ ہے اور اس کا دنیا کے سامنے سنانا بھی (ہمارے ذمہ ہے)"}, {"arabic": " فَاِذَا قَرَاۡنٰہُ فَاتَّبِعۡ قُرۡاٰنَہٗ ﴿ۚ۱۹﴾", "english": " So when We recite it, then follow thou its recital.", "french": " Alors, quand Nous le récitons, suis sa récitation.", "german": " Drum, wenn Wir sie lesen, folge ihrer Lesung;", "spanish": " Así pues, cuando te lo recitemos, sigue tú su recitación.", "urdu": " پس جب ہم اسے پڑھ لیا کریں تو ہمارے پڑھنے کے بعد تو بھی پڑھ لیا کر۔"}, {"arabic": " ثُمَّ اِنَّ عَلَیۡنَا بَیَانَہٗ ﴿ؕ۲۰﴾", "english": " Then upon Us rests the expounding thereof.", "french": " Ensuite c’est à Nous qu’incombe son interprétation.", "german": " dann obliegt Uns ihre Erläuterung.", "spanish": " A nosotros corresponde su explicación.", "urdu": " اور یہ ہمارا فرض ہے کہ ہم اس کو تیری زبان سے لوگوں کو کھول کر سنا دیں۔"}, {"arabic": " کَلَّا بَلۡ تُحِبُّوۡنَ الۡعَاجِلَۃَ ﴿ۙ۲۱﴾", "english": " Nay, but you love the present life;", "french": " Non , mais vous aimez ce qui est passager ;", "german": " Nein, ihr aber, ihr liebt das Gegenwärtige", "spanish": " ¡No!, pero amáis lo que está próximo a vuestras manos;", "urdu": " سنو! تم جلدی سے ملنے والی نعمت کو پسند کرتے ہو۔"}, {"arabic": " وَ تَذَرُوۡنَ الۡاٰخِرَۃَ ﴿ؕ۲۲﴾", "english": " And you neglect the Hereafter.", "french": " Et vous délaissez l’au-delà.", "german": " und vernachlässigt das Jenseits.", "spanish": " Y olvidáis el Más Allá.", "urdu": " اور بعد میں آنے والی نعمت کو نظر انداز کر دیتے ہو۔"}, {"arabic": " وُجُوۡہٌ یَّوۡمَئِذٍ نَّاضِرَۃٌ ﴿ۙ۲۳﴾", "english": " Some faces on that day will be bright,", "french": " Ce jour-là il y aura des visages resplendissants,", "german": " Manche Gesichter werden an jenem Tage leuchtend sein,", "spanish": " En ese día algunos rostros estarán risueños,", "urdu": " اس دن بعض لوگ ہشاش بشاس ہوں گے۔"}, {"arabic": " اِلٰی رَبِّہَا نَاظِرَۃٌ ﴿ۚ۲۴﴾", "english": " Looking eagerly towards their Lord;", "french": " Regardant ardemment vers leur Seigneur ;", "german": " und zu ihrem Herrn schauen;", "spanish": " Mirando anhelantes a su Señor;", "urdu": " اپنے خدا کی طرف نظر لگائے بیٹھے ہوں گے۔"}, {"arabic": " وَ وُجُوۡہٌ یَّوۡمَئِذٍۭ بَاسِرَۃٌ ﴿ۙ۲۵﴾", "english": " And some faces on that day will be dismal,", "french": " Et ce jour-là il y aura des visages attristés,", "german": " und manche Gesichter werden an jenem Tage gramvoll sein,", "spanish": " Y en ese día otros rostros aparecerán sombríos.", "urdu": " اور کچھ لوگ اس دن منہ بسورے بیٹھے ہوں گے۔"}, {"arabic": " تَظُنُّ اَنۡ یُّفۡعَلَ بِہَا فَاقِرَۃٌ ﴿ؕ۲۶﴾", "english": " Thinking that a back-breaking calamity is about to befall them.", "french": " Etant sûrs qu’une calamité écrasante va leur arriver.", "german": " denn sie ahnen, dass ein schreckliches Unglück ihnen demnächst widerfahren soll.", "spanish": " Pensando que una espantosa calamidad está a punto de caer sobre ellos.", "urdu": " کیونکہ وہ خیال کریں گے کہ ان کے ساتھ وہ سلوک کیا جائے گا جس سے کمر کے منکے تک ٹوٹ جائیں گے۔"}, {"arabic": " کَلَّاۤ اِذَا بَلَغَتِ التَّرَاقِیَ ﴿ۙ۲۷﴾", "english": " Aye! when the soul of the dying man comes up to the throat,", "french": " Oui, en vérité , quand l’âme du mourant monte jusqu’à sa gorge,", "german": " Ja! wenn (die Seele eines Sterbenden) zur Kehle emporsteigt", "spanish": " ¡Ay! Cuando el alma del hombre moribundo se le suba a la garganta,", "urdu": " سنو! جب روح حلق تک پہنچ جائے۔"}, {"arabic": " وَ قِیۡلَ مَنۡ ٜ رَاقٍ ﴿ۙ۲۸﴾", "english": " And it is said, ‘Who is the wizard to save him ?’", "french": " Et il est dit : « Quel est l’enchanteur qui peut le sauver ? »", "german": " und gesprochen wird: \"Wer ist der Zauberer (der ihn rette)?\";", "spanish": " Y se diga: “¿Quién es el mago capaz de salvarlo?”.", "urdu": " اور کہا جائے کہ آج کوئی ہے جو دم دعا سے اس کو اچھا کر دے۔"}, {"arabic": " وَّ ظَنَّ اَنَّہُ الۡفِرَاقُ ﴿ۙ۲۹﴾", "english": " And he is sure that it is the hour of parting;", "french": " Et il est sûr que c’est l’heure de la séparation ;", "german": " und er weiß, dass es (die Stunde des) Scheidens ist", "spanish": " Pues sabe con seguridad que es la hora de partir;", "urdu": " اور ہرایک یقین کرلے کہ اب جدائی کی گھڑی آگئی ہے۔"}, {"arabic": " وَ الۡتَفَّتِ السَّاقُ بِالسَّاقِ ﴿ۙ۳۰﴾", "english": " And one shank rubs against another shank in agony ;", "french": " Et un tibia pressera l’autre tibia en agonie ;", "german": " und Todespein auf Todespein gehäuft wird;", "spanish": " Y una pierna se frota contra la otra en agonía;", "urdu": " اور جان کندنی کی گھڑی آجائے۔"}, {"arabic": " اِلٰی رَبِّکَ یَوۡمَئِذِ ۣالۡمَسَاقُ ﴿ؕ٪۳۱﴾", "english": " Unto thy Lord that day will be the driving.", "french": " Et c’est vers ton Seigneur ce jour-là, qu’il sera poussé.", "german": " zu deinem Herrn wird an jenem Tage das Treiben sein.", "spanish": " En ese día, la marcha será hacia tu Señor.", "urdu": " اس دن تیرے رب ہی کی طرف جانا ہوگا۔"}, {"arabic": " فَلَا صَدَّقَ وَ لَا صَلّٰی ﴿ۙ۳۲﴾", "english": " For he neither accepted the truth , nor offered Prayers;", "french": " Car il n’accepta pas la Vérité ni disait sa Prière ;", "german": " Denn er spendete nicht und betete nicht,", "spanish": " Porque no aceptó la verdad, ni ofreció Oraciones:", "urdu": " پس کیا ہوا کہ ایسے شخص نے نہ صدقہ دیا نہ نماز پڑھی۔"}, {"arabic": " وَ لٰکِنۡ کَذَّبَ وَ تَوَلّٰی ﴿ۙ۳۳﴾", "english": " But he rejected the truth and turned his back;", "french": " Mais il rejeta la Vérité et tourna le dos ;", "german": " sondern er leugnete und wandte sich ab;", "spanish": " Sino que rechazó la verdad y volvió la espalda;", "urdu": " بلکہ (حق کو) جھٹلاتا رہا اور (اس سے) پیٹھ پھیر لی۔"}, {"arabic": " ثُمَّ ذَہَبَ اِلٰۤی اَہۡلِہٖ یَتَمَطّٰی ﴿ؕ۳۴﴾", "english": " Then he went to his kinsfolk, strutting along.", "french": " Ensuite il se rendit chez les siens, tout en se pavanant.", "german": " dann ging er zu seiner Sippe mit stolzem Gang.", "spanish": " Y al punto, se dirigió a sus familiares, pavoneándose.", "urdu": " (اور اس کے بعد شرمندہ ہونے کی بجائے) اپنے گھر والوں کی طرف فخر سے اکڑتا ہوا چلا گیا۔"}, {"arabic": " اَوۡلٰی لَکَ فَاَوۡلٰی ﴿ۙ۳۵﴾", "english": " ‘Woe unto thee! and woe again!", "french": " « Malheur à toi ! et malheur encore !", "german": " „Wehe dir denn! wehe!", "spanish": " “¡Ay de ti! ¡Ay de ti otra vez!”.", "urdu": " (اے شخص) تجھ پر ہلاکت پر ہلاکت ہو۔"}, {"arabic": " ثُمَّ اَوۡلٰی لَکَ فَاَوۡلٰی ﴿ؕ۳۶﴾", "english": " ‘Then woe unto thee! and woe again!’", "french": " Et encore, malheur à toi ! et malheur encore ! »", "german": "", "spanish": " “¡Ay, pues, de ti! ¡Ay, de nuevo!”.", "urdu": " پھر (ہم کہتے ہیں کہ) تجھ پر ہلاکت پر ہلاکت ہو۔"}, {"arabic": " اَیَحۡسَبُ الۡاِنۡسَانُ اَنۡ یُّتۡرَکَ سُدًی ﴿ؕ۳۷﴾", "english": " Does man think that he is to be left to himself uncontrolled?", "french": " L’homme s’imagine-t-il qu’on le laissera sans contrôle ?", "german": " Wähnt der Mensch etwa, er solle ganz ungebunden bleiben?", "spanish": " ¿Piensa el hombre que se le va a quedar libre para deambular?", "urdu": " کیا انسان خیال کرتا ہے کہ اس کو بے لگام چھوڑ دیا جائے گا۔"}, {"arabic": " اَلَمۡ یَکُ نُطۡفَۃً مِّنۡ مَّنِیٍّ یُّمۡنٰی ﴿ۙ۳۸﴾", "english": " Was he not a drop of fluid, emitted forth?", "french": " N’était-il pas une goutte de sperme émise ?", "german": " War er nicht ein Tropfen fließenden Samens, der verspritzt ward?", "spanish": " ¿Acaso no fue una gota de líquido, eyaculada?", "urdu": " کیا وہ کسی وقت پانی کا ایک قطرہ نہیں تھا جو اپنی مناسب حال جگہ میں ڈالا گیا۔"}, {"arabic": " ثُمَّ کَانَ عَلَقَۃً فَخَلَقَ فَسَوّٰی ﴿ۙ۳۹﴾", "english": " Then he became a clot, then He shaped and perfected him .", "french": " Ensuite il devint un caillot adhérent, ensuite Il le façonna et le rendit parfait.", "german": " Dann wurde er ein Blutklumpen, dann bildete und vervollkommnete Er (ihn).", "spanish": " Después se convirtió en coágulo y a continuación Él lo conformó y perfeccionó.", "urdu": " پھر وہ ایک چمٹنے والا لوتھڑا بن گیا۔ پھر اس (خدا) نے اس کو اور شکل میں بنا دیا اور آخر اسے مکمل کر دیا۔"}, {"arabic": " فَجَعَلَ مِنۡہُ الزَّوۡجَیۡنِ الذَّکَرَ وَ الۡاُنۡثٰی ﴿ؕ۴۰﴾", "english": " Then He made of him a pair, the male and female.", "french": " Ensuite Il fit de lui un couple, le mâle et la femelle.", "german": " So schuf Er aus ihm ein Paar, den Mann und das Weib.", "spanish": " Después hizo de él una pareja, hombre y mujer.", "urdu": " اور اسے جوڑا جوڑا کرکے بنایا یعنی نر اور مادہ کی شکل میں۔"}, {"arabic": " اَلَیۡسَ ذٰلِکَ بِقٰدِرٍ عَلٰۤی اَنۡ یُّحۡیِۦَ الۡمَوۡتٰی ﴿٪۴۱﴾", "english": " Has not such a One the power to raise the dead to life?", "french": " Un Tel Etre n’est-Il pas capable de ressusciter les morts ?", "german": " Und da sollte Er nicht imstande sein, die Toten ins Leben zu rufen?", "spanish": " ¿Acaso no tiene tal Ser el poder de devolver la vida a los muertos?", "urdu": " کیا یہ (خدا) اس بات پر قادر نہیں کہ مردوں کو پھر زندہ کردے۔"}], "Surah": 75}