{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں) ۔"}, {"arabic": " حٰمٓ ۚ﴿۲﴾", "english": " Ha Mim.", "french": " Ḥā Mīm (Le Très-Louable, le Seigneur de l’Honneur).", "german": " Hâ Mîm.", "spanish": " Ha Mim.", "urdu": " (یہ سورۃ) حمید (و) مجید ۔"}, {"arabic": " عٓسٓقٓ ﴿۳﴾", "english": " ‘Ain Sin Qaf.", "french": " ‘Aïn Sīn Qāf (Le Très-Savant, le Très-Audient, le Détenteur du plein Pouvoir).", "german": " 'Ain Sîn Qâf.", "spanish": " ‘Ain Sin Qaf.", "urdu": " علیم‘ سمیع (اور) قدیر (خدا نے اُتاری ہے) ۔"}, {"arabic": " کَذٰلِکَ یُوۡحِیۡۤ اِلَیۡکَ وَ اِلَی الَّذِیۡنَ مِنۡ قَبۡلِکَ ۙ اللّٰہُ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۴﴾", "english": " Thus has Allah, the Mighty, the Wise, been revealing to thee and to those that preceded thee.", "french": " Et c’est ainsi qu’Allāh, le Puissant, le Sage, t’envoie des révélations comme Il a fait à ceux qui t’ont précédé.", "german": " Also hat Allah, der Allmächtige, der Allweise, dir und denen, die vor dir waren, offenbart.", "spanish": " De este modo, Al-lah el Poderoso, el Sabio, se revela a ti y Se reveló a quienes te precedieron.", "urdu": " اسی طرح اللہ تجھ پر بھی وحی کرتا ہے اور اُن پر بھی (وحی کر چکا ہے) جو (لوگ) تجھ سے پہلے گذر چکے ہیں وہ غالب بھی ہے (اور) حکمت والا بھی ہے۔"}, {"arabic": " لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ ہُوَ الۡعَلِیُّ الۡعَظِیۡمُ ﴿۵﴾", "english": " To Him belongs whatever is in the heavens and whatever is in the earth, and He is the High, the Great.", "french": " A Lui appartiennent tout ce qui est aux cieux et tout ce qui est sur la terre, et Il est le Très-Haut, le Grand.", "german": " Sein ist, was in den Himmeln und was auf Erden ist, und Er ist der Erhabene, der Große.", "spanish": " A Él pertenece cuanto hay en los cielos y cuanto hay en la tierra, pues Él es el Altísimo, el Grande.", "urdu": " آسمانوں اور زمین میں جو کچھ ہے سب اسی کا ہے۔ اور وہ بلند شان ہے۔ اور اس کی حکومت ہر طبقہ کی مخلوق پر پھیلی ہوئی ہے۔"}, {"arabic": " تَکَادُ السَّمٰوٰتُ یَتَفَطَّرۡنَ مِنۡ فَوۡقِہِنَّ وَ الۡمَلٰٓئِکَۃُ یُسَبِّحُوۡنَ بِحَمۡدِ رَبِّہِمۡ وَ یَسۡتَغۡفِرُوۡنَ لِمَنۡ فِی الۡاَرۡضِ ؕ اَلَاۤ اِنَّ اللّٰہَ ہُوَ الۡغَفُوۡرُ الرَّحِیۡمُ ﴿۶﴾", "english": " The heavens may well-nigh rend asunder from above them; and the angels glorify their Lord with His praise and ask forgiveness for those on the earth. Behold! it is surely Allah Who is the Most Forgiving, the Merciful.", "french": " Les cieux pourraient bien se fendre dans leurs hauteurs célestes et les anges glorifient leur Seigneur avec Ses louanges, et demandent pardon pour ceux qui sont sur la terre. Notez bien ! C’est sûrement Allāh Qui est le Très-Pardonnant, le Miséricordieux !", "german": " Fast möchten die Himmel sich spalten von oben her, auch wenn die Engel ihren Herrn verherrlichen mit Seiner Lobpreisung und Vergebung erflehen für die auf Erden. Siehe, fürwahr, Allah ist der Vergebungsreiche, der Barmherzige.", "spanish": " Los cielos podrían desgarrarse en pedazos en las alturas celestiales; mientras los ángeles glorifican a Su Señor con Sus alabanzas y piden perdón por quienes están en la tierra. ¡Mirad! Al-lah es ciertamente el Sumo Indulgente, el Misericordioso.", "urdu": " قریب ہے کہ آسمان اپنے اوپر (غالب ذات کے حکم کی وجہ) سے پھٹ کر گر جائیں باوجود اس کے کہ ملائکہ اپنے رب کی حمد بھی کررہے ہیں اور تسبیح بھی کر رہے ہیں اور جو لوگ زمین میں ہیں ان کے لئے استغفار بھی کر رہے ہیں (پھر بھی خدا اپنے عذاب کو روکے گا نہیں تا کہ اس کی غفاری اور رحیمیت ظاہر ہو) سنو اللہ بہت بخشنے والا (اور) بے انتہا رحم کرنے والا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ اتَّخَذُوۡا مِنۡ دُوۡنِہٖۤ اَوۡلِیَآءَ اللّٰہُ حَفِیۡظٌ عَلَیۡہِمۡ ۫ۖ وَ مَاۤ اَنۡتَ عَلَیۡہِمۡ بِوَکِیۡلٍ ﴿۷﴾", "english": " And as for those who take for themselves protectors beside Him, Allah watches over them; and thou art not a guardian over them.", "french": " Et quant à ceux qui se prennent des protecteurs en dehors de Lui, Allāh les surveille : et tu n’es pas leur gardien.", "german": " Und jene, die sich Beschützer nehmen statt Ihn, Allah gibt auf sie acht; und du bist nicht Hüter über sie.", "spanish": " En cuanto a quienes toman para ellos protectores aparte de Él, Al-lah los vigila; y tú no eres guardián de ellos.", "urdu": " وہ لوگ جو اللہ کے سوا کسی کو اپنا پناہ دینے والا بناتے ہیں اللہ نے ان کے خلاف پڑنے والے سب اعمال کو محفوظ کر چھوڑا ہے اور تو ان پر نگران نہیں (خدا ہی نگران ہے) ۔"}, {"arabic": " وَ کَذٰلِکَ اَوۡحَیۡنَاۤ اِلَیۡکَ قُرۡاٰنًا عَرَبِیًّا لِّتُنۡذِرَ اُمَّ الۡقُرٰی وَ مَنۡ حَوۡلَہَا وَ تُنۡذِرَ یَوۡمَ الۡجَمۡعِ لَا رَیۡبَ فِیۡہِ ؕ فَرِیۡقٌ فِی الۡجَنَّۃِ وَ فَرِیۡقٌ فِی السَّعِیۡرِ ﴿۸﴾", "english": " Thus have We revealed to thee the Qur’an in Arabic, that thou mayest warn the Mother of towns, and all around it; and that thou mayest warn them of the Day of Gathering whereof there is no doubt: A party will be in the Garden, and a party in the blazing Fire.", "french": " C’est ainsi que Nous t’avons révélé un Coran un livre à être récité très souvent en arabe, dans une langue claire et éloquente afin que tu puisses avertir la Mère des Cités, et tous ceux qui demeurent autour d’elle : et que tu puisses les avertir du Jour du Rassemblement sur lequel il n’y a aucun doute : une partie sera dans le Paradis, et une autre dans la Fournaise de l’Enfer .", "german": " Also haben Wir dir den Qur-ân auf arabisch offenbart, dass du die Mutter der Städte warnest und alle rings um sie und (dass) du (sie) warnest vor dem Tag der Versammlung, an dem kein Zweifel ist. Ein Teil wird im Garten sein und ein Teil im flammenden Feuer.", "spanish": " Así te hemos revelado el Corán en árabe, para que adviertas a la adre de las ciudades y a todas las que la rodean; y para que les adviertas del Día de la Reunión sobre el que no hay duda: Una parte morará en los jardines del Paraíso , y otra parte estará en el Fuego ardiente.", "urdu": " اور اسی طرح (یعنی اپنے نگران ہونے کے ثبوت میں) ہم نے قرآن کو عربی زبان میں تیری طرف اتارا ہے تا کہ تو ملک کے مرکز کے لوگوں کو اور اس کے اردگرد کے رہنے والوں کو ہوشیار کرے اور تا کہ تو اس وقت سے ہوشیار کرے جب تمام لوگ جمع کیے جائیں گے جس کے آنے میں کوئی شبہ نہیں اس دن ایک گروہ تو جنت میں جائے گا اور ایک گروہ دوزخ میں جائے گا۔"}, {"arabic": " وَ لَوۡ شَآءَ اللّٰہُ لَجَعَلَہُمۡ اُمَّۃً وَّاحِدَۃً وَّ لٰکِنۡ یُّدۡخِلُ مَنۡ یَّشَآءُ فِیۡ رَحۡمَتِہٖ ؕ وَ الظّٰلِمُوۡنَ مَا لَہُمۡ مِّنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۹﴾", "english": " And if Allah had so pleased, He could have made them one people; but He admits into His mercy whomsoever He pleases. And as for the wrongdoers, they will have no protector and no helper.", "french": " Et si Allāh l’avait voulu, Il aurait pu faire d’eux un seul peuple : mais Il admet dans Sa miséricorde qui Il veut. Et quant aux injustes, ils n’auront pas de protecteur ni d’aide.", "german": " Hätte Allah gewollt, Er hätte sie zu einer einzigen Gemeinde machen können; jedoch Er lässt in Seine Barmherzigkeit ein, wen Er will. Und die Frevler werden keinen Beschützer noch Helfer haben.", "spanish": " Mas si Al-lah así lo hubiese querido, los hubiese convertido en un pueblo; pero Él admite a Su Misericordia a quien Le agrada. En cuanto a los inicuos, no tendrán protector ni quien les ayude.", "urdu": " اور اگر اللہ اپنی مرضی سے کام لیتا (یعنی جبر کرتا) تو ان سب کو ایک جماعت بنا دیتا لیکن وہ جس کو چاہتا ہے اپنی رحمت میں داخل کرتا ہے اور ظالموں کا نہ کوئی پناہ دہندہ ہوتا ہے نہ مددگار۔"}, {"arabic": " اَمِ اتَّخَذُوۡا مِنۡ دُوۡنِہٖۤ اَوۡلِیَآءَ ۚ فَاللّٰہُ ہُوَ الۡوَلِیُّ وَ ہُوَ یُحۡیِ الۡمَوۡتٰی ۫ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ٪﴿۱۰﴾", "english": " Have they taken for themselves protectors other than Him? But it is Allah Who is the real Protector. And He quickens the dead, and He has power over all things.", "french": " Se sont-ils pris des protecteurs en dehors de Lui ? Mais c’est Allāh Qui est le Vrai Protecteur. Et Il ranime les morts, et Il a le pouvoir de faire tout ce qu’Il veut.", "german": " Haben sie sich Beschützer genommen statt Ihn? Doch Allah allein ist der Beschützer. Er macht die Toten lebendig, und Er vermag alle Dinge zu tun.", "spanish": " ¿Han tomado para ellos protectores distintos de Él? Mas Al-lah es el auténtico Protector. Pues Él resucita a los muertos y tiene poder sobre todas las cosas.", "urdu": " کیا انہوں نے اللہ کے سوا کسی دوسرے کو پناہ دینے والا تجویز کیا ہے؟ پس (یاد رہے کہ) اللہ ہی پناہ دینے والا ہے اور وہی مردے زندہ کرتا ہے اور وہ اپنے ہر ارادہ کو پورا کرنے پر قادر ہے۔"}, {"arabic": " وَ مَا اخۡتَلَفۡتُمۡ فِیۡہِ مِنۡ شَیۡءٍ فَحُکۡمُہٗۤ اِلَی اللّٰہِ ؕ ذٰلِکُمُ اللّٰہُ رَبِّیۡ عَلَیۡہِ تَوَکَّلۡتُ ٭ۖ وَ اِلَیۡہِ اُنِیۡبُ ﴿۱۱﴾", "english": " And in whatsoever you differ, the decision thereof rests with Allah. Say : ‘Such is Allah, my Lord; in Him I put my trust, and to Him I always turn.’", "french": " Et dans toute affaire sur laquelle vous différez, le jugement appartient à Allāh. Dis : « Tel est Allāh, mon Seigneur ; en Lui je place ma confiance, et vers Lui je me tourne toujours . »", "german": " Und über was immer ihr uneins seid, die Entscheidung darüber ruht bei Allah. Das ist Allah, mein Herr; auf Ihn vertraue ich, und zu Ihm wende ich mich.", "spanish": " Y sea cual fuere aquello en lo que discrepéis, su juicio corresponde a Al-lah. Diles: “Así es Al-lah, mi Señor; en Él pongo mi confianza, y a Él siempre vuelvo”.", "urdu": " اور جس کسی (امر) میں تم اختلاف کرو اس کا آخری فیصلہ اللہ ہی کے قبضہ میں ہے یہ ہے تمہارا اللہ جو میرا بھی رب ہے۔ میں نے اسی پر توکل کیا ہے اور اُسی کی طرف میں جھکتا ہوں۔"}, {"arabic": " فَاطِرُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ جَعَلَ لَکُمۡ مِّنۡ اَنۡفُسِکُمۡ اَزۡوَاجًا وَّ مِنَ الۡاَنۡعَامِ اَزۡوَاجًا ۚ یَذۡرَؤُکُمۡ فِیۡہِ ؕ لَیۡسَ کَمِثۡلِہٖ شَیۡءٌ ۚ وَ ہُوَ السَّمِیۡعُ الۡبَصِیۡرُ ﴿۱۲﴾", "english": " He is the Maker of the heavens and the earth. He has made for you pairs of your own selves, and of the cattle also He has made pairs. He multiplies you therein. There is nothing whatever like unto Him; and He is the All-Hearing, the All-Seeing.", "french": " Il est l’Initiateur des cieux et de la terre. Il a fait pour votre bien des couples d’entre vous-mêmes, et des couples de parmi les bestiaux. Il vous y multiplie. Il n’y a rien de pareil à Lui, et Il est Celui Qui entend tout, Qui voit tout.", "german": " Der Schöpfer der Himmel und der Erde – Er hat aus euch selbst Gefährten für euch gemacht und Gefährten aus den Tieren. Dadurch vermehrt Er euch. Nichts gibt es Seinesgleichen; und Er ist der Allhörende, der Allsehende.", "spanish": " Él es el Creador Perfecto de los cielos y la tierra. Ha creado parejas de entre vosotros y también parejas de entre el ganado para vuestro beneficio. Con ello os multiplica. No hay nada que se parezca a Él; Él es Quien todo lo oye, Quien todo lo ve.", "urdu": " وہ آسمانوں اور زمین کا پیدا کرنے والا ہے اس نے تمہاری ہی جنس سے تمہارے ساتھی بنائے ہیں اور چارپایوں کے بھی جوڑے بنائے ہیں اور اس طرح وہ تم کو زمین میں بڑھاتا ہے اس جیسی کوئی چیز نہیں اور وہ بہت سننے والا (اور) دیکھنے والا ہے۔"}, {"arabic": " لَہٗ مَقَالِیۡدُ السَّمٰوٰتِ وَ الۡاَرۡضِ ۚ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ وَ یَقۡدِرُ ؕ اِنَّہٗ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۱۳﴾", "english": " To Him belong the keys of the heavens and the earth. He enlarges the provision for whomsoever He pleases and straitens it for whomsoever He pleases . Surely, He knows all things full well.", "french": " A Lui appartiennent les clefs des cieux et de la terre. Il élargit les moyens de qui Il veut, et les rétrécit pour qui Il veut . Assurément, Il connaît très bien toutes choses.", "german": " Sein sind die Schlüssel der Himmel und der Erde. Er weitet und beschränkt die Mittel zum Unterhalt, wem Er will. Wahrlich, Er weiß alle Dinge wohl.", "spanish": " A Él pertenecen las llaves de los cielos y la tierra. Él amplía la rovisión para quien Le agrada y la estrecha para quien quiere. En verdad, Él conoce perfectamente todas las cosas.", "urdu": " آسمانوں کی کنجیاں بھی اس کے ہاتھ میں ہیں اور زمین کی بھی وہ جس کے لئے چاہتا ہے رزق میں فراخی دے دیتا ہے اور (جس کے لئے چاہتا ہے رزق میں) تنگی کر دیتا ہے وہ ہر ایک امر کو خوب اچھی طرح جانتا ہے۔"}, {"arabic": " شَرَعَ لَکُمۡ مِّنَ الدِّیۡنِ مَا وَصّٰی بِہٖ نُوۡحًا وَّ الَّذِیۡۤ اَوۡحَیۡنَاۤ اِلَیۡکَ وَ مَا وَصَّیۡنَا بِہٖۤ اِبۡرٰہِیۡمَ وَ مُوۡسٰی وَ عِیۡسٰۤی اَنۡ اَقِیۡمُوا الدِّیۡنَ وَ لَا تَتَفَرَّقُوۡا فِیۡہِ ؕ کَبُرَ عَلَی الۡمُشۡرِکِیۡنَ مَا تَدۡعُوۡہُمۡ اِلَیۡہِ ؕ اَللّٰہُ یَجۡتَبِیۡۤ اِلَیۡہِ مَنۡ یَّشَآءُ وَ یَہۡدِیۡۤ اِلَیۡہِ مَنۡ یُّنِیۡبُ ﴿۱۴﴾", "english": " He has prescribed for you the religion which He enjoined on Noah, and which We have revealed to thee, and which We enjoined on Abraham and Moses and Jesus, saying , ‘Remain steadfast in obedience, and be not divided therein. Hard upon the idolaters is that to which thou callest them. Allah chooses for Himself whom He pleases, and guides to Himself him who turns to Him .’", "french": " Il vous a prescrit la religion qu’Il a enjointe à Noé, et que Nous t’avons révélée, et que Nous avons enjointe à Abraham, et à Moïse, et à Jésus en disant : « Etablissez fermement la religion, et n’y soyez pas désunis. C’est dur pour les idolâtres, ce à quoi tu les appelles. Allāh choisit pour Lui-Même qui Il veut, et Il guide vers Lui-Même celui qui se tourne vers Lui.", "german": " Er verordnete für euch eine Glaubenslehre, die Er Noah anbefahl und die Wir dir offenbart haben und die Wir Abraham und Moses und Jesus auf die Seele banden: Nämlich, bleibet standhaft im Gehorsam, und seid nicht gespalten darin. Hart ist für die Heiden das, wozu du sie aufrufst. Allah wählt dazu aus, wen Er will, und leitet dazu den, wer sich bekehrt.", "spanish": " Él os ha prescrito la religión que impuso a Noé, y que te hemos revelado, y que impusimos a Abraham, Moisés y Jesús, diciendo : “Permaneced perseverantes en la obediencia y no os dividáis en ella. Es duro para los idólatras aquello a lo que les exhortáis. Al-lah elige ara Él a quien le agrada y guía hacia Sí mismo a quien vuelve a Él” .", "urdu": " اس (اللہ) نے تجھ کو (اصولی طور پر) وہی دین دیا ہے جس کی تاکید اس نے نوح کو کی تھی اور جو ہم نے اب تجھ پر (قرآن کے ذریعہ سے) اتارا ہے اور جس کی تا کید ہم نے ابراہیم اور موسیٰ اور عیسیٰ کو کی تھی اور وہ یہ تھا کہ (اللہ کی) اطاعت کو دنیا میں قائم کرو‘ اور اس (دین) کے بارہ میں اختلاف کبھی نہ کیا کرو۔ مشرکوں پر وہ (تعلیم بڑی) گراں گذرتی ہے جس کی طرف تو ان کو بلاتا ہے حالانکہ اللہ کی نظر میں جو پسندیدہ ہوتا ہے وہ اسے اس (دین) کے لئے چن لیتا ہے اور یہ تعلیم اسی کو ملتی ہے جو خدا کی طرف ہمیشہ جھکا رہتا ہے۔"}, {"arabic": " وَ مَا تَفَرَّقُوۡۤا اِلَّا مِنۡۢ بَعۡدِ مَا جَآءَہُمُ الۡعِلۡمُ بَغۡیًۢا بَیۡنَہُمۡ ؕ وَ لَوۡ لَا کَلِمَۃٌ سَبَقَتۡ مِنۡ رَّبِّکَ اِلٰۤی اَجَلٍ مُّسَمًّی لَّقُضِیَ بَیۡنَہُمۡ ؕ وَ اِنَّ الَّذِیۡنَ اُوۡرِثُوا الۡکِتٰبَ مِنۡۢ بَعۡدِہِمۡ لَفِیۡ شَکٍّ مِّنۡہُ مُرِیۡبٍ ﴿۱۵﴾", "english": " And they did not become divided but after knowledge had come to them, through jealousy among themselves. And had it not been for a word that had already gone forth from thy Lord for an appointed term, the matter would surely have been decided between them. And surely those who were made to inherit the Book after them are in a disquieting doubt concerning it.", "french": " Et ils n’ont différé entre eux et ils ne se sont divisés qu’après que la connaissance leur fût venue, par suite de rivalité entre eux. Et n’eût été une parole qui avait déjà émané de ton Seigneur pour un terme déterminé, l’affaire aurait été assurément décidée entre eux. Et assurément ceux qui ont été faits héritiers du Livre après eux, sont dans une incertitude inquiétante à son sujet.", "german": " Und sie zerfielen erst dann in Spaltung, nachdem das Wissen zu ihnen gekommen war, aus selbstsüchtigem Neid untereinander. Und wäre nicht bereits ein Wort von deinem Herrn ergangen für eine bestimmte Frist – gewiss wäre zwischen ihnen entschieden worden. Wahrlich, jene, denen nach ihnen das Buch zum Erbe gegeben ward, sind in beunruhigendem Zweifel darüber.", "spanish": " Y sólo quedaron divididos y discreparon después de llegarles el conocimiento, por envidia mutua. Mas de no haber sido por una palabra ue había sido ya revelada por tu Señor para un plazo fijado, el asunto se habría decidido ciertamente entre ellos. Pues en verdad, quienes se hizo heredar el Libro después de ellos, se encuentran en una duda inquietante respecto al mismo.", "urdu": " اور کفار نے دین کے معاملہ میں اختلاف نہیں کیا مگر اس کے بعد کہ ان کے پاس ایک کامل علم (یعنی قرآن) آگیا اور یہ اختلاف انہوں نے (کسی عقلی دلیل کی وجہ سے نہیں کیا بلکہ) باہمی بغض و حسد کی وجہ سے کیا ہے اور اگر تیرے رب کی طرف سے ایک مدت مقررہ تک کے لئے ایک بات کا فیصلہ نہ ہو چکا ہوتا تو ان کفار کی تباہی کبھی کی ہو چکی ہوتی اور وہ لوگ جن کو ان (پہلے لوگوں) کے بعد کتاب کا وارث کیا گیا ہے وہ اس کتاب کی وجہ سے ایک ایسے شک میں مبتلا ہیں جو ان کے دلوں میں قلق پیدا کر رہا ہے۔"}, {"arabic": " فَلِذٰلِکَ فَادۡعُ ۚ وَ اسۡتَقِمۡ کَمَاۤ اُمِرۡتَ ۚ وَ لَا تَتَّبِعۡ اَہۡوَآءَہُمۡ ۚ وَ قُلۡ اٰمَنۡتُ بِمَاۤ اَنۡزَلَ اللّٰہُ مِنۡ کِتٰبٍ ۚ وَ اُمِرۡتُ لِاَعۡدِلَ بَیۡنَکُمۡ ؕ اَللّٰہُ رَبُّنَا وَ رَبُّکُمۡ ؕ لَنَاۤ اَعۡمَالُنَا وَ لَکُمۡ اَعۡمَالُکُمۡ ؕ لَا حُجَّۃَ بَیۡنَنَا وَ بَیۡنَکُمۡ ؕ اَللّٰہُ یَجۡمَعُ بَیۡنَنَا ۚ وَ اِلَیۡہِ الۡمَصِیۡرُ ﴿ؕ۱۶﴾", "english": " To this, then, do thou invite mankind . And be thou steadfast as thou art commanded, and follow not their evil inclinations, but say, ‘I believe in whatever Book Allah has sent down, and I am commanded to judge justly between you. Allah is our Lord and your Lord. For us is the reward of our works, and for you the reward of your works. There is no quarrel between us and you. Allah will gather us together, and to Him is the return.’", "french": " Vers ceci donc, appelle l’humanité . Et sois constant comme il t’est ordonné, et ne suis pas leurs mauvais penchants, mais dis : « Je crois en tout Livre révélé par Allāh, et il m’est ordonné de juger équitablement entre vous. Allāh est notre Seigneur et votre Seigneur. Pour nous sera la récompense de nos œuvres, et pour vous la récompense de vos œuvres. Il n’y a aucune querelle entre nous et vous. Allāh nous rassemblera, et auprès de Lui est la destination. »", "german": " Zu diesem (Glauben) also rufe (sie) auf. Und bleibe standhaft, wie dir geheißen ward, und folge ihren bösen Gelüsten nicht, sondern sprich: \"Ich glaube an das Buch, was immer es sei, das Allah herabgesandt hat, und mir ist befohlen, gerecht zwischen euch zu richten. Allah ist unser Herr und euer Herr. Für uns unsere Werke, und für euch eure Werke! Kein Streit ist zwischen uns und euch. Allah wird uns zusammenbringen, und zu Ihm ist die Heimkehr.\"", "spanish": " Ante esto, pues, invita tú a la humanidad. Sé perseverante como se te ha ordenado, y no sigas sus perversas inclinaciones, sino diles: “Creo en cualquier Libro revelado por Al-lah y se me ha ordenado juzgar con justicia entre vosotros. Al-lah es nuestro Señor y vuestro Señor. Para nosotros es la recompensa de nuestras obras y para vosotros la recompensa de las vuestras. No hay disputa alguna entre nosotros y vosotros. Al-lah nos reunirá juntos y a Él será el retorno”.", "urdu": " پس تو (اسی دین کی طرف) لوگوں کو پکار۔ اور تو (اسی طرح دین پر) استقلال سے قائم رہ جس طرح تجھے کہا گیا ہے اور ان کی خواہشوں کی پیروی نہ کر اور کہہ دے کہ اللہ نے اپنی کتاب سے جو کچھ اتارا ہے میں اس پر ایمان لاتا ہوں اور مجھے حکم دیا گیا ہے کہ میں تمہارے درمیان عدل سے فیصلہ کروں۔ اللہ ہمارا بھی رب ہے اور تمہارا بھی رب (ہے) ہمارے اعمال ہمارے ساتھ ہیں اور تمہارے اعمال تمہارے ساتھ (ہیں) تمہارے اور ہمارے درمیان کوئی جھگڑا نہیں۔ اللہ ہمیں (ایک دن) جمع کر دے گا اور اسی کی طرف ہم سب کو لوٹ کر جانا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یُحَآجُّوۡنَ فِی اللّٰہِ مِنۡۢ بَعۡدِ مَا اسۡتُجِیۡبَ لَہٗ حُجَّتُہُمۡ دَاحِضَۃٌ عِنۡدَ رَبِّہِمۡ وَ عَلَیۡہِمۡ غَضَبٌ وَّ لَہُمۡ عَذَابٌ شَدِیۡدٌ ﴿۱۷﴾", "english": " And those who dispute concerning Allah after He has been accepted — their dispute is futile in the sight of their Lord; and on them is God ’ s wrath and for them will be a severe punishment.", "french": " Et quant à ceux qui discutent au sujet d’Allāh après qu’Il ait été accepté, leur argument n’a pas de valeur aux yeux de leur Seigneur ; et sur eux est le courroux d’Allāh et ils auront un châtiment rigoureux.", "german": " Und diejenigen, die über Allah hadern, nachdem Ihm Folge geleistet worden ist – ihr Hader ist eitel vor ihrem Herrn; auf ihnen ist Zorn, und ihnen wird strenge Strafe.", "spanish": " Mas quienes disputan sobre Al-lah después de haber sido testigos de que sus oraciones ( las del Santo Profeta) han sido aceptadas no poseerán rgumento válido ante su Señor. Sobre ellos caerá la cólera de Dios y para ellos habrá un severo castigo.", "urdu": " اور وہ لوگ جو اللہ کے بارہ میں بحثیں کرتے ہیں جبکہ (لوگوں کی ایک بڑی تعداد) اس کی آواز کو قبول کر چکی ہے ان کی دلیل ان کے رب کے حضور توڑی جانے والی ہے ان پر غضب نازل ہوگا اور ان کے لئے سخت عذاب (مقدر) ہے۔"}, {"arabic": " اَللّٰہُ الَّذِیۡۤ اَنۡزَلَ الۡکِتٰبَ بِالۡحَقِّ وَ الۡمِیۡزَانَ ؕ وَ مَا یُدۡرِیۡکَ لَعَلَّ السَّاعَۃَ قَرِیۡبٌ ﴿۱۸﴾", "english": " Allah it is Who has sent down the Book with truth and also the Balance. And what will make thee know that the Hour may be near at hand?", "french": " C’est Allāh Qui a révélé le Livre avec la vérité, et aussi la Balance. Et qu’est-ce qui te fera comprendre qu’il se peut que l’Heure soit proche ?", "german": " Allah ist es, Der das Buch mit der Wahrheit herabgesandt hat und als Maßstab. Und wie kannst du wissen, dass die \"Stunde\" nahe ist?", "spanish": " Al-lah es Quien ha revelado el Libro con la verdad, y también la Balanza. ¿Qué te hará conocer que la Hora pueda estar muy cerca?", "urdu": " اللہ وہی ہے جس نے حق کے ساتھ اس کامل کتاب (قرآن) اور میزان کو اتارا ہے اور تم کو کس (بات) نے بتایا ہے کہ مقررہ وقت قریب آگیا ہے۔"}, {"arabic": " یَسۡتَعۡجِلُ بِہَا الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِہَا ۚ وَ الَّذِیۡنَ اٰمَنُوۡا مُشۡفِقُوۡنَ مِنۡہَا ۙ وَ یَعۡلَمُوۡنَ اَنَّہَا الۡحَقُّ ؕ اَلَاۤ اِنَّ الَّذِیۡنَ یُمَارُوۡنَ فِی السَّاعَۃِ لَفِیۡ ضَلٰلٍۭ بَعِیۡدٍ ﴿۱۹﴾", "english": " Those who believe not therein seek to hasten it; but those who believe are fearful of it, and know that it is the truth. Beware! those who dispute concerning the Hour are in error, far gone.", "french": " Ceux qui n’y croient pas veulent la hâter ; mais ceux qui y croient la redoutent, et savent que c’est la vérité. Prenez garde ! Ceux qui discutent au sujet de l’Heure sont vraiment allés bien loin dans l’égarement.", "german": " Diejenigen, die nicht an sie glauben, wünschen sie zu beschleunigen; die aber, die glauben, sind in Furcht vor ihr und wissen, dass es die Wahrheit ist. Höret! diejenigen, die an der \"Stunde\" zweifeln, sind weit in der Irre.", "spanish": " Quienes no creen en ella intentan apresurarla; pero los que creen la temen, y saben que es la verdad. ¡Cuidado! Los que disputan en relación con la Hora están en un error profundo.", "urdu": " جو لوگ اس پر ایمان نہیں لاتے وہ اس کے جلد لانے کے خواہاں ہیں اور مومن تو اس سے ڈرتے رہتے ہیں اور یقین رکھتے ہیں کہ وہ واقع ہو کر رہنے والی ہے۔ سنو! جو لوگ قیامت میں شبہ کرتے ہیں‘ وہ ایک لاعلاج گمراہی میں مبتلا ہیں۔"}, {"arabic": " اَللّٰہُ لَطِیۡفٌۢ بِعِبَادِہٖ یَرۡزُقُ مَنۡ یَّشَآءُ ۚ وَ ہُوَ الۡقَوِیُّ الۡعَزِیۡزُ ﴿٪۲۰﴾", "english": " Allah is Benignant to His servants. He provides for whom He pleases. And He is the Powerful, the Mighty.", "french": " Allāh est infiniment Bienveillant envers Ses serviteurs. Il pourvoit aux besoins de qui Il veut. Et Il est le Fort, le Puissant.", "german": " Allah ist gütig gegen Seine Diener. Er versorgt, wen Er will. Und Er ist der Starke, der Allmächtige.", "spanish": " Al-lah es extremadamente Bondadoso con Sus siervos. Él provee a quien Le place. Él es el Poderoso, el Potente.", "urdu": " اللہ اپنے بندوں کے پوشیدہ رازوں کو جانتا ہے جس کو چاہتا ہے رزق وافر دیتا ہے اور جس کے متعلق چاہتا ہے رزق میں کمی کر دیتا ہے۔ وہ بڑی طاقت والا (اور) غالب ہے۔"}, {"arabic": " مَنۡ کَانَ یُرِیۡدُ حَرۡثَ الۡاٰخِرَۃِ نَزِدۡ لَہٗ فِیۡ حَرۡثِہٖ ۚ وَ مَنۡ کَانَ یُرِیۡدُ حَرۡثَ الدُّنۡیَا نُؤۡتِہٖ مِنۡہَا وَ مَا لَہٗ فِی الۡاٰخِرَۃِ مِنۡ نَّصِیۡبٍ ﴿۲۱﴾", "english": " Whoso desires the harvest of the Hereafter, We give him increase in his harvest; and whoso desires the harvest of this world, We give him thereof , but in the Hereafter he will have no share.", "french": " Quiconque désire la moisson de l’au-delà, Nous lui accordons une augmentation de sa moisson, et quiconque désire la moisson de ce monde, Nous lui en accordons sa part , mais dans l’au-delà il n’aura aucune part.", "german": " Wer die Ernte des Jenseits begehrt, dem geben Wir Mehrung in seiner Ernte; und wer die Ernte dieser Welt begehrt, dem geben Wir davon, doch am Jenseits wird er keinen Anteil haben.", "spanish": " A quien desee la cosecha del Más Allá, le daremos su cosecha aumentada; y a quien desee la de este mundo, se la daremos, pero no tendrá parte en el Más Allá.", "urdu": " جو کوئی آخرت کی کھیتی چاہتا ہے ہم اس کی (آخرت کی) کھیتی کو اس کے لئے بڑھاتے چلے جاتے ہیں اور جو کوئی اس دنیا کی کھیتی چاہتا ہے ہم اس (کو اسی دنیا کی کھیتی) میں سے اس کا حصہ دے دیتے ہیں (یعنی دنیوی متاع اسے مل جاتا ہے) اور آخرت میں اس کا کوئی حصہ نہیں ہوتا۔"}, {"arabic": " اَمۡ لَہُمۡ شُرَکٰٓؤُا شَرَعُوۡا لَہُمۡ مِّنَ الدِّیۡنِ مَا لَمۡ یَاۡذَنۡۢ بِہِ اللّٰہُ ؕ وَ لَوۡ لَا کَلِمَۃُ الۡفَصۡلِ لَقُضِیَ بَیۡنَہُمۡ ؕ وَ اِنَّ الظّٰلِمِیۡنَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۲۲﴾", "english": " Have they such associates of Allah as have made lawful for them in religion that which Allah has not allowed? And but for Our word about the final judgment, the matter would have been decided by now between them. And surely the wrongdoers will have a grievous punishment.", "french": " Ont-ils des associés d’Allāh qui ont établi pour eux des commandements religieux qu’Allāh n’a pas autorisés ? Et n’était-ce Notre décret pour le jugement final, certainement l’affaire aurait déjà été décidée entre eux. Et assurément les injustes auront un châtiment douloureux.", "german": " Haben sie Nebengötter, die ihnen eine Glaubenslehre vorgeschrieben haben, die Allah nicht verordnet hat? Und wäre es nicht für den Urteilsspruch, zwischen ihnen wäre schon gerichtet. Und gewiss, den Frevlern wird schmerzliche Strafe.", "spanish": " ¿Tienen ellos partícipes tales con Al-lah que les han hecho lícito en la religión lo que Al-lah no ha permitido? Mas de no er por Nuestra palabra sobre el juicio final, el asunto ya se habría decidido entre ellos. En verdad, los inicuos tendrán un humillante castigo.", "urdu": " کیا ان کے لئے کوئی ایسے شریک ہیں جنہوں نے ان کے لئے ایسی دینی تعلیم تجویز کی ہے جس کا اللہ نے حکم نہیں دیا اور اگر (اللہ تعالیٰ کی طرف سے) آخری فیصلہ نہ ہو چکا ہوتا تو ان کے درمیان فیصلہ کر دیا جاتا اور ظالموں کو یقیناً دردناک عذاب پہنچے گا۔"}, {"arabic": " تَرَی الظّٰلِمِیۡنَ مُشۡفِقِیۡنَ مِمَّا کَسَبُوۡا وَ ہُوَ وَاقِعٌۢ بِہِمۡ ؕ وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فِیۡ رَوۡضٰتِ الۡجَنّٰتِ ۚ لَہُمۡ مَّا یَشَآءُوۡنَ عِنۡدَ رَبِّہِمۡ ؕ ذٰلِکَ ہُوَ الۡفَضۡلُ الۡکَبِیۡرُ ﴿۲۳﴾", "english": " Thou wilt see the wrongdoers in fear on account of that which they have earned, and it is sure to befall them. But those who believe and do good works will be in the meadows of the Gardens. They shall have with their Lord whatever they will desire. That is the great bounty of God .", "french": " Tu verras les injustes dans la crainte à cause de ce qu’ils ont acquis, et assurément cela leur surviendra. Mais ceux qui croient et font de bonnes œuvres seront dans les prairies des Jardins. Ils trouveront auprès de leur Seigneur tout ce qu’ils désireront. C’est là la grande munificence d’Allāh .", "german": " Du wirst die Frevler in Furcht sehen ob dessen, was sie begangen, und es wird sicherlich auf sie niederfallen. Jene aber, die glauben und gute Werke üben, werden in den Auen der Gärten sein. Sie sollen bei ihrem Herrn alles finden, was sie begehren. Das ist die große Huld.", "spanish": " Verás a los inicuos temerosos en razón de lo que han merecido, y que es seguro que caerá sobre ellos. Pero quienes creen y hacen buenas obras estarán en las praderas de los Jardines. Tendrán con su Señor cuanto deseen. Ésa es la gran magnanimidad de Dios.", "urdu": " تو ظالموں کو دیکھتا ہے کہ وہ اپنے عمل کی وجہ سے ڈر رہے ہیں حالانکہ وہ (موعود عذاب) ان پر ضرور نازل ہونے والا ہے اور وہ لوگ جو ایمان لائے اور ایمان کے مطابق عمل کیا‘ وہ گھنے باغوں میں ہوں گے (اور) اُن کے رب کے پاس ان کے لئے وہ سب کچھ موجود ہوگا (جس کی ان کو خواہش ہوگی) یہی بڑا فضل ہے۔"}, {"arabic": " ذٰلِکَ الَّذِیۡ یُبَشِّرُ اللّٰہُ عِبَادَہُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ ؕ قُلۡ لَّاۤ اَسۡـَٔلُکُمۡ عَلَیۡہِ اَجۡرًا اِلَّا الۡمَوَدَّۃَ فِی الۡقُرۡبٰی ؕ وَ مَنۡ یَّقۡتَرِفۡ حَسَنَۃً نَّزِدۡ لَہٗ فِیۡہَا حُسۡنًا ؕ اِنَّ اللّٰہَ غَفُوۡرٌ شَکُوۡرٌ ﴿۲۴﴾", "english": " This it is whereof Allah gives the glad tidings to His servants who believe and do good works. Say: ‘I ask of you no reward for it, except that I am inviting you to God because of love of kinship.’ And whoso earns a good deed, We give him increase of good therein. Surely, Allah is Most Forgiving, Most Appreciating.", "french": " Telle est la bonne nouvelle qu’Allāh annonce à Ses serviteurs, qui croient et font de bonnes œuvres. Dis : « Je ne vous en demande aucune récompense, excepté l’affection qui doit exister entre parents ». Et quiconque réalise un acte de bonté, Nous lui embellissons davantage sa bonté. Assurément, Allāh est Très-Pardonnant, Très-Appréciateur.", "german": " Dies ist es, wovon Allah die frohe Botschaft gibt Seinen Dienern, die glauben und gute Werke tun. Sprich: \"Ich verlange von euch keinen Lohn dafür, es sei denn die Liebe wie zu den Verwandten.\" Und wer eine gute Tat begeht, dem machen Wir sie noch schöner. Wahrlich, Allah ist allverzeihend, voll der Erkenntlichkeit.", "spanish": " Ésta es la buena nueva que Al-lah da a Sus siervos que creen y hacen buenas obras. Diles: “No os pido recompensa alguna por ello, sólo el afecto mostrado entre parientes y amigos. Y a quien haga un acto de bondad, le realzaremos más aún el atractivo de su bondad. En verdad Al-lah es el Sumo Indulgente, Sumo Reconocedor.", "urdu": " یہی وہ چیز ہے جس کی اللہ اپنے مومن بندوں کو بشارت دیتا ہے‘ ایسے مومن بندوں کو جو ایمان کے مطابق عمل بھی کرتے ہیں۔ تو کہہ دے میں اپنی خدمت کے بدلہ میں تم سے کوئی اجر نہیں مانگتا‘ سوائے اس محبت کے جو اپنے قریب ترین رشتہ داروں سے کی جاتی ہے اور جو شخص کوئی نیکی کا کام کرتا ہے ہم اس کی نیکی کو اس کے لئے اور زیادہ حسین بنا دیتے ہیں اللہ بہت بخشنے والا (اور) قدر دان ہے۔"}, {"arabic": " اَمۡ یَقُوۡلُوۡنَ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا ۚ فَاِنۡ یَّشَاِ اللّٰہُ یَخۡتِمۡ عَلٰی قَلۡبِکَ ؕ وَ یَمۡحُ اللّٰہُ الۡبَاطِلَ وَ یُحِقُّ الۡحَقَّ بِکَلِمٰتِہٖ ؕ اِنَّہٗ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۲۵﴾", "english": " Do they say, ‘He has forged a lie against Allah?’ If Allah had so willed, He could seal thy heart as He has sealed the hearts of thy enemies . But Allah is blotting out falsehood through thee and is establishing the truth by His words. Surely, He knows full well what is in the breasts.", "french": " Disent-ils : « Il a fabriqué un mensonge contre Allāh ! » ? Dans ce cas si Allāh l’avait voulu, Il aurait pu sceller ton cœur . Mais Allāh efface le mensonge et établit la vérité par Ses Commandements. Assurément, Il sait très bien ce qui est dans les cœurs.", "german": " Sagen sie: \"Er hat eine Lüge gegen Allah ersonnen\"? Wenn Allah so wollte, Er könnte dein Herz versiegeln. Doch Allah löscht die Falschheit aus und bewährt die Wahrheit durch Seine Zeichen. Fürwahr, Er weiß recht wohl, was in den Herzen ist.", "spanish": " ¿Acaso dicen: “Ha inventado una mentira contra Al-lah?”. Si Al-lah así lo hubiese querido, podría haber sellado tu corazón. Por el contrario, Al-lah hace desaparecer la falsedad y establece la verdad con Sus Mandamientos. En verdad Él sabe muy bien lo que hay en los corazones.", "urdu": " کیا وہ کہتے ہیں کہ اس شخص (یعنی محمد رسول اللہ صلی اللہ علیہ وسلم) نے خدا پر جھوٹ باندھا ہے۔ پس اگر اللہ چاہے تو تیرے دل پر مہر لگا دے۔ اور اللہ ہمیشہ باطل کو مٹا دیتا ہے اور حق کو اپنے نشانوں کے ذریعہ قائم کر دیتا ہے۔ وہ دلوں کی باتوں کو جانتا ہے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ یَقۡبَلُ التَّوۡبَۃَ عَنۡ عِبَادِہٖ وَ یَعۡفُوۡا عَنِ السَّیِّاٰتِ وَ یَعۡلَمُ مَا تَفۡعَلُوۡنَ ﴿ۙ۲۶﴾", "english": " And He it is Who accepts repentance from His servants, and forgives sins. And He knows what you do.", "french": " Et c’est Lui Qui accepte le repentir de Ses serviteurs, et pardonne les méfaits. Et Il sait ce que vous faites.", "german": " Er ist es, Der Reue annimmt von Seinen Dienern und Sünden vergibt und weiß, was ihr tut.", "spanish": " Él es Quien acepta el arrepentimiento de Sus siervos y perdona los pecados. Él sabe lo que hacéis.", "urdu": " اور وہی ہے جو اپنے بندوں کی توبہ کو قبول کرتا ہے اور ان کی غلطیوں کو معاف کرتا ہے اور جو کچھ تم کرتے ہو اسے جانتا ہے۔"}, {"arabic": " وَ یَسۡتَجِیۡبُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ یَزِیۡدُہُمۡ مِّنۡ فَضۡلِہٖ ؕ وَ الۡکٰفِرُوۡنَ لَہُمۡ عَذَابٌ شَدِیۡدٌ ﴿۲۷﴾", "english": " And He accepts the prayers of those who believe and do good works, and gives them more out of His grace; and as for the disbelievers, they will have a severe punishment.", "french": " Et Il exauce les prières de ceux qui croient et font de bonnes œuvres, et leur accorde une augmentation de Sa grâce ; et quant aux mécréants, ils auront un châtiment rigoureux.", "german": " Und Er erhört diejenigen, die gläubig sind und gute Werke üben, und gibt ihnen Mehrung von Seiner Gnadenfülle; den Ungläubigen aber wird strenge Strafe.", "spanish": " Él acepta las oraciones de quienes creen y practican las buenas obras y les da más de Su Gracia; en cuanto a los incrédulos, tendrán un severo castigo.", "urdu": " اور مومنوں اور ایمان کے مطابق عمل کرنے والوں کی دعاٶں کو قبول کرتا ہے اور اپنے فضل سے (جتنے بدلہ کے وہ مستحق ہوتے ہیں اس سے بھی) زیادہ ان کو دیتا ہے‘ اور کافروں کے لئے سخت عذاب مقرر ہے۔"}, {"arabic": " وَ لَوۡ بَسَطَ اللّٰہُ الرِّزۡقَ لِعِبَادِہٖ لَبَغَوۡا فِی الۡاَرۡضِ وَ لٰکِنۡ یُّنَزِّلُ بِقَدَرٍ مَّا یَشَآءُ ؕ اِنَّہٗ بِعِبَادِہٖ خَبِیۡرٌۢ بَصِیۡرٌ ﴿۲۸﴾", "english": " And if Allah should enlarge the provision for His servants, they would rebel in the earth; but He sends down according to a proper measure as He pleases. Indeed, He is All-Aware and All-Seeing with regard to His servants.", "french": " Et si Allāh devait accorder à Ses serviteurs les moyens de leurs provisions avec largesse, ils se mettraient en révolte sur la terre ; mais Il fait descendre avec une juste mesure ce qu’Il veut. En vérité, Il est Très-Conscient et voit bien en ce qui concerne Ses serviteurs.", "german": " Und wenn Allah Seinen Dienern die Mittel zum Unterhalt erweitern würde, sie würden übermütig werden auf Erden; doch Er sendet mit Maß hinab, wie es Ihm gefällt; denn Er kennt und schaut Seine Diener recht wohl.", "spanish": " Pues si Al-lah ampliara la provisión para Sus siervos, se ebelarían en la tierra; mas Él envía de acuerdo con una medida apropiada según Le place. En verdad, Él es Consciente de todo y Quien todo lo ve respecto a Sus siervos.", "urdu": " اور اگر اللہ اپنے بندوں کے لئے رزق کو بہت وسیع کر دیتا تو وہ ملک میں بہت سرکشی کرنے لگ جاتے‘ لیکن وہ جو کچھ چاہتا ہے اندازہ کے مطابق اتارتا ہے وہ اپنے بندوں کے حالات سے باخبر (اور) ان کے حالات کو دیکھنے والا ہے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ یُنَزِّلُ الۡغَیۡثَ مِنۡۢ بَعۡدِ مَا قَنَطُوۡا وَ یَنۡشُرُ رَحۡمَتَہٗ ؕ وَ ہُوَ الۡوَلِیُّ الۡحَمِیۡدُ ﴿۲۹﴾", "english": " And He it is Who sends down rain after they have despaired, and spreads out His mercy. And He is the Protector, the Praiseworthy.", "french": " Et c’est Lui Qui fait descendre la pluie après qu’ils en aient désespéré, et Qui répand Sa miséricorde. Et Il est le Protecteur, le Digne de louange.", "german": " Und Er ist es, Der den Regen hinabsendet, nachdem sie verzweifelten, und Seine Barmherzigkeit ausbreitet. Und Er ist der Beschützer, der Preiswürdige.", "spanish": " Él es Quien envía la lluvia después de que se han desesperado y distribuye Su misericordia. Pues Él es el Protector, Merecedor de Alabanzas.", "urdu": " اور وہی ہے جو مایوسی کے بعد بارش اتارتا ہے اور اپنی رحمت کو پھیلا دیتا ہے‘ اور وہی (سچا) پناہ دینے والا (اور) سب تعریفوں کا مالک ہے۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖ خَلۡقُ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ مَا بَثَّ فِیۡہِمَا مِنۡ دَآبَّۃٍ ؕ وَ ہُوَ عَلٰی جَمۡعِہِمۡ اِذَا یَشَآءُ قَدِیۡرٌ ﴿٪۳۰﴾", "english": " And among His Signs is the creation of the heavens and the earth, and of whatever living creatures He has spread forth in both. And He has the power to gather them together when He pleases.", "french": " Et parmi Ses Signes est la création des cieux et de la terre, et toute créature vivante qu’Il a dispersée dans les deux. Et Il a le pouvoir de les rassembler quand Il le veut.", "german": " Und unter Seinen Zeichen ist die Schöpfung der Himmel und der Erde und jeglicher Lebewesen, die Er in beiden verstreut hat. Und Er hat die Macht, sie zu versammeln allesamt, wenn es Ihm gefällt.", "spanish": " Entre Sus Signos está la creación de los cielos y la tierra y de todas las criaturas vivas que ha distribuido en ambos. Él tiene el poder de reunirlos cuando Le agrada.", "urdu": " اور آسمانوں اور زمین کی پیدائش اور جو کچھ ان دونوں کے درمیان جانداروں کی قسم سے اس نے پھیلایا ہے اس کے نشانوں میں سے ہے اور جب وہ چاہے گا ان سب کے جمع کرنے پر قادر ہوگا۔"}, {"arabic": " وَ مَاۤ اَصَابَکُمۡ مِّنۡ مُّصِیۡبَۃٍ فَبِمَا کَسَبَتۡ اَیۡدِیۡکُمۡ وَ یَعۡفُوۡا عَنۡ کَثِیۡرٍ ﴿ؕ۳۱﴾", "english": " And whatever misfortune befalls you, is due to what your own hands have wrought. And He forgives many of your sins .", "french": " Et tout malheur qui vous survient est dû à ce qu’ont fait vos propres mains. Et Il pardonne beaucoup de vos péchés .", "german": " Was euch an Unglück treffen mag, es erfolgt ob dessen, was eure Hände gewirkt haben. Und Er vergibt vieles.", "spanish": " Cualquier infortunio que os suceda, se debe a lo que vuestras ropias manos han forjado. Mas Él perdona muchos de vuestros pecados.", "urdu": " اور ہر مصیبت جو تم کو پہنچے وہ تمہارے اعمال کے سبب سے ہوتی ہے اور اللہ تمہارے اکثر قصوروں کو معاف کرتا ہے۔"}, {"arabic": " وَ مَاۤ اَنۡتُمۡ بِمُعۡجِزِیۡنَ فِی الۡاَرۡضِ ۚۖ وَ مَا لَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۳۲﴾", "english": " And you cannot frustrate God ’ s plan in the earth; nor have you any friend or helper beside Allah.", "french": " Et vous ne pouvez pas faire échouer le dessein de Dieu sur la terre ; et en dehors d’Allāh vous n’avez ni protecteur ni aide.", "german": " Ihr könnt auf Erden nicht obsiegen, noch habt ihr einen Freund oder Helfer außer Allah.", "spanish": " Y no podéis frustrar los planes de Dios en la tierra, ni tenéis amigo ni ayudante alguno aparte de Al-lah.", "urdu": " اور تم (اللہ کو) اس کے ارادے میں کہیں بھی زمین پر ناکام نہیں کر سکتے اور اللہ کے سوا تمہیں کوئی پناہ دینے والا نہیں‘ نہ کوئی تمہارا مددگار ہے۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہِ الۡجَوَارِ فِی الۡبَحۡرِ کَالۡاَعۡلَامِ ﴿ؕ۳۳﴾", "english": " And of His Signs are the sailingships on the sea like mountain tops:", "french": " Et parmi Ses Signes, il y a de hauts vaisseaux sur la mer pareils à des montagnes :", "german": " Und zu Seinen Zeichen gehören die gleich Bergspitzen auf dem Meere segelnden Schiffe;", "spanish": " Entre Sus Signos están los navíos en el mar, como cimas de montaña.", "urdu": " اور اس کے نشانات میں سے پہاڑوں کی طرح سمندر میں چلنے والی کشتیاں ہیں (یعنی جو بہت اونچی اونچی ہوتی ہیں)"}, {"arabic": " اِنۡ یَّشَاۡ یُسۡکِنِ الرِّیۡحَ فَیَظۡلَلۡنَ رَوَاکِدَ عَلٰی ظَہۡرِہٖ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّکُلِّ صَبَّارٍ شَکُوۡرٍ ﴿ۙ۳۴﴾", "english": " If He so will, He can cause the wind to become still so that they become motionless upon the surface thereof — in that, surely, are Signs for every person who is most patient and grateful —", "french": " S’Il le veut, Il peut faire tomber complètement le vent de sorte qu’ils deviendraient immobiles sur la surface de l’eau – assurément, il y a en cela des Signes pour toute personne endurante et reconnaissante –", "german": " wenn Er will, so kann Er den Wind besänftigen, so dass sie reglos liegen auf seinem Rücken – hierin sind wahrlich Zeichen für jeden Standhaften, Dankbaren –,", "spanish": " Si así lo quisiera podría hacer que el viento amainara de manera que quedaran sin movimiento en su superficie. Aquí hay en verdad Signos para cualquier persona que sea paciente y agradecida.", "urdu": " اگر وہ چاہے تو ہوا کو ٹھہرا دے اور وہ سمندر کی سطح پر کھڑی کی کھڑی رہ جائیں۔ اس میں ہر صبر کرنے والے قدر دان کے لئے نشانات ہیں۔"}, {"arabic": " اَوۡ یُوۡبِقۡہُنَّ بِمَا کَسَبُوۡا وَ یَعۡفُ عَنۡ کَثِیۡرٍ ﴿۫۳۵﴾", "english": " Or He can destroy them because of that which they (the men) have earned — but He forgives many of their sins —", "french": " Ou Il peut les détruire à cause de ce que leurs occupants ont acquis – mais Il pardonne beaucoup de leurs péchés –", "german": " oder Er kann sie untergehen lassen um dessentwillen, was sie (die Menschen) begangen haben – und Er vergibt vieles –,", "spanish": " O puede destruirlos por lo que ellos (los hombres) han merecido -pero Él perdona muchos de sus pecados -.", "urdu": " یا اگر وہ چاہے تو کشتی والوں کو ان کے اعمال کی وجہ سے ہلاک کر دے اور وہ بہت سے گناہوں کو معاف کر دیتا ہے۔"}, {"arabic": " وَّ یَعۡلَمَ الَّذِیۡنَ یُجَادِلُوۡنَ فِیۡۤ اٰیٰتِنَا ؕ مَا لَہُمۡ مِّنۡ مَّحِیۡصٍ ﴿۳۶﴾", "english": " And He destroys them so that those who dispute about the Signs of Allah may know that they have no refuge.", "french": " Et afin que ceux qui discutent au sujet de Nos Signes sachent qu’ ils n’ont pas d’échappatoire.", "german": " und damit jene, die über Allahs Zeichen streiten, begreifen, (dass) sie keine Zuflucht haben.", "spanish": " Y los destruye de manera que quienes disputan sobre los Signos de Al-lah sepan que no tienen refugio.", "urdu": " اور تا وہ لوگ جو ہمارے نشانوں میں بحث کرتے ہیں جان لیں کہ ان کے لئے بھاگنے کی کوئی جگہ نہیں۔"}, {"arabic": " فَمَاۤ اُوۡتِیۡتُمۡ مِّنۡ شَیۡءٍ فَمَتَاعُ الۡحَیٰوۃِ الدُّنۡیَا ۚ وَ مَا عِنۡدَ اللّٰہِ خَیۡرٌ وَّ اَبۡقٰی لِلَّذِیۡنَ اٰمَنُوۡا وَ عَلٰی رَبِّہِمۡ یَتَوَکَّلُوۡنَ ﴿ۚ۳۷﴾", "english": " And whatever you have been given is only a temporary provision of this life, but that which is with Allah is better and more lasting for those who believe and put their trust in their Lord,", "french": " Et tout ce qui vous a été donné est seulement une provision temporaire de cette vie, et ce qui est avec Allāh est meilleur et plus durable pour ceux qui croient et placent leur confiance en leur Seigneur,", "german": " Was euch gegeben ward, es ist nur ein vorübergehender Genuss für dieses Leben, und das, was bei Allah ist, ist besser und bleibender für jene, die glauben und auf ihren Herrn vertrauen,", "spanish": " Cuanto se os ha concedido no es más que una provisión temporal de esta vida, pero lo que está con Al-lah es mejor y más duradero para quienes creen y ponen su confianza en su Señor;", "urdu": " اور جو کچھ بھی تم کو دیا گیا ہے وہ ورلی زندگی کا سامان ہے اور جو اللہ کے پاس ہے وہ مومنوں اور اپنے رب پر توکل کرنے والوں کے لئے زیادہ اچھا اور زیادہ باقی رہنے والا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یَجۡتَنِبُوۡنَ کَبٰٓئِرَ الۡاِثۡمِ وَ الۡفَوَاحِشَ وَ اِذَا مَا غَضِبُوۡا ہُمۡ یَغۡفِرُوۡنَ ﴿ۚ۳۸﴾", "english": " And who eschew the more grievous sins and indecencies, and, when they are wroth, they forgive,", "french": " Et ceux qui évitent les péchés les plus graves et les indécences ; et qui, lorsqu’ils sont courroucés pardonnent ;", "german": " und die schwersten Sünden und Schändlichkeiten meiden und, wenn sie zornig sind, vergeben;", "spanish": " Quienes se abstienen de los pecados y obscenidades más graves y, cuando están encolerizados, perdonan,", "urdu": " اور (ان کے لئے) جو بڑے گناہوں اور بدکاری سے بچتے ہیں اور جب ان کو غصہ آتا ہے تو معاف کر دیتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ اسۡتَجَابُوۡا لِرَبِّہِمۡ وَ اَقَامُوا الصَّلٰوۃَ ۪ وَ اَمۡرُہُمۡ شُوۡرٰی بَیۡنَہُمۡ ۪ وَ مِمَّا رَزَقۡنٰہُمۡ یُنۡفِقُوۡنَ ﴿ۚ۳۹﴾", "english": " And those who hearken to their Lord, and observe Prayer, and whose affairs are decided by mutual consultation, and who spend out of what We have provided for them,", "french": " Et ceux qui écoutent leur Seigneur, et observent la Prière, et dont les affaires sont décidées à travers des consultations mutuelles, et qui dépensent de ces dons et richesses que Nous leur avons accordés,", "german": " und die auf ihren Herrn hören und das Gebet verrichten und deren Handlungsweise (eine Sache) gegenseitiger Beratung ist, und die spenden von dem, was Wir ihnen gegeben haben;", "spanish": " Quienes escuchan a su Señor y cumplen la Oración; cuyos asuntos se deciden por consulta mutua, y emplean de lo que les hemos proporcionado,", "urdu": " اور جو اپنے رب کی آواز کو قبول کر لیتے ہیں اور نمازیں باجماعت ادا کرتے ہیں اور ان کا طریق یہ ہے کہ اپنے ہر معاملہ کو باہمی مشورہ سے طے کرتے ہیں اور جو کچھ ہم نے ان کودیا ہے اس میں سے خرچ کرتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ اِذَاۤ اَصَابَہُمُ الۡبَغۡیُ ہُمۡ یَنۡتَصِرُوۡنَ ﴿۴۰﴾", "english": " And those who, when a wrong is done to them, defend themselves.", "french": " Et ceux qui, lorsqu’une injustice leur est faite, ripostent, tout en sachant que", "german": " und die, wenn eine Unbill sie trifft, sich verteidigen.", "spanish": " Y quienes se defienden cuando se les perjudica.", "urdu": " اور جب ان پر کوئی ظلم ہوتا ہے تو وہ بدلہ تو لے لیتے ہیں (مگر یہ یاد رکھتے ہیں) ۔"}, {"arabic": " وَ جَزٰٓؤُا سَیِّئَۃٍ سَیِّئَۃٌ مِّثۡلُہَا ۚ فَمَنۡ عَفَا وَ اَصۡلَحَ فَاَجۡرُہٗ عَلَی اللّٰہِ ؕ اِنَّہٗ لَا یُحِبُّ الظّٰلِمِیۡنَ ﴿۴۱﴾", "english": " And the recompense of an injury is an injury the like thereof; but whoso forgives and his act brings about reformation, his reward is with Allah. Surely, He loves not the wrongdoers.", "french": " Le paiement d’un préjudice est une sanction proportionnelle ; mais celui qui pardonne et par là apporte une réforme, sa récompense est auprès d’Allāh. Assurément, Il n’aime pas les injustes.", "german": " Die Vergeltung für eine Schädigung soll eine Schädigung in gleichem Ausmaß sein; wer aber vergibt und Besserung bewirkt, dessen Lohn ist sicher bei Allah. Wahrlich, Er liebt die Ungerechten nicht.", "spanish": " La recompensa de un daño es un daño similar; mas quien perdona y su acto produce la reforma, tendrá su recompensa con Al-lah. En verdad, Él no ama a los inicuos.", "urdu": " کہ بدی کا بدلہ اتنی ہی بدی ہوتی ہے اور جو معاف کرے اور اصلاح کو مدنظر رکھے تو اس کو بدلہ دینا اللہ کے ذمے ہوتا ہے وہ (اللہ) ظالموں کو پسند نہیں کرتا۔"}, {"arabic": " وَ لَمَنِ انۡتَصَرَ بَعۡدَ ظُلۡمِہٖ فَاُولٰٓئِکَ مَا عَلَیۡہِمۡ مِّنۡ سَبِیۡلٍ ﴿ؕ۴۲﴾", "english": " But there is no blame on those who defend themselves after they have been wronged.", "french": " Mais il n’y a aucun blâme sur ceux qui ripostent après avoir été injustement traités.", "german": " Jedoch trifft kein Tadel jene, die sich verteidigen, nachdem ihnen Unrecht widerfuhr.", "spanish": " Mas no hay culpa en quienes se defienden después de haber sido oprimidos.", "urdu": " اور جو لوگ اپنی ذات پر ظلم کیے جانے کے بعد مناسب بدلہ لیتے ہیں۔ ان پر کسی قسم کا اعتراض نہیں ہو سکتا۔"}, {"arabic": " اِنَّمَا السَّبِیۡلُ عَلَی الَّذِیۡنَ یَظۡلِمُوۡنَ النَّاسَ وَ یَبۡغُوۡنَ فِی الۡاَرۡضِ بِغَیۡرِ الۡحَقِّ ؕ اُولٰٓئِکَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۴۳﴾", "english": " The blame is only on those who wrong men and transgress in the earth without justification. Such will have a grievous punishment.", "french": " Le blâme est seulement sur ceux qui font tort aux hommes, et transgressent sur la terre sans justification. Ceux-là auront un châtiment douloureux.", "german": " Tadel trifft nur solche, die den Menschen Unrecht zufügen und auf Erden freveln ohne Rechtfertigung. Ihnen wird schmerzliche Strafe.", "spanish": " Sólo son culpables quienes perjudican a los hombres y cometen transgresión en la tierra sin justificación. Éstos tendrán un castigo doloroso.", "urdu": " اعتراض صرف ان لوگوں پر ہوتا ہے جو لوگوں پر ظلم (اور حملہ) میں ابتدا کرتے ہیں اور زمین میں بغیر کسی حق کے زیادتی کرنے لگ جاتے ہیں ایسے لوگوں کو دردناک عذاب ملے گا۔"}, {"arabic": " وَ لَمَنۡ صَبَرَ وَ غَفَرَ اِنَّ ذٰلِکَ لَمِنۡ عَزۡمِ الۡاُمُوۡرِ ﴿٪۴۴﴾", "english": " And he who is patient and forgives — that surely is a matter of strong determination.", "french": " Et celui qui est patient et pardonne – cela, assurément, requiert une grande détermination.", "german": " Und fürwahr, wer geduldig ist und vergibt – das ist gewiss Zeichen eines starken Geistes.", "spanish": " Mas quien es paciente y perdona: aquí hay en verdad un asunto de enérgica determinación.", "urdu": " اور جس نے صبر کیا اور معاف کیا تو (اس کا) یہ (کام) بڑی ہمت والے کاموں میں سے ہے۔"}, {"arabic": " وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَمَا لَہٗ مِنۡ وَّلِیٍّ مِّنۡۢ بَعۡدِہٖ ؕ وَ تَرَی الظّٰلِمِیۡنَ لَمَّا رَاَوُا الۡعَذَابَ یَقُوۡلُوۡنَ ہَلۡ اِلٰی مَرَدٍّ مِّنۡ سَبِیۡلٍ ﴿ۚ۴۵﴾", "english": " And he whom Allah adjudges astray — there is no protector for him thereafter. And thou wilt find the wrongdoers, when they see the punishment, saying: ‘Is there any way of return?’", "french": " Et celui qu’Allāh juge égaré – il n’y a aucun protecteur pour lui par la suite. Et tu verras les injustes qui diront, lorsqu’ils verront le châtiment : « N’y a-t-il aucune voie de retour ? »", "german": " Und wen Allah zum Irrenden erklärt, für ihn gibt es außer Ihm keinen Beschützer. Und du wirst die Frevler sehen, wie sie, wenn sie die Strafe schauen, sprechen: \"Ist denn kein Weg zur Rückkehr?\"", "spanish": " A quien Al-lah decreta extraviado, sepa que no tendrá después protector. Pero encontrarás que los injustos, cuando ven el castigo, dicen: “¿Hay algún camino de retorno?”.", "urdu": " اور جس کو اللہ گمراہ قرار دے تو اس (اللہ) کو چھوڑ کر اس کا کوئی مددگار نہیں ہو سکتا اور تو ظالموں کو دیکھے گا کہ جب وہ عذاب آتا دیکھیں گے تو کہیں گے کہ کیا اس عذاب کو لوٹانے کی کوئی تدبیر بھی ہے!"}, {"arabic": " وَ تَرٰٮہُمۡ یُعۡرَضُوۡنَ عَلَیۡہَا خٰشِعِیۡنَ مِنَ الذُّلِّ یَنۡظُرُوۡنَ مِنۡ طَرۡفٍ خَفِیٍّ ؕ وَ قَالَ الَّذِیۡنَ اٰمَنُوۡۤا اِنَّ الۡخٰسِرِیۡنَ الَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ وَ اَہۡلِیۡہِمۡ یَوۡمَ الۡقِیٰمَۃِ ؕ اَلَاۤ اِنَّ الظّٰلِمِیۡنَ فِیۡ عَذَابٍ مُّقِیۡمٍ ﴿۴۶﴾", "english": " And thou wilt see them brought before it (the Fire), casting down their eyes on account of disgrace, looking thereat with a stealthy glance. And those who believe will say, ‘The losers indeed are those who ruin themselves and their families on the Day of Resurrection.’ Behold! the wrongdoers are to remain in a lasting punishment.", "french": " Et tu les verras confrontés au châtiment , la tête baissée à cause de la disgrâce, le regardant à la dérobée. Et ceux qui croient diront : « En vérité, les perdants sont ceux qui ont causé leur propre ruine et celle de leurs familles le Jour de la Résurrection. » Notez bien ! Les injustes devront rester dans un châtiment d’une longue durée.", "german": " Und du wirst sie ihr ausgesetzt sehen, gedemütigt ob der Schmach, mit verstohlenem Blicke schauend. Die aber gläubig sind, werden sprechen: \"Fürwahr, die Verlierenden sind diejenigen, die sich selbst und ihre Angehörigen verlieren am Tage der Auferstehung.\" Höret! die Frevler sind wahrlich in langdauernder Pein.", "spanish": " Y los verás conducidos ante él (el Fuego), bajando sus ojos en razón de su humillación y observándo lo con una mirada furtiva. Mas quienes creen dirán: “Los perdedores son en verdad quienes se arruinan a sí mismos y a sus familias en el Día de la Resurre­cción. “¡Mirad! Los injustos habrán de permanecer en un castigo duradero”.", "urdu": " اور تو ان کو دیکھے گا کہ وہ اس عذاب کے سامنے پیش کیے جائیں گے اور ذلت کی وجہ سے سر جھکائے ہوئے نیچی نگاہوں سے دیکھ رہے ہوں گے اور مومن کہیں گے کہ اصل گھاٹا پانے والے وہی ہیں جنہوں نے اپنی جانوں اور اہل و عیال کو قیامت کے دن گھاٹے میں ڈالا۔ کان کھول کر سن لو! ظالم لوگ ایک قائم رہنے والے عذاب میں ہوں گے۔"}, {"arabic": " وَ مَا کَانَ لَہُمۡ مِّنۡ اَوۡلِیَآءَ یَنۡصُرُوۡنَہُمۡ مِّنۡ دُوۡنِ اللّٰہِ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَمَا لَہٗ مِنۡ سَبِیۡلٍ ﴿ؕ۴۷﴾", "english": " And they have no helpers to help them other than Allah. And for him whom Allah adjudges astray there is no way at all .", "french": " Et ils n’ont aucun protecteur pour les secourir autre qu’Allāh. Et pour celui qu’Allāh juge égaré, il n’y a pas d’issue du tout .", "german": " Und sie haben keine Helfer, ihnen gegen Allah zu helfen. Und für einen, den Allah zum Irrenden erklärt, ist kein Ausweg.", "spanish": " Y no tienen a nadie que les ayude aparte de Al-lah. Y para quien l-lah decreta que se ha extraviado, no hay camino en absoluto.", "urdu": " اور ان کو پناہ دینے والے کوئی نہیں ہوں گے جو ان کی اللہ کے مقابلہ میں مدد کر سکیں اور جس کو اللہ گمراہ سمجھتا ہے اس کو راستہ پر لانے کی کوئی تدبیر نہیں۔"}, {"arabic": " اِسۡتَجِیۡبُوۡا لِرَبِّکُمۡ مِّنۡ قَبۡلِ اَنۡ یَّاۡتِیَ یَوۡمٌ لَّا مَرَدَّ لَہٗ مِنَ اللّٰہِ ؕ مَا لَکُمۡ مِّنۡ مَّلۡجَاٍ یَّوۡمَئِذٍ وَّ مَا لَکُمۡ مِّنۡ نَّکِیۡرٍ ﴿۴۸﴾", "english": " Hearken ye to your Lord before there comes a day for which there will be no averting in opposition to the decree of Allah. There will be no refuge for you on that day, nor will there be for you any possibility of denial.", "french": " Répondez à l’appel de votre Seigneur, avant que ne vienne un jour où il n’y aura pas moyen de le détourner à l'encontre du décret d'Allāh. Ce Jour-là il n’y aura pour vous aucun refuge, et il n’y aura pour vous non plus aucun e possibilité de démenti.", "german": " Höret auf euren Herrn, bevor ein Tag kommt, den niemand gegen Allah verwehren kann. An jenem Tag wird es für euch keine Zuflucht geben, noch gibt es für euch irgendwelche Möglichkeit des Leugnens.", "spanish": " Escuchad a vuestro Señor antes de que llegue el día en el que no habrá escapatoria contra el decreto de Al-lah. En ese día no habrá refugio para vosotros, ni tendréis posibilidad alguna de negar.", "urdu": " تم اپنے رب کی آواز کا (اس پر لبیک کہتے ہوئے) جواب دو۔ پیشتر اس کے کہ وہ وقت آجائے جس کو اللہ کے مقابلہ میں لوٹانے والا کوئی نہیں۔ اس دن تمہارے لئے کوئی پناہ کی جگہ نہیں ہوگی اور تمہارے لئے انکار کی کوئی گنجائش نہیں ہوگی۔"}, {"arabic": " فَاِنۡ اَعۡرَضُوۡا فَمَاۤ اَرۡسَلۡنٰکَ عَلَیۡہِمۡ حَفِیۡظًا ؕ اِنۡ عَلَیۡکَ اِلَّا الۡبَلٰغُ ؕ وَ اِنَّاۤ اِذَاۤ اَذَقۡنَا الۡاِنۡسَانَ مِنَّا رَحۡمَۃً فَرِحَ بِہَا ۚ وَ اِنۡ تُصِبۡہُمۡ سَیِّئَۃٌۢ بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ فَاِنَّ الۡاِنۡسَانَ کَفُوۡرٌ ﴿۴۹﴾", "english": " But if they turn away, We have not sent thee as a guardian over them. Thy duty is only to convey the Message . And truly when We cause man to taste of mercy from Us, he rejoices therein. But if an evil befalls them because of what their hands have sent forth, then lo! man is ungrateful.", "french": " Mais s’ils se détournent, Nous ne t’avons pas envoyé vers eux en tant que gardien. Ton devoir est seulement de transmettre clairement le Message. Et en vérité lorsque Nous faisons goûter à l’homme une miséricorde de Notre part, il s’en réjouit. Mais si un malheur leur survient par suite de ce que leurs mains ont envoyé en avant, alors voilà que l’homme est très ingrat !", "german": " Kehren sie sich jedoch ab, so haben Wir dich nicht als Wächter über sie entsandt. Deine Pflicht ist nur die Verkündigung. Wenn Wir dem Menschen Unsere Barmherzigkeit zu kosten geben, so freut er sich über sie. Doch wenn sie ein Unheil trifft um dessentwillen, was ihre Hände vorausgesandt, siehe, dann ist der Mensch undankbar.", "spanish": " Mas si se apartan, no te hemos enviado como guardián de ellos. Tu deber es únicamente el de transmitir el Mensaje . En verdad cuanto, cuando hacemos que el hombre pruebe Nuestra misericordia, se alegra con ella. Pero si les sobreviene el mal por lo que cometieron sus manos ¡he ahí como el hombre se vuelve desagradecido!", "urdu": " پھر بھی اگر وہ اعراض کریں تو (کرتے رہیں) ہم نے تجھے ان پر نگران بنا کر نہیں بھیجا۔ تجھ پر صرف بات کا پہنچا دینا فرض ہے اور جب کبھی ہم انسان کو اپنی طرف سے رحمت پہنچاتے ہیں تو وہ اس پر خوش ہو جاتا ہے اور اگر اس کے کسی عمل کی وجہ سے (ہماری طرف سے) اس کو کوئی تکلیف پہنچے تو انسان ناشکر گذار بن جاتا ہے (اور پہلے تمام فضلوں کا انکار کر دیتا ہے)"}, {"arabic": " لِلّٰہِ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ یَخۡلُقُ مَا یَشَآءُ ؕیَہَبُ لِمَنۡ یَّشَآءُ اِنَاثًا وَّ یَہَبُ لِمَنۡ یَّشَآءُ الذُّکُوۡرَ ﴿ۙ۵۰﴾", "english": " To Allah belongs the kingdom of the heavens and the earth. He creates what He pleases. He bestows daughters upon whom He pleases, and He bestows sons upon whom He pleases;", "french": " A Allāh appartient le royaume des cieux et de la terre. Il crée ce qu’Il veut. Il accorde des filles à qui Il veut et Il accorde des fils à qui Il veut ;", "german": " Allahs ist das Königreich der Himmel und der Erde. Er schafft, was Ihm beliebt. Er beschert Mädchen, wem Er will, und Er beschert Knaben, wem Er will;", "spanish": " A Al-lah pertenece el reino de los cielos y la tierra. Él crea lo que le place. Concede hijas a quien quiere y concede hijos a quien le agrada;", "urdu": " اللہ ہی کے لئے زمین و آسمان کی بادشاہت ہے جو کچھ چاہتا ہے پیدا کرتا ہے‘ جس کو چاہتا ہے لڑکیاں دیتا ہے‘ جس کو چاہتا ہے‘ لڑکے دیتا ہے۔"}, {"arabic": " اَوۡ یُزَوِّجُہُمۡ ذُکۡرَانًا وَّ اِنَاثًا ۚ وَ یَجۡعَلُ مَنۡ یَّشَآءُ عَقِیۡمًا ؕ اِنَّہٗ عَلِیۡمٌ قَدِیۡرٌ ﴿۵۱﴾", "english": " Or He mixes them, males and females; and He makes whom He pleases barren. Surely, He is All- Knowing, Powerful.", "french": " Ou, Il les mélange, mâles et femelles, et Il rend stérile qui Il veut. Assurément, Il est Omniscient, Omnipotent.", "german": " oder Er gibt beides, Knaben und Mädchen; und Er macht unfruchtbar, wen Er will; Er ist allwissend (und) bestimmt das Maß.", "spanish": " O bien, Él los mezcla, varones y hembras; y Él hace estéril a quien le place. En verdad, Él es Omnisciente, Poderoso.", "urdu": " یا لڑکوں اور لڑکیوں کو ملا جلا دیتا ہے (یعنی لڑکیاں بھی پیدا ہوتی ہیں اور لڑکے بھی) اور جس کو چاہتا ہے بانجھ بنا دیتا ہے وہ بڑے علم والا (اور) قدرت والا ہے۔"}, {"arabic": " وَ مَا کَانَ لِبَشَرٍ اَنۡ یُّکَلِّمَہُ اللّٰہُ اِلَّا وَحۡیًا اَوۡ مِنۡ وَّرَآیِٔ حِجَابٍ اَوۡ یُرۡسِلَ رَسُوۡلًا فَیُوۡحِیَ بِاِذۡنِہٖ مَا یَشَآءُ ؕ اِنَّہٗ عَلِیٌّ حَکِیۡمٌ ﴿۵۲﴾", "english": " And it is not for a man that Allah should speak to him except by revelation or from behind a veil or by sending a messenger to reveal by His command what He pleases. Surely, He is High, Wise.", "french": " Et il n’est pas possible pour un homme qu’Allāh lui parle sauf à travers la révélation, ou de derrière un voile, ou en envoyant un messager pour qu’il révèle par Son commandement ce qu’Il veut. Assurément, Il est Très-Haut et Sage.", "german": " Keinem Menschen steht es zu, dass Allah zu ihm sprechen sollte, außer durch Offenbarung oder hinter einem Schleier oder indem Er einen Boten schickt, zu offenbaren auf Sein Geheiß, was Ihm gefällt; Er ist erhaben, allweise.", "spanish": " Y no es propio para el hombre que Al-lah le hable salvo por revelación o tras un velo, o enviándole un mensajero para que le revele con Su mandamiento lo que desee. En verdad, Él es Altísimo, Sabio.", "urdu": " اور کسی آدمی کی یہ حیثیت نہیں کہ اللہ اس سے وحی کے سوا یا پردے کے پیچھے بولنے کے سوا کسی اور صورت سے کلام کرے یا (اس کی طرف فرشتوں میں سے) رسول (بناکر) بھیجے جو اس کے حکم سے جو کچھ وہ کہے بات پہنچا دیں۔ وہ بڑی شان والا (اور) حکمتوں کا واقف ہے۔"}, {"arabic": " وَ کَذٰلِکَ اَوۡحَیۡنَاۤ اِلَیۡکَ رُوۡحًا مِّنۡ اَمۡرِنَا ؕ مَا کُنۡتَ تَدۡرِیۡ مَا الۡکِتٰبُ وَ لَا الۡاِیۡمَانُ وَ لٰکِنۡ جَعَلۡنٰہُ نُوۡرًا نَّہۡدِیۡ بِہٖ مَنۡ نَّشَآءُ مِنۡ عِبَادِنَا ؕ وَ اِنَّکَ لَتَہۡدِیۡۤ اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿ۙ۵۳﴾", "english": " And thus have We revealed to thee the Word by Our command. Thou didst not know what the Book was, nor what the faith. But We have made it (the revelation) a light, whereby We guide such of Our servants as We please. And truly, thou guidest mankind to the right path,", "french": " Et c’est ainsi que Nous t’avons révélé, par Notre commandement, une révélation insufflant la vie. Tu ne savais pas ce qu’était le Livre, ni ce qu’était la foi. Mais Nous avons fait de la révélation une lumière, par laquelle Nous guidons ceux de Nos serviteurs que Nous voulons. Et en vérité tu guides l’humanité vers un droit chemin,", "german": " Also haben Wir dir ein Wort offenbart nach Unserem Gebot. Du wusstest nicht was das Buch war noch was der Glaube. Doch Wir haben sie (die Offenbarung) zu einem Lichte gemacht, mit dem Wir jenen von Unseren Dienern den Weg weisen, denen Wir wollen. Wahrlich, du leitest auf den geraden Weg,", "spanish": " Así te hemos revelado una gran revelación por Nuestro mandamiento. No sabías lo que era el Libro ni qué era la fe. Pero la hicimos (a la revelación) ser una luz con la que guiamos a quien Nos place de Nuestros siervos. En verdad tú guías a los hombres al camino recto,", "urdu": " اور اسی طرح ہم نے تیری طرف اپنے حکم سے کلام نازل کیا ہے تو نہیں جانتا تھا کہ کتاب کیا چیز ہے اور نہ یہ جانتا تھا کہ ایمان کیا چیز ہے لیکن ہم نے اس (تیری وحی) کو نور بنا دیا ہے اس کے ذریعہ سے اپنے بندوں میں سے جس کو چاہتے ہیں ہم ہدایت دے دیتے ہیں اور تو یقیناً لوگوں کو سیدھے راستہ کی طرف لا رہا ہے ۔"}, {"arabic": " صِرَاطِ اللّٰہِ الَّذِیۡ لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ اَلَاۤ اِلَی اللّٰہِ تَصِیۡرُ الۡاُمُوۡرُ ﴿٪۵۴﴾", "english": " The path of Allah, to Whom belongs whatever is in the heavens and whatever is in the earth. Behold! to Allah do all things return.", "french": " Le chemin d’Allāh, à Qui appartiennent tout ce qui est dans les cieux et tout ce qui est sur la terre. Notez bien ! A Allāh que retournent toutes les affaires pour Sa décision .", "german": " den Weg Allahs, Dem alles gehört, was in den Himmeln und was auf Erden ist. Höret! zu Allah kehren alle Dinge zurück.", "spanish": " El camino de Al-lah, a Quien pertenece cuanto hay en los cielos y cuanto hay en la tierra. ¡Mirad! A Al-lah retornan todas las cosas.", "urdu": " اللہ کے راستہ کی طرف جو اس کا بھی مالک ہے جو آسمانوں میں ہے اور اس کا بھی جو زمین میں ہے۔ سنو! سب باتیں خدا ہی کی طرف جاتی ہیں (یعنی تمام باتوں کی ابتدا اور انجام خدا ہی کے ہاتھ میں ہیں۔)"}], "Surah": 42}