{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ اِذَا طَلَّقۡتُمُ النِّسَآءَ فَطَلِّقُوۡہُنَّ لِعِدَّتِہِنَّ وَ اَحۡصُوا الۡعِدَّۃَ ۚ وَ اتَّقُوا اللّٰہَ رَبَّکُمۡ ۚ لَا تُخۡرِجُوۡہُنَّ مِنۡۢ بُیُوۡتِہِنَّ وَ لَا یَخۡرُجۡنَ اِلَّاۤ اَنۡ یَّاۡتِیۡنَ بِفَاحِشَۃٍ مُّبَیِّنَۃٍ ؕ وَ تِلۡکَ حُدُوۡدُ اللّٰہِ ؕ وَ مَنۡ یَّتَعَدَّ حُدُوۡدَ اللّٰہِ فَقَدۡ ظَلَمَ نَفۡسَہٗ ؕ لَا تَدۡرِیۡ لَعَلَّ اللّٰہَ یُحۡدِثُ بَعۡدَ ذٰلِکَ اَمۡرًا ﴿۲﴾", "english": " O Prophet! when you divorce women, divorce them for the prescribed period, and reckon the period; and fear Allah. Turn them not out of their houses, nor should they themselves leave unless they commit an act which is manifestly foul. And these are the limits set by Allah; and whoso transgresses the limits of Allah, he indeed wrongs his own soul. Thou knowest not; it may be that thereafter Allah will bring something new to pass.", "french": " Ô Prophète ! lorsque vous divorcez d’avec les femmes, divorcez d’avec elles selon leur période d’attente prescrite , et tenez compte de la période ; et craignez Allāh, votre Seigneur. Ne les chassez pas de leurs habitations, et elles ne doivent pas en partir d’elles-mêmes non plus, à moins qu’elles ne commettent une indécence manifeste. Et ce sont là les limites fixées par Allāh ; et quiconque transgresse les limites d’Allāh, nuit assurément à sa propre âme. Tu ne sais pas, il se peut que par la suite Allāh fasse arriver quelque chose de nouveau.", "german": " O Prophet! wenn ihr euch von Frauen trennt, so trennt euch von ihnen für ihre vorgeschriebene Frist, und berechnet die Frist; und fürchtet Allah, euren Herrn. Vertreibt sie nicht aus ihren Häusern, noch sollen sie (selbst) fortgehen, es sei denn, sie begehen offenkundige Unsittlichkeit. Das sind die Schranken Allahs; und wer Allahs Schranken übertritt, der sündigt wider sich selbst. Du weißt nicht, vielleicht wird Allah späterhin etwas Neues geschehen lassen.", "spanish": " ¡Oh Profeta! Cuando divorciéis a las mujeres, divorciadlas por el período prescrito y contad el período; y temed a Al-lah uestro Señor. No las echéis de sus hogares, ni que ellas mismas los abandonen, salvo que cometan un acto manifiestamente obsceno. Éstos son los límites fijados por Al-lah; y quien transgrede los límites de Al-lah, en verdad perjudica a su propia alma. Tú no lo sabes; es posible que Al-lah, más adelante, haga que ocurra algo nuevo.", "urdu": " اے نبی! (اور اس کے ماننے والو) جب تم بیویوں کو طلاق دو تو ان کو مقررہ وقت کے مطابق طلاق دو اور (طلاق کے بعد) وقت کا اندازہ رکھو اور اللہ کا جو تمہارا رب ہے تقویٰ اختیار کرو‘ ان کو ان کے گھروں سے نہ نکالو اور نہ وہ خود نکلیں سوائے اس کے کہ وہ ایک کھلے گناہ کی مرتکب ہوں۔ اور یہ اللہ کی حدیں ہیں اور جو کوئی اللہ کی حدوں کو توڑ دیتا ہے وہ اپنی جان پر ظلم کرتا ہے (اے طلاق دینے والے)! تجھے معلوم نہیں کہ شاید اللہ اس واقعہ کے بعد کچھ اور ظاہر کرے۔"}, {"arabic": " فَاِذَا بَلَغۡنَ اَجَلَہُنَّ فَاَمۡسِکُوۡہُنَّ بِمَعۡرُوۡفٍ اَوۡ فَارِقُوۡہُنَّ بِمَعۡرُوۡفٍ وَّ اَشۡہِدُوۡا ذَوَیۡ عَدۡلٍ مِّنۡکُمۡ وَ اَقِیۡمُوا الشَّہَادَۃَ لِلّٰہِ ؕ ذٰلِکُمۡ یُوۡعَظُ بِہٖ مَنۡ کَانَ یُؤۡمِنُ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ۬ؕ وَ مَنۡ یَّتَّقِ اللّٰہَ یَجۡعَلۡ لَّہٗ مَخۡرَجًا ۙ﴿۳﴾", "english": " Then, when they are about to reach their prescribed term, keep them with kindness, or put them away with kindness, and call to witness two just persons from among you; and bear true witness for Allah. This is by which is admonished he who believes in Allah and the Last Day. And he who fears Allah — He will make for him a way out,", "french": " Puis, lorsqu’elles atteignent le terme prescrit , gardez-les d’une manière bienveillante, ou séparez-vous d’elles d’une manière bienveillante, et appelez à témoin deux personnes justes d’entre vous ; et acquittez-vous du témoignage pour l’amour d’ Allāh. Voilà ce à quoi est exhorté celui qui croit en Allāh et au Jour Dernier. Et celui qui craint Allāh – Il ménagera une issue pour lui,", "german": " Dann, wenn ihre Frist um ist, nehmt sie in Güte zurück oder trennt euch in Güte von ihnen und rufet zwei rechtschaffene Leute aus eurer Mitte zu Zeugen; und lasst es ein wahrhaftiges Zeugnis vor Allah sein. Das ist eine Mahnung für den, der an Allah und an den Jüngsten Tag glaubt. Und dem, der Allah fürchtet, wird Er einen Ausweg bereiten,", "spanish": " Luego, cuando estén a punto de cumplir su término prescrito , conservadlas con amabilidad o despedidlas bondadosamente, y llamad como testigos a dos personas justas de entre vosotros, que den testimonio verdadero por Al-lah. Con esto es con lo que se amonesta a quien cree en Al-lah y en el Último Día. Mas quien tema a Al-lah, sepa que Él le abrirá un camino de salida,", "urdu": " پھر جب عورتیں عدت کی آخری حد کو پہنچ جائیں تو انہیں مناسب طریق پر روک لو یا انہیں مناسب طریق پر فارغ کردو۔ اور اپنے میں سے دو منصف گواہ مقرر کرو۔ اور خدا کے لئے سچی گواہی دو۔ تم میں سے جو کوئی اللہ اور یوم آخر پر ایمان لاتا ہے اس کو یہ نصیحت کی جاتی ہے اور جو شخص اللہ کا تقویٰ اختیار کرے گا اللہ اس کے لئے کوئی نہ کوئی رستہ نکال دے گا۔"}, {"arabic": " وَّ یَرۡزُقۡہُ مِنۡ حَیۡثُ لَا یَحۡتَسِبُ ؕ وَ مَنۡ یَّتَوَکَّلۡ عَلَی اللّٰہِ فَہُوَ حَسۡبُہٗ ؕ اِنَّ اللّٰہَ بَالِغُ اَمۡرِہٖ ؕ قَدۡ جَعَلَ اللّٰہُ لِکُلِّ شَیۡءٍ قَدۡرًا ﴿۴﴾", "english": " And will provide for him from where he expects not. And he who puts his trust in Allah — He is sufficient for him. Verily, Allah will accomplish His purpose. For everything has Allah appointed a measure.", "french": " Et Il pourvoira à ses besoins d’où il ne s ’y attend pas. Et celui qui met sa confiance en Allāh – Il est suffisant pour lui. En vérité, Allāh accomplira sûrement Sa décision. A toute chose, Allāh a prescrit une mesure.", "german": " und wird ihn versorgen, von wannen er es nicht erwartet. Und für den, der auf Allah vertraut, ist Er Genüge. Wahrlich, Allah wird Seine Absicht durchführen. Für alles hat Allah ein Maß bestimmt.", "spanish": " Y le proporcionará de donde no espera. Pues quien pone su confianza en Al-lah, sepa que Él le es suficiente. En verdad, Al-lah cumplirá Su objetivo. Al-lah ha fijado una medida para todo.", "urdu": " اور اس کو وہاں سے رزق دے گا جہاں سے رزق آنے کا اسے خیال بھی نہیں ہوگا اور جو کوئی اللہ پر توکل کرتا ہے وہ (اللہ) اس کے لئے کافی ہے اللہ یقیناً اپنے مقصد کو پورا کرکے چھوڑتا ہے اللہ نے ہر چیز کا اندازہ مقرر کر چھوڑا ہے۔"}, {"arabic": " وَ الّٰٓیِٴۡ یَئِسۡنَ مِنَ الۡمَحِیۡضِ مِنۡ نِّسَآئِکُمۡ اِنِ ارۡتَبۡتُمۡ فَعِدَّتُہُنَّ ثَلٰثَۃُ اَشۡہُرٍ ۙ وَّ الّٰٓیِٴۡ لَمۡ یَحِضۡنَ ؕ وَ اُولَاتُ الۡاَحۡمَالِ اَجَلُہُنَّ اَنۡ یَّضَعۡنَ حَمۡلَہُنَّ ؕ وَ مَنۡ یَّتَّقِ اللّٰہَ یَجۡعَلۡ لَّہٗ مِنۡ اَمۡرِہٖ یُسۡرًا ﴿۵﴾", "english": " And if you are in doubt as to such of your women as despair of monthly courses, then know that the prescribed period for them is three months, and the same is for such as have not had their monthly courses yet . And as for those who are with child, their period shall be until they are delivered of their burden. And whoso fears Allah, He will provide facilities for him in his affair.", "french": " Et si vous êtes dans le doute au sujet de celles de vos femmes qui n’espèrent plus de règles, alors sachez que la période prescrite pour elles est de trois mois, et la même chose pour celles qui n’ont pas encore eu leurs règles. Et quant à celles qui sont enceintes, leur période sera jusqu’à ce qu’elles soient délivrées de leur fardeau. Et quiconque craint Allāh, Il lui facilitera ses affaires.", "german": " Wenn ihr im Zweifel seid (über) jene eurer Frauen, die keine monatliche Reinigung mehr erhoffen, (dann wisset, dass) ihre Frist drei Monate ist, und (das gleiche gilt für) die, die noch keine Reinigung hatten. Und für die Schwangeren soll ihre Frist so lange währen, bis sie sich ihrer Bürde entledigt haben. Und dem, der Allah fürchtet, wird Er Erleichterung verschaffen in seinen Angelegenheiten.", "spanish": " Mas si tenéis alguna duda respecto a aquellas de vuestras mujeres que desesperan de la menstruación, sabed que l período prescrito para ellas es de tres meses, así como para las que aún no han tenido sus reglas. Mas en cuanto a las que estén embarazadas, su período durará hasta que queden libres de su carga. Y a quien teme a Al-lah, Él le facilitará sus asuntos.", "urdu": " اور (تمہاری بیویوں میں سے) وہ (عورتیں) جو حیض سے مایوس ہو چکی ہوں اگر (ان کی عدت کے متعلق) تمہیں شبہ ہو تو ان کی عدت تین مہینے ہے اور اسی طرح ان کی بھی جن کو حیض نہیں آرہا۔ اور جن عورتوں کو حمل ہو ان کی عدت وضع حمل تک ہے اور جو کوئی اللہ کا تقویٰ اختیار کرے اللہ ضرور اس کے معاملہ میں آسانی پیدا کر دیتا ہے۔"}, {"arabic": " ذٰلِکَ اَمۡرُ اللّٰہِ اَنۡزَلَہٗۤ اِلَیۡکُمۡ ؕ وَ مَنۡ یَّتَّقِ اللّٰہَ یُکَفِّرۡ عَنۡہُ سَیِّاٰتِہٖ وَ یُعۡظِمۡ لَہٗۤ اَجۡرًا ﴿۶﴾", "english": " That is the command of Allah which He has revealed to you. And whoso fears Allah — He will remove the evil consequences of his deeds and will enlarge his reward.", "french": " C’est là le commandement d’Allāh qu’Il vous a révélé. Et quiconque craint Allāh – Il lui enlèvera ses méfaits et lui augmentera grandement sa récompense.", "german": " Das ist Allahs Gebot, das Er euch herabgesandt hat. Und wer Allah fürchtet – Er wird seine Übel von ihm nehmen und ihm seinen Lohn erweitern.", "spanish": " Ése es el mandamiento de Al-lah que Él os ha revelado. Quien tema a Al-lah, sepa que Él eliminará las consecuencias perversas de sus acciones y ampliará su recompensa.", "urdu": " یہ اللہ کا حکم ہے جو اس نے تمہاری طرف اتارا ہے اور جو کوئی اللہ کا تقویٰ اختیار کرے وہ (خدا) اس کی بدیاں مٹا دیتا ہے اور اس کے اجر کو بڑھا دیتا ہے۔"}, {"arabic": " اَسۡکِنُوۡہُنَّ مِنۡ حَیۡثُ سَکَنۡتُمۡ مِّنۡ وُّجۡدِکُمۡ وَ لَا تُضَآرُّوۡہُنَّ لِتُضَیِّقُوۡا عَلَیۡہِنَّ ؕ وَ اِنۡ کُنَّ اُولَاتِ حَمۡلٍ فَاَنۡفِقُوۡا عَلَیۡہِنَّ حَتّٰی یَضَعۡنَ حَمۡلَہُنَّ ۚ فَاِنۡ اَرۡضَعۡنَ لَکُمۡ فَاٰتُوۡہُنَّ اُجُوۡرَہُنَّ ۚ وَ اۡتَمِرُوۡا بَیۡنَکُمۡ بِمَعۡرُوۡفٍ ۚ وَ اِنۡ تَعَاسَرۡتُمۡ فَسَتُرۡضِعُ لَہٗۤ اُخۡرٰی ؕ﴿۷﴾", "english": " Lodge them during the prescribed period in the houses wherein you dwell, according to the best of your means; and harass them not that you may create hardships for them. And if they be with child, spend on them until they are delivered of their burden. And if they give suck to the child for you, give them their recompense, and consult with one another in kindness; but if you meet with difficulty from each other, then another woman shall suckle the child for him (the father).", "french": " Logez-les pendant la période prescrite dans les maisons où vous demeurez, le mieux possible selon vos moyens ; et ne les tourmentez pas pour leur rendre la vie difficile. Et si elles sont enceintes, dépensez pour elles jusqu’à ce qu’elles soient délivrées de leur fardeau. Et si elles allaitent l’enfant pour vous, donnez-leur leur récompense, et décidez de vos affaires ensemble en vous consultant l’un l’autre d’une façon juste ; mais si vous rencontrez des difficultés entre vous, alors une autre femme allaitera l’enfant pour lui - le père.", "german": " Lasset sie (während der Frist) in den Häusern wohnen, in denen ihr wohnt, gemäß euren Mitteln; und tut ihnen nichts zuleide in der Absicht, es ihnen schwer zu machen. Und wenn sie schwanger sind, so bestreitet ihren Unterhalt, bis sie sich ihrer Bürde entledigt haben. Und wenn sie (das Kind) für euch säugen, gebt ihnen ihren Lohn und beratet euch freundlich miteinander; wenn ihr aber (damit) Verlegenheit füreinander schafft, dann soll eine andere (das Kind) für den (Vater) säugen.", "spanish": " Alojadlas durante el período prescrito en las viviendas en las que habitáis, de acuerdo con lo mejor de vuestros medios, y no las molestéis a fin de no crearles dificultades indebidas. Y si estuviesen embarazadas, gastad en ellas hasta que queden libres de su carga. Y si os amamantan al hijo , dadles su recompensa y decidid vuestros asuntos mediante mutua consulta y con justicia. Pero si ncontráis dificultades entre ambos, que otra mujer amamante al niño para él (el padre).", "urdu": " (اے مسلمانو! مطلقہ عورتوں کے حق کو نہ بھولو) ان کو وہیں رکھو جہاں تم اپنی طاقت کے مطابق رہتے ہو۔ اور ان کو کسی قسم کا ضرر نہ دو اس لئے کہ ان کو تنگ کرکے (گھر سے) نکال دو۔ اور اگر وہ حمل والی ہوں‘ تو اس وقت تک ان پر خرچ کرو جب تک وضع حمل ہو جائے اور اگر وہ تمہارے لئے بچوں کو دودھ پلائیں‘ تو ان کو معقول اجرت دو اور اس کا فیصلہ حسب دستور باہمی مشورہ سے کرو اور اگر آپس میں کسی فیصلہ پر اکٹھے نہ ہو سکو تو کوئی اور عورت اس بچے کو دودھ پلائے۔"}, {"arabic": " لِیُنۡفِقۡ ذُوۡ سَعَۃٍ مِّنۡ سَعَتِہٖ ؕ وَ مَنۡ قُدِرَ عَلَیۡہِ رِزۡقُہٗ فَلۡیُنۡفِقۡ مِمَّاۤ اٰتٰٮہُ اللّٰہُ ؕ لَا یُکَلِّفُ اللّٰہُ نَفۡسًا اِلَّا مَاۤ اٰتٰٮہَا ؕ سَیَجۡعَلُ اللّٰہُ بَعۡدَ عُسۡرٍ یُّسۡرًا ٪﴿۸﴾", "english": " Let him who has abundance of means spend out of his abundance. And let him whose means of subsistence are straitened spend out of what Allah has given him. Allah burdens not any soul beyond that which He has given it. Allah will soon bring about ease after hardship.", "french": " Que celui qui a une abondance de biens dépense de son abondance. Et que celui dont les ressources sont restreintes, dépense selon ce qu’Allāh lui a donné. Allāh ne charge aucune âme au-delà de ce qu’Il lui a donné. Allāh apportera bientôt l’aisance après les difficultés.", "german": " Jener, der Fülle hat, soll aus seiner Fülle aufwenden; Und der, dessen Mittel beschränkt sind, soll aufwenden gemäß dem, was ihm Allah gegeben hat. Allah fordert von keiner Seele über das hinaus, was Er ihr gegeben hat. Allah wird nach Bedrängnis bald Erleichterung schaffen.", "spanish": " Que quien tenga medios abundantes emplee de su abundancia. Y aquel cuyos medios de subsistencia sean escasos, emplee de lo que Al-lah le haya entregado. Al-lah no carga a ningún alma más allá de lo que le ha proporcionado. Al-lah hará que pronto llegue el alivio tras la dureza.", "urdu": " چاہیے کہ مال دار مرد (دودھ پلانے والی عورت پر) اپنی طاقت کے مطابق خرچ کرے۔ اور جو مالدار نہیں ہے وہ اللہ کے دئے کے مطابق خرچ کرے اللہ کسی نفس کو ایسے احکام نہیں دیتا جو اس کی طاقت سے بڑھ کر ہوں بلکہ ایسے ہی احکام دیتا ہے جن کے پورا کرنے کی توفیق بھی ان کو بخشی ہو۔ چنانچہ اگر کوئی شخص خدا کے حکم پر عمل کرتے ہوئے دودھ پلانے والی عورت کی مزدوری صحیح طور پر دے گا تو اگر وہ تنگی کی حالت میں بھی ہے تو اللہ اس کے بعد اس کے لئے فراخی کی حالت پیدا کر دے گا۔"}, {"arabic": " وَ کَاَیِّنۡ مِّنۡ قَرۡیَۃٍ عَتَتۡ عَنۡ اَمۡرِ رَبِّہَا وَ رُسُلِہٖ فَحَاسَبۡنٰہَا حِسَابًا شَدِیۡدًا ۙ وَّ عَذَّبۡنٰہَا عَذَابًا نُّکۡرًا ﴿۹﴾", "english": " How many a city rebelled against the command of its Lord and His Messengers, and We called it to severe account, and punished it with dire punishment!", "french": " Que de villes se sont révoltées contre le commandement de leur Seigneur et de Ses Messagers, et Nous leur avons sévèrement demandé des comptes, et Nous les avons châtiées d’un châtiment très pénible !", "german": " Wie so manche Stadt widersetzte sich dem Befehl ihres Herrn und Seiner Gesandten, und Wir zogen sie streng zur Rechenschaft und straften sie mit harter Strafe!", "spanish": " ¡Cuántas ciudades se rebelaron contra el mandato de Su Señor y Sus Mensajeros, y Nosotros les pedimos cuentas estrictas y les castigamos con un castigo ejemplar!", "urdu": " اور بہت سی بستیاں ہیں جنہوں نے اپنے رب کے حکم کا اور رسولوں کا انکار کیا۔ اس پر ہم نے ان سے بڑی سختی سے حساب لیا اور ان پر بڑا عذاب نازل کیا۔"}, {"arabic": " فَذَاقَتۡ وَبَالَ اَمۡرِہَا وَ کَانَ عَاقِبَۃُ اَمۡرِہَا خُسۡرًا ﴿۱۰﴾", "english": " So it tasted the evil consequences of its conduct, and the end of its affair was ruin.", "french": " Elles ont donc goûté les mauvaises conséquences de leur conduite, et la fin de leur affaire a été la ruine.", "german": " So kostete sie die bösen Folgen ihres Betragens, und das Ende ihres Betragens war Untergang.", "spanish": " Así probaron las consecuencias perversas de su conducta, y el final de su asunto fue la perdición.", "urdu": " اور انہوں نے اپنے کیے کی سزا بھگت لی۔ اور ان کا انجام گھاٹا ہی نکلا۔"}, {"arabic": " اَعَدَّ اللّٰہُ لَہُمۡ عَذَابًا شَدِیۡدًا ۙ فَاتَّقُوا اللّٰہَ یٰۤاُولِی الۡاَلۡبَابِ ۬ۚۖۛ الَّذِیۡنَ اٰمَنُوۡا ؕ۟ۛ قَدۡ اَنۡزَلَ اللّٰہُ اِلَیۡکُمۡ ذِکۡرًا ﴿ۙ۱۱﴾", "english": " Allah has prepared for them a severe punishment; so fear Allah, O ye men of understanding, who have believed. Allah has indeed sent down to you a Reminder —", "french": " Allāh leur a préparé un châtiment rigoureux, craignez donc Allāh, ô vous hommes doués d’intelligence, qui avez cru. Allāh vous a en effet envoyé un Rappel –", "german": " Allah hat für sie eine strenge Strafe bereitet; so fürchtet Allah, o ihr Leute von Verstand, die ihr glaubt. Allah hat euch fürwahr eine Ermahnung herniedergesandt –", "spanish": " Al-lah les ha preparado un severo castigo; temed, pues, a Al-lah, ¡Oh! hombres de entendimiento que habéis creído. Al-lah os ha enviado en verdad un Recordatorio.", "urdu": " ایسے لوگوں کے لئے اللہ نے سخت عذاب مقرر کیا ہے۔ پس اے مومنوں میں سے عقل مندو! اللہ کا تقویٰ اختیار کرو۔ اللہ نے تمہارے لئے شرف کا سامان یعنی رسول اتارا ہے"}, {"arabic": " رَّسُوۡلًا یَّتۡلُوۡا عَلَیۡکُمۡ اٰیٰتِ اللّٰہِ مُبَیِّنٰتٍ لِّیُخۡرِجَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ مِنَ الظُّلُمٰتِ اِلَی النُّوۡرِ ؕ وَ مَنۡ یُّؤۡمِنۡۢ بِاللّٰہِ وَ یَعۡمَلۡ صَالِحًا یُّدۡخِلۡہُ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ؕ قَدۡ اَحۡسَنَ اللّٰہُ لَہٗ رِزۡقًا ﴿۱۲﴾", "english": " A Messenger, who recites unto you the clear Signs of Allah, that he may bring those who believe and do good deeds out of every kind of darkness into light. And whoso believes in Allah and does good deeds — He will make him enter Gardens, through which rivers flow, to abide therein for ever. Allah has indeed made excellent provision for him.", "french": " Un Messager, qui vous récite les Signes manifestes d’Allāh, afin de faire sortir ceux qui croient et font de bonnes œuvres, de toutes sortes de ténèbres et les amener vers la lumière, et quiconque croit en Allāh et fait de bonnes œuvres – Il le fera entrer dans des Jardins sous lesquels coulent des ruisseaux, pour y demeurer éternellement. Allāh a en vérité fait pour lui une excellente provision.", "german": " einen Gesandten, der euch die deutlichen Zeichen Allahs vorträgt, auf dass er jene, die glauben und gute Werke tun, aus den Finsternissen ans Licht führe. Und wer an Allah glaubt und recht handelt, den wird Er in Gärten führen, durch die Ströme fließen, darin zu weilen auf immer. Allah hat ihm fürwahr eine treffliche Versorgung gewährt.", "spanish": " Un Mensajero que os recita los Signos manifiestos de Al-lah, para sacar de toda clase de tinieblas a la luz a quienes crean y practiquen el bien; pues a quien crea en Al-lah y haga buenas obras, Él lo hará entrar en Jardines por los que corren ríos, para morar en ellos para siempre. En verdad, Al-lah le ha preparado una excelente provisión.", "urdu": " یعنی رسول اتارا ہے جو تم کو اللہ کی ایسی آیات سناتا ہے جو (ہر نیکی اور بدی کو) کھول دیتی ہیں جس کا نتیجہ یہ ہوتا ہے کہ مومن لوگ جو اپنے ایمان کے مطابق عمل کرتے ہیں‘ وہ اندھیروں سے نکل کر نور میں آجاتے ہیں اور جو بھی اللہ پر ایمان لائے‘ اور اس کے مطابق عمل کرے وہ اس کو ایسی جنتوں میں داخل کرے گا‘ جن کے نیچے نہریں بہتی ہونگی۔ وہ اس میں ہمیشہ رہتے چلے جائیں گے اللہ نے ایسے شخص کو بڑا پسندیدہ روزی عطا فرمائی ہے۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ خَلَقَ سَبۡعَ سَمٰوٰتٍ وَّ مِنَ الۡاَرۡضِ مِثۡلَہُنَّ ؕ یَتَنَزَّلُ الۡاَمۡرُ بَیۡنَہُنَّ لِتَعۡلَمُوۡۤا اَنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ۬ۙ وَّ اَنَّ اللّٰہَ قَدۡ اَحَاطَ بِکُلِّ شَیۡءٍ عِلۡمًا ﴿٪۱۳﴾", "english": " Allah is He Who created seven heavens, and of the earth the like thereof. The divine command comes down in their midst, that you may know that Allah has power over all things, and that Allah encompasses all things in His knowledge.", "french": " Allāh est Celui Qui a créé sept cieux, et en a fait autant pour la terre. Le commandement divin descend en abondance au milieu d’eux afin que vous sachiez qu’Allāh a le pouvoir de faire tout ce qu’Il veut, et qu’Allāh embrasse toutes choses dans Sa connaissance.", "german": " Allah ist es, Der sieben Himmel erschuf und von der Erde eine gleiche Zahl. Der (göttliche) Befehl steigt nieder in ihre Mitte, auf dass ihr erfahret, dass Allah alle Dinge zu tun vermag und dass Allah alle Dinge mit Wissen umfasst.", "spanish": " Al-lah es Quien creó siete cielos y otras tantas tierras. El mandamiento Divino desciende en mitad de ellos, para que sepáis que Al-lah tiene poder sobre todas las cosas y que Al-lah abarca todo en Su conocimiento.", "urdu": " اللہ وہی ہے جس نے سات آسمان پیدا کیے ہیں اور زمینیں بھی آسمانوں کے عدد کے مطابق (پیدا کی ہیں) ان (آسمانوں اور ان زمینوں) کے درمیان اس کا حکم نازل ہوتا رہتا ہے تا کہ تم جان لو کہ اللہ ہر ایک چیز پر قادر ہے۔ اور اسی طرح اللہ ہر چیز کا علم سے احاطہ کیے ہوئے ہے۔"}], "Surah": 65}