{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں۔)"}, {"arabic": " اَلۡحَمۡدُ لِلّٰہِ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ جَعَلَ الظُّلُمٰتِ وَ النُّوۡرَ ۬ؕ ثُمَّ الَّذِیۡنَ کَفَرُوۡا بِرَبِّہِمۡ یَعۡدِلُوۡنَ ﴿۲﴾", "english": " All praise belongs to Allah Who created the heavens and the earth and brought into being every kind of darkness and light; yet those who disbelieve set up equals to their Lord.", "french": " Toutes les louanges appartiennent à Allāh, Qui a créé les cieux et la terre et Qui a fait les ténèbres et la lumière. Pourtant, les mécréants élèvent des égaux à leur Seigneur.", "german": " Aller Preis gehört Allah, Der die Himmel und die Erde erschaffen und die Finsternisse und das Licht ins Sein gerufen hat; doch setzen jene, die da ungläubig sind, ihrem Herrn anderes gleich.", "spanish": " Toda alabanza corresponde a Al-lah, quien creó los cielos y la tierra y originó toda clase de tinieblas y luz; sin embargo, los incrédulos ponen a otros al mismo nivel que su Señor.", "urdu": " ہر (قسم کی) تعریف کا اللہ ہی مستحق ہے‘ جس نے آسمانوں اور زمین کو پیدا کیا ہے اور اندھیروں اور نور کو بھی بنایا ہے باوجود اس کے کافر اپنے رب کے شریک بناتے ہیں۔"}, {"arabic": " ہُوَ الَّذِیۡ خَلَقَکُمۡ مِّنۡ طِیۡنٍ ثُمَّ قَضٰۤی اَجَلًا ؕ وَ اَجَلٌ مُّسَمًّی عِنۡدَہٗ ثُمَّ اَنۡتُمۡ تَمۡتَرُوۡنَ ﴿۳﴾", "english": " He it is Who created you from clay, and then He decreed a term. And there is another term fixed with Him. Yet you doubt!", "french": " C’est Lui Qui vous a créé d’argile, et ensuite Il a décrété un terme. Et la connaissance d’ un autre terme fixé est avec Lui ; et cependant, vous doutez.", "german": " Er ist es, Der euch aus Lehm erschaffen, und dann bestimmte Er eine Frist. Und eine (weitere) Frist ist bei Ihm bekannt. Ihr aber zweifelt noch!", "spanish": " Quien os creó del barro y os fijó después un plazo. Y hay otro plazo fijado junto a Él. ¡Y a pesar de esto dudáis!", "urdu": " وہ خدا ہی ہے جس نے تم کو گیلی مٹی سے پیدا کیا ہے پھر (زمانئہ حیات کے لئے) ایک میعاد تجویز کی اور ایک اور میعاد بھی ہے جس کا علم صرف اسی کو ہے پھر بھی تم شبہ کرتے ہو۔"}, {"arabic": " وَ ہُوَ اللّٰہُ فِی السَّمٰوٰتِ وَ فِی الۡاَرۡضِ ؕ یَعۡلَمُ سِرَّکُمۡ وَ جَہۡرَکُمۡ وَ یَعۡلَمُ مَا تَکۡسِبُوۡنَ ﴿۴﴾", "english": " And He is Allah, the God , both in the heavens and in the earth. He knows your inside and your outside. And He knows what you earn.", "french": " C’est Allāh, le Dieu Unique, à la fois dans les cieux et sur la terre. Il sait ce que vous dissimulez et ce que vous révélez, et Il sait ce que vous acquérez.", "german": " Und Er ist Allah, (der Gott) in den Himmeln wie auf der Erde. Er kennt euer Verborgenes und euer Sichtbares, und Er weiß, was ihr verdient.", "spanish": " Pues Él es Al-lah, Dios, tanto en los cielos como en la tierra. Él conoce vuestros secretos así como lo que es aparente. Y sabe lo que ganáis.", "urdu": " اور آسمانوں اور زمین میں وہی خدا ہے جو تمہارے رازوں کو بھی جانتا ہے اور تمہاری کھلی باتوں کو بھی‘ اور جو کچھ تم کماتے ہو اس کو بھی جانتا ہے۔"}, {"arabic": " وَ مَا تَاۡتِیۡہِمۡ مِّنۡ اٰیَۃٍ مِّنۡ اٰیٰتِ رَبِّہِمۡ اِلَّا کَانُوۡا عَنۡہَا مُعۡرِضِیۡنَ ﴿۵﴾", "english": " And there comes not to them any Sign of the Signs of their Lord, but they turn away from it.", "french": " Et pas un Signe des Signes de leur Seigneur n’arrive à eux qu’ils ne s’en détournent.", "german": " Es kommt zu ihnen auch nicht ein Zeichen von den Zeichen ihres Herrn, ohne dass sie sich davon abwenden.", "spanish": " Y no les llega ninguno de los Signos de su Señor, sin que se aparten de Él.", "urdu": " اور ان لوگوں کے پاس ان کے رب کے نشانوں میں سے کبھی کوئی نشان نہیں آیا مگر (ان کا معاملہ یہ رہا ہے کہ) وہ اس سے اعراض ہی کرتے چلے آئے ہیں۔"}, {"arabic": " فَقَدۡ کَذَّبُوۡا بِالۡحَقِّ لَمَّا جَآءَہُمۡ ؕ فَسَوۡفَ یَاۡتِیۡہِمۡ اَنۡۢبٰٓؤُا مَا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿۶﴾", "english": " So they rejected the truth when it came to them; but soon shall come to them the tidings of that at which they mocked.", "french": " Ainsi, ils ont traité la vérité de mensonge quand elle leur est venue ; mais ils ne tarderont pas à recevoir des nouvelles de ce dont ils se sont moqués.", "german": " So haben sie die Wahrheit verworfen, als sie zu ihnen kam; bald aber soll ihnen Kunde werden von dem, was sie verspotteten.", "spanish": " Rechazaron pues la verdad cuando les llegó; pero pronto les llegará la nueva de aquello de lo que se burlaron.", "urdu": " پس کامل حق (یعنی قرآن) جب ان کے پاس آیا تو اس کا بھی انہوں نے انکار کردیا۔ اب اس کا نتیجہ یہ نکلے گا کہ جن باتوں کے متعلق وہ ہنسی کرتے تھے جلد ہی ان کے وقوعہ کی خبریں ان کو ملنے لگ جائیں گی۔"}, {"arabic": " اَلَمۡ یَرَوۡا کَمۡ اَہۡلَکۡنَا مِنۡ قَبۡلِہِمۡ مِّنۡ قَرۡنٍ مَّکَّنّٰہُمۡ فِی الۡاَرۡضِ مَا لَمۡ نُمَکِّنۡ لَّکُمۡ وَ اَرۡسَلۡنَا السَّمَآءَ عَلَیۡہِمۡ مِّدۡرَارًا ۪ وَّ جَعَلۡنَا الۡاَنۡہٰرَ تَجۡرِیۡ مِنۡ تَحۡتِہِمۡ فَاَہۡلَکۡنٰہُمۡ بِذُنُوۡبِہِمۡ وَ اَنۡشَاۡنَا مِنۡۢ بَعۡدِہِمۡ قَرۡنًا اٰخَرِیۡنَ ﴿۷﴾", "english": " See they not how many a generation We have destroyed before them? We had established them in the earth as We have established you not, and We sent the clouds over them, pouring down abundant rain; and We caused streams to flow beneath them; then did We destroy them because of their sins and raised up after them another generation.", "french": " Ne voient-ils pas combien de générations Nous avions détruites avant eux ? Nous les avions établies sur la terre comme Nous ne vous y avons pas établis ; et Nous avons envoyé des nuages versant sur elles d’abondantes pluies ; et Nous avons fait couler des ruisseaux sous leurs pieds ; ensuite Nous les avons détruites pour leurs péchés et avons suscité après elles d’autres générations.", "german": " Sehen sie denn nicht, wie so manches Geschlecht Wir schon vor ihnen vernichtet haben? Diese hatten Wir auf der Erde festgesetzt, wie Wir euch nicht festgesetzt haben; und über sie sandten Wir Wolken, reichlichen Regen ergießend; und unter ihnen ließen Wir Ströme fließen; dann aber tilgten Wir sie aus um ihrer Sünden willen und erweckten nach ihnen ein anderes Geschlecht.", "spanish": " ¿No ven acaso a cuantas épocas diferentes hemos destruido antes de ellos? Los establecimos en la tierra como no os hemos establecido a vosotros, y enviamos sobre ellos nubes que soltaron lluvias abundantes; e hicimos que a sus pies corrieran ríos; pero los destruimos por sus pecados e hicimos surgir tras ellos a otro pueblo.", "urdu": " کیا انہیں معلوم نہیں کہ ان سے پہلے کتنے ہی زمانوں (کے لوگوں) کو جنہیں ہم نے زمین میں اتنی طاقت بخشی تھی جتنی طاقت تمہیں (یعنی اس زمانہ کے لوگوں کو) نہیں بخشی‘ ہلاک کر دیا اور ہم نے ان پر بادلوں کو موسلا دھار بارش برساتے ہوئے بھیجا تھا اور ان سے ایسی نہریں چلائی تھیں جو ان کے قبضہ اور تصرف میں چلتی تھیں۔ پھر ہم نے ان کو ان کے گناہوں کی وجہ سے ہلاک کر دیا۔ اور ان کے بعد ایک اور نسل پیدا کر دی۔"}, {"arabic": " وَ لَوۡ نَزَّلۡنَا عَلَیۡکَ کِتٰبًا فِیۡ قِرۡطَاسٍ فَلَمَسُوۡہُ بِاَیۡدِیۡہِمۡ لَقَالَ الَّذِیۡنَ کَفَرُوۡۤا اِنۡ ہٰذَاۤ اِلَّا سِحۡرٌ مُّبِیۡنٌ ﴿۸﴾", "english": " And if We had sent down to thee a writing upon parchment and they had felt it with their hands, even then the disbelievers would have surely said, ‘This is nothing but manifest sorcery.’", "french": " Et si Nous avions fait descendre sur toi un écrit sur parchemin et s’ils l’avaient tâté de leurs mains, même alors les mécréants auraient certainement dit : « Ceci n’est qu’une magie manifeste. »", "german": " Wenn Wir dir auch eine Schrift hinabgesandt hätten auf Pergament, welche sie befühlt hätten mit ihren Händen, die Ungläubigen hätten selbst dann gesagt: \"Das ist nichts als offenkundige Zauberei.\"", "spanish": " Aunque te hubiésemos revelado un escrito en pergamino y ellos lo tocaran con las manos, los incrédulos habrían dicho ciertamente: “esto no es más que pura magia”.", "urdu": " اور اگر ہم تجھ پر ایک کاغذوں پر لکھی ہوئی کتاب نازل کرتے‘ جسے وہ اپنے ہاتھوں سے چھولیتے تو کافر پھر بھی کہتے‘ یہ تو ایک کھلا کھلا فریب ہے۔"}, {"arabic": " وَ قَالُوۡا لَوۡ لَاۤ اُنۡزِلَ عَلَیۡہِ مَلَکٌ ؕ وَ لَوۡ اَنۡزَلۡنَا مَلَکًا لَّقُضِیَ الۡاَمۡرُ ثُمَّ لَا یُنۡظَرُوۡنَ ﴿۹﴾", "english": " And they say, ‘Why has not an angel been sent down to him?’ But if We had sent down an angel, the matter would have been settled, and then they would not have been granted a respite.", "french": " Et ils disent : « Pourquoi un ange n’a-t-il pas été envoyé auprès de lui ? » Mais si Nous avions envoyé un ange, certainement l’affaire aurait été réglée et alors aucun répit ne leur aurait été accordé.", "german": " Sie sagen: \"Warum ist kein Engel zu ihm herabgesandt worden?\" Hätten Wir aber einen Engel hinabgesandt, die Sache wäre entschieden gewesen; dann hätten sie keinen Aufschub erlangt.", "spanish": " Y dicen: “¿por qué no se le ha enviado un ángel?”. Pero si hubiésemos enviado un ángel, la cuestión habría quedado zanjada y no se les habría concedido un respiro.", "urdu": " اور (مخالف) کہتے ہیں‘ اس پر کوئی فرشتہ کیوں نہیں اتارا گیا۔ اور اگر ہم کوئی فرشتہ اتارتے تو فیصلہ ہی ہو جاتا‘ پھر ان کو ڈھیل نہ دی جاتی۔"}, {"arabic": " وَ لَوۡ جَعَلۡنٰہُ مَلَکًا لَّجَعَلۡنٰہُ رَجُلًا وَّ لَلَبَسۡنَا عَلَیۡہِمۡ مَّا یَلۡبِسُوۡنَ ﴿۱۰﴾", "english": " And if We had appointed as Messenger an angel, We would have made him appear as a man; and thus We would have made confused to them what they are themselves confusing.", "french": " Et si Nous l’avions fait - ce Messager - un ange, Nous l’aurions fait apparaître sous forme humaine ; et ainsi Nous les aurions mis dans la même confusion dans laquelle ils sont.", "german": " Und wenn Wir ihn (aus) einem Engel geschaffen hätten, hätten Wir ihn doch als Menschen geschaffen, und so hätten Wir ihnen das noch verwirrter gemacht, was sie selbst schon verwirren.", "spanish": " Y si hubiésemos nombrado como Mensajero a un ángel, lo habríamos hecho aparecer como un hombre; y por tanto abríamos hecho confuso para ellos lo que ya están confundiendo ellos mismos .", "urdu": " اور (یہ بھی یاد رکھنا چاہیئے کہ) اگر ہم اس (پیامبر) کو فرشتوں میں سے تجویز کرتے تب بھی ہم اسے مرد کی شکل ہی دیتے اور ان کے اوپر پھر بھی وہ بات مشتبہ کر دیتے جسے اب وہ مشتبہ سمجھ رہے ہیں۔"}, {"arabic": " وَ لَقَدِ اسۡتُہۡزِیٴَ بِرُسُلٍ مِّنۡ قَبۡلِکَ فَحَاقَ بِالَّذِیۡنَ سَخِرُوۡا مِنۡہُمۡ مَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿٪۱۱﴾", "english": " And surely have the Messengers been mocked at before thee, but that which they mocked at encompassed those of them who scoffed.", "french": " Et en vérité, des Messagers ont été raillés avant toi, mais les moqueurs d’entre eux ont été cernés par leur raillerie", "german": " Auch die Gesandten vor dir sind verspottet worden, doch das, worüber sie spotteten, umringte die Spötter unter ihnen.", "spanish": " Pues en verdad se han burlado de otros Mensajeros antes de ti, pero aquello de lo que se burlaron, atrapó a quienes se mofaron.", "urdu": " اور تجھ سے پہلے جو رسول گزرے ہیں ان سے بھی ہنسی کی گئی تھی نتیجہ یہ ہوا کہ ان میں سے جنہوں نے ہنسی کی تھی انہیں اسی عذاب نے آگھیرا جس سے وہ ہنسی کر رہے تھے۔"}, {"arabic": " قُلۡ سِیۡرُوۡا فِی الۡاَرۡضِ ثُمَّ انۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الۡمُکَذِّبِیۡنَ ﴿۱۲﴾", "english": " Say, ‘Go about in the earth, and see what was the end of those who treated the Prophets as liars.’", "french": " Dis : « Parcourez la terre et voyez comment a été la fin de ceux qui ont traité les Prophètes de menteurs. »", "german": " Sprich: \"Wandert über die Erde und seht, wie das Ende der Verleugner war.\"", "spanish": " Diles: “Recorred la tierra y ved cuál fue la suerte de los que trataron de mentirosos a los Profetas” .", "urdu": " تو انہیں کہہ دے (ذرا) زمین میں پھرو۔ پھر دیکھو جھٹلانے والوں کا کیا انجام ہوا کرتا ہے۔"}, {"arabic": " قُلۡ لِّمَنۡ مَّا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ قُلۡ لِّلّٰہِ ؕ کَتَبَ عَلٰی نَفۡسِہِ الرَّحۡمَۃَ ؕ لَیَجۡمَعَنَّکُمۡ اِلٰی یَوۡمِ الۡقِیٰمَۃِ لَا رَیۡبَ فِیۡہِ ؕ اَلَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ فَہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۱۳﴾", "english": " Say, ‘To whom belongs what is in the heavens and the earth?’ Say, ‘To Allah.’ He has taken upon Himself to show mercy. He will certainly continue to assemble you till the Day of Resurrection. There is no doubt in it. Those who ruin their souls will not believe.", "french": " Dis : « A qui appartient ce qui est dans les cieux et sur la terre ? » Dis : « A Allāh. » Il S’est imposé à Lui-Même de faire miséricorde. Il continuera assurément à vous rassembler jusqu’au Jour de la Résurrection. Il n’y a pas de doute quant à cela. Ceux qui ont causé leur propre perte ne croiront pas.", "german": " Sprich: \"Wessen ist, was in den Himmeln und was auf Erden ist?\" Sprich: \"Allahs.\" Er hat Sich Selbst Barmherzigkeit vorgeschrieben. Er wird euch gewisslich weiter versammeln bis zum Tage der Auferstehung. Daran ist kein Zweifel. Jene aber, die ihre Seelen verderben, die wollen nicht glauben.", "spanish": " Diles: “¿A quien pertenece cuanto existe en los cielos y en la ierra?”. Diles: “a Al-lah”. Él se impuso a Sí mismo el mostrar misericordia. Él ciertamente continuará reuniéndoos hasta el Día de la Resurrección. Sobre esto no hay duda alguna. Pero los que se han arruinado a si mismos no creerán.", "urdu": " (ان سے) پوچھ کہ آسمانوں اور زمین میں جو کچھ ہے وہ کس کا ہے؟ (اس کا جواب وہ کیا دیں گے اس لئے تو ہی ان کو) کہہ دے‘ اللہ کا۔ اس نے اپنے نفس پر رحمت فرض کر چھوڑی ہے وہ تم کو قیامت کے دن تک جمع کرتا چلا جائے گا۔ اس (امر) میں کوئی شک نہیں کہ وہ لوگ جنہوں نے اپنی جانوں کو گھاٹے میں ڈال دیا وہ (اس بداعمالی کہ وجہ سے) ایمان نہیں لائیں گے۔"}, {"arabic": " وَ لَہٗ مَا سَکَنَ فِی الَّیۡلِ وَ النَّہَارِ ؕ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۱۴﴾", "english": " To Him belongs whatever dwells in the night and the day. And He is the All-Hearing, the All-Knowing.", "french": " A Lui appartient ce qui demeure dans la nuit et dans le jour. Il est Celui Qui entend tout, Qui sait tout.", "german": " Sein ist, was da wohnt in der Nacht und im Tage. Und Er ist der Allhörende, der Allwissende.", "spanish": " A Él pertenece cuanto mora en el día y la noche. Pues Él es quien todo lo oye, el Omnisciente.", "urdu": " اور جو کچھ رات (کی تاریکی) اور دن (کی روشنی) میں موجود ہے وہ سب اس (خدا) کا ہے اور وہ بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " قُلۡ اَغَیۡرَ اللّٰہِ اَتَّخِذُ وَلِیًّا فَاطِرِ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ ہُوَ یُطۡعِمُ وَ لَا یُطۡعَمُ ؕ قُلۡ اِنِّیۡۤ اُمِرۡتُ اَنۡ اَکُوۡنَ اَوَّلَ مَنۡ اَسۡلَمَ وَ لَا تَکُوۡنَنَّ مِنَ الۡمُشۡرِکِیۡنَ ﴿۱۵﴾", "english": " Say, ‘Shall I take any protector other than Allah, the Maker of the heavens and the earth, Who feeds and is not fed?’ Say, ‘I have been commanded to be the first of those who submit.’ And be thou not of those who associate partners with God.", "french": " Dis : « Dois-je prendre un Protecteur autre qu’Allāh, le Créateur des cieux et de la terre, Qui nourrit sans être nourri ? » Dis : « En vérité, j’ai reçu le commandement d’être le premier de ceux qui se soumettent. » Et ne sois pas du nombre des associateurs.", "german": " Sprich: \"Sollte ich einen anderen zum Beschützer nehmen als Allah, den Schöpfer der Himmel und der Erde, Der Nahrung gibt und Selbst keine Nahrung nimmt?\" Sprich: \"Mir ward geboten, dass ich der erste sei, der sich ergibt.\" Und sei nicht der Götzendiener einer.", "spanish": " Diles: “¿Tomaré protector alguno distinto de Al-lah, Creador de los cielos y la tierra, que alimenta y no es alimentado?”. Diles: “se me ha ordenado ser el primero que se someta”. Y no seas de los que asocian partícipes con Dios .", "urdu": " تو کہہ کیا میں اللہ کے سوا جو آسمانوں اور زمین کا پیدا کرنے والا ہے کوئی اور دوست بناٶں حالانکہ وہ (سب انسانوں کو) کھلاتا ہے اور (کسی کی طرف سے) اُسے رزق نہیں دیا جاتا۔ کہہ دے مجھے حکم دیا گیا ہے کہ میں سب سے بڑا فرمانبردار بنوں اور یہ کہ (اے رسول) تو مشرکوں میں سے مت بنیو۔"}, {"arabic": " قُلۡ اِنِّیۡۤ اَخَافُ اِنۡ عَصَیۡتُ رَبِّیۡ عَذَابَ یَوۡمٍ عَظِیۡمٍ ﴿۱۶﴾", "english": " Say, ‘Of a truth, I fear, if I disobey my Lord, the punishment of an awful day.’", "french": " Dis : « En vérité, je crains, si je désobéissais à mon Seigneur, la punition d’un Jour Énorme. »", "german": " Sprich: \"Ich fürchte die Strafe eines furchtbaren Tages, sollte ich meinem Herrn ungehorsam sein.\"", "spanish": " Di: “Si desobedezco a mi Señor, temo el castigo de un día enorme”.", "urdu": " تو کہہ دے کہ اگر میں اپنے رب کی نافرمانی کروں تو میں ایک بڑے دن کے عذاب سے ڈرتا ہوں۔"}, {"arabic": " مَنۡ یُّصۡرَفۡ عَنۡہُ یَوۡمَئِذٍ فَقَدۡ رَحِمَہٗ ؕ وَ ذٰلِکَ الۡفَوۡزُ الۡمُبِیۡنُ ﴿۱۷﴾", "english": " He from whom it is averted on that day, God indeed has had mercy on him. And that indeed is a manifest triumph.", "french": " Celui qui en est épargné ce jour-là, en vérité, Allāh lui a fait miséricorde. Et cela est le triomphe manifeste.", "german": " Wer an jenem Tag davor bewahrt bleibt, dem hat Er Barmherzigkeit erwiesen. Das ist eine offenbare Glückseligkeit.", "spanish": " Quien se libre ese día, es porque Dios verdaderamente ha tenido misericordia de él. Ése será un triunfo manifiesto.", "urdu": " جس پر سے وہ (عذاب) ٹلایا گیا تو (سمجھ لو کہ) اس دن اس پر خدا نے رحم کر دیا۔ اور یہ بہت بڑی کامیابی ہے۔"}, {"arabic": " وَ اِنۡ یَّمۡسَسۡکَ اللّٰہُ بِضُرٍّ فَلَا کَاشِفَ لَہٗۤ اِلَّا ہُوَ ؕ وَ اِنۡ یَّمۡسَسۡکَ بِخَیۡرٍ فَہُوَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۱۸﴾", "english": " And if Allah touch thee with affliction, there is none that can remove it but He; and if He touch thee with happiness, then He has power to do all that He wills.", "french": " Et si Allāh te cause une affliction, nul ne peut l’enlever excepté Lui ; et s’Il t’accorde le bon heur , alors il est en Son pouvoir de faire tout ce qu’Il veut.", "german": " Wenn Allah dich mit Unglück trifft, so ist keiner, es hinwegzunehmen, als Er; und wenn Er dich mit Glück berührt, so hat Er die Macht, alles zu tun, was Er will.", "spanish": " Si Al-lah te toca con un mal, nadie podrá librarte sino Él; pero si te bendice con la buena suerte es porque Él tiene poder para hacer todo lo que desea.", "urdu": " اور اگر اللہ تجھے کوئی ضرر پہنچائے تو اس کے سوا اس کو کوئی دور نہیں کر سکتا اور اگر وہ تجھے کوئی بھلائی پہنچائے تو وہ ہر امر پر قادر ہے۔"}, {"arabic": " وَ ہُوَ الۡقَاہِرُ فَوۡقَ عِبَادِہٖ ؕ وَ ہُوَ الۡحَکِیۡمُ الۡخَبِیۡرُ ﴿۱۹﴾", "english": " And He is Supreme over His servants; and He is the Wise, the All-Aware.", "french": " Et de par Sa gloire et Sa majesté, Il est le Dominant sur Ses serviteurs – l’humanité ; et c’est Lui le Sage, le Très-Conscient.", "german": " Er ist der Höchste über Seine Diener; und Er ist der Allweise, der Allwissende.", "spanish": " Pues Él es absolutamente Poderoso sobre Sus criaturas: la humanidad; y es el Sabio, el Consciente de todo.", "urdu": " اور وہ اپنے بندوں پر غالب ہے اور وہ بڑی حکمتوں والا ہے (اور) سب حالات سے باخبر ہے۔"}, {"arabic": " قُلۡ اَیُّ شَیۡءٍ اَکۡبَرُ شَہَادَۃً ؕ قُلِ اللّٰہُ ۟ۙ شَہِیۡدٌۢ بَیۡنِیۡ وَ بَیۡنَکُمۡ ۟ وَ اُوۡحِیَ اِلَیَّ ہٰذَا الۡقُرۡاٰنُ لِاُنۡذِرَکُمۡ بِہٖ وَ مَنۡۢ بَلَغَ ؕ اَئِنَّکُمۡ لَتَشۡہَدُوۡنَ اَنَّ مَعَ اللّٰہِ اٰلِہَۃً اُخۡرٰی ؕ قُلۡ لَّاۤ اَشۡہَدُ ۚ قُلۡ اِنَّمَا ہُوَ اِلٰہٌ وَّاحِدٌ وَّ اِنَّنِیۡ بَرِیۡٓءٌ مِّمَّا تُشۡرِکُوۡنَ ﴿ۘ۲۰﴾", "english": " Say, ‘What thing is most weighty as a witness?’ Say, ‘Allah is a Witness between me and you. And this Qur’an has been revealed to me so that with it I may warn you and whomsoever it reaches. What! do you really bear witness that there are other gods beside Allah?’ Say, ‘I bear not witness thereto .’ Say, ‘He is the One God, and certainly I am far removed from that which you associate with Him .’", "french": " Dis : « Qu’y a-t-il de plus valable comme témoignage ? » Dis : « Allāh est Témoin entre moi et vous. Et ce Coran m’a été révélé afin que, par ce moyen, je vous avertisse et tous ceux qu’il atteindra. Comment ! Portez-vous témoignage réellement qu’il existe d’autres dieux à part Allāh ? » Dis : « Je n' y porte pas témoignage ». Dis : « Lui-Seul est une Divinité Unique, et je suis totalement déchargé de ce que vous Lui associez. »", "german": " Sprich: \"Was ist am gewichtigsten als ein Zeugnis?\" Sprich: \"Allah ist Zeuge zwischen mir und euch. Und dieser Qur-ân ist mir offenbart worden, auf dass ich euch warne damit und jeden, den er erreicht. Wolltet ihr wirklich bezeugen, dass es neben Allah andere Götter gibt?\" Sprich: \"Ich bezeuge es nicht.\" Sprich: \"Er ist der Einige Gott, und ich bin wahrlich fern von dem, was ihm anbetet.\"", "spanish": " Pregúntales: “¿Qué tiene más peso como testimonio?” Diles: “Al-lah es Testigo entre vosotros y yo. Pues este Corán me ha sido revelado para que con él pueda advertiros a vosotros y a quienes alcance. ¡Cómo! ¿Pretendéis testimoniar que hay otros dioses además de Al-lah?”. Di: “No doy testimonio de eso” y añade: “Él es el Dios Único, y me absuelvo totalmente de lo que asociáis a El”.", "urdu": " تو کہہ سب سے زیادہ (سچی) گواہی دینے والی کونسی ہستی ہے۔ پھر (خود ہی جواب میں) کہہ دے کہ اللہ۔ وہ تمہارے اور میرے درمیان گواہ ہے۔ اور میری طرف یہ قرآن وحی کیا گیا ہے تا کہ میں تمہیں اس کے ذریعہ سے (آنے والے عذاب سے) ہوشیار کروں اور ان (سب) کو بھی جن تک یہ پہنچے۔ کیا تم یہ گواہی دیتے ہو کہ اللہ کے سوا کوئی اور معبود بھی ہیں (اورپھر اپنی طرف سے) کہدے کہ (تم ایسی جھوٹی گواہیاں دیتے پھرو) میں تو یہ گواہی نہیں دیتا (پھر ان سے) کہدے کہ وہ (خدا) تو اپنی ذات میں صرف اکیلا خدا ہے اور میں تو ان چیزوں سے جن کو تم خدا کا شریک بناتے ہو بیزار ہوں۔"}, {"arabic": " اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَعۡرِفُوۡنَہٗ کَمَا یَعۡرِفُوۡنَ اَبۡنَآءَہُمۡ ۘ اَلَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ فَہُمۡ لَا یُؤۡمِنُوۡنَ ﴿٪۲۱﴾", "english": " Those to whom We gave the Book recognize him as they recognize their sons. But those who ruin their souls will not believe.", "french": " Ceux à qui a été donné le Livre le reconnaissent tout comme ils reconnaissent leurs propres fils. Mais ceux qui ont causé leur propre perte ne croiront pas.", "german": " Sie, denen Wir das Buch gaben, erkennen es, wie sie ihre Söhne erkennen. Jene aber, die ihre Seelen verderben, die wollen nicht glauben.", "spanish": " Aquellos a quienes dimos el Libro lo reconocen como reconocen a sus hijos. Pero quienes arruinan sus almas no creerán.", "urdu": " وہ لوگ جنہیں ہم نے کتاب دی ہے وہ اس (سچائی) کو (اسی طرح) پہچانتے ہیں جس طرح وہ اپنے بیٹوں کو پہچانتے ہیں (لیکن) جو لوگ گھاٹے میں پڑگئے اور اپنی جانوں کو (بھی) گھاٹے میں ڈال دیا وہ ایمان نہیں لاتے۔"}, {"arabic": " وَ مَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا اَوۡ کَذَّبَ بِاٰیٰتِہٖ ؕ اِنَّہٗ لَا یُفۡلِحُ الظّٰلِمُوۡنَ ﴿۲۲﴾", "english": " And who is more unjust than he who forges a lie against Allah or gives the lie to His Signs? Surely, the unjust shall not prosper.", "french": " Et qui est plus injuste que celui qui invente un mensonge contre Allāh, ou qui traite Ses Signes de mensonges ? Sûrement, les injustes ne prospéreront pas.", "german": " Und wer ist ungerechter als der, der eine Lüge ersinnt wider Allah oder Seine Zeichen der Lüge zeiht? Wahrlich, die Ungerechten sollen nie Erfolg haben.", "spanish": " Pues ¿hay alguien más injusto que quien inventa una mentira contra Al-lah o tacha de mentiras sus Signos? En verdad, los impíos no prosperarán.", "urdu": " اور اس سے زیادہ ظالم کون ہو سکتا ہے جو اللہ پر جھوٹ باندھتا ہے یا اس کے نشانات کو جھٹلاتا ہے۔ سچی بات یہ ہے کہ ظالم کبھی کامیاب نہیں ہوتے۔"}, {"arabic": " وَ یَوۡمَ نَحۡشُرُہُمۡ جَمِیۡعًا ثُمَّ نَقُوۡلُ لِلَّذِیۡنَ اَشۡرَکُوۡۤا اَیۡنَ شُرَکَآؤُکُمُ الَّذِیۡنَ کُنۡتُمۡ تَزۡعُمُوۡنَ ﴿۲۳﴾", "english": " And think of the day when We shall gather them all together; then shall We say to those who associated partners with God , ‘Where are the partners you spoke of, those whom you used to assert?’", "french": " Et pensez au Jour où Nous les rassemblerons tous ; c’est alors que Nous dirons à ceux qui ont donné des associés à Allāh : « Où sont donc vos associés que vous prétendiez ? »", "german": " Am Tage, da Wir sie alle versammeln werden, werden Wir zu denen, die Götter anbeteten, sprechen: \"Wo sind nun eure Götter, die ihr wähntet?\"", "spanish": " Y acuérdate del día en el que los reuniremos a todos; entonces diremos a quienes asocian otros partícipes a Dios: “¿Dónde están esos otros partícipes de quienes hablabais, aquellos en los que creíais?”.", "urdu": " اور جس دن ہم ان سب کو اکٹھا کریں گے پھر جنہوں نے ہمارے شریک قرار دئیے ہیں ان سے کہیں گے کہ تمہارے (بنائے ہوئے) وہ شریک جن کے متعلق تم دعویٰ کیا کرتے تھے (کہ وہ اللہ کے شریک ہیں) کہاں ہیں۔"}, {"arabic": " ثُمَّ لَمۡ تَکُنۡ فِتۡنَتُہُمۡ اِلَّاۤ اَنۡ قَالُوۡا وَ اللّٰہِ رَبِّنَا مَا کُنَّا مُشۡرِکِیۡنَ ﴿۲۴﴾", "english": " Then the end of their mischief will be naught save that they shall say, ‘By Allah, our Lord, we were not idolaters.’", "french": " Alors, ils n’auront pas d’excuses, sauf qu’ils diront : « Par Allāh, notre Seigneur, nous n’étions pas des associateurs. »", "german": " Dann werden sie keine andere Ausrede haben als dass sie sagen werden: \"Bei Allah, unserem Herrn, wir waren keine Götzendiener.\"", "spanish": " Entonces el fin de su maldad será la nada, salvo que dirán: “ Por Al-lah, Señor Nuestro, no éramos idólatras”.", "urdu": " پھر اس کے جواب میں وہ صرف یہ کہیں گے کہ اللہ کی قسم جو ہمارا (سچا) رب ہے ہم (تو) مشرک تھے (ہی) نہیں۔"}, {"arabic": " اُنۡظُرۡ کَیۡفَ کَذَبُوۡا عَلٰۤی اَنۡفُسِہِمۡ وَ ضَلَّ عَنۡہُمۡ مَّا کَانُوۡا یَفۡتَرُوۡنَ ﴿۲۵﴾", "english": " See how they lie against themselves. And that which they fabricated has failed them.", "french": " Voyez comment ils mentiront contre eux-mêmes ; et ce qu’ils ont fabriqué ne leur a été d’aucun recours.", "german": " Schau, wie sie wider sich selber lügen und das, was sie sich ersannen, sie im Stich lässt.", "spanish": " Mira cómo mienten contra sí mismos. Y lo que inventaron no les sirvió de nada.", "urdu": " دیکھ (اس موقعہ پر) وہ کس طرح اپنی جانوں کے متعلق جھوٹ بولیں گے اور جو (کچھ) وہ اس سے پہلے افترا کرتے تھے (سب) انہیں بھول جائے گا۔"}, {"arabic": " وَ مِنۡہُمۡ مَّنۡ یَّسۡتَمِعُ اِلَیۡکَ ۚ وَ جَعَلۡنَا عَلٰی قُلُوۡبِہِمۡ اَکِنَّۃً اَنۡ یَّفۡقَہُوۡہُ وَ فِیۡۤ اٰذَانِہِمۡ وَقۡرًا ؕ وَ اِنۡ یَّرَوۡا کُلَّ اٰیَۃٍ لَّا یُؤۡمِنُوۡا بِہَا ؕ حَتّٰۤی اِذَا جَآءُوۡکَ یُجَادِلُوۡنَکَ یَقُوۡلُ الَّذِیۡنَ کَفَرُوۡۤا اِنۡ ہٰذَاۤ اِلَّاۤ اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿۲۶﴾", "english": " And among them are some who give ear to thee; but We have put veils on their hearts, that they should not understand, and deafness in their ears. And even if they see every Sign, they would not believe therein, so much so, that when they come to thee, disputing with thee, those who disbelieve say, ‘This is nothing but fables of the ancients.’", "french": " Et certains d’entre eux apparemment te prêtent une oreille attentive ; alors que Nous avons mis des voiles sur leurs cœurs afin qu’ils ne comprennent pas, et une lourdeur dans leurs oreilles. Et même s’ils voyaient tous les Signes, ils n’y croiraient pas, à tel point ils ont du toupet que lorsqu’ils viennent à toi, ils disputent avec toi. Les mécréants disent : « Ce ne sont que des fables des anciens. »", "german": " Und unter ihnen sind manche, die dir Gehör schenken, doch Wir haben auf ihre Herzen Hüllen gelegt, dass sie nicht begreifen, und in ihre Ohren Taubheit. Selbst wenn sie jedes Zeichen sehen, sie würden doch nicht daran glauben, so dass sie mit dir streiten, wenn sie zu dir kommen. Die Ungläubigen erklären: \"Das sind bloß Fabeln der Alten.\"", "spanish": " Y hay entre ellos quienes te escuchan; pero hemos puesto velos sobre sus corazones para que no entiendan y hemos hecho sordos sus oídos. Y aunque vean todos los Signos no creerán en ellos, hasta el punto de que, cuando vienen a ti, discutiendo contigo, los incrédulos dicen: “no son más que fábulas de los antiguos”.", "urdu": " اور ان میں سے بعض (لوگ) ایسے ہیں جو تیری (باتوں کی) طرف کان رکھتے ہیں حالانکہ ہم نے ان کے دلوں پر پردے ڈال دئیے ہیں تا کہ وہ اسے (نہ) سمجھیں اور ان کے کانوں میں بہراپن (پیدا کردیا) ہے اور گو وہ ہر ایک (قسم کا) نشان دیکھ لیں وہ اس پر ایمان نہیں لائیں گے‘ (ان کی حالت) یہاں تک (پہنچی ہوئی ہے) کہ جب وہ تیرے پاس آتے ہیں تو تجھ سے جھگڑتے ہیں۔ کافر کہتے ہیں یہ (قرآن) صرف پہلوں کی کہانیاں ہیں۔"}, {"arabic": " وَ ہُمۡ یَنۡہَوۡنَ عَنۡہُ وَ یَنۡـَٔوۡنَ عَنۡہُ ۚ وَ اِنۡ یُّہۡلِکُوۡنَ اِلَّاۤ اَنۡفُسَہُمۡ وَ مَا یَشۡعُرُوۡنَ ﴿۲۷﴾", "english": " And they forbid others to believe it and themselves too they keep away from it. And they ruin none but their own selves; only they perceive not.", "french": " Et ils empêchent les gens d' y croire , et eux aussi ils s’en écartent. Et ils ne ruinent que leur propre âme ; seulement, ils ne s’ en aperçoivent pas.", "german": " Und sie hindern daran und halten sich selbst davon fern. Aber sich selbst stürzen sie ins Verderben; allein sie begreifen es nicht.", "spanish": " Prohíben a otros creer en ello y ellos mismos también se apartan. Mas no hacen sino perderse; aunque no se dan cuenta.", "urdu": " اور وہ اس سے (اوروں کو بھی) روکتے ہیں اور (خود بھی) اس سے دور رہتے ہیں لیکن وہ اپنے آپ کے سوا کسی کو ہلاک نہیں کرتے‘ مگر وہ سمجھتے نہیں۔"}, {"arabic": " وَ لَوۡ تَرٰۤی اِذۡ وُقِفُوۡا عَلَی النَّارِ فَقَالُوۡا یٰلَیۡتَنَا نُرَدُّ وَ لَا نُکَذِّبَ بِاٰیٰتِ رَبِّنَا وَ نَکُوۡنَ مِنَ الۡمُؤۡمِنِیۡنَ ﴿۲۸﴾", "english": " And if thou couldst only see when they are made to stand before the Fire! They will say, ‘Oh, would that we might be sent back! And then we would not treat the Signs of our Lord as lies, and we would be of the believers.’", "french": " Et si tu pouvais les voir quand ils seront contraints de s’arrêter devant le Feu ! Ils diront : « Si seulement nous pouvions être renvoyés ! Et alors nous ne traiterions pas de mensonges les Signes de notre Seigneur, et nous serions au nombre des croyants. »", "german": " Und könntest du nur sehen, wie sie vor das Feuer gestellt werden! Dann werden sie sprechen: \"Ach, dass wir doch zurückgebracht würden! Wir würden dann nicht die Zeichen unseres Herrn als Lüge behandeln, und wir würden zu den Gläubigen zählen.\"", "spanish": " ¡Si al menos pudieras ver cuando sean colocados ante el Fuego! Dirán: “¡Oh, ojalá pudiéramos regresar! Entonces no trataríamos de mentiras los Signos de Nuestro Señor y nos contaríamos entre los creyentes”.", "urdu": " اور اگر تو انہیں (اس وقت) دیکھے جب انہیں دوزخ کے سامنے کھڑا کیا جائے گا جب (وہ) کہیں گے (کہ) اے کاش ہمیں’’ ایمان کی حالت میں ‘‘ واپس لوٹا دیا جائے اور ہم آئندہ کبھی اپنے رب کے نشانوں کو نہیں جھٹلائیں گے (تو تجھے ان کی تکذیب کی حقیقت معلوم ہو جائے۔)"}, {"arabic": " بَلۡ بَدَا لَہُمۡ مَّا کَانُوۡا یُخۡفُوۡنَ مِنۡ قَبۡلُ ؕ وَ لَوۡ رُدُّوۡا لَعَادُوۡا لِمَا نُہُوۡا عَنۡہُ وَ اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿۲۹﴾", "english": " Nay, that which they used to conceal before has now become clear to them. And if they were sent back, they would surely return to that which they were forbidden. And they are certainly liars.", "french": " Mais non, ce qu’ils dissimulaient auparavant est maintenant clair pour eux. Et s’ils étaient renvoyés sur la terre , ils retourneraient assurément à ce qui leur était interdit. Et certainement, ce sont des menteurs.", "german": " Nein, das, was sie ehemals zu verhehlen pflegten, ist ihnen nun klar geworden. Doch würden sie auch zurückgebracht, ganz gewiss würden sie bald zu dem ihnen Verbotenen zurückkehren. Und sicherlich sind sie Lügner.", "spanish": " No, lo que antes solían ocultar se les ha hecho evidente ahora . Y si fuesen devueltos, seguramente volverían a lo que les fue prohibido. Pues son ciertamente embusteros.", "urdu": " حقیقت یہ ہے کہ جو (کچھ) وہ (اس سے پہلے) چھپایا کرتے تھے وہ ان پر خوب منکشف ہو گیا اور اگر انہیں (واپس) لوٹایا جاتا تو یقیناً وہ پھر اسی بات کی تکرار کرتے جس سے انہیں روکا جاتا تھا اور وہ یقیناً (اپنے اس دعویٰ میں) جھوٹے ہیں۔"}, {"arabic": " وَ قَالُوۡۤا اِنۡ ہِیَ اِلَّا حَیَاتُنَا الدُّنۡیَا وَ مَا نَحۡنُ بِمَبۡعُوۡثِیۡنَ ﴿۳۰﴾", "english": " And they say, ‘There is nothing except this our present life, and we shall not be raised again.’", "french": " Et ils disent : « Il n’existe rien en dehors de notre vie d’ici-bas ; et nous ne serons pas ressuscités. »", "german": " Sie sagen: \"Es gibt kein anderes als unser irdisches Leben, und wir werden nicht wiedererweckt werden.\"", "spanish": " Dicen: “No existe nada excepto nuestra vida presente, y no seremos resucitados”.", "urdu": " اور وہ کہتے ہیں کہ ہماری (اس) ورلی زندگی کے سوا کوئی (اور زندگی) نہیںہے اور نہ ہمیں اٹھایا جائے گا۔"}, {"arabic": " وَ لَوۡ تَرٰۤی اِذۡ وُقِفُوۡا عَلٰی رَبِّہِمۡ ؕ قَالَ اَلَیۡسَ ہٰذَا بِالۡحَقِّ ؕ قَالُوۡا بَلٰی وَ رَبِّنَا ؕ قَالَ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ تَکۡفُرُوۡنَ ﴿٪۳۱﴾", "english": " And if thou couldst only see when they are made to stand before their Lord! He will say, ‘Is not this second life the truth?’ They will say, ‘Yea, by our Lord.’ He will say, ‘Then taste the punishment because you disbelieved.’", "french": " Et si seulement tu pouvais les voir quand ils seront obligés de comparaître devant leur Seigneur ! Il leur dira : « Cette seconde vie n’est-elle donc pas la vérité ? » Ils répondront : « Si, par notre Seigneur ! » Il dira : « Goûtez donc le châtiment pour votre mécréance. »", "german": " Aber könntest du nur sehen, wenn sie vor ihren Herrn gestellt werden! Er wird sprechen: \"Ist nicht dies die Wahrheit?\" Sie werden antworten: \"Ja, bei unserem Herrn.\" Er wird sprechen: \"Dann kostet die Strafe, weil ihr ungläubig wart.\"", "spanish": " ¡Si al menos pudieras ver cuando se les haga comparecer ante su Señor! Él les dirá: “¿No es esta segunda vida una realidad?”. Responderán: “Sí, Señor Nuestro”. Pero Él les dirá: probad, pues, el castigo por no haber creído”.", "urdu": " اور اگر تو انہیں (اس وقت) دیکھے جب انہیں اپنے رب کے سامنے کھڑا کیا جائے گا (اور) وہ (اُن سے) فرمائے گا کیا یہ (دوسری زندگی) سچ نہیں ہے (اور) وہ جواب میں کہیں گے ہمیں اپنے رب کی قسم کیوں نہیں (ضرور سچ ہے) وہ فرمائے گا۔ تب تم اپنے انکار (پر اصرار) کی وجہ سے عذاب (کا مزا) چکھو۔"}, {"arabic": " قَدۡ خَسِرَ الَّذِیۡنَ کَذَّبُوۡا بِلِقَآءِ اللّٰہِ ؕ حَتّٰۤی اِذَا جَآءَتۡہُمُ السَّاعَۃُ بَغۡتَۃً قَالُوۡا یٰحَسۡرَتَنَا عَلٰی مَا فَرَّطۡنَا فِیۡہَا ۙ وَ ہُمۡ یَحۡمِلُوۡنَ اَوۡزَارَہُمۡ عَلٰی ظُہُوۡرِہِمۡ ؕ اَلَا سَآءَ مَا یَزِرُوۡنَ ﴿۳۲﴾", "english": " Those indeed are the losers who deny the meeting with Allah, so much so, that when the Hour shall come on them unawares, they will say, ‘O our grief for our neglecting this Hour !’ And they shall bear their burdens on their backs. Surely, evil is that which they bear.", "french": " Ceux-là sont les perdants, ceux qui nient la rencontre avec Allāh, à tel point que lorsque l’Heure arrivera pour eux à l’improviste, ils diront : « Hélas ! que nous regrettons d’avoir négligé cette Heure ! » Et ils porteront leurs fardeaux sur leurs dos. Attention ! Mauvais est ce qu’ils portent !", "german": " Wahrlich, die Verlierer sind die, welche die Begegnung mit Allah leugnen. Wenn dann aber unversehens die \"Stunde\" über sie kommt, werden sie sagen: \"O wehe uns, dass wir sie vernachlässigt haben!\" Und sie werden ihre Last auf ihrem Rücken tragen. Wahrlich, schlimm ist das, was sie tragen werden.", "spanish": " Serán ciertamente de los perdedores aquellos que nieguen el encuentro con Al-lah, hasta el punto de que, cuando les llegue la hora por sorpresa, dirán: ¡Desgraciados de nosotros por haber descuidado esta Hora !”. Pero llevarán su fardo sobre sus espaldas. En verdad, malo será lo que cargarán.", "urdu": " جن لوگوں نے اللہ کی ملاقات (کے مسئلہ) کو جھٹلایا وہ نقصان میں پڑ گئے ہیں یہاں تک کہ جب وہ گھڑی ان پر اچانک آجائے گی تو وہ کہیں گے۔ اف رے ہماری ندامت اس کوتاہی کی وجہ سے جو اس گھڑی کے بارہ میں ہم نے کی اور وہ اس وقت اپنے بوجھ اپنی پیٹھوں پر اٹھائے ہوئے ہوں گے۔ سنو جو (بوجھ) وہ اٹھائیں گے‘ وہ بہت (ہی) برا ہوگا۔"}, {"arabic": " وَ مَا الۡحَیٰوۃُ الدُّنۡیَاۤ اِلَّا لَعِبٌ وَّ لَہۡوٌ ؕ وَ لَلدَّارُ الۡاٰخِرَۃُ خَیۡرٌ لِّلَّذِیۡنَ یَتَّقُوۡنَ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۳۳﴾", "english": " And worldly life is nothing but a sport and a pastime. And surely the abode of the Hereafter is better for those who are righteous. Will you not then understand?", "french": " Et la vie d’ici-bas n’est rien qu’un jeu et un amusement. Et assurément la demeure de l’au-delà est meilleure pour ceux qui agissent avec droiture. Ne voulez-vous donc pas comprendre ?", "german": " Das Leben in dieser Welt ist nur ein Spiel und ein Zeitvertreib. Und besser ist wahrlich die Wohnstätte des Jenseits für jene, die rechtschaffen sind. Wollt ihr denn nicht begreifen?", "spanish": " La vida mundana no es sino juego y diversión; pero ciertamente la morada del Más Allá es mejor para los justos. ¿No entenderéis?", "urdu": " اور ورلی زندگی کھیل اور مشغلہ کے سوا (کچھ) نہیں ہے اور جو لوگ تقویٰ اختیار کرتے ہیں ان کے لئے پیچھے آنے والا گھر یقیناً بہتر ہے پھر کیا تم عقل سے کام نہیں لیتے۔"}, {"arabic": " قَدۡ نَعۡلَمُ اِنَّہٗ لَیَحۡزُنُکَ الَّذِیۡ یَقُوۡلُوۡنَ فَاِنَّہُمۡ لَا یُکَذِّبُوۡنَکَ وَ لٰکِنَّ الظّٰلِمِیۡنَ بِاٰیٰتِ اللّٰہِ یَجۡحَدُوۡنَ ﴿۳۴﴾", "english": " We know full well that what they say verily grieves thee; for surely it is not thee that they charge with falsehood but it is the Signs of Allah that the evil-doers reject.", "french": " Nous savons parfaitement que ce qu’ils disent en vérité t’afflige ; car assurément, ce n’est pas toi qu’ils traitent de menteur, mais ce sont les Signes d’Allāh que les malfaisants renient.", "german": " Wir wissen wohl, dich betrübt das, was sie sagen; denn fürwahr, nicht dich zeihen sie der Falschheit, es sind die Zeichen Allahs, die die Frevler verwerfen.", "spanish": " Sabemos perfectamente que te apena lo que dicen; pues, ciertamente, no es a ti a quien acusan de falsedad, sino que son los Signos de Al-lah lo que rechazan los inicuos.", "urdu": " ہم یقیناً جانتے ہیں (اور) یہی بات سچی ہے کہ جو کچھ وہ کہتے ہیں وہ تجھے ضرور غمگین کرتا ہے کیونکہ وہ تجھ کو نہیں جھٹلاتے بلکہ ظالم اللہ کی آیتوں کا دانستہ انکار کرتے ہیں۔"}, {"arabic": " وَ لَقَدۡ کُذِّبَتۡ رُسُلٌ مِّنۡ قَبۡلِکَ فَصَبَرُوۡا عَلٰی مَا کُذِّبُوۡا وَ اُوۡذُوۡا حَتّٰۤی اَتٰہُمۡ نَصۡرُنَا ۚ وَ لَا مُبَدِّلَ لِکَلِمٰتِ اللّٰہِ ۚ وَ لَقَدۡ جَآءَکَ مِنۡ نَّبَاِی الۡمُرۡسَلِیۡنَ ﴿۳۵﴾", "english": " And Messengers indeed have been rejected before thee; but notwithstanding their rejection and persecution they remained patient until Our help came to them. There is none that can change the words of Allah. And there have already come to thee tidings of past Messengers.", "french": " Et en vérité, avant toi des Messagers ont été traités de menteurs ; mais bien qu’ils fussent traités de menteurs et persécutés, ils patientèrent jusqu’à ce que Notre secours leur vînt. Personne ne peut changer les paroles d’Allāh. Et des nouvelles des Messagers passés te sont déjà parvenues.", "german": " Wohl sind vor dir Gesandte als lügenhaft gescholten worden; doch obwohl sie verleugnet und verfolgt wurden, blieben sie geduldig, bis Unsere Hilfe ihnen kam. Es gibt keinen, der die Worte Allahs zu ändern vermöchte. Wahrlich, schon kam Kunde zu dir von den Gesandten.", "spanish": " Y en verdad, antes de ti otros Mensajeros fueron rechazados; pero a pesar de ser rechazados y perseguidos, resistieron con paciencia hasta que les llegó Nuestra ayuda. No hay nada que pueda cambiar las palabras de Al-lah. Y ya te han llegado noticias de los anteriores Mensajeros.", "urdu": " اور تجھ سے پہلے رسولوں کو بھی یقیناً جھٹلایا جا چکا ہے۔ پھر باوجود اس کے کہ انہیں جھٹلایا گیا اور انہیں تکلیف دی گئی وہ صبر کرتے رہے یہاں تک کہ ان کے پاس ہماری مدد آگئی اور اللہ کی باتوں کو بدلنے والا کوئی نہیں اور تیرے پاس رسولوں کی بعض خبریں یقیناً آہی چکی ہیں۔"}, {"arabic": " وَ اِنۡ کَانَ کَبُرَ عَلَیۡکَ اِعۡرَاضُہُمۡ فَاِنِ اسۡتَطَعۡتَ اَنۡ تَبۡتَغِیَ نَفَقًا فِی الۡاَرۡضِ اَوۡ سُلَّمًا فِی السَّمَآءِ فَتَاۡتِیَہُمۡ بِاٰیَۃٍ ؕ وَ لَوۡ شَآءَ اللّٰہُ لَجَمَعَہُمۡ عَلَی الۡہُدٰی فَلَا تَکُوۡنَنَّ مِنَ الۡجٰہِلِیۡنَ ﴿۳۶﴾", "english": " And if their aversion is grievous to thee, then, if thou art able to seek a passage into the earth or a ladder unto heaven, and bring them a Sign, thou canst do so . And had Allah enforced His will, He could surely have brought them together into the guidance. So be thou not of those who lack knowledge.", "french": " Et si leur aversion t’afflige, alors si tu es à même de chercher et de trouver un passage dans la terre ou une échelle pour monter au ciel, afin de leur apporter un Signe, regarde si tu peux le faire . Et si Allāh l’avait voulu, Il aurait pu assurément les rassembler sur la bonne direction. Ne sois donc pas du nombre des ignorants.", "german": " Und wenn dir ihr Widerwille schmerzlich ist, nun wohl, falls du imstande bist, einen Schacht in die Erde oder eine Leiter in den Himmel zu finden und ihnen ein Zeichen zu bringen (dann magst du es tun). Wäre es Allahs Wille, Er hätte sie gewiss auf den rechten Weg zusammengeführt. So sei nicht der Unwissenden einer.", "spanish": " Y si te apena su alejamiento, entonces, aunque trates de encontrar un túnel en la tierra o una escala que suba al cielo, para traerles un igno, no podrás hacerlo. Pues si Al-lah hubiese ejecutado su voluntad, en verdad los hubiera reunido en el camino recto. No seas pues de los ignorantes.", "urdu": " اور اگر ان (کافروں) کی روگردانی تجھ پر گراں گزرتی ہے تو اگر تجھ میں طاقت ہے کہ زمین میں کسی سرنگ کی یا آسمان کی طرف کسی سیڑھی کی تلاش کر سکے (اور) پھر ان کے لئے کوئی نشان لا سکے (تو بیشک ایسا کر) اور اگر اللہ چاہتا تو ان کو ضرور ہدایت پر جمع کر دیتا۔ پس تو ناواقفوں میں سے ہرگز نہ بن۔"}, {"arabic": " اِنَّمَا یَسۡتَجِیۡبُ الَّذِیۡنَ یَسۡمَعُوۡنَ ؕؔ وَ الۡمَوۡتٰی یَبۡعَثُہُمُ اللّٰہُ ثُمَّ اِلَیۡہِ یُرۡجَعُوۡنَ ﴿۳۷﴾؃", "english": " Only those can accept who listen. And as for the dead, Allah will raise them to life, then to Him shall they be brought back.", "french": " Seuls ceux qui écoutent sincèrement répondent à l’appel . Et quant aux morts, Allāh les ressuscitera et alors ils seront ramenés à Lui.", "german": " Nur die können aufnehmen, die zuhören. Die aber tot sind, Allah wird sie erwecken, dann sollen sie zu ihm zurückgebracht werden.", "spanish": " Sólo responden quienes escuchan con sinceridad. En cuanto a los muertos Al-lah les devolverá la vida y a Él serán devueltos.", "urdu": " جو لوگ سنتے ہیں وہی (بات کو) قبول کرتے ہیں اور (جو) مردے (ہیں) اللہ انہیں اٹھائے گا۔ پھر انہیں اسی کی طرف لوٹایا جائے گا۔"}, {"arabic": " وَ قَالُوۡا لَوۡ لَا نُزِّلَ عَلَیۡہِ اٰیَۃٌ مِّنۡ رَّبِّہٖ ؕ قُلۡ اِنَّ اللّٰہَ قَادِرٌ عَلٰۤی اَنۡ یُّنَزِّلَ اٰیَۃً وَّ لٰکِنَّ اَکۡثَرَ ہُمۡ لَا یَعۡلَمُوۡنَ ﴿۳۸﴾", "english": " And they say, ‘Why has not a Sign been sent down to him from his Lord?’ Say, ‘Surely, Allah has power to send down a Sign, but most of them do not know.’", "french": " Et ils disent : « Pourquoi un Signe de son Seigneur ne lui a-t-il pas été envoyé ? » Dis : « Allāh a en vérité le pouvoir d’envoyer un Signe, mais la plupart d’entre eux ne savent pas. »", "german": " Sie sagen: \"Warum ist ihm kein Zeichen niedergesandt worden von seinem Herrn?\" Sprich: \"Allah hat die Macht, ein Zeichen herabzusenden, doch die meisten von ihnen wissen es nicht.\"", "spanish": " Pero dicen: “¿Por qué no le fue enviado un Signo de su Señor?”. Diles: “en verdad, Al-lah tiene poder para enviar un Signo, pero la mayoría de ellos no lo sabe”.", "urdu": " اور وہ کہتے ہیں کہ اس کے رب کی طرف سے اس پر کوئی نشان کیوں نہیں اتارا گیا تو کہہ دے کہ اللہ اس (بات) پر یقیناً قادر ہے کہ کوئی نشان نازل کرے ہاں مگر ان میں سے اکثر (اس بات کو) نہیں جانتے۔"}, {"arabic": " وَ مَا مِنۡ دَآبَّۃٍ فِی الۡاَرۡضِ وَ لَا طٰٓئِرٍ یَّطِیۡرُ بِجَنَاحَیۡہِ اِلَّاۤ اُمَمٌ اَمۡثَالُکُمۡ ؕ مَا فَرَّطۡنَا فِی الۡکِتٰبِ مِنۡ شَیۡءٍ ثُمَّ اِلٰی رَبِّہِمۡ یُحۡشَرُوۡنَ ﴿۳۹﴾", "english": " There is not an animal that crawls in the earth, nor a bird that flies on its two wings, but they are communities like you. We have left out nothing in the Book. Then to their Lord shall they be gathered together.", "french": " Il n’y a aucune créature rampant ou marchant sur la terre, ni oiseau volant avec deux ailes, qui ne forment des communautés comme vous. Dans le Livre, Nous n’avons rien omis. Ensuite, ils seront tous rassemblés auprès de leur Seigneur.", "german": " Kein Getier gibt es auf der Erde, keinen Vogel, der auf seinen zwei Schwingen dahinfliegt, die nicht Gemeinschaften wären gleich euch. Nichts haben Wir in dem Buch ausgelassen. Zu ihrem Herrn sollen sie dann versammelt werden.", "spanish": " No existe un animal que se arrastre por la tierra, ni un pájaro que vuele con sus dos alas, que no tenga comunidades como las vuestras. Nada hemos omitido en el Libro. Después serán reunidos ante su Señor.", "urdu": " اور سب کے سب زمین میں چلنے والے (جانور) اور نیز اپنے دونوں پروں سے اڑنے والے پرندے تمہاری طرح کی جماعتیں ہیں ہم نے اس کتاب میں کچھ بھی کمی نہیں کی۔ پھر انہیں (یعنی پہلے بیان کردہ گروہوں میں سے انسانوں کو) اپنے رب کی طرف اکٹھا کرکے لے جایا جائے گا۔"}, {"arabic": " وَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا صُمٌّ وَّ بُکۡمٌ فِی الظُّلُمٰتِ ؕ مَنۡ یَّشَاِ اللّٰہُ یُضۡلِلۡہُ ؕ وَ مَنۡ یَّشَاۡ یَجۡعَلۡہُ عَلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۴۰﴾", "english": " Those who have rejected Our Signs are deaf and dumb, in utter darkness. Whom Allah wills He allows to perish and whom He wills He places on the right path.", "french": " Ceux qui traitent Nos Signes de mensonges sont sourds et muets, et sont dans une obscurité complète. Celui à propos de qui Allāh décide qu’il mérite de s’égarer , Il le laisse s’égarer. Et celui à propos de qui Il décide, Il l’amène sur le droit chemin.", "german": " Die aber Unsere Zeichen leugneten, sind taub und stumm in Finsternissen. Wen Allah will, lässt er in die Irre gehen und wen Er will, führt Er auf den geraden Weg.", "spanish": " Quienes han rechazado nuestros Signos están sordos y mudos en las tinieblas más completas. A quien Al-lah así lo estima oportuno , permite que se extravíe y a quien así decide lo sitúa en el camino correcto.", "urdu": " اور جن لوگوں نے ہماری آیتوںں کو جھٹلایا ہے وہ بہرے اور گونگے ہیں (اور) تاریکیوں میں (پڑے ہوئے) ہیں۔ جسے اللہ چاہے ہلاک کر دے اور جسے چاہے سیدھے راستہ پر (قائم) کر دے۔"}, {"arabic": " قُلۡ اَرَءَیۡتَکُمۡ اِنۡ اَتٰٮکُمۡ عَذَابُ اللّٰہِ اَوۡ اَتَتۡکُمُ السَّاعَۃُ اَغَیۡرَ اللّٰہِ تَدۡعُوۡنَ ۚ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۴۱﴾", "english": " Say, ‘What think ye? If the punishment of Allah come upon you or there come upon you the Hour, will you call upon any other than Allah, if you are truthful?’", "french": " Dis : « Aviez-vous déjà songé à ce que serait votre réaction si le châtiment d’Allāh tombait sur vous, ou que tombait sur vous l’Heure destinée , invoqueriez-vous quelqu’un d’autre qu’Allāh, si vous êtes véridiques ? »", "german": " Sprich: \"Was denkt ihr? Wenn die Strafe Allahs über euch kommt oder die \"Stunde\" euch ereilt, werdet ihr dann zu einem anderen rufen als zu Allah, wenn ihr wahrhaft seid?\"", "spanish": " Diles: “¿Cuál pensáis que será vuestra respuesta si os azota el castigo de Al-lah o si os llega la Hora destinada ?, ¿invocaréis acaso a alguien que no sea Al-lah, si sois sinceros?", "urdu": " تو کہہ کہ تم بتاٶ تو (سہی) کہ اگر تم پر اللہ کا عذاب آجائے یا تم پر وہ (موعودہ) گھڑی آجائے تو اگر تم سچے ہو تو کیا تم (اس وقت) اللہ کے سوا کسی (اور) کو پکارو گے۔"}, {"arabic": " بَلۡ اِیَّاہُ تَدۡعُوۡنَ فَیَکۡشِفُ مَا تَدۡعُوۡنَ اِلَیۡہِ اِنۡ شَآءَ وَ تَنۡسَوۡنَ مَا تُشۡرِکُوۡنَ ﴿٪۴۲﴾", "english": " Nay, but on Him alone will you call; then will He remove that which you call on Him to remove , if He please, and you will forget what you associate with Him.", "french": " Au contraire, Lui Seul que vous appellerez ; alors, s’Il le veut, Il enlèvera ce dont vous Lui demandiez d’être délivrés, et vous oublierez ce que vous Lui aurez associé.", "german": " Nein, zu Ihm allein werdet ihr rufen; dann wird Er das hinwegnehmen, wozu ihr (Ihn) ruft, wenn Er will und ihr werdet vergessen, was ihr (Ihm) zur Seite stelltet.", "spanish": " No, a Él sólo invocaréis. Entonces Él os librará de lo que le habéis pedido que os libere, si así lo quiere, y olvidaréis todo lo que asociasteis a Él” .", "urdu": " نہیں بلکہ تم اسی کو پکارو گے پھر اگر وہ چاہے گا تو جس (تکلیف کے ازالہ) کے لئے تم (اسے) پکارو گے وہ اسے ضرور دور کر دے گا اور تم اسے جسے تم (خدا کا) شریک قرار دیتے ہو بھول جاٶ گے۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَاۤ اِلٰۤی اُمَمٍ مِّنۡ قَبۡلِکَ فَاَخَذۡنٰہُمۡ بِالۡبَاۡسَآءِ وَ الضَّرَّآءِ لَعَلَّہُمۡ یَتَضَرَّعُوۡنَ ﴿۴۳﴾", "english": " And indeed We sent Messengers to peoples before thee; then We afflicted them with poverty and adversity that they might humble themselves.", "french": " Et en vérité, Nous avons envoyé avant toi des Messagers aux peuples ; puis Nous les avons saisis par l’adversité et la misère afin qu’ils puissent devenir humbles.", "german": " Wir schickten schon vor dir (Gesandte) zu Völkern, dann suchten Wir sie mit Not und Drangsal heim, auf dass sie sich demütigen möchten.", "spanish": " En verdad, antes de ti enviamos a otros Mensajeros a los hombres; después los abrumamos con la aflicción y la adversidad, para que se hicieran más humildes.", "urdu": " اور ہم تجھ سے پہلی قوموں کی طرف (رسول) بھیج چکے ہیں اور (ان رسولوں کے آنے کے بعد) ہم نے انہیں (یعنی منکرین کو) اس لئے مالی اور جسمانی تکلیفوں میں گرفتار کیا تھا کہ وہ عجز اختیار کریں۔"}, {"arabic": " فَلَوۡلَاۤ اِذۡ جَآءَہُمۡ بَاۡسُنَا تَضَرَّعُوۡا وَ لٰکِنۡ قَسَتۡ قُلُوۡبُہُمۡ وَ زَیَّنَ لَہُمُ الشَّیۡطٰنُ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۴۴﴾", "english": " Why, then, when Our punishment came upon them, did they not grow humble? But their hearts were hardened and Satan made all that they did seem fair to them.", "french": " Pourquoi, alors, quand Notre châtiment est tombé sur eux, ne se sont-ils pas humiliés ? Mais leur cœur était endurci et Satan a fait que leurs actions paraissent attrayantes à leurs yeux.", "german": " Warum demütigten sie sich dann nicht, als Unsere Strafe über sie kam? Jedoch ihre Herzen waren verhärtet, und Satan ließ ihnen alles, was sie taten, als wohlgetan erscheinen.", "spanish": " ¿Por qué, pues, cuando les llegó nuestro castigo no se hicieron más umildes? Mas sus corazones se endurecieron y Satanás hizo que les pareciera correcto cuanto hicieron.", "urdu": " پھر کیوں نہ ایسا ہوا کہ جب ان پر ہمارا عذاب آیا تھا تو وہ عجز اختیار کر لیتے بلکہ ان کے دل (تو اور بھی) سخت ہو گئے اور شیطان نے اسے جو وہ کرتے تھے انہیں خوبصورت کرکے دکھایا۔"}, {"arabic": " فَلَمَّا نَسُوۡا مَا ذُکِّرُوۡا بِہٖ فَتَحۡنَا عَلَیۡہِمۡ اَبۡوَابَ کُلِّ شَیۡءٍ ؕ حَتّٰۤی اِذَا فَرِحُوۡا بِمَاۤ اُوۡتُوۡۤا اَخَذۡنٰہُمۡ بَغۡتَۃً فَاِذَا ہُمۡ مُّبۡلِسُوۡنَ ﴿۴۵﴾", "english": " Then, when they forgot that with which they had been admonished, We opened unto them the gates of all things, until, when they became exultant at what they were given, We seized them suddenly, and lo! they were plunged into despair.", "french": " Puis, lorsqu’ils avaient oublié ce avec quoi Nous les avions admonestés, Nous leur ouvrîmes les portes de toutes choses et lorsqu’ils éprouvèrent une vive joie de ce qui leur était donné, Nous les avons saisis brusquement et les voilà désespérés !", "german": " Als sie das vergaßen, woran sie erinnert worden waren, da öffneten Wir ihnen die Pforten aller Dinge, bis dass Wir sie plötzlich erfassten, dieweil sie sich des Gegebenen über mütig erfreuten, und siehe, sie wurden in Verzweiflung gestürzt!", "spanish": " Luego, cuando olvidaron aquello con lo que se les amonestó, les abrimos las puertas de todas las cosas hasta que se envanecieron por lo que se les había dado; entonces caímos de repente sobre ellos y ¡helos ahí!, hundidos en la desesperación.", "urdu": " اور پھر جب وہ اس (امر) کو بھول گئے جو انہیں یاد دلایا جاتا تھا تو ہم نے ان پر ہر اک چیز کے دروازے کھول دئیے۔ یہاں تک کہ جب وہ اس پر خوش ہو گئے جو انہیں دیا گیا تھا تو ہم نے انہیں اچانک عذاب میں مبتلا کر دیا جس پر وہ یکدم ناامید ہو گئے۔"}, {"arabic": " فَقُطِعَ دَابِرُ الۡقَوۡمِ الَّذِیۡنَ ظَلَمُوۡا ؕ وَ الۡحَمۡدُ لِلّٰہِ رَبِّ الۡعٰلَمِیۡنَ ﴿۴۶﴾", "english": " So the last remnant of the people who did wrong was cut off; and all praise belongs to Allah, the Lord of all the worlds.", "french": " Ainsi, les racines mêmes des gens qui faisaient le mal furent coupées ; et toutes les louanges appartiennent à Allāh, le Seigneur de tous les mondes.", "german": " So ward der restliche Zweig des Volkes der Frevler abgeschnitten; und aller Preis gehört Allah, dem Herrn der Welten.", "spanish": " Así fueron cortadas las mismas raíces de los que obraron mal; y toda alabanza corresponde a Al-lah, el Señor de todos los mundos.", "urdu": " پس جنہوں نے ظلم کیا تھا ان کی جڑ کاٹ دی گئی اور (ثابت ہوا کہ) سب تعریفوں کا اللہ ہی مستحق ہے جو سب جہانوں کا رب ہے۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ اِنۡ اَخَذَ اللّٰہُ سَمۡعَکُمۡ وَ اَبۡصَارَکُمۡ وَ خَتَمَ عَلٰی قُلُوۡبِکُمۡ مَّنۡ اِلٰہٌ غَیۡرُ اللّٰہِ یَاۡتِیۡکُمۡ بِہٖ ؕ اُنۡظُرۡ کَیۡفَ نُصَرِّفُ الۡاٰیٰتِ ثُمَّ ہُمۡ یَصۡدِفُوۡنَ ﴿۴۷﴾", "english": " Say, ‘What think ye? If Allah should take away your hearing and your sight, and seal up your hearts, who is the God other than Allah who could bring it back to you?’ See how We vary the Signs, yet they turn away.", "french": " Dis : « Que pensez-vous ? Si Allāh vous privait de l’ouïe et de la vue, et qu’Il vous scellait le cœur, quel dieu autre qu’Allāh pourrait vous les rendre ? Vois comment Nous varions les Signes et cependant, ils s’ en détournent. »", "german": " Sprich: \"Was wähnt ihr? Wenn Allah euer Gehör und euer Gesicht wegnähme und eure Herzen versiegelte, welcher Gott außer Allah könnte es euch wiedergeben?\" Schau, wie mannigfach Wir die Zeichen dartun, und dennoch kehren sie sich ab.", "spanish": " Diles: “¿Qué os parece? si Al-lah os retirara el oído y la vista y sellara vuestros corazones, ¿qué otro dios que no fuera Al-lah podría devolvéroslo? Mira cómo variamos los Signos y, sin embargo, vuelven la espalda.", "urdu": " تو کہہ دے کہ بتاٶ تو سہی (کہ) اگر اللہ تمہاری شنوائی اور بینائی کو ضائع کر دے اور تمہارے دلوں پر مہر لگا دے تو اللہ کے سوا کون معبود ہے جو وہ (ضائع شدہ چیز) تمہیں (واپس) لا دے گا۔ دیکھ ہم کس طرح آیتوں کو باربار (مختلف پیرایہ میں) بیان کرتے ہیں (مگر) پھر بھی وہ اعراض کرتے چلے جاتے ہیں۔"}, {"arabic": " قُلۡ اَرَءَیۡتَکُمۡ اِنۡ اَتٰٮکُمۡ عَذَابُ اللّٰہِ بَغۡتَۃً اَوۡ جَہۡرَۃً ہَلۡ یُہۡلَکُ اِلَّا الۡقَوۡمُ الظّٰلِمُوۡنَ ﴿۴۸﴾", "english": " Say, ‘What think ye? If the punishment of Allah come upon you suddenly or openly, will any be destroyed save the wrongdoing people?’", "french": " Dis : « Que pensez-vous ? Si le châtiment d’Allāh tombait sur vous à l’improviste ou ouvertement, qui serait détruit sinon le peuple qui a mal agi ? »", "german": " Sprich: \"Was wähnt ihr? Wenn Allahs Strafe unversehens oder offenkundig über euch kommt, wer anderes wird vernichtet werden als das Volk der Ungerechten?\"", "spanish": " Diles: “¿Qué os parece? si el castigo de Al-lah os llegara repentina o abiertamente, ¿quiénes serán destruidos sino los malvados?”.", "urdu": " تو کہہ دے کہ بتاٶ تو سہی کہ اگر اللہ کا عذاب تم پر اچانک (بلا اطلاع) یا ظاہر طور پر آجائے تو کیا ظالم لوگوں کے سوا (کوئی اور شخص) ہلاک کیا جائے گا۔"}, {"arabic": " وَ مَا نُرۡسِلُ الۡمُرۡسَلِیۡنَ اِلَّا مُبَشِّرِیۡنَ وَ مُنۡذِرِیۡنَ ۚ فَمَنۡ اٰمَنَ وَ اَصۡلَحَ فَلَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۴۹﴾", "english": " And We send not the Messengers but as bearers of glad tidings and as warners. So those who believe and reform themselves , on them shall come no fear nor shall they grieve.", "french": " Et Nous n’envoyons les Messagers qu’en tant que Porteurs de la bonne nouvelle et Avertisseurs. Alors, pour ceux qui croient et se réforment, il n’y aura ni crainte ni affliction.", "german": " Wir schicken die Gesandten nur als Bringer froher Botschaft und als Warner. Die also, die da glauben und sich bessern, keine Furcht soll über sie kommen, noch sollen sie trauern.", "spanish": " No enviamos a los Mensajeros sino como portadores de la buena nueva y como amonestadores. Por tanto, a quienes crean y se reformen no les sobrecogerá el temor ni se afligirán.", "urdu": " اور ہم رسولوں کو صرف خوش خبری دینے اور ڈرانے کے لئے بھیجتے ہیں۔ پھر جو (لوگ) ایمان لے آئیں اور اصلاح کریں تو انہیں نہ کسی قسم کا (آئندہ کے لئے) خوف ہوگا‘ اور نہ وہ (گزشتہ کوتاہیوں پر) غمگین ہوں گے۔"}, {"arabic": " وَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا یَمَسُّہُمُ الۡعَذَابُ بِمَا کَانُوۡا یَفۡسُقُوۡنَ ﴿۵۰﴾", "english": " And those who reject Our Signs, punishment will touch them, because they disobeyed.", "french": " Et ceux qui traitent de mensonges Nos signes, le châtiment leur surviendra, parce qu’ils ont désobéi.", "german": " Die aber Unsere Zeichen leugneten, sie wird die Strafe ereilen, weil sie ungehorsam waren.", "spanish": " Pero a quienes rechacen nuestros Signos, les sobrevendrá Nuestro castigo, por haber desobedecido.", "urdu": " اور جنہوں نے ہماری آیات کا انکار کیا ہے انہیں ان کی نافرمانیوں کی وجہ سے عذاب ہوگا۔"}, {"arabic": " قُلۡ لَّاۤ اَقُوۡلُ لَکُمۡ عِنۡدِیۡ خَزَآئِنُ اللّٰہِ وَ لَاۤ اَعۡلَمُ الۡغَیۡبَ وَ لَاۤ اَقُوۡلُ لَکُمۡ اِنِّیۡ مَلَکٌ ۚ اِنۡ اَتَّبِعُ اِلَّا مَا یُوۡحٰۤی اِلَیَّ ؕ قُلۡ ہَلۡ یَسۡتَوِی الۡاَعۡمٰی وَ الۡبَصِیۡرُ ؕ اَفَلَا تَتَفَکَّرُوۡنَ ﴿٪۵۱﴾", "english": " Say: “I do not say to you: ‘I possess the treasures of Allah,’ nor do I know the unseen; nor do I say to you: ‘I am an angel.’ I follow only that which is revealed to me.” Say: ‘Can a blind man and one who sees be alike?’ Will you not then reflect?", "french": " Dis : « Je ne vous dis pas que je possède les trésors d’Allāh, et que l’invisible m’est connu. Je ne vous dis pas non plus : ‘ Je suis un ange’, et je ne fais que suivre ce qui m’est révélé. » Dis : « Un aveugle et quelqu’un qui voit sont-ils pareils ? » Ne voulez-vous donc pas réfléchir ?", "german": " Sprich: «Ich sage nicht zu euch: \"Bei mir sind Allahs Schätze\", noch weiß ich das Verborgene; auch sage ich nicht zu euch: \"Ich bin ein Engel\"; ich folge nur dem, was mir offenbart ward.» Sprich: «Können wohl ein Blinder und ein Sehender einander gleichen? Wollt ihr denn nicht nachdenken?»", "spanish": " Diles: “No os digo: “poseo los tesoros de Al-lah” ni tampoco conozco lo desconocido; ni os digo: “soy un ángel”; sigo únicamente lo que me ha sido revelado”. Diles: “¿pueden ser iguales el ciego y el que ve?” ¿No recapacitaréis entonces?", "urdu": " تو کہہ دے کہ میں تمہیں یہ نہیں کہتا کہ میرے پاس اللہ کے خزانے ہیں اور نہ (یہ کہ) میں غیب جانتا ہوں اور نہ میں تمہیں یہ کہتا ہوں کہ میں فرشتہ ہوں۔ میں تو صرف اس کی پیروی کرتا ہوں جو میری طرف الہام کیا گیا ہے۔ تو کہہ دے کہ کیا اندھا اور آنکھوں والا برابر ہو سکتا ہے پھر کیا تم سوچتے نہیں؟"}, {"arabic": " وَ اَنۡذِرۡ بِہِ الَّذِیۡنَ یَخَافُوۡنَ اَنۡ یُّحۡشَرُوۡۤا اِلٰی رَبِّہِمۡ لَیۡسَ لَہُمۡ مِّنۡ دُوۡنِہٖ وَلِیٌّ وَّ لَا شَفِیۡعٌ لَّعَلَّہُمۡ یَتَّقُوۡنَ ﴿۵۲﴾", "english": " And warn thereby those who fear that they shall be gathered to their Lord, that they shall have no friend nor intercessor beside Him, so that they may become righteous.", "french": " Et par ce moyen, mets en garde ceux qui craignent d’être rassemblés auprès de leur Seigneur qu’ils n’auront, à part Lui, ni protecteur ni intercesseur, afin qu’ils agissent avec droiture.", "german": " Und warne hiermit jene, die da fürchten, dass sie zu ihrem Herrn versammelt würden – wo sie keinen Freund noch Fürsprecher haben werden außer Ihm –, auf dass sie doch gottesfürchtig werden.", "spanish": " Advierte con ello a quienes temen, que serán reunidos junto a su Señor, y que no tendrán amigo ni intercesor aparte de Él, a fin de que se vuelvan justos.", "urdu": " اور تو اس (کلام) کے ذریعہ سے ان لوگوں کو جو اس بات سے ڈرتے ہیں کہ انہیں ان کے رب کی طرف اکٹھا کرکے لے جایا جائے گا۔ جب کہ اس کے سوا نہ ان کا کوئی مددگار ہوگا۔ نہ سفارشی۔ اس لئے ڈرا کہ وہ تقویٰ اختیار کریں۔"}, {"arabic": " وَ لَا تَطۡرُدِ الَّذِیۡنَ یَدۡعُوۡنَ رَبَّہُمۡ بِالۡغَدٰوۃِ وَ الۡعَشِیِّ یُرِیۡدُوۡنَ وَجۡہَہٗ ؕ مَا عَلَیۡکَ مِنۡ حِسَابِہِمۡ مِّنۡ شَیۡءٍ وَّ مَا مِنۡ حِسَابِکَ عَلَیۡہِمۡ مِّنۡ شَیۡءٍ فَتَطۡرُدَہُمۡ فَتَکُوۡنَ مِنَ الظّٰلِمِیۡنَ ﴿۵۳﴾", "english": " And drive not away those who call upon their Lord morning and evening, seeking His countenance. Thou art not at all accountable for them nor are they at all accountable for thee, that thou shouldst drive them away and be of the unjust.", "french": " Et ne repousse pas ceux qui font appel à leur Seigneur matin et soir, à la recherche de Son plaisir. Tu n’es aucunement responsable de leur compte, et ils ne sont aucunement responsables du tien. Alors, si tu les repoussais, tu serais du nombre des injustes.", "german": " Und treibe die nicht fort, die ihren Herrn am Morgen und am Abend anrufen im Trachten nach Seinem Angesicht. Du bist nicht verantwortlich für sie, und sie sind nicht verantwortlich für dich. Treibst du sie fort, so wirst du der Ungerechten einer.", "spanish": " No rechaces a quienes invocan a su Señor mañana y tarde buscando Su semblante. Tú no eres en absoluto responsable de ellos ni ellos lo son de ti, porque si los rechazas serás de los injustos.", "urdu": " اور تو ان لوگوں کو جو اپنے رب کو صبح و شام اس کی توجہ چاہتے ہوئے پکارتے ہیں مت دھتکار۔ ان کے حساب کا کوئی حصہ بھی تیرے ذمہ نہیں اور تیرے حساب کا کوئی حصہ ان کے ذمہ نہیں۔ پس (اگر) تو انہیں دھتکارے گا تو ظالم ہو جائے گا۔"}, {"arabic": " وَ کَذٰلِکَ فَتَنَّا بَعۡضَہُمۡ بِبَعۡضٍ لِّیَقُوۡلُوۡۤا اَہٰۤؤُلَآءِ مَنَّ اللّٰہُ عَلَیۡہِمۡ مِّنۡۢ بَیۡنِنَا ؕ اَلَیۡسَ اللّٰہُ بِاَعۡلَمَ بِالشّٰکِرِیۡنَ ﴿۵۴﴾", "english": " And in like manner have We tried some of them by others, that they may say, ‘Is it these whom Allah has favoured from among us?’ Does not Allah know best those who are grateful?", "french": " Et pareillement, Nous avons éprouvé certains d’entre eux par d’autres, afin qu’ils disent : « Est-ce ceux-ci qu’Allāh a favorisés parmi nous ? » Allāh ne sait-Il pas mieux que quiconque lesquels sont reconnaissants ?", "german": " Ähnlich haben Wir einige von ihnen durch andere auf die Probe gestellt, so dass sie sagen möchten: \"Sind es diese, denen Allah huldreich gewesen ist aus unserer Mitte?\" Kennt Allah denn nicht am besten die Dankbaren?", "spanish": " Y de igual manera probamos a algunos de ellos con otros para que pudieran decir: “¿Son éstos a quienes Dios ha favorecido de entre nosotros?” ¿Acaso no conoce Al-lah mejor a los agradecidos?", "urdu": " اور ہم نے ان میں سے بعض کو بعض کے ذریعہ سے اس طرح آزمایا ہے تا کہ وہ (ابتلاء میں ڈالے ہوئے لوگ) کہیں کہ کیا اللہ نے ہم میں سے ان (ذلیل) لوگوں پر احسان کیا ہے (ٹھیک ہے) کیا خدا شکر گزاروں کو (سب سے زیادہ) نہیں جانتا؟"}, {"arabic": " وَ اِذَا جَآءَکَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِاٰیٰتِنَا فَقُلۡ سَلٰمٌ عَلَیۡکُمۡ کَتَبَ رَبُّکُمۡ عَلٰی نَفۡسِہِ الرَّحۡمَۃَ ۙ اَنَّہٗ مَنۡ عَمِلَ مِنۡکُمۡ سُوۡٓءًۢ ابِجَہَالَۃٍ ثُمَّ تَابَ مِنۡۢ بَعۡدِہٖ وَ اَصۡلَحَ فَاَنَّہٗ غَفُوۡرٌ رَّحِیۡمٌ ﴿۵۵﴾", "english": " And when those who believe in Our Signs come to thee, say: ‘Peace be unto you! Your Lord has taken it upon Himself to show mercy, so that whoso among you does evil ignorantly, and repents thereafter and amends, then He is Most Forgiving, Merciful.’", "french": " Et quand ceux qui croient à Nos Signes viennent à toi, dis : « La paix soit avec vous ! Votre Seigneur S’est imposé à Lui-Même de faire miséricorde, de sorte que pour quiconque parmi vous, après avoir fait un mal par ignorance, s’ en repent ensuite et s’amende, Il est Très-Pardonnant, Miséricordieux. »", "german": " Und wenn jene, die an Unsere Zeichen glauben, zu dir kommen, so sprich: \"Friede sei mit euch! Euer Herr hat Sich Selbst Barmherzigkeit vorgeschrieben; wenn einer von euch unwissentlich etwas Böses tut und hernach bereut und sich bessert, so ist Er allvergebend, barmherzig.\"", "spanish": " Cuando vengan a ti quienes creen en Nuestros Signos, diles: “¡que la paz sea con vosotros!”. Vuestro Señor se ha impuesto a Sí mismo mostrar misericordia para ser -con aquellos de vosotros que hagan el mal por ignorancia y después se arrepientan y se reformen- el Sumo Indulgente y Misericordioso”.", "urdu": " اورجب تیرے پاس وہ لوگ آئیں جو ہماری آیتوں پر ایمان لاتے ہیں تو تو (انہیں) کہہ تم پر ہمیشہ سلامتی ہو۔ تمہارے رب نے اپنے آپ پر (تمہارے لئے) رحمت کو فرض کر لیا ہے (اس طرح) کہ تم میں سے جو (کوئی) غفلت میں کوئی بدی کر بیٹھے گا پھر وہ اس کے بعد توبہ کرلے گا اور اصلاح کرے گا۔ تو اس (خدا) کی صفت یہ ہے کہ وہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ کَذٰلِکَ نُفَصِّلُ الۡاٰیٰتِ وَ لِتَسۡتَبِیۡنَ سَبِیۡلُ الۡمُجۡرِمِیۡنَ ﴿٪۵۶﴾", "english": " And thus do We expound the Signs that you may seek forgiveness and that the way of the sinners may become manifest.", "french": " Et c’est ainsi que Nous expliquons en détail les Signes et cela pour que devienne claire la voie des pécheurs.", "german": " Also machen Wir die Zeichen klar, und dass der Weg der Sünder erkannt werde.", "spanish": " Así exponemos los Signos para que aparezca evidente el camino de los pecadores.", "urdu": " اور ہم نشانات کو اسی طرح کھول (کھول) کر بیان کرتے ہیں (تاحق کھل جائے) اور تا مجرموں کا طریقہ ظاہر ہو جائے۔"}, {"arabic": " قُلۡ اِنِّیۡ نُہِیۡتُ اَنۡ اَعۡبُدَ الَّذِیۡنَ تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ ؕ قُلۡ لَّاۤ اَتَّبِعُ اَہۡوَآءَکُمۡ ۙ قَدۡ ضَلَلۡتُ اِذًا وَّ مَاۤ اَنَا مِنَ الۡمُہۡتَدِیۡنَ ﴿۵۷﴾", "english": " Say: ‘I am forbidden to worship those on whom you call beside Allah.’ Say: ‘I will not follow your evil inclinations. In that case, I shall become lost and I shall not be of the guided.’", "french": " Dis : « Il m’est interdit d’adorer ceux que vous invoquez en dehors d’Allāh. » Dis : « Je ne suivrai pas vos vains désirs ; sinon je m’égarerais et je ne serais pas du nombre de ceux qui sont bien guidés. »", "german": " Sprich: \"Mir ward verboten, die anzubeten, die ihr statt Allah anruft.\" Sprich: \"Ich will euren bösen Gelüsten nicht folgen; ich würde sonst wahrlich irregehen und wäre nicht unter den Rechtgeleiteten.\"", "spanish": " Diles: “Se me ha prohibido adorar a quienes invocáis en vez de Al-lah”. Diles: “No seguiré vuestros deseos vanos porque, de hacerlo, me extraviaría y no estaría entre los guiados”.", "urdu": " تو (ان سے) کہدے کہ مجھے بالکل منع کیا گیا ہے کہ میں ان (جھوٹے معبودوں) کی عبادت کروں جنہیں تم اللہ کے سوا پکارتے ہو۔ تو (ان سے) کہدے کہ میں تمہاری گری ہوئی خواہشات کی پیروی نہیں کرتا (اگر میں ایسا کروں تو) اس صورت میں (سمجھو کہ) میں گمراہ ہو چکا۔ اور میں ہدایت یافتہ (لوگوں) میں سے نہیں ہوں۔"}, {"arabic": " قُلۡ اِنِّیۡ عَلٰی بَیِّنَۃٍ مِّنۡ رَّبِّیۡ وَ کَذَّبۡتُمۡ بِہٖ ؕ مَا عِنۡدِیۡ مَا تَسۡتَعۡجِلُوۡنَ بِہٖ ؕ اِنِ الۡحُکۡمُ اِلَّا لِلّٰہِ ؕ یَقُصُّ الۡحَقَّ وَ ہُوَ خَیۡرُ الۡفٰصِلِیۡنَ ﴿۵۸﴾", "english": " Say: ‘I take my stand on a clear evidence from my Lord and you reject it. That which you desire to be hastened is not in my power . The decision rests with none but Allah. He explains the truth, and He is Best of judges.’", "french": " Dis : « Je me fonde sur une preuve claire de la part de mon Seigneur, et vous la traitez de mensonge. Ce que vous voulez hâter n’est pas en mon pouvoir. La décision n’appartient qu’à Allāh. Il explique la vérité et Il est le Meilleur des juges. »", "german": " Sprich: \"Ich habe einen klaren Beweis von meinem Herrn und ihr verwerft ihn. Ich habe nicht bei mir, was ihr beschleunigt zu sehen wünschet. Die Entscheidung liegt bei Allah allein. Er legt die Wahrheit dar, und Er ist der beste Richter.\"", "spanish": " Diles: “Me apoyo en una prueba clara de mi Señor y osotros la rechazáis. Lo que pretendéis apresurar no está en mi poder. La decisión sólo corresponde a Al-lah. Él explica la verdad y es el Mejor de los Jueces”.", "urdu": " تو (ان سے) کہدے کہ میں اپنے رب کی طرف سے ایک واضح دلیل پر قائم ہوں اور تم نے اس (رب) کی تکذیب کی ہے جس بات کے متعلق تم جلدی کرتے ہو وہ میرے پاس نہیں ہے فیصلہ تو اللہ کے اختیار میں ہے وہ سچائی بیان کرتا ہے اور وہ فیصلہ کرنے میں سب سے اچھا ہے۔"}, {"arabic": " قُلۡ لَّوۡ اَنَّ عِنۡدِیۡ مَا تَسۡتَعۡجِلُوۡنَ بِہٖ لَقُضِیَ الۡاَمۡرُ بَیۡنِیۡ وَ بَیۡنَکُمۡ ؕ وَ اللّٰہُ اَعۡلَمُ بِالظّٰلِمِیۡنَ ﴿۵۹﴾", "english": " Say: ‘If that which you desire to be hastened were in my power, surely the matter would be decided between me and you. And Allah knows best the unjust.’", "french": " Dis : « Si ce que vous voulez hâter était en mon pouvoir, alors certainement l’affaire serait décidée entre moi et vous. Et Allāh connaît mieux que quiconque les injustes. »", "german": " Sprich: \"Hätte ich bei mir, was ihr beschleunigt zu sehen wünschet, wahrlich, entschieden wäre die Sache zwischen mir und euch. Und Allah kennt die Frevler recht wohl.\"", "spanish": " Diles: “Si estuviera en mi poder lo que deseáis que se apresure, en verdad la cuestión se decidiría entre vosotros y yo. Pero Al-lah conoce mejor a los injustos”.", "urdu": " تو (ان سے) کہدے کہ جس چیز کے متعلق تم جلدی کے خواہاں ہو اگر وہ میرے پاس ہوتی تو میرے اور تمہارے درمیان (اختلافی) امر کا فیصلہ (کبھی کا) ہو جاتا۔ اور اللہ ظالموں کو سب سے زیادہ جانتا ہے (جب چاہے گا فیصلہ کر دے گا)"}, {"arabic": " وَ عِنۡدَہٗ مَفَاتِحُ الۡغَیۡبِ لَا یَعۡلَمُہَاۤ اِلَّا ہُوَ ؕ وَ یَعۡلَمُ مَا فِی الۡبَرِّ وَ الۡبَحۡرِ ؕ وَ مَا تَسۡقُطُ مِنۡ وَّرَقَۃٍ اِلَّا یَعۡلَمُہَا وَ لَا حَبَّۃٍ فِیۡ ظُلُمٰتِ الۡاَرۡضِ وَ لَا رَطۡبٍ وَّ لَا یَابِسٍ اِلَّا فِیۡ کِتٰبٍ مُّبِیۡنٍ ﴿۶۰﴾", "english": " And with Him are the keys of the unseen; none knows them but He. And He knows whatsoever is in the land and in the sea. And there falls not a leaf but He knows it; nor is there a grain in the deep darkness of the earth, nor anything green or dry, but is recorded in a clear Book.", "french": " Et avec Lui sont les clés de l’invisible ; Lui Seul les connaît. Et Il connaît tout ce qui est sur la terre et dans la mer. Et aucune feuille ne tombe sans qu’Il le sache ; et pas une graine dans les ténèbres de la terre, ni rien d’humide ni de sec qui ne soit consigné dans un Livre clair.", "german": " Bei Ihm sind die Schlüssel des Verborgenen; keiner kennt sie als Er allein. Und Er weiß, was auf dem Lande ist und was im Meer. Und nicht ein Blatt fällt nieder, ohne dass Er es weiß; und kein Körnchen ist in der Erde dunkel und nichts Grünes und nichts Dürres, das nicht in einem deutlichen Buch wäre.", "spanish": " Pues Él posee las claves de lo desconocido; nadie las conoce excepto Él. Y Él sabe todo lo que hay en la tierra y en el mar. Y no cae una hoja sin que Él lo sepa; ni hay un solo grano en las inieblas de la tierra, ni nada húmedo o seco que no esté registrado en un Libro Manifiestamente claro.", "urdu": " اور اس کے پاس غیب کی کنجیاں ہیں۔ سوائے اس کے ان (غیبوں) کو کوئی نہیں جانتا اور جو کچھ خشکی اور سمندر میں ہے وہ اسے جانتا ہے اور کوئی پتہ نہیں گرتا مگر وہ اسے جان لیتا ہے اور زمین کی تاریکیوں میں کوئی دانہ نہیں اور نہ کوئی تر (چیز) ہے اور نہ خشک (چیز) جو (اس کی) کھلی (کھلی) حفاظت میں نہ ہو۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ یَتَوَفّٰٮکُمۡ بِالَّیۡلِ وَ یَعۡلَمُ مَا جَرَحۡتُمۡ بِالنَّہَارِ ثُمَّ یَبۡعَثُکُمۡ فِیۡہِ لِیُقۡضٰۤی اَجَلٌ مُّسَمًّی ۚ ثُمَّ اِلَیۡہِ مَرۡجِعُکُمۡ ثُمَّ یُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿٪۶۱﴾", "english": " And He it is Who takes your souls by night and knows that which you do by day; then He raises you up again therein, that the appointed term may be completed. Then to Him is your return. Then will He inform you of what you used to do.", "french": " Et c’est Lui Qui, pendant la nuit, prend vos âmes, et sait ce que vous faites pendant la journée ; puis Il vous y ressuscite afin que le terme fixé soit accompli. Ensuite, vers Lui est votre retour. Alors, Il vous informera de ce que vous faisiez.", "german": " Und Er ist es, Der eure Seelen zu Sich nimmt in der Nacht und weiß, was ihr schaffet am Tag; darin erweckt Er euch dann wieder, auf dass die vorbestimmte Frist vollendet werde. Zu Ihm ist dann eure Heimkehr; dann wird Er euch verkünden, was eure Werke waren.", "spanish": " Pues Él es quien recoge vuestras almas por la noche y sabe cuanto hacéis durante el día; y más tarde os reanima de nuevo para que se cumpla el plazo establecido. Luego a Él volveréis y os informará de cuanto hayáis hecho.", "urdu": " اور وہی ہے جو رات کے وقت تمہاری روح قبض کرتا ہے۔ اور دن کے وقت جو کچھ تم کرتے ہو اسے جانتا ہے پھر تمہیں دن کے وقت اٹھاتا ہے تا کہ ایک مدت جو مقرر ہو چکی ہے پوری کی جائے جس کے بعد تمہارا لوٹنا اسی کی طرف ہے اور جو کچھ تم کرتے ہو وہ اس کی تمہیں خبر دے گا۔"}, {"arabic": " وَ ہُوَ الۡقَاہِرُ فَوۡقَ عِبَادِہٖ وَ یُرۡسِلُ عَلَیۡکُمۡ حَفَظَۃً ؕ حَتّٰۤی اِذَا جَآءَ اَحَدَکُمُ الۡمَوۡتُ تَوَفَّتۡہُ رُسُلُنَا وَ ہُمۡ لَا یُفَرِّطُوۡنَ ﴿۶۲﴾", "english": " And He is Supreme over His servants, and He sends guardians to watch over you, until, when death comes to anyone of you, Our messengers take his soul, and they fail not.", "french": " Et de par Sa gloire et Sa majesté, Il est le Dominant sur Ses serviteurs – l’humanité , et Il envoie des gardiens pour veiller sur vous, jusqu’à ce que, quand la mort surprend l’un d’entre vous, Nos messagers prennent son âme et ils négligent rien.", "german": " Er ist der Höchste über Seine Diener, und Er sendet Wächter über euch, bis endlich, wenn der Tod an einen von euch herantritt, Unsere Gesandten seine Seele dahinnehmen, und sie säumen nicht.", "spanish": " Él es Soberano sobre sus siervos y envía protectores para vigilarlos, hasta que, cuando os llegue la muerte a uno de vosotros, nuestros mensajeros recojan su alma; y no fallarán.", "urdu": " اور وہ اپنے بندوں پر غالب ہے اور تم پر نگران (مقرر کرکے) بھیجتا (رہتا) ہے یہاں تک کہ جب تم میں سے کسی کو موت آپکڑتی ہے تو ہمارے بھیجے ہوئے (فرشتے) اس کی روح قبض کر لیتے ہیں اور وہ (حکم کی تکمیل میں) کمی نہیں کرتے۔"}, {"arabic": " ثُمَّ رُدُّوۡۤا اِلَی اللّٰہِ مَوۡلٰٮہُمُ الۡحَقِّ ؕ اَلَا لَہُ الۡحُکۡمُ ۟ وَ ہُوَ اَسۡرَعُ الۡحٰسِبِیۡنَ ﴿۶۳﴾", "english": " Then are they returned to Allah, their true Lord. Surely, His is the judgment. And He is the Quickest of reckoners.", "french": " Alors ils sont ramenés à Allāh, leur Vrai Seigneur. Attention ! C’est à Lui qu’appartient le jugement, et c’est Lui Qui est le plus prompt de ceux qui règlent les comptes.", "german": " Dann werden sie zurückgebracht zu Allah, ihrem wahren Herrn. Wahrlich, Sein ist das Urteil, und Er ist der schnellste Rechner.", "spanish": " Luego son devueltos a Al-lah, su verdadero Señor. En verdad, suyo es el juicio. Y Él es el más Experto en la retribución.", "urdu": " پھر انہیں اللہ کی طرف جو ان کا سچا آقا ہے لوٹایا جائے گا۔ سنو! فیصلہ اسی کے اختیار میں ہے اور وہ حساب لینے والوں میں سے سب سے جلدی (حساب) لینے والا ہے۔"}, {"arabic": " قُلۡ مَنۡ یُّنَجِّیۡکُمۡ مِّنۡ ظُلُمٰتِ الۡبَرِّ وَ الۡبَحۡرِ تَدۡعُوۡنَہٗ تَضَرُّعًا وَّ خُفۡیَۃً ۚ لَئِنۡ اَنۡجٰٮنَا مِنۡ ہٰذِہٖ لَنَکُوۡنَنَّ مِنَ الشّٰکِرِیۡنَ ﴿۶۴﴾", "english": " Say, “Who delivers you from the calamities of the land and the sea, when you call upon Him in humility and in secret, saying , ‘If He deliver us from this, we will surely be of those who are grateful?’ ”", "french": " Dis : « Qui vous délivre des calamités de la terre et de la mer, lorsque vous L’invoquez avec humilité et en secret, en disant : ‘S’Il nous délivre de ceci, nous serons assurément du nombre des reconnaissants’ ? »", "german": " Sprich: «Wer errettet euch aus den Fährnissen zu Land und Meer, [wenn] ihr Ihn anruft in Demut und insgeheim: \"Wenn Er uns hieraus errettet, werden wir wahrlich dankbar sein\"?»", "spanish": " Diles: “¿Quién os libra de las calamidades de la tierra y el mar, cuando lo invocáis con humildad y en secreto, diciendo : “Si Él nos libra de esto, seremos en verdad de los agradecidos?”.", "urdu": " تو (ان سے) کہدے کہ تمہیں خشکی اور تری کی مصیبتوں سے کون بچاتا ہے جبکہ تم اسے عاجزی سے اور پوشیدہ طور پر (یہ کہتے ہوئے) پکارتے ہو کہ اگر وہ ہمیں اس مصیبت سے بچائے گا تو ہم ضرور شکر گزار ہو جائیں گے۔"}, {"arabic": " قُلِ اللّٰہُ یُنَجِّیۡکُمۡ مِّنۡہَا وَ مِنۡ کُلِّ کَرۡبٍ ثُمَّ اَنۡتُمۡ تُشۡرِکُوۡنَ ﴿۶۵﴾", "english": " Say, ‘Allah delivers you from them and from every distress, yet you associate partners with Him .’", "french": " Dis : « Allāh vous en délivre, et ainsi que de toutes les détresses, et néanmoins vous Lui donnez des associés. »", "german": " Sprich: \"Allah errettet euch daraus und aus aller Drangsal, dennoch stellt ihr (Ihm) Götter zur Seite.\"", "spanish": " Diles: “Al-lah os libra de ellas y de toda aflicción, y sin embargo asociáis otros partícipes con Él” .", "urdu": " تو (ان سے) کہہ دے کہ اللہ (ہی) تمہیں اس سے (بھی) اور ہر اک (دوسری) گھبراہٹ سے (بھی) بچاتا ہے۔ پھر (بھی) تم شرک کرتے ہو۔"}, {"arabic": " قُلۡ ہُوَ الۡقَادِرُ عَلٰۤی اَنۡ یَّبۡعَثَ عَلَیۡکُمۡ عَذَابًا مِّنۡ فَوۡقِکُمۡ اَوۡ مِنۡ تَحۡتِ اَرۡجُلِکُمۡ اَوۡ یَلۡبِسَکُمۡ شِیَعًا وَّ یُذِیۡقَ بَعۡضَکُمۡ بَاۡسَ بَعۡضٍ ؕ اُنۡظُرۡ کَیۡفَ نُصَرِّفُ الۡاٰیٰتِ لَعَلَّہُمۡ یَفۡقَہُوۡنَ ﴿۶۶﴾", "english": " Say, ‘He has power to send punishment upon you from above you or from beneath your feet, or to confound you by splitting you into sects and make you taste the violence of one another.’ See how We expound the Signs in various ways that they may understand!", "french": " Dis : « Il a le pouvoir de susciter contre vous un châtiment d’en haut ou de dessous vos pieds, ou de vous jeter dans la confusion permanente de sectes hostiles et vous faire goûter la violence les uns des autres. » Vois comment Nous expliquons diversement les Signes pour qu’ils comprennent !", "german": " Sprich: \"Er hat die Macht, euch ein Strafgericht zu senden, aus der Höhe oder unter euren Füßen hervor, oder euch als Gruppen zusammenzuführen, und die einen der anderen Gewalttat kosten zu lassen.\" Schau, wie mannigfach Wir die Zeichen dartun, auf dass sie verstehen.", "spanish": " Diles: “Él tiene poder para enviaros un castigo desde lo alto o desde debajo de vuestros pies, o para hacer de vuestro destino que os dividáis en sectas mutuamente hostiles y que sufráis la violencia de los demás” ¡Mira cómo exponemos los Signos de distintas formas para que comprendan!", "urdu": " تو (ان سے) کہدے وہ اس (بات) پر بھی قادر ہے کہ تمہارے اوپر کی طرف سے عذاب نازل کرے یا تمہارے پاٶں کے نیچے کی طرف سے یا تمہیں (ایک دوسرے کے خلاف) آپس میں مختلف گروہوں کی صورت میں ملادے اور تم میں سے بعض کی طرف سے بعض کو تکلیف پہنچائے۔ دیکھ ہم دلیلوں کو کس طرح باربار بیان کرتے ہیں تا کہ وہ سمجھیں۔"}, {"arabic": " وَ کَذَّبَ بِہٖ قَوۡمُکَ وَ ہُوَ الۡحَقُّ ؕ قُلۡ لَّسۡتُ عَلَیۡکُمۡ بِوَکِیۡلٍ ﴿ؕ۶۷﴾", "english": " And thy people have rejected it, though it is the truth. Say, ‘I am not a guardian over you.’", "french": " Et ton peuple l’a traité de mensonge, bien que ce soit la vérité. Dis : « Je ne suis pas votre surveillant. »", "german": " Und dein Volk hat es verworfen, obwohl es die Wahrheit ist. Sprich: \"Ich bin kein Wächter über euch.\"", "spanish": " Mas tu pueblo lo ha rechazado a pesar de ser la verdad. Diles: “¡No soy vuestro guardián!”.", "urdu": " اور تیری قوم نے اس (امر یعنی پیغام محمد صلی اللہ علیہ وسلم) کو جھوٹا قرار دیا ہے حالانکہ وہ سچا ہے۔ تو ان سے کہہ دے کہ میں تمہارا ذمہ دار نہیں ہوں۔"}, {"arabic": " لِکُلِّ نَبَاٍ مُّسۡتَقَرٌّ ۫ وَّ سَوۡفَ تَعۡلَمُوۡنَ ﴿۶۸﴾", "english": " For every prophecy there is a fixed time; and soon will you come to know.", "french": " Chaque prophétie se réalise en son temps et lieu et vous ne tarderez pas à le savoir.", "german": " Für jede Weissagung ist eine Zeit gesetzt, und bald werdet ihr es erfahren.", "spanish": " Para cada profeta hay un plazo establecido; y pronto llegaréis a saberlo.", "urdu": " ہر ایک پیشگوئی کی ایک حد مقرر ہوتی ہے اور تم جلد ہی (حقیقت کو) جان لو گے۔"}, {"arabic": " وَ اِذَا رَاَیۡتَ الَّذِیۡنَ یَخُوۡضُوۡنَ فِیۡۤ اٰیٰتِنَا فَاَعۡرِضۡ عَنۡہُمۡ حَتّٰی یَخُوۡضُوۡا فِیۡ حَدِیۡثٍ غَیۡرِہٖ ؕ وَ اِمَّا یُنۡسِیَنَّکَ الشَّیۡطٰنُ فَلَا تَقۡعُدۡ بَعۡدَ الذِّکۡرٰی مَعَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿۶۹﴾", "english": " And when thou seest those who engage in vain discourse concerning Our Signs, then turn thou away from them until they engage in a discourse other than that. And if Satan cause thee to forget, then sit not, after recollection, with the unjust people.", "french": " Et quand tu verras ceux qui plaisantent avec Nos Signes, alors détourne-toi d’eux jusqu’à ce qu’ils changent de conversation. Et si Satan te faisait oublier ce précepte , alors, après t’ en être souvenu, ne reste pas assis en compagnie des injustes.", "german": " Wenn du jene siehst, die mit Unseren Zeichen töricht reden, dann wende dich ab von ihnen, bis sie ein anderes Gespräch führen. Und sollte dich Satan (dies) vergessen lassen, dann sitze nicht, nach dem Wiedererinnern, mit dem Volk der Ungerechten.", "spanish": " Cuando veas a quienes juegan con Nuestros Signos, apártate de ellos hasta que no empiecen a tratar otro tema. Y si Satanás te hace olvidar, no te sientes -después de caer en la cuenta- con los hombres impíos.", "urdu": " اور جب تو ان لوگوں کو دیکھے جو ہماری آیتوں کے بارہ میں بے لگام ہو کر باتیں کرتے ہیں تو اس وقت تک ان سے الگ رہ جب تک وہ اس (بیہودہ گوئی) کے سوا کسی اور بات میں مشغول نہ ہو جائیں۔ اور اگر شیطان تجھے بھلا ہی دے تو یاد آنے کے بعد تو ظالم قوم کے پاس نہ بیٹھ۔"}, {"arabic": " وَ مَا عَلَی الَّذِیۡنَ یَتَّقُوۡنَ مِنۡ حِسَابِہِمۡ مِّنۡ شَیۡءٍ وَّ لٰکِنۡ ذِکۡرٰی لَعَلَّہُمۡ یَتَّقُوۡنَ ﴿۷۰﴾", "english": " And those who are righteous are not at all accountable for them, but their duty is to admonish them, that they may fear God.", "french": " Et ceux qui agissent avec droiture ne sont nullement responsables pour eux, mais leur devoir est de les avertir pour qu’ils craignent Allāh.", "german": " Den Rechtschaffenen obliegt nicht die Verantwortung für jene, sondern nur das Ermahnen, auf dass sie gottesfürchtig werden.", "spanish": " Pues los justos no son en absoluto responsables de ellos, aunque su deber es amonestarlos, para que teman a Dios .", "urdu": " اور جو لوگ تقویٰ اختیار کرتے ہیں ان کے ذمہ ان (بیہودہ گو لوگوں) کے حساب کا کوئی حصہ نہیں ہے بلکہ نصیحت کرنا (ان کے ذمہ) ہے تا کہ وہ تقویٰ اختیار کریں۔"}, {"arabic": " وَ ذَرِ الَّذِیۡنَ اتَّخَذُوۡا دِیۡنَہُمۡ لَعِبًا وَّ لَہۡوًا وَّ غَرَّتۡہُمُ الۡحَیٰوۃُ الدُّنۡیَا وَ ذَکِّرۡ بِہٖۤ اَنۡ تُبۡسَلَ نَفۡسٌۢ بِمَا کَسَبَتۡ ٭ۖ لَیۡسَ لَہَا مِنۡ دُوۡنِ اللّٰہِ وَلِیٌّ وَّ لَا شَفِیۡعٌ ۚ وَ اِنۡ تَعۡدِلۡ کُلَّ عَدۡلٍ لَّا یُؤۡخَذۡ مِنۡہَا ؕ اُولٰٓئِکَ الَّذِیۡنَ اُبۡسِلُوۡا بِمَا کَسَبُوۡا ۚ لَہُمۡ شَرَابٌ مِّنۡ حَمِیۡمٍ وَّ عَذَابٌ اَلِیۡمٌۢ بِمَا کَانُوۡا یَکۡفُرُوۡنَ ﴿٪۷۱﴾", "english": " And let alone those who take their religion for a sport and a pastime, and whom worldly life has beguiled. And admonish people thereby lest a soul be consigned to perdition for what it has wrought. It shall have no helper nor intercessor beside Allah; and even if it offer every ransom, it shall not be accepted from it. These are they who have been delivered over to destruction for their own acts. They will have a drink of boiling water and a grievous punishment, because they disbelieved.", "french": " Et laisse de côté ceux qui prennent leur religion pour un jeu et un amusement, et que la vie de ce monde a séduits. Et avertis- les par ceci, afin qu’une âme ne soit pas vouée à la perdition par suite de ce qu’elle aura commis. A part Allāh, elle n’aura ni aide ni médiateur ; et quand bien même elle offrirait toutes les rançons, elles ne seraient pas acceptées d’elle. Voilà ceux qui ont été livrés à la perdition à cause de ce qu’ils ont acquis. Ils auront de l’eau bouillante à boire et un châtiment douloureux pour leur mécréance.", "german": " Lass jene allein, die ihren Glauben als ein Spiel und einen Zeitvertreib nehmen und die das irdische Leben betört hat. Und ermahne (die Menschen) hierdurch, damit nicht eine Seele der Verdammnis anheimfalle für das, was sie begangen hat. Keinen Helfer noch Fürsprecher soll sie haben, es sei denn Allah; und wenn sie auch jegliches Lösegeld bietet, es wird von ihr nicht angenommen werden. Das sind die, welche dem Verderben preisgegeben wurden für ihre eigenen Taten. Ein Trunk siedenden Wassers wird ihr Teil sein und eine schmerzliche Strafe, weil sie ungläubig waren.", "spanish": " Abandona a quienes tomen su religión como juego y pasatiempo y a uienes ha seducido la vida mundana. Pero exhorta de ese modo a los hombres no sea que un alma sea arrojada a la perdición por lo que ha cometido. No tendrá abogado ni intercesor fuera de Al-lah; ni aunque ofrezca cualquier rescate, se le aceptará. Ésos son los que han sido entregados a la destrucción por sus propios actos. Tendrán por bebida agua hirviente y sufrirán un doloroso castigo, por no haber creído.", "urdu": " اور تو ان لوگوں کو جنہوں نے اپنے دین کو مشغلہ اور کھیل بنا لیا ہے اور ورلی زندگی نے انہیں دھوکا میں ڈالا ہوا ہے چھوڑ دے اور اس (کلام الٰہی) کے ذریعہ سے نصیحت کر۔ تا (ایسا نہ ہو) کہ کسی جان کو اس کے کمائے ہوئے کے سبب سے اس طرح ہلاکت میں ڈال دیا جائے کہ خدا کے سوا اس کا نہ کوئی مددگار ہو اور نہ شفیع ہو‘ اور اگر وہ ہر اک (قسم) کا بدلہ بھی دیں تو ان سے قبول نہ کیا جائے گا یہ وہ لوگ ہیں جنہیں ان کی کمائی کے سبب سے ہلاکت میں ڈال دیا جائے گا۔ انہیں ان کے کفر کے سبب سے پینے کو گرم پانی (ملے گا) اور دردناک عذاب ہوگا۔"}, {"arabic": " قُلۡ اَنَدۡعُوۡا مِنۡ دُوۡنِ اللّٰہِ مَا لَا یَنۡفَعُنَا وَ لَا یَضُرُّنَا وَ نُرَدُّ عَلٰۤی اَعۡقَابِنَا بَعۡدَ اِذۡ ہَدٰٮنَا اللّٰہُ کَالَّذِی اسۡتَہۡوَتۡہُ الشَّیٰطِیۡنُ فِی الۡاَرۡضِ حَیۡرَانَ ۪ لَہٗۤ اَصۡحٰبٌ یَّدۡعُوۡنَہٗۤ اِلَی الۡہُدَی ائۡتِنَا ؕ قُلۡ اِنَّ ہُدَی اللّٰہِ ہُوَ الۡہُدٰی ؕ وَ اُمِرۡنَا لِنُسۡلِمَ لِرَبِّ الۡعٰلَمِیۡنَ ﴿ۙ۷۲﴾", "english": " Say: “Shall we call, beside Allah, upon that which can neither profit us nor harm us, and shall we be turned back on our heels after Allah has guided us, like one whom the evil ones entice away leaving him bewildered in the land, and who has companions who call him to guidance, saying , ‘Come to us?’ ” Say: “Surely, the guidance of Allah is the only guidance and we have been commanded to submit to the Lord of all the worlds.", "french": " Dis : « Au lieu d’Allāh, invoquerons-nous ce qui ne peut ni nous profiter ni nous nuire, et reviendrons-nous sur nos pas après qu’Allāh nous aura guidés, comme quelqu’un que les malins ont envoûté, le laissant ahuri sur la terre, bien que des compagnons l’appellent à la direction, en disant : « Viens à nous ? » Dis : « En vérité, la direction d’Allāh est la seule direction, et nous avons reçu le commandement de nous soumettre au Seigneur de tous les mondes. »", "german": " Sprich: «Sollen wir statt Allah das anrufen, was uns weder nützt noch schadet, und sollen wir umkehren auf unseren Fersen, nachdem Allah uns den Weg gewiesen, gleich einem, den die Teufel verwirrt im Land herumgängeln? Er hat Gefährten, die ihn zum rechten Weg rufen: \"Komm zu uns!\"» Sprich: «Allahs Führung ist allein die Führung, und uns ist geboten, dass wir uns ergeben dem Herrn der Welten.", "spanish": " Diles: “¿Invocaremos, en lugar de Al-lah a lo que no puede beneficiarnos ni perjudicarnos, y volveremos sobre nuestros talones después de que Al-lah nos ha guiado, como aquél a quien los malvados educen, dejándolo perdido en la tierra, a pesar de que tiene compañeros que lo llaman al buen camino, diciéndole: “ven a nosotros”?”. Diles: “en verdad, la guía de Al-lah es la única guía, y se nos ha ordenado que nos sometamos al Señor de todos los mundos”.", "urdu": " تو (ان سے) کہدے کیا ہم اللہ کے سوا اسے پکاریں جو نہ ہمیں (کوئی) نفع دیتا ہے اور نہ ضرر دیتا ہے اور کیا اللہ کے ہدایت (دے) دینے کے بعد ہم اس (شخص) کی طرح اپنی ایڑیوں کے بل لوٹائے جائیں جسے سرکش (لوگ) زمین میں بہکا کر لے گئے ہوں‘ (اور وہ) حیران (و پریشان) ہو رہا ہو اس کے (کچھ) ساتھی تو ایسے ہیں جو اسے (یہ کہتے ہوئے) پکارتے ہیں کہ ہمارے پاس آ‘ تا ہدایت پائے۔ تو (ان کافروں سے) کہہ دے کہ یقیناً اللہ کی ہدایت ہی اصل ہدایت ہے اور ہمیں حکم دیا گیا ہے کہ ہم سب جہانوں کے رب کی فرمانبرداری کریں۔"}, {"arabic": " وَ اَنۡ اَقِیۡمُوا الصَّلٰوۃَ وَ اتَّقُوۡہُ ؕ وَ ہُوَ الَّذِیۡۤ اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۷۳﴾", "english": " “And we have been given the command : ‘Observe Prayer and fear Him;’ and He it is to Whom you shall be gathered.”", "french": " Et nous avons reçu ce commandement : « Observez la prière et craignez-Le, » c’est vers Lui que vous serez rassemblés.", "german": " Und: \"Verrichtet das Gebet und fürchtet Ihn\", und Er ist es, zu Dem ihr versammelt werdet.»", "spanish": " “Se nos ha dado la orden: “Cumplid la Oración y temedle”; pues junto a Él seréis reunidos”.", "urdu": " اور یہ (بھی ہدایت دی گئی ہے) کہ نمازوں کو باشرائط ادا کرو اور اس (خدا) کو اپنی ڈھال بناٶ۔ اور وہی ہے جس کی طرف تم اکٹھے کرکے لے جائے جاٶ گے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ ؕ وَ یَوۡمَ یَقُوۡلُ کُنۡ فَیَکُوۡنُ ۬ؕ قَوۡلُہُ الۡحَقُّ ؕ وَ لَہُ الۡمُلۡکُ یَوۡمَ یُنۡفَخُ فِی الصُّوۡرِ ؕ عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ ؕ وَ ہُوَ الۡحَکِیۡمُ الۡخَبِیۡرُ ﴿۷۴﴾", "english": " And He it is Who created the heavens and the earth in accordance with the requirements of wisdom; and the day He says, ‘Be!’, it will be. His word is the truth, and His will be the kingdom on the day when the trumpet will be blown. He is the Knower of the unseen and the seen. And He is the Wise, the All-Aware.", "french": " Et c’est Lui Qui a créé les cieux et la terre de façon correcte ; et le jour où Il dira : « Sois, » et la chose commence à être. Sa parole est la vérité, et c’est à Lui le royaume le jour où l’on sonnera de la trompe. Il est le Connaisseur de l’invisible et du visible. Et Il est le Sage, le Très-Conscient.", "german": " Er ist es, Der die Himmel und die Erde erschuf in Weisheit; und dem Tage, da Er spricht \"Es werde!\" und es wird sein. Sein Wort ist die Wahrheit, und Sein ist das Reich an dem Tage, da in die Posaune geblasen wird. Kenner des Verborgenen und des Offenbaren – Er ist der Allweise, der Allwissende.", "spanish": " Pues Él es quien creó los cielos y la tierra de la manera correcta; y el día que Él diga “¡Sea!”, será. Su Palabra es la verdad, y Suyo será el Reino el día en que sea tocada la trompeta. Él es quien conoce lo invisible y lo visible. Pues Él es el Sabio, el Omnisapiente.", "urdu": " اور وہی ہے جس نے آسمانوں اور زمین کو حق (وحکمت) کے ساتھ پیدا کیا ہے اور جس دن وہ کہے گا کہ (میرے منشا کے مطابق یوں) ہو جائے (اسی طرح) ہو جائے گا۔ اس کی بات ہو کر رہنے والی ہے اور جس دن صور پھونکا جائے گا حکومت (صرف) اسی کو (حاصل) ہوگی (وہ) پوشیدہ اور ظاہر (باتوں) کا جاننے والا ہے اور وہ حکمت والا (اور) خبردار ہے۔"}, {"arabic": " وَ اِذۡ قَالَ اِبۡرٰہِیۡمُ لِاَبِیۡہِ اٰزَرَ اَتَتَّخِذُ اَصۡنَامًا اٰلِہَۃً ۚ اِنِّیۡۤ اَرٰٮکَ وَ قَوۡمَکَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۷۵﴾", "english": " And remember the time when Abraham said to his father, Azar: ‘Dost thou take idols for gods? Surely, I see thee and thy people in manifest error.’", "french": " Et souviens-toi lorsque Abraham dit à son père, Azar : « Prends-tu des idoles pour dieux ? En vérité, je te vois ainsi que ton peuple dans une erreur manifeste. »", "german": " Und (denke daran) wie Abraham zu seinem Vater Azar sprach: \"Nimmst du Götzenbilder zu Göttern? Ich sehe dich und dein Volk in offenbarer Irrung.\"", "spanish": " Y acuérdate de cuando Abraham dijo a Azar, su padre: “¿Tomas a los ídolos por dioses? En verdad, os veo a ti y a tu pueblo en un error manifiesto”.", "urdu": " اور (یاد کرو) جب ابراہیم نے اپنے باپ آزر سے یہ کہا کہ کیا تو (بعض) بتوں کو معبود بناتا ہے۔ میں تجھے اور تیری قوم کو کھلی (کھلی) گمراہی میں پاتا ہوں۔"}, {"arabic": " وَ کَذٰلِکَ نُرِیۡۤ اِبۡرٰہِیۡمَ مَلَکُوۡتَ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ لِیَکُوۡنَ مِنَ الۡمُوۡقِنِیۡنَ ﴿۷۶﴾", "english": " And thus did We show Abraham the kingdom of the heavens and the earth that he might be rightly guided and that he might be of those who have certainty of faith.", "french": " Et ainsi, Nous avons montré la réalité du royaume des cieux et de la terre à Abraham, pour qu’il fût du nombre de ceux qui croient avec certitude.", "german": " Also zeigten Wir Abraham das Reich der Himmel und der Erde, (auf dass er rechtgeleitet sei) und er zu den Festen im Glauben zählen möchte.", "spanish": " Y así mostramos a Abraham el Reino de los cielos y la tierra para que fuera rectamente guiado y se contara entre los que tienen la certeza de la fe.", "urdu": " اور ہم ابراہیم کو اس طرح آسمانوں اور زمینوں پر (اپنی) بادشاہت دکھاتے تھے (تا اس کا علم کامل ہو) اور تا کہ وہ یقین کرنے والوں میں سے ہو جائے۔"}, {"arabic": " فَلَمَّا جَنَّ عَلَیۡہِ الَّیۡلُ رَاٰ کَوۡکَبًا ۚ قَالَ ہٰذَا رَبِّیۡ ۚ فَلَمَّاۤ اَفَلَ قَالَ لَاۤ اُحِبُّ الۡاٰفِلِیۡنَ ﴿۷۷﴾", "english": " And when the night darkened upon him, he saw a star. He said: ‘This is my Lord!’ But when it set, he said: ‘I like not those that set.’", "french": " Et lorsque la nuit tomba sur lui, il vit une étoile. Il dit : « Voilà mon Seigneur. » Mais quand elle disparut, il dit : « Je n’aime pas ceux qui disparaissent. »", "german": " Als nun die Nacht ihn überschattete, da erblickte er einen Stern. Er sprach: \"Ist das mein Herr?\" Doch da er unterging, sprach er: \"Ich liebe nicht die Untergehenden.\"", "spanish": " Cuando la noche lo cubrió, vio a una estrella. Dijo: “¡Éste es mi Señor!”. Mas cuando desapareció, dijo: “No me gustan los que desaparecen”.", "urdu": " (ایک دن ایسا ہوا کہ) جب رات نے اس پر پردہ ڈال دیا تو اس نے ایک ستارہ دیکھا (اسے دیکھ کر) اس نے کہا کہ کیا یہ میرا رب (ہو سکتا) ہے؟ پھر جب وہ ڈوب گیا‘ تو اس نے کہا کہ میں ڈوبنے والوں کو پسند نہیں کرتا۔"}, {"arabic": " فَلَمَّا رَاَ الۡقَمَرَ بَازِغًا قَالَ ہٰذَا رَبِّیۡ ۚ فَلَمَّاۤ اَفَلَ قَالَ لَئِنۡ لَّمۡ یَہۡدِنِیۡ رَبِّیۡ لَاَکُوۡنَنَّ مِنَ الۡقَوۡمِ الضَّآلِّیۡنَ ﴿۷۸﴾", "english": " And when he saw the moon rise with spreading light, he said: ‘This is my Lord.’ But when it set, he said, ‘If my Lord guide me not, I shall surely be of the people who go astray.’", "french": " Et lorsqu’il vit la lune se lever et répandre sa lumière, il dit : « Voici mon Seigneur. » Mais lorsqu’elle se coucha, il dit : « Si mon Seigneur ne me guide pas, je serais assurément du nombre des gens égarés. »", "german": " Als er den Mond sah, sein Licht ausbreitend, da sprach er: \"Ist das mein Herr?\" Doch da er unterging, sprach er: \"Hätte nicht mein Herr mich recht geleitet, wäre ich gewiss unter den Verirrten gewesen.\"", "spanish": " Cuando vio a la luna levantarse con su clara luz, dijo: “éste es mi Señor”. Pero cuando se puso, dijo: “Si mi Señor no me guía me contaré ciertamente entre los hombres que se extravían”.", "urdu": " (اس کے بعد) جب اس نے چاند چمکتا ہوا دیکھا تو اس نے کہا (کیا) یہ میرا رب (ہوسکتا) ہے؟ پھر جب وہ بھی غائب ہو گیا‘ تو اس نے کہا کہ اگر میرا رب مجھے ہدایت نہ دیتا تو میں ضرور گمراہوں کی جماعت میں سے ہوتا۔"}, {"arabic": " فَلَمَّا رَاَ الشَّمۡسَ بَازِغَۃً قَالَ ہٰذَا رَبِّیۡ ہٰذَاۤ اَکۡبَرُ ۚ فَلَمَّاۤ اَفَلَتۡ قَالَ یٰقَوۡمِ اِنِّیۡ بَرِیۡٓءٌ مِّمَّا تُشۡرِکُوۡنَ ﴿۷۹﴾", "english": " And when he saw the sun rise with spreading light, he said: ‘This is my Lord, this is the greatest.’ But when it set, he said, ‘O my people, surely I am clear of that which you associate with God .", "french": " Et quand il vit le soleil se lever et répandre sa lumière, il dit : « Voici mon Seigneur ; celui-ci est le plus grand de tous . » Mais quand lui aussi se coucha, il dit : « Ô mon peuple, me voici déchargé totalement de ce que vous associez à Allāh .", "german": " Als er die Sonne sah, ihr Licht ausbreitend, da sprach er: \"Ist das mein Herr, das ist das Größte?\" Da sie aber unterging, sprach er: \"O mein Volk, ich habe nichts zu tun mit dem, was ihr anbetet.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=6:79&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=6:79&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic80\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic80\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/6:80' style='text-decoration:underline'>6:80</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(80)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control80\"></i></button> <audio id=\"player80\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنِّیۡ وَجَّہۡتُ وَجۡہِیَ لِلَّذِیۡ فَطَرَ السَّمٰوٰتِ وَ الۡاَرۡضَ حَنِیۡفًا وَّ مَاۤ اَنَا مِنَ الۡمُشۡرِکِیۡنَ ﴿ۚ۸۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘I have turned my face toward Him Who created the heavens and the earth, being ever inclined <I>to God</I>, and I am not of those who associate gods <em>with God</em>.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_6_80_a' href='#'>a</a>]</sup>‘I have turned my face toward Him Who created the heavens and the earth, being ever inclined <i>to Allah</i>, and I am not of those who associate gods <i>with Him</i>.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_6_80_a'>a</span></div> <div><div class='reference' data-id='ref_6_80_a' style='display:none'> <p><b>a.</b> <a href='/quran/3:21' target=_blank>3:21</a>. (<a href='javascript:void(0)' data-id='ref_6_80_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">میں تو یقیناً اپنی توجّہ کو اس کی طرف ہمیشہ مائل رہتے ہوئے پھیر چکا ہوں جس نے آسمانوں اور زمین کو پیدا کیا اور میں مشرکوں میں سے نہیں ہوں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">میں نے (تمام) کج راہیوں سے بچتے ہوئے یقیناً اپنی توجہ اس (خدا) کی طرف پھیر دی ہے جس نے آسمانوں اور زمین کو پیدا کیا ہے اور میں مشرکوں میں سے نہیں ہوں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">En vérité, j’ai tourné mon visage vers Celui Qui a créé les cieux et la terre, étant toujours incliné vers Lui, et je ne suis pas du nombre des associateurs<em>.</em> »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“He dirigido mi rostro hacia Él, el Creador de los cielos y la tierra, estando siempre inclinado <em>ante Dios</em> y no siendo de los que asocian otros dioses <em>a Dios.”</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Siehe, ich habe mein Angesicht in Aufrichtigkeit zu Dem gewandt, Der die Himmel und die Erde schuf, und ich gehöre nicht zu den Götzendienern.\"", "spanish": " Y cuando vio al sol levantarse con su esplendorosa luz, dijo: “éste es mi Señor, éste es el más grande”. Pero cuando se puso, dijo: “¡Oh, ueblo mío!, no soy en verdad responsable de lo que asociáis a Dios” ;", "urdu": " پھر جب اس نے سورج کو چمکتے ہوئے دیکھا تو اس نے کہا کہ (کیا) یہ میرا رب (ہوسکتا) ہے یہ بیشک سب سے بڑا ہے پھر جب وہ (بھی) غائب ہو گیا تو اس نے کہا کہ میں اس سے جسے تم (خدا کا) شریک بناتے ہو بالکل بیزار ہوں۔"}, {"arabic": " اِنِّیۡ وَجَّہۡتُ وَجۡہِیَ لِلَّذِیۡ فَطَرَ السَّمٰوٰتِ وَ الۡاَرۡضَ حَنِیۡفًا وَّ مَاۤ اَنَا مِنَ الۡمُشۡرِکِیۡنَ ﴿ۚ۸۰﴾", "english": " ‘I have turned my face toward Him Who created the heavens and the earth, being ever inclined to God , and I am not of those who associate gods with God .’", "french": " En vérité, j’ai tourné mon visage vers Celui Qui a créé les cieux et la terre, étant toujours incliné vers Lui, et je ne suis pas du nombre des associateurs . »", "german": " Siehe, ich habe mein Angesicht in Aufrichtigkeit zu Dem gewandt, Der die Himmel und die Erde schuf, und ich gehöre nicht zu den Götzendienern.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=6:80&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=6:80&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic81\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic81\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/6:81' style='text-decoration:underline'>6:81</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(81)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control81\"></i></button> <audio id=\"player81\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ حَآجَّہٗ قَوۡمُہٗ ؕ قَالَ اَتُحَآجُّوۡٓنِّیۡ فِی اللّٰہِ وَ قَدۡ ہَدٰٮنِ ؕ وَ لَاۤ اَخَافُ مَا تُشۡرِکُوۡنَ بِہٖۤ اِلَّاۤ اَنۡ یَّشَآءَ رَبِّیۡ شَیۡئًا ؕ وَسِعَ رَبِّیۡ کُلَّ شَیۡءٍ عِلۡمًا ؕ اَفَلَا تَتَذَکَّرُوۡنَ ﴿۸۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And his people argued with him. He said: ‘Do you argue with me concerning Allah when He has guided me aright? And I fear not that which you associate with Him, unless my Lord will something. My Lord comprehends all things in His knowledge. Will you not then be admonished?</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And his people argued with him. He said, ‘Do you argue with me concerning Allah when He has guided me aright? And I fear not that which you associate with Him except <i>that I </i>fear what my Lord wills. <sup class='ref'>[<a class='ref' data-id='ref_6_81_b' href='#'>b</a>]</sup>My Lord comprehends all things in His knowledge. Will you not then be admonished? <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_6_81_b'>b</span></div> <div><div class='reference' data-id='ref_6_81_b' style='display:none'> <p><b>b.</b> <a href='/quran/7:90' target=_blank>7:90</a>. (<a href='javascript:void(0)' data-id='ref_6_81_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اس کی قوم اس سے جھگڑتی رہی۔ اس نے کہا کیا تم اللہ کے بارہ میں مجھ سے جھگڑتے ہو جبکہ وہ مجھے ہدایت دے چکا ہے اور میں ان چیزوں (کے گزند) سے بالکل نہیں ڈرتا جنہیں تم اس کا شریک بنا رہے ہو۔ (میں کچھ نہیں چاہتا) سوائے اس کے کہ میرا ربّ کچھ چاہے۔ میرا ربّ ہر چیز پر علم کے لحاظ سے حاوی ہے۔ پس کیا تم نصیحت نہیں پکڑو گے ؟</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اس کی قوم نے اس سے بحث کرکے جیتنا چاہا (تو) اس نے کہا کہ کیا تم مجھ سے اللہ کے بارہ میں بحث کرتے ہو حالانکہ اس نے خود مجھے ہدایت دی ہے اور جسے تم اللہ کا شریک بناتے ہو میں اس سے نہیں ڈرتا۔ ہاں اگر میرا رب کسی بات کا ارادہ کرے (تو اس سے ڈرتا ہوں) میرے رب نے ہر اک چیز کا علم سے احاطہ کیا ہوا ہے پھر کیا تم سمجھتے نہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et son peuple discuta avec lui. Il dit : « Discuterez-vous avec moi au sujet d’Allāh, qui m’a guidé <em>sur le droit chemin</em> ? Et je ne crains pas les associés que vous Lui donnez, sauf ce que veut mon Seigneur. Dans Sa science, mon Seigneur comprend toutes choses. Ne voulez-vous donc pas être avertis ?</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y su pueblo discutió con él. Y dijo: “¿Discutís conmigo respecto a Al-lah, siendo así que Él me ha guiado por el camino recto? Mas yo no temo a lo que asociáis a Él, a menos que mi Señor quiera algo. Mi Señor abarca todas las cosas en Su conocimiento ¿no estaréis, pues, prevenidos?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und sein Volk stritt mit ihm. Da sagte er: \"Streitet ihr mit mir über Allah, da Er mich schon recht geleitet hat? Und ich fürchte nicht das, was ihr Ihm zur Seite stellt, sondern nur das, was mein Herr will. Mein Herr umfasst alle Dinge mit Wissen. Wollt ihr denn nicht verstehen?", "spanish": " “He dirigido mi rostro hacia Él, el Creador de los cielos y la tierra, estando siempre inclinado ante Dios y no siendo de los que asocian otros dioses a Dios.”", "urdu": " میں نے (تمام) کج راہیوں سے بچتے ہوئے یقیناً اپنی توجہ اس (خدا) کی طرف پھیر دی ہے جس نے آسمانوں اور زمین کو پیدا کیا ہے اور میں مشرکوں میں سے نہیں ہوں۔"}, {"arabic": " وَ کَیۡفَ اَخَافُ مَاۤ اَشۡرَکۡتُمۡ وَ لَا تَخَافُوۡنَ اَنَّکُمۡ اَشۡرَکۡتُمۡ بِاللّٰہِ مَا لَمۡ یُنَزِّلۡ بِہٖ عَلَیۡکُمۡ سُلۡطٰنًا ؕ فَاَیُّ الۡفَرِیۡقَیۡنِ اَحَقُّ بِالۡاَمۡنِ ۚ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿ۘ۸۲﴾", "english": " ‘And why should I fear that which you associate with God , when you fear not to associate with Allah that for which He has sent down to you no authority?’ Which, then, of the two parties has greater right to security, if indeed you know?", "french": " Et pourquoi craindrais-je les associés que vous Lui donnez, puisque vous-mêmes vous ne craignez pas de donner à Allāh des associés ce pour quoi Il ne vous a transmis aucune autorité ? » Lequel donc des deux partis à davantage droit à la sécurité, si vous le savez vraiment ?", "german": "", "spanish": " “Y ¿por qué he de temer a lo que asociáis a Dios , si vosotros no teméis asociar a Al-lah aquello para lo que no os ha dado Él autoridad alguna?”. ¿Cuál de las dos partes tiene mayor derecho a la seguridad, si es que en verdad lo sabéis?", "urdu": " اور میں اس (چیز) سے جسے تم (خدا کا) شریک بناتے ہو کس طرح ڈر سکتا ہوں جبکہ اس (چیز) کو جس کے متعلق اس نے تم پر کوئی دلیل نہیں اتاری‘ تم اللہ کا شریک بنانے سے نہیں ڈرتے سو اگر تم (کچھ) علم رکھتے ہو تو (بتاٶ کہ) ہم دونوں فریق میں سے کونسا امن (میں رہنے) کا زیادہ مستحق ہے۔"}, {"arabic": " اَلَّذِیۡنَ اٰمَنُوۡا وَ لَمۡ یَلۡبِسُوۡۤا اِیۡمَانَہُمۡ بِظُلۡمٍ اُولٰٓئِکَ لَہُمُ الۡاَمۡنُ وَ ہُمۡ مُّہۡتَدُوۡنَ ﴿٪۸۳﴾", "english": " Those who believe and mix not up their belief with injustice — it is they who shall have peace, and who are rightly guided.", "french": " Ceux qui croient et ne mettent pas en doute leur croyance par quelque injustice, ceux-là jouiront de la paix et ils sont bien guidés.", "german": " Die da glauben und ihren Glauben nicht mit Ungerechtigkeit vermengen – sie sind es, die Frieden haben sollen und die rechtgeleitet sind.", "spanish": " Quienes creen y no disfrazan su fe con la injusticia: son los que tendrán la paz y serán correctamente guiados.", "urdu": " جو لوگ ایمان لے آئے اور انہوں نے اپنے ایمان کو ظلم سے مخلوط نہیں کیا انہی لوگوں کے لئے امن (مقدر) ہے اور وہی ہدایت پانے والے ہیں۔"}, {"arabic": " وَ تِلۡکَ حُجَّتُنَاۤ اٰتَیۡنٰہَاۤ اِبۡرٰہِیۡمَ عَلٰی قَوۡمِہٖ ؕ نَرۡفَعُ دَرَجٰتٍ مَّنۡ نَّشَآءُ ؕ اِنَّ رَبَّکَ حَکِیۡمٌ عَلِیۡمٌ ﴿۸۴﴾", "english": " And that is Our argument which We gave to Abraham against his people. We exalt in degrees of rank whomso We please. Thy Lord is indeed Wise, All-Knowing.", "french": " Et tel est Notre argument que Nous avons donné à Abraham contre son peuple. Nous élevons en rang par degrés qui Nous voulons. Ton Seigneur est en vérité Sage, Omniscient.", "german": " Das ist Unser Beweis, den Wir Abraham seinem Volk gegenüber gaben. Wir erheben in den Rängen, wen Wir wollen. Siehe, dein Herr ist allweise, allwissend.", "spanish": " Ése es el argumento que dimos a Abraham frente a su gente. Pues exaltamos en distintos rangos de dignidad a quien Nos place. Tu Señor es ciertamente Sabio, Omnisciente.", "urdu": " اور یہ ہماری طرف سے (دی ہوئی ایک) دلیل تھی‘ (جو) ہم نے ابراہیم کو اس کی قوم کے خلاف سکھائی تھی‘ ہم جسے چاہتے ہیں درجوں میں بلند کرتے ہیں۔ تیرا رب یقیناً حکمت والا (اور) خوب جاننے والا ہے۔"}, {"arabic": " وَ وَہَبۡنَا لَہٗۤ اِسۡحٰقَ وَ یَعۡقُوۡبَ ؕ کُلًّا ہَدَیۡنَا ۚ وَ نُوۡحًا ہَدَیۡنَا مِنۡ قَبۡلُ وَ مِنۡ ذُرِّیَّتِہٖ دَاوٗدَ وَ سُلَیۡمٰنَ وَ اَیُّوۡبَ وَ یُوۡسُفَ وَ مُوۡسٰی وَ ہٰرُوۡنَ ؕ وَ کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿ۙ۸۵﴾", "english": " And We gave him Isaac and Jacob; each did We guide aright, and Noah did We guide aright aforetime, and of his progeny, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward those who do good.", "french": " Et Nous lui avons donné Isaac et Jacob ; Nous avons guidé tous les deux sur le droit chemin et auparavant, Nous avons guidé Noé, et parmi ses descendants, David et Salomon et Job et Joseph et Moïse et Aaron. C’est ainsi que Nous récompensons ceux qui font le bien.", "german": " Wir schenkten ihm Isaak und Jakob; jeden leiteten Wir recht, wie Wir vordem Noah recht geleitet hatten und von seinen Nachfahren David und Salomo und Hiob und Joseph und Moses und Aaron. Also belohnen Wir die Wirker des Guten.", "spanish": " Y le dimos a Isaac y a Jacob; guiamos rectamente a cada uno de ellos como guiamos anteriormente a Noé y, de su descendencia, a David y Salomón, a Job y José, a Moisés y Aarón. Así recompensamos a los que hacen el bien.", "urdu": " اور ہم نے اس (یعنی ابراہیم کو) اسحاق اور یعقوب دئے تھے‘ ہم نے (ان) سب کو ہدایت دی تھی اور (اس سے) پہلے ہم نے نوح کو ہدایت دی تھی اور اس (یعنی ابراہیم) کی اولاد میں سے داو‘د اور سلیمان اور ایوب اور یوسف اور موسیٰ اور ہارون کو (بھی) اور اسی طرح ہم اچھی طرح کام کرنے والوں کو بدلہ دیا کرتے ہیں۔"}, {"arabic": " وَ زَکَرِیَّا وَ یَحۡیٰی وَ عِیۡسٰی وَ اِلۡیَاسَ ؕ کُلٌّ مِّنَ الصّٰلِحِیۡنَ ﴿ۙ۸۶﴾", "english": " And We guided Zachariah and John and Jesus and Elias; each one of them was of the virtuous.", "french": " Et Nous avons guidé Zacharie et Jean et Jésus et Elie ; chacun d’eux était du nombre des justes.", "german": " Und (Wir leiteten) Zacharias und Johannes und Jesus und Elias; alle gehörten sie zu den Rechtschaffenen.", "spanish": " Y guiamos a Zacarías y Juan, a Jesús y Elías, cada uno de ellos estaba entre los virtuosos.", "urdu": " اور زکریا اور یحییٰ اور عیسیٰ اور الیاس کو بھی (ہدایت دی تھی) (یہ) سب کے سب نیکوں میں سے تھے۔"}, {"arabic": " وَ اِسۡمٰعِیۡلَ وَ الۡیَسَعَ وَ یُوۡنُسَ وَ لُوۡطًا ؕ وَ کُلًّا فَضَّلۡنَا عَلَی الۡعٰلَمِیۡنَ ﴿ۙ۸۷﴾", "english": " And We also guided Ishmael and Elisha and Jonah and Lot; and each one did We exalt above the people.", "french": " Et Nous avons aussi guidé Ismaël et Elisée et Jonas et Lot. Et Nous avons élevé chacun d’eux au-dessus des gens de son époque.", "german": " Und (Wir leiteten) Ismael und Elisa und Jonas und Lot; sie alle zeichneten Wir aus unter den Völkern.", "spanish": " Y guiamos también a Ismael y Eliseo, a Jonás y Lot; a cada uno de ellos lo ensalzamos sobre los hombres.", "urdu": " اور اسماعیل اور الیسع اور یونس اور لوط کو (بھی ہدایت دی تھی) اور ان سب کو ہم نے تمام جہانوں پر فضیلت دی تھی۔"}, {"arabic": " وَ مِنۡ اٰبَآئِہِمۡ وَ ذُرِّیّٰتِہِمۡ وَ اِخۡوَانِہِمۡ ۚ وَ اجۡتَبَیۡنٰہُمۡ وَ ہَدَیۡنٰہُمۡ اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۸۸﴾", "english": " And We exalted some of their fathers and their children and their brethren, and We chose them and We guided them in the straight path.", "french": " Et Nous avons élevé certains d’entre leurs pères et leurs enfants et leurs frères, et Nous les avons choisis et Nous les avons guidés vers le droit chemin.", "german": " Ebenso manche von ihren Vätern und ihren Kindern und ihren Brüdern: Wir erwählten sie und leiteten sie auf den geraden Weg.", "spanish": " Y ensalzamos a algunos de sus padres, sus hijos y sus hermanos; los elegimos y los guiamos por el camino recto.", "urdu": " اور ان کے باپ دادوں اور ان کی اولاد اور ان کے بھائیوں کو (بھی ہم نے ہدایت دی تھی) اور ہم نے انہیں چن لیا تھا اور انہیں سیدھے راستہ کی طرف راہنمائی کی تھی۔"}, {"arabic": " ذٰلِکَ ہُدَی اللّٰہِ یَہۡدِیۡ بِہٖ مَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ ؕ وَ لَوۡ اَشۡرَکُوۡا لَحَبِطَ عَنۡہُمۡ مَّا کَانُوۡا یَعۡمَلُوۡنَ ﴿۸۹﴾", "english": " That is the guidance of Allah. He guides thereby those of His servants whom He pleases. And if they had worshipped aught beside Him, surely all they did would have been of no avail to them.", "french": " Telle est la direction d’Allāh, par laquelle Il guide qui Il veut parmi Ses serviteurs. Et s’ils avaient donné des associés à Allāh , il est certain que tout ce qu’ils avaient fait ne leur aurait servi à rien.", "german": " Das ist der Weg Allahs; damit leitet Er von Seinen Dienern, wen Er will. Hätten sie aber anderes angebetet, wahrlich, nichts hätte ihnen all ihr Tun gefruchtet.", "spanish": " Ésa es la guía de Al-lah. Mediante ella encamina a aquellos de sus siervos que Le place. Pero si hubiesen adorado a cualquier cosa fuera de Él, en verdad todo lo que hicieron no les habría servido de nada.", "urdu": " اللہ کے ہدایت دینے کا یہی طریق ہے جس کے ذریعہ سے وہ اپنے بندوں میں سے جسے چاہتا ہے راہ دکھاتا ہے اور اگر وہ شرک کرتے تو جو کچھ وہ اعمال کرتے تھے ان سے ضائع ہوجاتے۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ وَ الۡحُکۡمَ وَ النُّبُوَّۃَ ۚ فَاِنۡ یَّکۡفُرۡ بِہَا ہٰۤؤُلَآءِ فَقَدۡ وَکَّلۡنَا بِہَا قَوۡمًا لَّیۡسُوۡا بِہَا بِکٰفِرِیۡنَ ﴿۹۰﴾", "english": " It is these to whom We gave the Book and dominion and prophethood. But if these people are ungrateful for them, it matters not , for We have now entrusted them to a people who are not ungrateful for them.", "french": " C’est à eux que Nous avons donné le Livre, la faculté du jugement et le prophétat – nubuwwah- . Mais ils n’en sont pas reconnaissants ; mais cela n’a pas d’importance , car, maintenant, cette affaire-là Nous l’avons confiée à un peuple qui ne la reniera pas.", "german": " Diese sind es, denen Wir die Schrift gaben und die Weisheit und das Prophetentum. Wenn aber diese das (Prophetentum) leugnen, dann haben Wir es einem Volke anvertraut, das es nicht leugnet.", "spanish": " Éstos son a quienes entregamos el Libro, la facultad de juzgar y la rofecía. Pero si estos hombres son ingratos con ellos, no importa, pues ya los hemos confiado a un pueblo que no es desagradecido con ellos.", "urdu": " وہی لوگ ہیں جنہیں ہم نے کتاب اور فیصلہ کرنے کی فراست اور نبوت دی تھی۔ پس اگر یہ لوگ اس (نبوت) کا انکار کریں تو ہم نے اسے ایک (اور) قوم (یعنی مسلمانوں) کے سپرد کر دیا ہے جو اس کے منکر نہیں ہیں۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ ہَدَی اللّٰہُ فَبِہُدٰٮہُمُ اقۡتَدِہۡ ؕ قُلۡ لَّاۤ اَسۡـَٔلُکُمۡ عَلَیۡہِ اَجۡرًا ؕ اِنۡ ہُوَ اِلَّا ذِکۡرٰی لِلۡعٰلَمِیۡنَ ﴿٪۹۱﴾", "english": " These it is whom Allah guided aright, so follow thou their guidance. Say: ‘I ask not of you any reward for it. This is naught but an admonition for all mankind.’", "french": " Voilà ceux qu’Allāh a dirigés sur le droit chemin . Suis donc leur direction. Dis : « Je ne vous en demande aucune récompense. Ce n’est là qu’une admonestation à tous les hommes. »", "german": " Das sind jene, die Allah recht geleitet hat: so folge ihrem Weg. Sprich: \"Ich verlange von euch keinen Lohn dafür. Es ist ja nichts anderes als eine Ermahnung für die ganze Menschheit.\"", "spanish": " Éstos son aquellos a quienes Al-lah guió rectamente; seguid, pues, sus instrucciones. Diles: “No os pido recompensa alguna por ello. Esto no es más que una exhortación para toda la humanidad”.", "urdu": " انہی (مذکورہ بالا لوگوں) کو اللہ نے ہدایت دی۔ پس تو ان کی ہدایت کی پیروی کر۔ تو ان سے کہہ دے کہ میں اس پر تم سے کوئی مزدوری نہیں مانگتا۔ یہ تو صرف تمام جہانوں کے لئے ایک نصیحت ہے۔"}, {"arabic": " وَ مَا قَدَرُوا اللّٰہَ حَقَّ قَدۡرِہٖۤ اِذۡ قَالُوۡا مَاۤ اَنۡزَلَ اللّٰہُ عَلٰی بَشَرٍ مِّنۡ شَیۡءٍ ؕ قُلۡ مَنۡ اَنۡزَلَ الۡکِتٰبَ الَّذِیۡ جَآءَ بِہٖ مُوۡسٰی نُوۡرًا وَّ ہُدًی لِّلنَّاسِ تَجۡعَلُوۡنَہٗ قَرَاطِیۡسَ تُبۡدُوۡنَہَا وَ تُخۡفُوۡنَ کَثِیۡرًا ۚ وَ عُلِّمۡتُمۡ مَّا لَمۡ تَعۡلَمُوۡۤا اَنۡتُمۡ وَ لَاۤ اٰبَآؤُکُمۡ ؕ قُلِ اللّٰہُ ۙ ثُمَّ ذَرۡہُمۡ فِیۡ خَوۡضِہِمۡ یَلۡعَبُوۡنَ ﴿۹۲﴾", "english": " And they do not make a just estimate of Allah, when they say: ‘Allah has not revealed anything to any man.’ Say: ‘Who revealed the Book which Moses brought, a light and guidance for the people — though you treat it as scraps of paper which you show while you conceal much; and you have been taught that which neither you nor your fathers knew?’ — Say: ‘Allah’. Then leave them to amuse themselves with their vain discourse.", "french": " Ils n’estiment pas Allāh de l’estime qui Lui est due lorsqu’ils dirent : « Allāh n’a rien révélé à quelque humain. » Dis : « Qui a révélé le Livre apporté par Moïse, comme une lumière et une direction pour les hommes ? Vous les traitiez comme des chiffons de papier en en montrant quelques-uns et en en cachant la plupart alors qu’il vous a été enseigné ce que ni vous ni vos pères ne savaient. » Dis : « Allāh. » Ensuite, laisse-les s’amuser avec leurs vains discours.", "german": " Sie würdigen Allah nicht wie es ihm gebührt, wenn sie sagen: \"Allah hat keinem Menschen irgendetwas herabgesandt.\" Sprich: \"Wer sandte das Buch nieder, das Moses brachte als ein Licht und eine Führung für die Menschen – ob ihr es gleich als Fetzen Papier behandelt, die ihr zeigt, während ihr viel verbergt –, und doch ist euch das gelehrt worden, was weder ihr noch eure Väter wussten?\" Sprich: \"Allah!\" Dann lass sie sich weiter vergnügen an ihrem eitlen Geschwätz.", "spanish": " Mas fracasaron en respetar a Al-lah como se merece cuando dijeron: “Al-lah no ha revelado nada a ningún hombre”. Diles: “¿Quién reveló el Libro que trajo Moisés, luz y guía para los hombres – aunque lo tratáis como pedazos de papel que mostráis, al mismo tiempo que ocultáis gran parte; y se os ha enseñado lo que no sabíais ni vosotros ni vuestros padres?”-. Diles: “¡Al-lah! Y déjalos luego que se diviertan con sus vanas discusiones.", "urdu": " اور جب انہوں نے یہ بات کہی تھی کہ اللہ نے کسی بندے پر کچھ نہیں اتارا تو ان لوگوں نے اللہ (کی صفات) کا اندازہ اس طرح نہیں کیا تھا جس طرح کرنا چاہیے۔ تو (ان سے) کہہ دے کہ وہ کتاب جو موسیٰ لائے تھے اور وہ لوگوں کے لئے نور اور ہدایت تھی۔ اس کو کس نے اتارا تھا تم اسے ورق ورق کر رہے ہو اس کو ظاہر (بھی) کرتے ہو اور (اس میں سے) بہت (حصوں) کو چھپاتے (بھی) ہو۔ حالانکہ تمہیں وہ (کچھ) سکھایا گیا ہے جو نہ تم جانتے تھے اور نہ تمہارے باپ دادے (جانتے تھے) تو (ان سے) کہہ دے کہ اللہ نے (ہی اسے اتارا تھا) پھر تو انہیں ان کے جھوٹ میں کھیلتے ہوئے چھوڑ دے۔"}, {"arabic": " وَ ہٰذَا کِتٰبٌ اَنۡزَلۡنٰہُ مُبٰرَکٌ مُّصَدِّقُ الَّذِیۡ بَیۡنَ یَدَیۡہِ وَ لِتُنۡذِرَ اُمَّ الۡقُرٰی وَ مَنۡ حَوۡلَہَا ؕ وَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ یُؤۡمِنُوۡنَ بِہٖ وَ ہُمۡ عَلٰی صَلَاتِہِمۡ یُحَافِظُوۡنَ ﴿۹۳﴾", "english": " And this is a Book which We have revealed, full of blessings, to fulfil that which preceded it, and to enable thee to warn the Mother of towns and those around her. And those who believe in the Hereafter believe therein and they keep a watch over their Prayer.", "french": " Et ceci est un Livre que Nous avons révélé, plein de bénédictions, accomplissant celui qui l’a précédé afin que tu avertisses la Mère des villes, et les habitants tout autour. Et ceux qui croient à l’au-delà croient à ceci, et ils surveillent leur Prière avec vigilance.", "german": " Dies ist ein Buch, das Wir hinabsandten, voll des Segens, Erfüller dessen, was vor ihm war, auf dass du die Mutter der Städte und die rings um sie (Wohnenden) verwarnest. Die an das Kommende glauben, die glauben daran, und sie halten streng ihre Gebete.", "spanish": " Pues éste es un Libro que hemos revelado, lleno de bendiciones, para cumplir lo que le precedió y para permitirte advertir a la madre de las ciudades y a todos los de su alrededor. Y quienes creen en el Más Allá creen en él y cumplen atentamente su Oración.", "urdu": " اور یہ (قرآن) ایک (عظیم الشان) کتاب ہے جسے ہم نے اتارا ہے (اور وہ) برکات کی جامع ہے (اور) جو (کلام) اس سے پہلے تھا اس کو پورا کرنے والی ہے (اور ہم نے اسے اس لئے اتارا ہے کہ تو اس کے ذریعہ سے لوگوں کو ہدایت دے) اور تا کہ تو ام القریٰ (یعنی اہل مکہ) کو اور جو اس کے ارد گرد (رہتے) ہیں ڈرائے اور جو لوگ پیچھے آنے والی (موعود باتوں) پر ایمان لاتے ہیں وہ اس (کتاب) یعنی (قرآن) پر (بھی) ایمان لاتے ہیں اور وہ اپنی نمازوں کا ہمیشہ خیال رکھتے ہیں۔"}, {"arabic": " وَ مَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا اَوۡ قَالَ اُوۡحِیَ اِلَیَّ وَ لَمۡ یُوۡحَ اِلَیۡہِ شَیۡءٌ وَّ مَنۡ قَالَ سَاُنۡزِلُ مِثۡلَ مَاۤ اَنۡزَلَ اللّٰہُ ؕ وَ لَوۡ تَرٰۤی اِذِ الظّٰلِمُوۡنَ فِیۡ غَمَرٰتِ الۡمَوۡتِ وَ الۡمَلٰٓئِکَۃُ بَاسِطُوۡۤا اَیۡدِیۡہِمۡ ۚ اَخۡرِجُوۡۤا اَنۡفُسَکُمۡ ؕ اَلۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ الۡہُوۡنِ بِمَا کُنۡتُمۡ تَقُوۡلُوۡنَ عَلَی اللّٰہِ غَیۡرَ الۡحَقِّ وَ کُنۡتُمۡ عَنۡ اٰیٰتِہٖ تَسۡتَکۡبِرُوۡنَ ﴿۹۴﴾", "english": " And who is more unjust than he who forges a lie against Allah, or says, ‘It has been revealed to me,’ while nothing has been revealed to him; and who says, ‘I will send down the like of that which Allah has sent down?’ And if thou couldst only see, when the wrongdoers are in the agonies of death, and the angels stretch forth their hands, saying , ‘Yield up your souls. This day shall you be awarded the punishment of disgrace, because of that which you spoke against Allah falsely and because you turned away from His Signs with disdain.’", "french": " Et qui est plus injuste que celui qui invente un mensonge contre Allāh, ou qui dit : « Il m’a été révélé ceci , » alors que rien ne lui a été révélé ; et qui dit : « Je ferai descendre une révélation pareille à celle qu’Allāh a fait descendre ? » Et si tu voyais, lorsque les impies sont dans les affres de la mort, et que les anges tendent leurs mains, en disant : « Rendez vos âmes ; c’est aujourd’hui que vous sera infligé le châtiment de l'humiliation pour ce que vous disiez sur Allāh d’autre que la vérité, et parce que vous vous détourniez de Nos Signes avec orgueil. »", "german": " Wer ist ungerechter, als wer eine Lüge wider Allah erdichtet oder spricht: \"Mir ward offenbart\", während ihm doch nichts offenbart worden, und wer da spricht: \"Ich werde dergleichen hinabsenden, wie Allah hinabgesandt hat.\"? Aber könntest du die Frevler nur sehen in des Todes Schlünden, wenn die Engel ihre Hände ausstrecken: \"Liefert eure Seelen aus! Heute sei die Strafe der Schande euer Lohn um dessentwillen, was ihr Falsches wider Allah gesprochen, und weil ihr euch mit Verachtung abwandtet von Seinen Zeichen.\"", "spanish": " ¿Quién es más injusto que quien inventa una mentira contra Al-lah o dice: “me ha sido revelado”, cuando nada le fue revelado; y quien dice: “haré descender algo similar a lo que Al-lah ha hecho descender”. ¡Ojalá pudieras ver a los malhechores en la agonía de la muerte y a los ángeles extender sus manos diciendo : “¡entregad vuestras almas! Este día seréis pagados con el castigo de la desgracia, por lo que dijisteis en falso contra Al-lah y por haberos apartado con desdén de Sus Signos”.", "urdu": " اور اس شخص سے زیادہ ظالم کون ہو سکتا ہے جو جان بوجھ کر اللہ پر جھوٹ باندھے یا یہ کہے کہ مجھ پر وحی (نازل) کی گئی ہے حالانکہ اس پر وحی (نازل) نہ کی گئی ہو اور (اسی طرح) اس شخص سے (زیادہ ظالم کون ہو سکتا ہے) جو کہتا ہے کہ جو کچھ اللہ نے اتارا ہے میں بھی یقیناً ویسا ہی (کلام) اتار دوں گا۔ اور اگر تو (اس وقت کو) دیکھے جبکہ ظالم موت کی تکالیف میں مبتلا ہوں گے اور فرشتے (یہ کہتے ہوئے) اپنے ہاتھ پھیلا رہے ہوں گے کہ اپنی جانیں نکالو۔ جو کچھ تم اللہ کے متعلق ناحق کہتے تھے اور جو تم اس کی آیتوں کے بارے میں تکبر سے کام لیتے تھے اس کے سبب سے تمہیں آج رسوائی کا عذاب دیا جائے گا (تو تجھے ایک عبرت ناک نظارہ نظر آئے گا۔)"}, {"arabic": " وَ لَقَدۡ جِئۡتُمُوۡنَا فُرَادٰی کَمَا خَلَقۡنٰکُمۡ اَوَّلَ مَرَّۃٍ وَّ تَرَکۡتُمۡ مَّا خَوَّلۡنٰکُمۡ وَرَآءَ ظُہُوۡرِکُمۡ ۚ وَ مَا نَرٰی مَعَکُمۡ شُفَعَآءَکُمُ الَّذِیۡنَ زَعَمۡتُمۡ اَنَّہُمۡ فِیۡکُمۡ شُرَکٰٓؤُا ؕ لَقَدۡ تَّقَطَّعَ بَیۡنَکُمۡ وَ ضَلَّ عَنۡکُمۡ مَّا کُنۡتُمۡ تَزۡعُمُوۡنَ ﴿٪۹۵﴾", "english": " And now you come to Us one by one even as We created you at first, and you have left behind you that which We bestowed upon you, and We see not with you your intercessors of whom you asserted that they were partners with God in your affairs . Now you have been cut off from one another and that which you presumed has failed you.", "french": " Et certainement, vous êtes venus à Nous un par un, tout comme Nous vous avions créés d’abord et vous avez laissé derrière vous ce que Nous vous avions accordé et Nous ne voyons pas avec vous vos intercesseurs qui, selon vos dires, étaient les associés d’Allāh dans vos affaires. Maintenant, vous avez été séparés les uns des autres, et vos prétentions vous ont trahis.", "german": " Und nun kommt ihr einzeln zu Uns, wie Wir euch zuerst erschufen, und habt, was Wir euch bescherten, hinter euch gelassen, und Wir sehen nicht bei euch eure Fürsprecher, die ihr wähntet, sie seien (Gottes) Gegenpart in euren Sachen. Nun seid ihr voneinander abgeschnitten und das, was ihr wähntet, ist euch dahingeschwunden.", "spanish": " Ahora venís a Nos uno a uno, como os creamos al principio; habéis dejado tras vosotros lo que os concedimos, y no vemos con vosotros a sos intercesores vuestros que asegurabais estaban asociados a Dios en vuestros asuntos. Ahora habéis sido separados unos de otros y os ha fallado lo que dabais por sentado.", "urdu": " اور (اس وقت ہم کہیں گے کہ) جس طرح ہم نے تمہیں پہلی دفعہ پیدا کیا تھا (اسی طرح اب) تم ہمارے پاس اکیلے اکیلے پہنچے ہو۔ اور جو کچھ ہم نے بطور احسان تمہیں دیا تھا اسے تم نے اپنی پیٹھوں کے پیچھے چھوڑ دیا ہے اور (یہ کیا بات ہے کہ) ہم تمہارے ان شفیعوں کو جن کے بارہ میں تم دعویٰ کرتے تھے کہ وہ تم (پر حکومت کرنے) میں (خدا کے) شریک ہیں (آج) تمہارے ساتھ نہیں دیکھتے (اب) تمہارے آپس کے رشتے بالکل کٹ گئے ہیں اور جو کچھ تم کہا کرتے تھے وہ (سب) تم سے کھویا گیا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ فَالِقُ الۡحَبِّ وَ النَّوٰی ؕ یُخۡرِجُ الۡحَیَّ مِنَ الۡمَیِّتِ وَ مُخۡرِجُ الۡمَیِّتِ مِنَ الۡحَیِّ ؕ ذٰلِکُمُ اللّٰہُ فَاَنّٰی تُؤۡفَکُوۡنَ ﴿۹۶﴾", "english": " Verily, it is Allah Who causes the grain and the date-stones to sprout. He brings forth the living from the dead, and He is the Bringer forth of the dead from the living. That is Allah; wherefore, then, are you turned back?", "french": " En vérité, c’est Allāh Qui fait fendre les graines et les noyaux de dattes. Il fait sortir le vivant du mort et Il est Celui Qui fait sortir le mort du vivant. Voilà votre Allāh ; comment donc vous vous laissez détourner de la vérité ?", "german": " Wahrlich, Allah ist es, Der das Korn und den Dattelkern keimen lässt. Er bringt das Lebendige hervor aus dem Toten, und Er ist der Hervorbringer des Toten aus dem Lebendigen. Das ist Allah; warum dann lasst ihr euch abwendig machen?", "spanish": " En verdad, es Al-lah quien hace que germinen el grano y el hueso de dátil. Él hace surgir a lo vivo de lo muerto y es quien extrae lo muerto de lo vivo. Así es Al-lah; ¿cómo os alejáis, pues?", "urdu": " اللہ یقیناً دانے اور گٹھلیوں کو پھاڑنے والا ہے‘ وہ زندہ کو مردہ سے نکالتا ہے اور مردہ کو زندہ سے نکالنے والا ہے۔ تمہارا اللہ یہ ہے سو بتاٶ تم کہاں سے واپس لوٹائے جاتے ہو۔"}, {"arabic": " فَالِقُ الۡاِصۡبَاحِ ۚ وَ جَعَلَ الَّیۡلَ سَکَنًا وَّ الشَّمۡسَ وَ الۡقَمَرَ حُسۡبَانًا ؕ ذٰلِکَ تَقۡدِیۡرُ الۡعَزِیۡزِ الۡعَلِیۡمِ ﴿۹۷﴾", "english": " He causes the break of day; and He made the night for rest and the sun and the moon for reckoning time. That is the decree of the Mighty, the Wise.", "french": " Le Fendeur de l’aube en des parties ; et Il a fait la nuit pour le repos, et le soleil et la lune pour le calcul du temps . C’est là le plan du Puissant, de l’Omniscient.", "german": " Er lässt den Tag anbrechen; und Er machte die Nacht zur Ruhe und Sonne und Mond zur Berechnung. Das ist die Anordnung des Allmächtigen, des Allwissenden.", "spanish": " Él origina la aurora; e hizo la noche para el reposo, y el sol y la luna para contar el tiempo. Ése es el plan del poderoso, el Sabio.", "urdu": " وہ صبح کو ظاہر کرنے والا ہے اور اس نے رات کو باعث آرام اور سورج اور چاند کو ذریعہ حساب بنایا ہے۔ یہ اندازہ اس کا ہے جو غالب ہے (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ جَعَلَ لَکُمُ النُّجُوۡمَ لِتَہۡتَدُوۡا بِہَا فِیۡ ظُلُمٰتِ الۡبَرِّ وَ الۡبَحۡرِ ؕ قَدۡ فَصَّلۡنَا الۡاٰیٰتِ لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۹۸﴾", "english": " And He it is Who has made the stars for you that you may follow the right direction with their help amid the deep darkness of the land and the sea. We have explained the Signs in detail for a people who possess knowledge.", "french": " Et c’est Lui Qui a fait pour vous les étoiles, afin qu’avec leur aide, vous puissiez vous diriger au milieu des ténèbres de la terre et de la mer. Nous avons expliqué en détail les Signes pour un peuple qui comprend.", "german": " Und Er ist es, Der die Sterne für euch geschaffen, auf dass ihr durch sie den Weg findet in den Finsternissen zu Land und Meer. Wir haben bis ins Einzelne die Zeichen dargelegt für Menschen, die Wissen haben.", "spanish": " Él es Quien hizo las estrellas para que pudierais seguir, con su ayuda, la orientación correcta entre las tinieblas de la tierra y del mar. Hemos explicado los Signos con detalle para la gente que posee conocimiento.", "urdu": " اور وہی ہے جس نے تمہارے لئے ستاروں کو پیدا کیا ہے تا کہ تم ان کے ذریعہ سے خشکی اور تری کی مشکلات میں راہ معلوم کرو۔ ہم نے علم والی قوم کے لئے نشانات کھول کر بیان کر دئیے ہیں۔"}, {"arabic": " وَ ہُوَ الَّذِیۡۤ اَنۡشَاَکُمۡ مِّنۡ نَّفۡسٍ وَّاحِدَۃٍ فَمُسۡتَقَرٌّ وَّ مُسۡتَوۡدَعٌ ؕ قَدۡ فَصَّلۡنَا الۡاٰیٰتِ لِقَوۡمٍ یَّفۡقَہُوۡنَ ﴿۹۹﴾", "english": " And He it is Who has produced you from a single person and there is for you a home and a lodging. We have explained the Signs in detail for a people who understand.", "french": " Et c’est Lui Qui vous a créés d’un seul être, et il y a pour vous une résidence temporaire et une demeure permanente. Nous avons expliqué en détail les Signes pour un peuple qui comprend.", "german": " Er ist es, Der euch entstehen ließ aus einem einzigen Wesen, und (euch) ist ein Aufenthaltsort und eine Heimstatt. Wir haben bis ins Einzelne die Zeichen dargelegt für Menschen, die begreifen.", "spanish": " Él es Quien os creó a partir de una sola fuente y os preparó un hogar y un alojamiento. Hemos explicado los Signos con detalle para la gente que entiende.", "urdu": " اور وہی ہے جس نے تمہیں ایک جان سے پیدا کیا ہے پھر اس کے بعد اس نے (تمہارے لئے) ایک عارضی ٹھہرنے کی جگہ اور ایک لمبے عرصے تک رہنے کی جگہ مقرر کی ہے۔ ہم نے سمجھنے والے لوگوں کے لئے نشانات کھول کر بیان کر دئے ہیں۔"}, {"arabic": " وَ ہُوَ الَّذِیۡۤ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً ۚ فَاَخۡرَجۡنَا بِہٖ نَبَاتَ کُلِّ شَیۡءٍ فَاَخۡرَجۡنَا مِنۡہُ خَضِرًا نُّخۡرِجُ مِنۡہُ حَبًّا مُّتَرَاکِبًا ۚ وَ مِنَ النَّخۡلِ مِنۡ طَلۡعِہَا قِنۡوَانٌ دَانِیَۃٌ وَّ جَنّٰتٍ مِّنۡ اَعۡنَابٍ وَّ الزَّیۡتُوۡنَ وَ الرُّمَّانَ مُشۡتَبِہًا وَّ غَیۡرَ مُتَشَابِہٍ ؕ اُنۡظُرُوۡۤا اِلٰی ثَمَرِہٖۤ اِذَاۤ اَثۡمَرَ وَ یَنۡعِہٖ ؕ اِنَّ فِیۡ ذٰلِکُمۡ لَاٰیٰتٍ لِّقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۱۰۰﴾", "english": " And it is He Who sends down water from the cloud; and We bring forth therewith every kind of growth; then We bring forth with that green foliage wherefrom We produce clustered grain. And from the date-palm, out of its sheaths, come forth bunches hanging low. And We produce therewith gardens of grapes, and the olive and the pomegranate — similar and dissimilar. Look at the fruit thereof when it bears fruit, and the ripening thereof. Surely, in this are Signs for a people who believe.", "french": " Et c’est Lui Qui fait descendre l’eau des nuages ; et par ce moyen, Nous produisons toutes sortes de germination ; ensuite, Nous en faisons sortir une verdure, d’où Nous produisons des grains en grappes. Et des palmiers-dattiers ; de leur spathe, sortent des grappes qui pendent bas. Et Nous produisons encore des vignobles, et l’olive et la grenade – des fruits semblables et dissemblables. Et quand les arbres fructifient, regardez les fruits et voyez comme ils mûrissent. En vérité, il y a là des Signes pour un peuple qui croit.", "german": " Und Er ist es, Der Wasser niedersendet aus der Wolke, damit bringen Wir alle Art Wachstum hervor; mit diesem bringen Wir dann Grünes hervor, daraus Wir gereihtes Korn sprießen lassen, und aus der Dattelpalme, aus ihren Blütendolden, (sprießen) niederhängende Datteltrauben, und Gärten mit Trauben, und die Olive und den Granatapfel – einander ähnlich und unähnlich. Betrachtet ihre Frucht, wenn sie Früchte tragen, und ihr Reifen. Wahrlich, hierin sind Zeichen für Leute, die glauben.", "spanish": " Él es quien hace descender el agua de la nube; de ese modo hacemos que germinen toda clase de plantas; en ellas hacemos brotar hojas verdes en las que producimos granos apiñados. Y de las palmeras, de sus ainas, salen racimos que cuelgan bajo. Y así hacemos brotar huertos de viñedos, olivos y granados –semejantes y diferentes-. Observad su fruto cuando lo tienen y su maduración. En verdad que en todo ello hay Signos para los hombres que creen.", "urdu": " اور وہی ہے جس نے آسمان سے پانی اتارا ہے پھر (دیکھو کس طرح) اس کے ذریعہ سے ہم نے ہر ایک چیز کی روئیدگی پیدا کی ہے اور اس کے ذریعہ سے کھیتی پیدا کی ہے جس سے ہم تہ بہ تہ دانے نکالتے ہیں اور کھجور میں سے یعنی اس کے گابھے میں سے جھکے ہوئے پھل (نکالتے) ہیں اور انگوروں اور زیتون اور انار کے ایسے باغات (نکالتے ہیں) جن میں سے بعض آپس میں ملتے جلتے ہیں اور (بعض) مختلف ہیں۔ جب (ان میں سے ہر قسم کے درخت کو) پھل آتا ہے تو اس کے پھل کو اور اس کے پکنے (کی کیفیت) کو دیکھو۔ اس میں ایمان لانے والے لوگوں کے لئے یقیناً (بہت سے) نشانات ہیں۔"}, {"arabic": " وَ جَعَلُوۡا لِلّٰہِ شُرَکَآءَ الۡجِنَّ وَ خَلَقَہُمۡ وَ خَرَقُوۡا لَہٗ بَنِیۡنَ وَ بَنٰتٍۭ بِغَیۡرِ عِلۡمٍ ؕ سُبۡحٰنَہٗ وَ تَعٰلٰی عَمَّا یَصِفُوۡنَ ﴿۱۰۱﴾٪", "english": " And they hold the Jinn to be partners with Allah, although He created them; and they falsely ascribe to Him sons and daughters without any knowledge. Holy is He and exalted far above what they attribute to Him !", "french": " Et ils tiennent les djinns pour des associés d’Allāh, alors que c’est Lui Qui les a créés ; et sans connaissance aucune, ils Lui attribuent faussement des fils et des filles. Il est Saint, et Il est bien au-dessus de tout ce qu’ils Lui attribuent.", "german": " Und doch halten sie die Jinn für Allahs Teilhaber, obwohl Er sie geschaffen hat; und sie dichten Ihm fälschlich Söhne und Töchter an ohne alles Wissen. Heilig ist Er und erhaben über das, was sie (Ihm) zuschreiben.", "spanish": " Mas sostienen que los yinn están asociados a Al-lah, a pesar de que Él los creó, y Le adjudican falsamente hijos e hijas sin conocimiento. ¡Santo es Él y glorificado sea, muy por encima de lo que Le atribuyen!", "urdu": " اور انہوں نے اللہ کے ساتھ جنوں میں سے شریک مقرر کئے ہیں حالانکہ اس (خدا) نے انہیں پیدا کیا ہے اور انہوں نے اس کے لئے جھوٹے طور پر بغیر علم کے بیٹے اور بیٹیاں بنائی ہیں وہ پاک ہے اور جو کچھ وہ بیان کرتے ہیں اس سے (بلندو) بالا ہے۔"}, {"arabic": " بَدِیۡعُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ اَنّٰی یَکُوۡنُ لَہٗ وَلَدٌ وَّ لَمۡ تَکُنۡ لَّہٗ صَاحِبَۃٌ ؕ وَ خَلَقَ کُلَّ شَیۡءٍ ۚ وَ ہُوَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۱۰۲﴾", "english": " The Originator of the heavens and the earth! How can He have a son when He has no consort, and when He has created everything and has knowledge of all things?", "french": " C ‘est Lui Qui a créé les cieux et la terre du néant ! Comment peut-Il avoir un fils quand Il n’a pas d’épouse, et qu’Il a créé toutes choses, et qu’Il connaît très bien toutes choses ?", "german": " Schöpfer der Himmel und der Erde! Wie sollte Er einen Sohn haben, wo Er keine Gefährtin hat und wo Er alles erschuf und alle Dinge weiß?", "spanish": " ¡Originador de los cielos y de la tierra! ¿Cómo podría tener un hijo si no tiene compañera, si lo ha creado todo y tiene conocimiento de todas las cosas?", "urdu": " (وہ) آسمانوں اور زمین کو بلا نمونہ پیدا کرنے والا ہے‘ اس کا بیٹا کیوں کر ہو سکتا ہے حالانکہ اس کی کوئی بیوی نہ تھی اور اس نے (تو) ہر اک چیز کو پیدا کیا ہے اور وہ ہراک امر کو جانتا ہے۔"}, {"arabic": " ذٰلِکُمُ اللّٰہُ رَبُّکُمۡ ۚ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ خَالِقُ کُلِّ شَیۡءٍ فَاعۡبُدُوۡہُ ۚ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ وَّکِیۡلٌ ﴿۱۰۳﴾", "english": " Such is Allah, your Lord. There is no God but He, the Creator of all things, so worship Him. And He is Guardian over everything.", "french": " Tel est Allāh, votre Seigneur. Il n’y a de dieu que Lui, le Créateur de toutes choses. Adorez-Le donc. Et Il est Gardien sur toutes choses.", "german": " Das ist Allah, euer Herr. Es gibt keinen Gott außer Ihm, dem Schöpfer aller Dinge; so betet Ihn an. Und Er ist Hüter über alle Dinge.", "spanish": " Así es Al-lah, vuestro Señor. No hay otro Dios sino Él, el Creador de todas las cosas. Adoradle, pues; ya que es el Guardián de todo.", "urdu": " یہ ہے تمہارا اللہ جو تمہارا رب (بھی) ہے اس کے سوا کوئی معبود نہیں‘ وہ ہر ایک چیز کا پیدا کرنے والا ہے پس اس کی عبادت کرو اور وہ ہر ایک (چیز) پر نگران ہے۔"}, {"arabic": " لَا تُدۡرِکُہُ الۡاَبۡصَارُ ۫ وَ ہُوَ یُدۡرِکُ الۡاَبۡصَارَ ۚ وَ ہُوَ اللَّطِیۡفُ الۡخَبِیۡرُ ﴿۱۰۴﴾", "english": " Eyes cannot reach Him but He reaches the eyes. And He is the Incomprehensible, the All-Aware.", "french": " Les regards ne peuvent pas L’atteindre, mais Lui, Il atteint les regards. Et Il est l’Incompréhensible, le Très-Conscient.", "german": " Blicke können Ihn nicht erreichen, Er aber erreicht die Blicke. Und Er ist der Gütige, der Allkundige.", "spanish": " Las miradas no pueden alcanzarle pero Él alcanza las miradas. Él es el Inconmensurable, el Omnisapiente.", "urdu": " نظریں اس تک نہیں پہنچ سکتیں‘ لیکن وہ نظروں تک پہنچتا ہے اور وہ مہربانی کرنے والا (اور) حقیقت پر آگاہ ہے۔"}, {"arabic": " قَدۡ جَآءَکُمۡ بَصَآئِرُ مِنۡ رَّبِّکُمۡ ۚ فَمَنۡ اَبۡصَرَ فَلِنَفۡسِہٖ ۚ وَ مَنۡ عَمِیَ فَعَلَیۡہَا ؕ وَ مَاۤ اَنَا عَلَیۡکُمۡ بِحَفِیۡظٍ ﴿۱۰۵﴾", "english": " Proofs have indeed come to you from your Lord; so whoever sees, it is for his own good; and whoever becomes blind, it is to his own harm. And I am not a guardian over you.", "french": " En vérité, des preuves manifestes vous sont venues de votre Seigneur ; alors celui qui voit clair, ce sera à son avantage ; et celui qui demeure aveugle, ce sera à son détriment. Et je ne suis pas là pour vous surveiller.", "german": " Sichtbare Beweise sind euch nunmehr gekommen von eurem Herrn; wer also sieht, es ist zu seinem eigenen Besten; und wer blind wird, es ist zu seinem eigenen Schaden. Und ich bin nicht ein Wächter über euch.", "spanish": " Ciertamente os ha llegado una luz manifiesta de vuestro Señor; por tanto, quien la ve lo hace para su propio bien; pero quien se ciega lo hace para su propio perjuicio. Pues yo no soy vuestro guardián.", "urdu": " تمہارے رب کی طرف سے دلائل آچکے ہیں پس جس نے (انہیں) جان لیا (اس کا یہ فعل) اس کے اپنے (فائدہ کے) لئے ہوگا اور جس نے کجراہی (اختیار) کی (اس کا یہ فعل) اسی پر پڑے گا اور میں تو تمہارا محافظ نہیں ہوں۔"}, {"arabic": " وَ کَذٰلِکَ نُصَرِّفُ الۡاٰیٰتِ وَ لِیَقُوۡلُوۡا دَرَسۡتَ وَ لِنُبَیِّنَہٗ لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۱۰۶﴾", "english": " And thus do We vary the Signs that the truth may become established , but the result is that they say, ‘Thou hast learnt well ;’ and We vary the Signs that We may explain it to a people who have knowledge.", "french": " Et c’est ainsi que Nous varions les Signes pour qu’ils disent sans réfléchir : « Tu l’ as appris et tu l’as enseigné , » et afin que nous puissions l’expliquer clairement à un peuple qui a de la connaissance.", "german": " Also wenden und wenden Wir die Zeichen, damit sie sagen können: \"Du hast vorgetragen\", und damit Wir sie klar machen für Leute, die Wissen haben.", "spanish": " Así variamos los Signos para que llegue a brillar la verdad, pero el resultado es que llos dicen: “tú has aprendido mucho”; y variamos los Signos para explicarlos a los hombres que tienen conocimiento.", "urdu": " اور اسی طرح ہم آیتوں کو کئی کئی طرح پھیر پھیر کر لاتے ہیں (تا ان پر حجت ہو جائے) اور تا وہ (یہ) کہدیں کو تونے پڑھ کر (سنا) دیا ہے (اور حجت پوری کر دی ہے) اور تا کہ ہم اسے علم والی قوم (کے فائدہ) کے لئے بیان کر دیں۔"}, {"arabic": " اِتَّبِعۡ مَاۤ اُوۡحِیَ اِلَیۡکَ مِنۡ رَّبِّکَ ۚ لَاۤ اِلٰہَ اِلَّا ہُوَ ۚ وَ اَعۡرِضۡ عَنِ الۡمُشۡرِکِیۡنَ ﴿۱۰۷﴾", "english": " Follow that which has been revealed to thee from thy Lord; there is no God but He; and turn aside from the idolaters.", "french": " Suis donc ce que ton Seigneur t’a révélé. Il n’y a de dieu que Lui ; et détourne-toi des associateurs.", "german": " Folge dem, was dir offenbart wurde von deinem Herrn – es gibt keinen Gott außer Ihm –, und wende dich ab von den Götzendienern.", "spanish": " Sigue lo que te ha sido revelado por tu Señor; no hay dios sino Él; y aléjate de los idólatras.", "urdu": " جو (کچھ) تیرے رب کی طرف سے تجھ پر نازل کیا جاتا ہے اس کی پیروی کر۔ اس کے سوا (اور) کوئی معبود نہیں اور تو مشرکوں سے منہ پھیرلے۔"}, {"arabic": " وَ لَوۡ شَآءَ اللّٰہُ مَاۤ اَشۡرَکُوۡا ؕ وَ مَا جَعَلۡنٰکَ عَلَیۡہِمۡ حَفِیۡظًا ۚ وَ مَاۤ اَنۡتَ عَلَیۡہِمۡ بِوَکِیۡلٍ ﴿۱۰۸﴾", "english": " And if Allah had enforced His will, they would not have set up gods with Him. And We have not made thee a keeper over them nor art thou over them a guardian.", "french": " Et si Allāh l’avait voulu, ils ne Lui auraient pas donné des associés. Et Nous ne t’avons pas désigné pour les surveiller. Et tu n’es pas non plus leur protecteur.", "german": " Hätte Allah Seinen Willen erzwungen, sie hätten (Ihm) keine Götter zur Seite gesetzt. Wir haben dich nicht zu ihrem Hüter gemacht, noch bist du ein Wächter über sie.", "spanish": " Y si Al-lah hubiese ejecutado Su voluntad, no habrían asociado otros dioses a Él. Pero no te hemos hecho su protector ni eres su guardián.", "urdu": " اور اگر اللہ چاہتا تو وہ شرک نہ کرتے اور ہم نے تجھے ان پر محافظ نہیں مقرر کیا۔ اور نہ تو ان پر نگران ہے۔"}, {"arabic": " وَ لَا تَسُبُّوا الَّذِیۡنَ یَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ فَیَسُبُّوا اللّٰہَ عَدۡوًۢا بِغَیۡرِ عِلۡمٍ ؕ کَذٰلِکَ زَیَّنَّا لِکُلِّ اُمَّۃٍ عَمَلَہُمۡ ۪ ثُمَّ اِلٰی رَبِّہِمۡ مَّرۡجِعُہُمۡ فَیُنَبِّئُہُمۡ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۰۹﴾", "english": " And revile not those whom they call upon beside Allah, lest they, out of spite, revile Allah in their ignorance. Thus unto every people have We caused their doing to seem fair. Then unto their Lord is their return; and He will inform them of what they used to do.", "french": " Et n’injuriez pas ceux à qui ils en appellent à côté d’Allāh afin que, par inimitié et dans leur ignorance, ils n’injurient pas Allāh. Ainsi avons-Nous fait que les actions de chaque peuple paraissent attrayantes à leurs yeux. Ensuite, leur retour est auprès de leur Seigneur ; et Il les informera de ce qu’ils faisaient.", "german": " Und schmähet nicht die, welche sie statt Allah anrufen, sonst würden sie aus Groll Allah schmähen ohne Wissen. Also ließen Wir jedem Volke sein Tun als wohlgefällig erscheinen. Dann aber ist zu ihrem Herrn ihre Heimkehr; und Er wird ihnen verkünden, was sie getan.", "spanish": " No insultéis a quienes ellos invocan en lugar de Al-lah, no sea que ellos, por despecho, insulten a Al-lah en su ignorancia. Así hicimos que cada pueblo considerara justas sus acciones. Pero después volverán a su Señor y Él les informará de cuanto hayan hecho.", "urdu": " اور تم انہیں جنہیں وہ اللہ کے سوا (دعاٶں میں) پکارتے ہیں گالیاں نہ دو نہیں تو وہ دشمن ہو کر جہالت کی وجہ سے اللہ کو گالیاں دیں گے۔ اس طرح ہم نے ہر ایک قوم کے لئے اس کے عمل خوبصورت کرکے دکھائے ہیں پھر انہیں اپنے رب کی طرف لوٹ کر جانا ہے جس پر وہ انہیں اس کی خبر دے گا جو وہ کرتے تھے۔"}, {"arabic": " وَ اَقۡسَمُوۡا بِاللّٰہِ جَہۡدَ اَیۡمَانِہِمۡ لَئِنۡ جَآءَتۡہُمۡ اٰیَۃٌ لَّیُؤۡمِنُنَّ بِہَا ؕ قُلۡ اِنَّمَا الۡاٰیٰتُ عِنۡدَ اللّٰہِ وَ مَا یُشۡعِرُکُمۡ ۙ اَنَّہَاۤ اِذَا جَآءَتۡ لَا یُؤۡمِنُوۡنَ ﴿۱۱۰﴾", "english": " And they swear their strongest oaths by Allah that if there came to them a Sign, they would surely believe therein. Say, ‘Surely, Signs are with Allah. But what should make you understand that when the Signs come, they will not believe?’", "french": " Et ils jurent par Allāh, de leurs serments les plus solennels, que si un Signe leur venait, ils y croiraient sûrement. Dis : « En vérité, c’est à Allāh Seul qu’appartiennent les Signes. » Mais qu’est-ce qui vous fera comprendre que quand ceux-là viendront, ils ne croiront pas ?", "german": " Sie schwören ihre feierlichsten Eide bei Allah, wenn ihnen nur ein Zeichen käme, sie würden sicherlich daran glauben. Sprich: \"Bei Allah sind die Zeichen und auch das, was euch verstehen machen wird, dass sie nicht glauben werden, wenn (die Zeichen) kommen.\"", "spanish": " Y juran por Al-lah con sus más solemnes juramentos que si les hubiera llegado un Signo, verdaderamente habrían creído en él. Diles: “en verdad los Signos corresponden a Al-lah. Pero ¿qué os haría comprender que cuando llegaran los signos no creerían?", "urdu": " اور انہوں نے اللہ کی پکی قسمیں کھائی ہیں کہ اگر ان کے پاس کوئی نشان آئے تو وہ اسے ضرور قبول کریں گے تو (مومنوں سے) کہہ کہ نشانات (بھی) اور وہ چیز بھی جو تمہیں بتا دے گی کہ جب وہ (نشانات) آجائیں تو وہ (لوگ) ایمان (پھر بھی) نہیں لائیں گے اللہ ہی کے پاس ہے۔"}, {"arabic": " وَ نُقَلِّبُ اَفۡـِٕدَتَہُمۡ وَ اَبۡصَارَہُمۡ کَمَا لَمۡ یُؤۡمِنُوۡا بِہٖۤ اَوَّلَ مَرَّۃٍ وَّ نَذَرُہُمۡ فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۱۱۱﴾٪", "english": " And We shall confound their hearts and their eyes, as they believed not therein at the first time, and We shall leave them in their transgression to wander in distraction.", "french": " Et Nous ferons que leur cœur et leur faculté de la vue retournent à l’état dans lequel ils se trouvaient lorsqu'initialement ils ne crurent pas en Nos signes, et Nous les laisserons errer dans leur transgression comme des affolés.", "german": " Und Wir werden ihre Herzen und ihre Augen verwirren, weil sie ja auch das erste Mal nicht daran glaubten, und Wir lassen sie sodann in ihrer Widerspenstigkeit verblendet irregehen.", "spanish": " Y haremos que sus corazones y sus facultades visuales reviertan al mismo estado en que se encontraban cuando rechazaron inicialmente Nuestros Signos, y los abandonaremos en su trasgresión, para que vaguen aturdidos.", "urdu": " اور ہم ان کے دلوں کو اور ان کی آنکھوں کو اس وجہ سے کہ وہ اس (وحی) پر پہلی دفعہ ایمان نہیں لائے پھیر دیں گے اور انہیں ان کی سرکشیوں میں بہکتے ہوئے چھوڑ دیں گے۔"}, {"arabic": " وَ لَوۡ اَنَّنَا نَزَّلۡنَاۤ اِلَیۡہِمُ الۡمَلٰٓئِکَۃَ وَ کَلَّمَہُمُ الۡمَوۡتٰی وَ حَشَرۡنَا عَلَیۡہِمۡ کُلَّ شَیۡءٍ قُبُلًا مَّا کَانُوۡا لِیُؤۡمِنُوۡۤا اِلَّاۤ اَنۡ یَّشَآءَ اللّٰہُ وَ لٰکِنَّ اَکۡثَرَہُمۡ یَجۡہَلُوۡنَ ﴿۱۱۲﴾", "english": " And even if We send down unto them angels, and the dead speak to them, and We gather to them all things face to face, they would not believe, unless Allah enforced His will. But most of them behave ignorantly.", "french": " Et même si Nous faisions descendre des anges sur eux, et que les morts leur parlaient, et que Nous rassemblions toutes choses devant eux, ils ne croiraient pas, à moins qu’Allāh le veuille. Mais la plupart d’entre eux sont ignorants.", "german": " Und sendeten Wir auch Engel zu ihnen hinab, und die Toten sprächen zu ihnen, und Wir versammelten alle Dinge ihnen gegenüber, sie würden doch nicht glauben, es wäre denn Allahs Wille. Jedoch die meisten von ihnen sind unwissend.", "spanish": " Pues aunque les enviáramos a los ángeles, les hablaran los muertos y reuniéramos frente a ellos todas las cosas, no creerían a menos que Al-lah ejecutara Su Voluntad. Pero la mayoría de ellos se comportan como ignorantes.", "urdu": " اور اگر ہم ان پر فرشتے نازل کرتے اور مردے ان سے کلام کرتے اور ہر اک چیز کو ہم ان کے آمنے سامنے کھڑا کر دیتے تو بھی وہ اللہ کی مشیت کے بغیر ایمان نہ لاتے‘ بلکہ ان میں سے بہت سے جاہل ہیں۔"}, {"arabic": " وَ کَذٰلِکَ جَعَلۡنَا لِکُلِّ نَبِیٍّ عَدُوًّا شَیٰطِیۡنَ الۡاِنۡسِ وَ الۡجِنِّ یُوۡحِیۡ بَعۡضُہُمۡ اِلٰی بَعۡضٍ زُخۡرُفَ الۡقَوۡلِ غُرُوۡرًا ؕ وَ لَوۡ شَآءَ رَبُّکَ مَا فَعَلُوۡہُ فَذَرۡہُمۡ وَ مَا یَفۡتَرُوۡنَ ﴿۱۱۳﴾", "english": " And in like manner have We made for every Prophet an enemy, evil ones from among men and Jinn. They suggest one to another gilded speech in order to deceive — and if thy Lord had enforced His will, they would not have done it; so leave them alone with that which they fabricate —", "french": " Et pareillement, à chaque Prophète Nous avons donné un ennemi ; ce sont des malins d’entre les hommes et les djinns. Ils se suggèrent les uns aux autres des paroles dorées pour induire les hommes en erreur ; et si ton Seigneur l’avait voulu, ils ne l’auraient pas fait. Laisse-les donc avec ce qu’ils inventent.", "german": " Also hatten Wir die Teufel unter den Menschen und den Jinn jedem Propheten zum Feind gemacht. Sie geben einander prunkende Rede ein zum Trug – und hätte dein Herr Seinen Willen erzwungen, sie hätten es nicht getan; so überlass sie sich selbst mit dem, was sie erdichten –", "spanish": " Y de igual manera opusimos a cada Profeta un enemigo, seres malvados de entre los hombres y los Yinn. Se dirigen mutuamente alabras cubiertas de oropel para engañar –y si tu Señor hubiera ejecutado Su voluntad, no lo habrían hecho-; ¡déjalos, pues, solos con lo que maquinan!", "urdu": " اور ہم نے انسانوں اور جنوں میں سے سرکشوں کو اسی طرح ہر اک نبی کا دشمن بنا دیا تھا ان میں سے بعض بعض کو دھوکا دینے کے لئے (ان کے دل میں) برے خیال ڈالتے ہیں جو محض ملمع کی بات ہوتی ہے اور اگر تیرا رب چاہتا تو وہ ایسا نہ کرتے۔ پس تو ان کو بھی اور ان کے جھوٹ کو بھی نظر انداز کردے۔"}, {"arabic": " وَ لِتَصۡغٰۤی اِلَیۡہِ اَفۡـِٕدَۃُ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ وَ لِیَرۡضَوۡہُ وَ لِیَقۡتَرِفُوۡا مَا ہُمۡ مُّقۡتَرِفُوۡنَ ﴿۱۱۴﴾", "english": " And in order that the hearts of those who believe not in the Hereafter may incline thereto and that they may be pleased therewith and that they may continue to earn what they are earning.", "french": " Et afin que les cœurs de ceux qui ne croient pas à l’au-delà puissent y incliner, et qu’ils en soient satisfaits, et qu’ils puissent continuer à acquérir ce qu’ils sont en train d’acquérir.", "german": " und damit die Herzen derer, die nicht an das Jenseits glauben, demselben zugeneigt würden und an diesem Gefallen fänden und (fortfahren) möchten zu verdienen, was sie sich nun erwerben.", "spanish": " Para que los corazones de los que no creen en el Más Allá se inclinen hacia ello, les agrade y puedan seguir ganando lo que están mereciendo.", "urdu": " اور (خداتعالیٰ نے یہ اس لئے چاہا ہے) تا قیامت پر ایمان نہ لانے والوں کے دل (اپنے اعمال کے نتیجہ میں) ایسی ہی باتوں کی طرف جھکیں اور تا وہ اس (یعنی جھوٹ) کو پسند کرنے لگ جائیں اور تا وہ اپنے اعمال کا نتیجہ دیکھ لیں۔"}, {"arabic": " اَفَغَیۡرَ اللّٰہِ اَبۡتَغِیۡ حَکَمًا وَّ ہُوَ الَّذِیۡۤ اَنۡزَلَ اِلَیۡکُمُ الۡکِتٰبَ مُفَصَّلًا ؕ وَ الَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَعۡلَمُوۡنَ اَنَّہٗ مُنَزَّلٌ مِّنۡ رَّبِّکَ بِالۡحَقِّ فَلَا تَکُوۡنَنَّ مِنَ الۡمُمۡتَرِیۡنَ ﴿۱۱۵﴾", "english": " Shall I seek for judge other than Allah, when He it is Who has sent down to you the Book, clearly explained? And those to whom We gave the Book know that it has been sent down from thy Lord with truth; so be thou not of those who doubt.", "french": " Chercherai-je un autre juge qu’Allāh, alors que c’est Lui Qui a fait descendre vers vous le Livre clairement explicite ? Et ceux à qui Nous avons donné le Livre savent bien que c’est ton Seigneur Qui l’a révélé avec vérité ; ne sois donc pas du nombre de ceux qui doutent.", "german": " Soll ich denn einen anderen Richter suchen als Allah – und Er ist es, Der euch das Buch, deutlich gemacht, herabgesandt hat? Und jene, denen Wir das Buch gegeben haben, wissen, dass es von deinem Herrn mit der Wahrheit herabgesandt ward; deshalb solltest du nicht unter den Bestreitern sein.", "spanish": " ¿Voy acaso a buscar un juez distinto de Al-lah, si es Él quien os ha revelado el Libro, claramente explicado? Mas aquellos a quienes entregamos el Libro saben que ha sido revelado por tu Señor con la verdad; no seas, pues, de los que dudan.", "urdu": " (تو کہہ دے کہ) کیا اللہ کے سوا میں کوئی اور فیصلہ کرنے والا ڈھونڈوں؟ حالانکہ اس نے تم پر کھلی کھلی کتاب اتاری ہے اور جنہیں ہم نے کتاب دی ہے وہ جانتے ہیں کہ وہ سچائی کے ساتھ تیرے رب کی طرف سے نازل کی گئی ہے۔ پس تو جھگڑا کرنے والوں میں سے نہ بن۔"}, {"arabic": " وَ تَمَّتۡ کَلِمَتُ رَبِّکَ صِدۡقًا وَّ عَدۡلًا ؕ لَا مُبَدِّلَ لِکَلِمٰتِہٖ ۚ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۱۱۶﴾", "english": " And the word of thy Lord has been fulfilled in truth and justice. None can change His words; and He is the All-Hearing, the All-Knowing.", "french": " Et la parole de ton Seigneur a été accomplie en toute vérité et justice. Nul ne peut changer Ses paroles ; et Il est Celui Qui entend tout, l’Omniscient.", "german": " Das Wort deines Herrn wird vollendet sein in Wahrheit und Gerechtigkeit. Keiner vermag Seine Worte zu ändern, und Er ist der Allhörende, der Allwissende.", "spanish": " Pues la palabra de tu Señor se ha cumplido en verdad y justicia. Nadie puede cambiar Sus palabras, pues Él es quien Todo lo Oye, el Omnisapiente.", "urdu": " اور تیرے رب کی بات (تو) حق اور انصاف کے ساتھ پوری ہو کر رہے گی (کیونکہ) اس کی باتوں کو کوئی بدلنے والا نہیں‘ اور وہ خوب سننے والا (اور) خوب جاننے والا ہے۔"}, {"arabic": " وَ اِنۡ تُطِعۡ اَکۡثَرَ مَنۡ فِی الۡاَرۡضِ یُضِلُّوۡکَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ اِنۡ یَّتَّبِعُوۡنَ اِلَّا الظَّنَّ وَ اِنۡ ہُمۡ اِلَّا یَخۡرُصُوۡنَ ﴿۱۱۷﴾", "english": " And if thou obey the majority of those on earth, they will lead thee astray from Allah’s way. They follow nothing but mere conjecture, and they do nothing but lie.", "french": " Et si tu obéis à la majorité de ceux qui sont sur la terre, ils t’égareront de la voie d’Allāh. Ceux-ci ne suivent que la conjecture et ils ne font que mentir.", "german": " Und wenn du der Mehrzahl derer auf Erden gehorchest, werden sie dich wegführen von Allahs Weg. Sie folgen nur einem Wahn, und sie vermuten bloß.", "spanish": " Pero si obedeces a la mayoría de los de que están en la tierra, te extraviarán del camino de Al-lah. No siguen sino meras conjeturas y no hacen más que mentir.", "urdu": " اور اگر تو زمین میں بسنے والوں سے اکثر کی بات کی پیروی کرے‘ تو وہ تجھے اللہ کی راہ سے گمراہ کر دیں گے‘ وہ صرف گمان کی پیروی کرتے ہیں اور صرف اٹکل سے باتیں کرتے ہیں۔"}, {"arabic": " اِنَّ رَبَّکَ ہُوَ اَعۡلَمُ مَنۡ یَّضِلُّ عَنۡ سَبِیۡلِہٖ ۚ وَ ہُوَ اَعۡلَمُ بِالۡمُہۡتَدِیۡنَ ﴿۱۱۸﴾", "english": " Surely, thy Lord knows best those who go astray from His way; and He knows best those who are rightly guided.", "french": " Assurément ton Seigneur sait le mieux celui qui s’égare de Sa voie et Il connaît le mieux les bien- guidés.", "german": " Wahrlich, dein Herr weiß am besten, wer von Seinem Wege abirrt; und Er kennt am besten die Rechtgeleiteten.", "spanish": " En verdad, tu Señor conoce bien a los que se extravían de Su camino; y conoce bien a los que están correctamente guiados.", "urdu": " تیرا رب ہی یقیناً اسے جو اس کے راستہ سے بھٹک جاتا ہے بہتر جانتا ہے‘ اور وہی ہدایت یافتوں کو بہتر جانتا ہے۔"}, {"arabic": " فَکُلُوۡا مِمَّا ذُکِرَ اسۡمُ اللّٰہِ عَلَیۡہِ اِنۡ کُنۡتُمۡ بِاٰیٰتِہٖ مُؤۡمِنِیۡنَ ﴿۱۱۹﴾", "english": " Eat, then, of that over which the name of Allah has been pronounced, if you are believers in His Signs.", "french": " Si vous croyez aux Signes d’Allāh, mangez donc de ce sur quoi Son nom a été prononcé.", "german": " So esset das, worüber Allahs Name ausgesprochen ward, wenn ihr an Seine Zeichen glaubt.", "spanish": " Comed, pues, de aquello sobre lo que ha sido invocado el nombre de Al-lah, si creéis en Sus Signos.", "urdu": " پس اگر تم اس کی نشانیوں پر ایمان لاتے ہو تو جس پر اللہ کا نام لیا گیا ہے اس میں سے کھاٶ۔"}, {"arabic": " وَ مَا لَکُمۡ اَلَّا تَاۡکُلُوۡا مِمَّا ذُکِرَ اسۡمُ اللّٰہِ عَلَیۡہِ وَ قَدۡ فَصَّلَ لَکُمۡ مَّا حَرَّمَ عَلَیۡکُمۡ اِلَّا مَا اضۡطُرِرۡتُمۡ اِلَیۡہِ ؕ وَ اِنَّ کَثِیۡرًا لَّیُضِلُّوۡنَ بِاَہۡوَآئِہِمۡ بِغَیۡرِ عِلۡمٍ ؕ اِنَّ رَبَّکَ ہُوَ اَعۡلَمُ بِالۡمُعۡتَدِیۡنَ ﴿۱۲۰﴾", "english": " And what reason have you that you should not eat of that over which the name of Allah has been pronounced, when He has already explained to you that which He has forbidden unto you — save that which you are forced to? And surely many mislead others by their evil desires through lack of knowledge. Assuredly, thy Lord knows best the transgressors.", "french": " Et pour quelle raison ne mangeriez-vous pas de ce sur quoi le nom d’Allāh a été prononcé, puisqu’Il vous a déjà expliqué clairement ce qu’Il vous a interdit – excepté ce auquel vous êtes contraints de recourir ? Et assurément, bon nombre de gens égarent d’autres par leurs mauvais désirs, par manque de connaissance réelle ; assurément, ton Seigneur connaît les transgresseurs mieux que quiconque.", "german": " Was ist euch, dass ihr nicht von dem esset, worüber Allahs Name ausgesprochen ward, wo Er euch bereits erklärt hat, was Er euch verboten hat – das ausgenommen, wozu ihr gezwungen werdet? Und gewiss, viele führen (andere) irre mit ihren bösen Gelüsten durch Mangel an Wissen. Wahrlich, dein Herr kennt die Übertreter am besten.", "spanish": " ¿Qué motivo tenéis para no comer de aquello sobre lo que ha sido invocado el nombre de Al-lah, si Él os ha explicado ya lo que os ha prohibido – a menos que os veáis obligados-?. Y ciertamente muchos desvían a otros con sus malos deseos por falta de conocimiento. En verdad, tu Señor conoce muy bien a los transgresores.", "urdu": " اور تمہیں کیا (ہو گیا) ہے کہ تم اس میں سے جس پر اللہ کا نام لیا گیا ہے باوجود اس کے نہیں کھاتے کہ اس (اللہ) نے تمہارے سامنے وہ سب کچھ کھول کر بیان کر دیا ہے جو اس نے تمہارے لئے حرام کیا ہے سوائے اس کے کہ تم مجبور ہو جاٶ اور بہت سے (لوگ) بغیر کسی سچے علم کے یقیناً اپنی خواہشوں کے مطابق (لوگوں کو) گمراہ کرتے ہیں۔ تیرا رب یقیناً حد سے آگے نکل جانے والوں کو بہتر جانتا ہے۔"}, {"arabic": " وَ ذَرُوۡا ظَاہِرَ الۡاِثۡمِ وَ بَاطِنَہٗ ؕ اِنَّ الَّذِیۡنَ یَکۡسِبُوۡنَ الۡاِثۡمَ سَیُجۡزَوۡنَ بِمَا کَانُوۡا یَقۡتَرِفُوۡنَ ﴿۱۲۱﴾", "english": " And eschew open sins as well as secret ones. Surely, those who earn sin will be rewarded for that which they have earned.", "french": " Et évitez le péché, qu’il soit manifeste ou secret. Assurément, ceux qui acquièrent le péché seront rétribués pour ce qu’ils auront acquis.", "german": " Und meidet Sünde – die öffentliche und die geheime. Jene, die Sünde erwerben, werden den Lohn empfangen für ihren Erwerb.", "spanish": " Evitad los pecados, tanto los aparentes como los ocultos. Cierto es que quienes ganen el pecado serán retribuidos por lo que han ganado.", "urdu": " اور گناہ کی ظاہری شکل اور اس کی حقیقت (دونوں) سے بچو۔ جو لوگ گناہ کماتے ہیں‘ انہیں جو کچھ وہ کماتے ہیں یقیناً اس کا بدلہ دیا جائے گا۔"}, {"arabic": " وَ لَا تَاۡکُلُوۡا مِمَّا لَمۡ یُذۡکَرِ اسۡمُ اللّٰہِ عَلَیۡہِ وَ اِنَّہٗ لَفِسۡقٌ ؕ وَ اِنَّ الشَّیٰطِیۡنَ لَیُوۡحُوۡنَ اِلٰۤی اَوۡلِیٰٓئِہِمۡ لِیُجَادِلُوۡکُمۡ ۚ وَ اِنۡ اَطَعۡتُمُوۡہُمۡ اِنَّکُمۡ لَمُشۡرِکُوۡنَ ﴿۱۲۲﴾٪", "english": " And eat not of that on which the name of Allah has not been pronounced, for surely that is disobedience. And certainly the evil ones inspire their friends that they may dispute with you. And if you obey them, you will indeed be setting up gods with God.", "french": " Et ne mangez pas de ce sur quoi le nom d’Allāh n’aura pas été prononcé, car certainement, c’est là une abomination. Et il est certain que les malins inspirent leurs amis pour qu’ils disputent avec vous. Et si vous leur obéissez, vous serez certainement des associateurs.", "german": " Und esset nicht von dem, worüber Allahs Name nicht ausgesprochen ward, denn fürwahr, das ist Ungehorsam. Und gewiss werden die Teufel ihren Freunden eingeben, mit euch zu streiten. Und wenn ihr ihnen gehorcht, so werdet ihr Götzendiener sein.", "spanish": " Y no comáis de aquello sobre lo que no ha sido invocado el nombre de Al-lah porque, en verdad, es una desobediencia. Y ciertamente los malvados inspiran a sus amigos para que discutan con vosotros. Pero si es obedecéis, ciertamente estaréis levantando a otros dioses a la altura de Dios .", "urdu": " اور تم اس میں سے جس پر اللہ کا نام نہیں لیا گیا نہ کھاٶ اور یہ (فعل) یقیناً نافرمانی ہے اور شیطان یقیناً اپنے دوستوں کے دل میں (ایسے خیال) ڈالتے رہتے ہیں تا کہ وہ تم سے جھگڑیں‘ اور اگر تم ان کی فرمانبرداری کرو گے تو یقیناً تم مشرک ہو جاٶ گے۔"}, {"arabic": " اَوَ مَنۡ کَانَ مَیۡتًا فَاَحۡیَیۡنٰہُ وَ جَعَلۡنَا لَہٗ نُوۡرًا یَّمۡشِیۡ بِہٖ فِی النَّاسِ کَمَنۡ مَّثَلُہٗ فِی الظُّلُمٰتِ لَیۡسَ بِخَارِجٍ مِّنۡہَا ؕ کَذٰلِکَ زُیِّنَ لِلۡکٰفِرِیۡنَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۲۳﴾", "english": " Can he, who was dead and We gave him life and made for him a light whereby he walks among men, be like him whose condition is that he is in utter darkness whence he cannot come forth? Thus have the doings of the disbelievers been made to seem fair to them.", "french": " Est-il possible que celui qui était mort et que Nous avons ressuscité et pour qui Nous avons fait une lumière grâce à laquelle il circule parmi les hommes, soit pareil à celui dont la condition est de se trouver dans les ténèbres, d’où il ne peut sortir ? Ainsi, on a fait que les actions des mécréants paraissent attrayantes à leurs yeux.", "german": " Kann wohl einer, der tot war – und dem Wir Leben gaben und für den Wir ein Licht machten, damit unter Menschen zu wandeln –, dem gleich sein, der in Finsternissen ist und nicht daraus hervorzugehen vermag? Also wurde den Ungläubigen schön gemacht, was sie zu tun pflegten.", "spanish": " Quien estaba muerto y le devolvimos la vida, dándole una luz con la que anda entre los hombres, ¿puede ser acaso como quien está en las más profundas tinieblas de las que no puede salir? Así se hizo que las acciones de los incrédulos les parecieran correctas a ellos.", "urdu": " اور کیا جو شخص مردہ ہو پھر اسے ہم نے زندہ کر دیا ہو اور اس کے لئے ایسی روشنی مقرر کی ہو‘ جس کے ذریعہ سے وہ لوگوں میں چلتا پھرتا ہو اسی شخص کی طرح (ہو سکتا) ہے جس کا حال یہ ہے کہ وہ اندھیروں میں (پڑا ہوا) ہے (اور) ان سے کسی وقت بھی نہیں نکلتا۔ اسی طرح کافروں کے لئے ان کے اعمال خوبصورت کرکے دکھائے گئے ہیں۔"}, {"arabic": " وَ کَذٰلِکَ جَعَلۡنَا فِیۡ کُلِّ قَرۡیَۃٍ اَکٰبِرَ مُجۡرِمِیۡہَا لِیَمۡکُرُوۡا فِیۡہَا ؕ وَ مَا یَمۡکُرُوۡنَ اِلَّا بِاَنۡفُسِہِمۡ وَ مَا یَشۡعُرُوۡنَ ﴿۱۲۴﴾", "english": " And thus have We made in every town the great ones from among its sinners such as are in utter darkness with the result that they plot therein; and they plot not except against their own souls; but they perceive not.", "french": " Et ainsi Nous avons laissé les leaders des pécheurs dans chaque ville y tramer des complots contre la vérité ; en fait, ils ne trament que contre leur propre âme, mais ils ne s’ en rendent pas compte.", "german": " Und so haben Wir es in jeder Stadt die Großen ihrer Sünder gemacht: dass sie darin Ränke schmieden. Und sie schmieden nur Ränke gegen ihre eigenen Seelen; allein sie merken es nicht.", "spanish": " Y de este modo permitimos a los cabecillas de los pecadores de cada ciudad a que tramaran en ellas contra la verdad ; pero no traman más que contra sus propias almas; aunque no caen en la cuenta.", "urdu": " اور ہم نے ہر اک بستی میں اس کے بڑے بڑے مجرموں کو ایسا ہی بنا دیا ہے۔ (یعنی وہ اپنے برے اعمال اچھی شکل میں دیکھتے ہیں) جس کا نتیجہ یہ ہوتا ہے کہ وہ اس (بستی) میں (نبیوں کے خلاف) تدبیریں کرتے ہیں لیکن درحقیقت وہ اپنی ہی جانوں کے خلاف تدبیریں کرتے ہیں اور وہ سمجھتے نہیں۔"}, {"arabic": " وَ اِذَا جَآءَتۡہُمۡ اٰیَۃٌ قَالُوۡا لَنۡ نُّؤۡمِنَ حَتّٰی نُؤۡتٰی مِثۡلَ مَاۤ اُوۡتِیَ رُسُلُ اللّٰہِ ؕۘؔ اَللّٰہُ اَعۡلَمُ حَیۡثُ یَجۡعَلُ رِسَالَتَہٗ ؕ سَیُصِیۡبُ الَّذِیۡنَ اَجۡرَمُوۡا صَغَارٌ عِنۡدَ اللّٰہِ وَ عَذَابٌ شَدِیۡدٌۢ بِمَا کَانُوۡا یَمۡکُرُوۡنَ ﴿۱۲۵﴾", "english": " And when there comes to them a Sign, they say, ‘We will not believe until we are given the like of that which Allah’s Messengers have been given.’ Allah knows best where to place His Message. Surely, humiliation before Allah and a severe punishment shall smite the offenders because of their plotting.", "french": " Et lorsqu’il leur vient un Signe, ils disent : « Nous ne voulons pas croire avant d’avoir reçu une révélation pareille à celle qui a été donnée aux Messagers d’Allāh. » Or, Allāh sait le mieux où placer Son Message. Assurément, aux yeux d’Allāh, l ’humiliation et un châtiment sévère frapperont les coupables pour les complots qu’ils ont ourdis.", "german": " Und wenn ihnen ein Zeichen kommt, sagen sie: \"Wir werden nicht eher glauben, als bis wir dasselbe erhalten, was die Gesandten Gottes erhalten haben.\" Allah weiß am besten, wohin Er Seine Botschaft hinlegt. Wahrlich, Erniedrigung vor Allah und eine strenge Strafe wird die Sünder treffen für ihre Ränke.", "spanish": " Y cuando les llega un Signo dicen: “No creeremos mientras no se nos dé algo semejante a lo que se ha dado a los Mensajeros de Al-lah”. Al-lah sabe mejor que nadie donde colocar su Mensaje. En verdad, la humillación ante Al-lah y un severo castigo afligirán a los pecadores por lo que tramaron.", "urdu": " اور جب ان کے پاس کوئی نشان آتا ہے تو کہتے ہیں کہ جب تک ہمیں ویسا ہی کلام نہ دیا جائے جو اللہ کے رسولوں کو دیا گیا ہے ہم ہرگز ایمان نہیں لائیں گے اللہ (سب سے) زیادہ جانتا ہے کہ وہ اپنی رسالت کہاں رکھے۔ جن لوگوں نے گناہ کیا ہے انہیں بوجہ اس کے کہ وہ (نبی کے خلاف) تدبیریں کرتے ہیں اللہ کی طرف سے ضرور ذلت اور سخت عذاب پہنچے گا۔"}, {"arabic": " فَمَنۡ یُّرِدِ اللّٰہُ اَنۡ یَّہۡدِیَہٗ یَشۡرَحۡ صَدۡرَہٗ لِلۡاِسۡلَامِ ۚ وَ مَنۡ یُّرِدۡ اَنۡ یُّضِلَّہٗ یَجۡعَلۡ صَدۡرَہٗ ضَیِّقًا حَرَجًا کَاَنَّمَا یَصَّعَّدُ فِی السَّمَآءِ ؕ کَذٰلِکَ یَجۡعَلُ اللّٰہُ الرِّجۡسَ عَلَی الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ ﴿۱۲۶﴾", "english": " So, whomsoever Allah wishes to guide, He expands his bosom for the acceptance of Islam; and as to him whom He wishes to let go astray, He makes his bosom narrow and close, as though he were mounting up into the skies. Thus does Allah inflict punishment on those who do not believe.", "french": " Ainsi, celui qu’Allāh désire guider, Il lui ouvre le cœur pour l’acceptation de l’Islam ; et quant à celui qu’Il désire laisser s’égarer, Il rend sa poitrine serrée et gênée comme s’il escaladait une hauteur escarpée. C’est ainsi qu’Allāh châtie ceux qui ne veulent pas croire.", "german": " Darum: wen Allah leiten will, dem weitet Er die Brust für den Islam; und wen Er in die Irre gehen lassen will, dem macht Er die Brust eng und bang, als sollte er zum Himmel emporklimmen. So verhängt Allah Strafe über jene, die nicht glauben.", "spanish": " Así, a quien Al-lah desea guiar le abre el corazón para que acepte el Islam; y a quien desea dejar que se extravíe le estrecha el corazón, como si tratara de subir cuesta arriba. Así impone Al-lah el castigo a quienes no creen.", "urdu": " اور جسے اللہ ہدایت دینے کا ارادہ کرتا ہے اس کا سینہ اسلام کے لئے کھول دیتا ہے اور جسے گمراہ کرنے کا ارادہ کر لیتا ہے اس کا سینہ نہایت تنگ کر دیتا ہے۔ گویا کہ وہ بلندی کی طرف چڑھ رہا ہے (اور) اسی طرح اللہ ان لوگوں پر جو ایمان نہیں لاتے عذاب نازل کرتا ہے۔"}, {"arabic": " وَ ہٰذَا صِرَاطُ رَبِّکَ مُسۡتَقِیۡمًا ؕ قَدۡ فَصَّلۡنَا الۡاٰیٰتِ لِقَوۡمٍ یَّذَّکَّرُوۡنَ ﴿۱۲۷﴾", "english": " And this is the path of thy Lord leading straight to Him. We have indeed explained the Signs in detail for a people who would be admonished.", "french": " Et ceci est le chemin droit de ton Seigneur. Nous avons en vérité expliqué les Signes en détail pour un peuple désireux d’être averti.", "german": " Das ist der Weg deines Herrn, der gerade. Wir haben die Zeichen bis ins einzelne dargelegt für Leute, die beherzigen mögen.", "spanish": " Mas éste es el camino de tu Señor, que lleva recto a Él. En verdad, hemos explicado con detalle los Signos para un pueblo que ha sido advertido.", "urdu": " اور یہ تیرے رب کا سیدھا راستہ ہے۔ ہم نشانات کو نصیحت حاصل کرنے والے لوگوں کے لئے کھول کر بیان کر چکے ہیں۔"}, {"arabic": " لَہُمۡ دَارُ السَّلٰمِ عِنۡدَ رَبِّہِمۡ وَ ہُوَ وَلِیُّہُمۡ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۲۸﴾", "english": " For them is the abode of peace with their Lord, and He is their Friend because of what they did.", "french": " Pour eux, il y a la Maison de la paix auprès de leur Seigneur, et Il est leur Ami pour ce qu’ils ont fait.", "german": " Für sie ist eine Wohnstatt des Friedens bei ihrem Herrn, und Er ist ihr Freund um ihrer Werke willen.", "spanish": " Para ellos es la morada de paz con su Señor, y Él es su Amigo por lo que hicieron.", "urdu": " ان کے لئے ان کے رب کے حضور میں سلامتی کا گھر (تیار) ہے اور جو کچھ وہ کرتے ہیں اس کے سبب سے وہ ان کا مددگار ہے۔"}, {"arabic": " وَ یَوۡمَ یَحۡشُرُہُمۡ جَمِیۡعًا ۚ یٰمَعۡشَرَ الۡجِنِّ قَدِ اسۡتَکۡثَرۡتُمۡ مِّنَ الۡاِنۡسِ ۚ وَ قَالَ اَوۡلِیٰٓؤُہُمۡ مِّنَ الۡاِنۡسِ رَبَّنَا اسۡتَمۡتَعَ بَعۡضُنَا بِبَعۡضٍ وَّ بَلَغۡنَاۤ اَجَلَنَا الَّذِیۡۤ اَجَّلۡتَ لَنَا ؕ قَالَ النَّارُ مَثۡوٰٮکُمۡ خٰلِدِیۡنَ فِیۡہَاۤ اِلَّا مَا شَآءَ اللّٰہُ ؕ اِنَّ رَبَّکَ حَکِیۡمٌ عَلِیۡمٌ ﴿۱۲۹﴾", "english": " And on the day when He will gather them all together, He will say , ‘O company of Jinn! you sought to make subservient to yourselves a great many from among men!’ And their friends from among men will say, ‘Our Lord! we profited from one another but now we have reached our term which Thou didst appoint for us.’ He will say, ‘The Fire is your abode, wherein you shall abide, save what Allah may will.’ Surely, thy Lord is Wise, All-Knowing.", "french": " Et le jour où Il les rassemblera tous, Il dira : « Ô compagnie des djinns, vous avez cherché à avoir un grand nombre du commun des hommes à votre service. » Et leurs amis d’entre les gens ordinaires diront : « Notre Seigneur, nous avons profité les uns des autres, mais maintenant nous avons atteint le terme que Tu avais fixé pour nous. » Il dira : « Votre habitation sera le Feu où vous demeurerez longtemps, sauf ce qu’Allāh voudra. » Assurément, ton Seigneur est Sage, Omniscient.", "german": " Und an dem Tage, da Er sie versammelt allzumal, dann: \"O Zunft der Jinn, ihr habt eine große Anzahl von Menschen auf eure Seite gezogen.\" Und ihre Freunde unter den Menschen werden sagen: \"Unser Herr, einige von uns haben von anderen Vorteil genossen, nun aber stehen wir am Ende unserer Frist, die Du uns bestimmtest.\" Er wird sprechen: \"Das Feuer sei euer Aufenthalt, darin sollt ihr bleiben, es sei denn, dass Allah anders will.\" Wahrlich, dein Herr ist allweise, allwissend.", "spanish": " Mas el día en que los reúna a todos dirá: “¡Oh, asamblea de los yinn! ¡Habéis intentado someter a vosotros a un gran número de los hombres!”. Y sus amigos de entre los hombres dirán: ¡Señor Nuestro! nos aprovechamos los unos de los otros, pero ahora hemos alcanzado el término que Tú nos fijaste”. Él dirá: “El Fuego es vuestra morada, en la que habitaréis mucho tiempo, salvo que Al-lah quiera otra cosa”. En verdad, tu Señor es Sabio, Omnisciente.", "urdu": " اور اس دن (کو یاد کرو) جب وہ ان سب کو اکٹھا کرے گا (پھر کہے گا) اے جنوں کی جماعت! تم نے انسانوں میں سے اکثر کو (اپنے ساتھ ملا) لیا تھا اور ان کے انسان مددگار کہیں گے کہ اے ہمارے رب! ہم میں سے بعضوں نے بعض سے فائدہ اٹھایا ہے‘ اور ہم اپنی اس مدت کو پہنچ گئے ہیں جو تو نے ہمارے لئے مقرر کی تھی۔ وہ فرمائے گا آگ تمہارا ٹھکانا ہے اس میں تم ایک لمبے عرصہ تک رہو گے سوائے اس کے کہ خدا کی مشیت کچھ اور چاہے۔ تیرا رب یقیناً حکمت والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ کَذٰلِکَ نُوَلِّیۡ بَعۡضَ الظّٰلِمِیۡنَ بَعۡضًۢا بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۱۳۰﴾٪", "english": " And in like manner do We set some of the wrongdoers over the others because of what they earned.", "french": " Et pareillement, Nous plaçons certains d’entre les impies au-dessus des autres à cause de ce qu’ils ont acquis.", "german": " Also setzen Wir einige der Frevler über die anderen, um dessentwillen, was sie sich erwarben.", "spanish": " Y de igual manera dimos poder a algunos injustos sobre otros, a causa de lo que ganaron.", "urdu": " اور اس طرح ہم بعض ظالموں کو بعض کا اس کام کی وجہ سے جو وہ کرتے ہیں‘ دوست بنا دیتے ہیں۔"}, {"arabic": " یٰمَعۡشَرَ الۡجِنِّ وَ الۡاِنۡسِ اَلَمۡ یَاۡتِکُمۡ رُسُلٌ مِّنۡکُمۡ یَقُصُّوۡنَ عَلَیۡکُمۡ اٰیٰتِیۡ وَ یُنۡذِرُوۡنَکُمۡ لِقَآءَ یَوۡمِکُمۡ ہٰذَا ؕ قَالُوۡا شَہِدۡنَا عَلٰۤی اَنۡفُسِنَا وَ غَرَّتۡہُمُ الۡحَیٰوۃُ الدُّنۡیَا وَ شَہِدُوۡا عَلٰۤی اَنۡفُسِہِمۡ اَنَّہُمۡ کَانُوۡا کٰفِرِیۡنَ ﴿۱۳۱﴾", "english": " ‘O company of Jinn and men! did not Messengers come to you from among yourselves who related to you My Signs and who warned you of the meeting of this your day?’ They will say, ‘We bear witness against ourselves.’ And the worldly life deceived them. And they will bear witness against themselves that they were disbelievers.", "french": " » Ô compagnie des djinns et des hommes ! Des Messagers choisis parmi vous ne sont-ils pas venus auprès de vous, vous raconter Mes Signes, et vous prévenir de la rencontre de votre jour que voici ? » Ils diront : « Nous portons témoignage contre nous-mêmes. » Et la vie temporelle les a trompés. Et ils rendront témoignage contre eux-mêmes qu’ils étaient mécréants.", "german": " O Zunft der Jinn und der Menschen! Sind nicht Gesandte zu euch gekommen aus eurer Mitte, die euch Meine Zeichen berichteten und euch warnten vor dem Eintreffen dieses eures Tages? Sie werden sagen: \"Wir zeugen wider uns selbst.\" Das irdische Leben hat sie betrogen, und sie werden wider sich selbst Zeugnis ablegen, dass sie Ungläubige waren.", "spanish": " “¡Oh asamblea de yinns y hombres! ¿Acaso no os llegaron Mensajeros de entre vosotros mismos que os relataron Mis Signos y os advirtieron del encuentro de este día vuestro?”. Dirán: “somos testigos contra nosotros mismos”. Pues la vida mundanal los sedujo. Y atestiguarán contra sí mismos que fueron incrédulos.", "urdu": " اے جنوں اور انسانوں کی جماعت! کیا تم میں سے (ہی) تمہارے پاس رسول نہیں آئے جو تمہیں میری آیات پڑھ کر سناتے تھے اور تمہیں آج کے دن کی ملاقات سے ڈراتے تھے۔ وہ کہیں گے کہ ہم اپنے خلاف (خود) گواہی دیتے ہیں۔ اور ورلی زندگی نے انہیں دھوکے میں ڈال دیا اور انہوں نے اپنے خلاف (آپ یہ) گواہی دی کہ وہ کافر تھے۔"}, {"arabic": " ذٰلِکَ اَنۡ لَّمۡ یَکُنۡ رَّبُّکَ مُہۡلِکَ الۡقُرٰی بِظُلۡمٍ وَّ اَہۡلُہَا غٰفِلُوۡنَ ﴿۱۳۲﴾", "english": " That is because thy Lord would not destroy the towns unjustly while their people were unwarned.", "french": " C’est que ton Seigneur ne détruirait pas injustement des villes tant que leurs habitants ne sont pas avertis.", "german": " Dies, weil dein Herr die Städte nicht ungerechterweise zerstören wollte, während ihre Bewohner ungewarnt waren.", "spanish": " Esto es porque tu Señor nunca destruiría injustamente las ciudades sin antes advertir a sus habitantes.", "urdu": " یہ (رسولوں کا بھیجنا) اس سبب سے تھا کہ تیرا رب شہروں کو ان کے باشندوں کے غافل ہونے کی حالت میں ظلم کے ساتھ تباہ نہیں کر سکتا تھا۔"}, {"arabic": " وَ لِکُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوۡا ؕ وَ مَا رَبُّکَ بِغَافِلٍ عَمَّا یَعۡمَلُوۡنَ ﴿۱۳۳﴾", "english": " And for all are degrees of rank according to what they do, and thy Lord is not unmindful of what they do.", "french": " Et pour tous il y aura des rangs selon ce qu’ils auront fait ; et ton Seigneur n’est pas inattentif à ce qu’ils font.", "german": " Für alle sind Rangstufen je nach ihrem Tun, und dein Herr übersieht nicht, was sie tun.", "spanish": " Y para todos habrá niveles de rango de acuerdo con lo que hayan hecho, y tu Señor no ignora lo que hacen.", "urdu": " اور ہر شخص (یا قوم) کے لئے اس کے اعمال کے مطابق درجات مقرر ہیں اور تیرا رب اس سے غافل نہیں جو وہ کرتے ہیں۔"}, {"arabic": " وَ رَبُّکَ الۡغَنِیُّ ذُو الرَّحۡمَۃِ ؕ اِنۡ یَّشَاۡ یُذۡہِبۡکُمۡ وَ یَسۡتَخۡلِفۡ مِنۡۢ بَعۡدِکُمۡ مَّا یَشَآءُ کَمَاۤ اَنۡشَاَکُمۡ مِّنۡ ذُرِّیَّۃِ قَوۡمٍ اٰخَرِیۡنَ ﴿۱۳۴﴾ؕ", "english": " And thy Lord is Self-Sufficient, full of mercy. If He please, He can do away with you and cause to succeed you what He pleases, even as He raised you from the offspring of other people.", "french": " Et ton Seigneur Se suffit à Lui-Même, le Seigneur de la miséricorde. S’Il le veut, Il a le pouvoir de Se défaire de vous, et vous faire succéder par qui Il veut, de même qu’Il vous a suscités de la descendance d’un autre peuple.", "german": " Dein Herr ist der Sich Selbst Genügende, voll der Barmherzigkeit. Wenn Er will, kann Er euch hinwegnehmen und an eurer Statt folgen lassen, was Ihm beliebt, wie Er auch euch entstehen ließ aus der Nachkommenschaft anderer.", "spanish": " Y tu Señor es Autosuficiente, pleno de misericordia. Si se le antoja, puede haceros desaparecer y que os suceda lo que le plazca, de igual modo a como os hizo nacer de la descendencia de otros pueblos.", "urdu": " اور تیرا رب کسی کا محتاج نہیں (اور) رحمت والا ہے اگر وہ چاہے تو تمہیں ہلاک کر دے اور جس طرح تمہیں ایک دوسری قوم کی نسل سے کھڑا کیا ہے (اسی طرح) جسے چاہے تمہارے (ہلاک کرنے کے) بعد تمہارا جانشین کردے۔"}, {"arabic": " اِنَّ مَا تُوۡعَدُوۡنَ لَاٰتٍ ۙ وَّ مَاۤ اَنۡتُمۡ بِمُعۡجِزِیۡنَ ﴿۱۳۵﴾", "english": " Surely, that which you are promised shall come to pass and you cannot frustrate it .", "french": " En vérité, ce qui vous a été promis arrivera et vous ne pourrez pas Nous contrarier.", "german": " Wahrlich, was euch versprochen wird, das wird geschehen, und ihr könnt es nicht vereiteln.", "spanish": " En verdad, lo que os ha prometido sucederá y no podréis impedirlo.", "urdu": " جس (بات) کا تم سے وعدہ کیا جا رہا ہے وہ ضرور ہو کر رہے گی اور تم کسی طرح بھی ہمیں عاجز نہیں کر سکتے۔"}, {"arabic": " قُلۡ یٰقَوۡمِ اعۡمَلُوۡا عَلٰی مَکَانَتِکُمۡ اِنِّیۡ عَامِلٌ ۚ فَسَوۡفَ تَعۡلَمُوۡنَ ۙ مَنۡ تَکُوۡنُ لَہٗ عَاقِبَۃُ الدَّارِ ؕ اِنَّہٗ لَا یُفۡلِحُ الظّٰلِمُوۡنَ ﴿۱۳۶﴾", "english": " Say, ‘O my people, act as best you can. I, too, am acting. Soon will you know whose will be the ultimate reward of the abode.’ Surely, the wrongdoers shall not prosper.", "french": " Dis : « Ô mon peuple, agissez au mieux que vous pouvez ; moi aussi j’agis. Vous ne tarderez pas à savoir qui recevra la meilleure récompense de la Demeure finale . » Assurément, ceux qui commettent le mal ne prospéreront pas.", "german": " Sprich: \"O mein Volk, handelt nach eurem Vermögen, auch ich werde handeln. Bald werdet ihr wissen, wessen der endgültige Lohn der Wohnstatt sein wird.\" Siehe, die Ungerechten haben nie Erfolg.", "spanish": " Diles: “¡Oh, pueblo mío! obrad del mejor modo que podáis. Yo actúo también. Pronto sabréis a quién corresponde la recompensa final de la morada”. Ciertamente, los injustos no prosperarán.", "urdu": " تو کہہ دے کہ اے میری قوم تم اپنے طریق پر عمل کرو‘ میں بھی (اپنے طریق) پر عمل کروں گا پھر تم جلدی ہی معلوم کرلو گے کہ اس گھر (یعنی دنیا) کا انجام کس کے حق میں ہوتا ہے۔ بات یہ ہے کہ ظالم (کبھی) کامیاب نہیں ہوتے۔"}, {"arabic": " وَ جَعَلُوۡا لِلّٰہِ مِمَّا ذَرَاَ مِنَ الۡحَرۡثِ وَ الۡاَنۡعَامِ نَصِیۡبًا فَقَالُوۡا ہٰذَا لِلّٰہِ بِزَعۡمِہِمۡ وَ ہٰذَا لِشُرَکَآئِنَا ۚ فَمَا کَانَ لِشُرَکَآئِہِمۡ فَلَا یَصِلُ اِلَی اللّٰہِ ۚ وَ مَا کَانَ لِلّٰہِ فَہُوَ یَصِلُ اِلٰی شُرَکَآئِہِمۡ ؕ سَآءَ مَا یَحۡکُمُوۡنَ ﴿۱۳۷﴾", "english": " And they have assigned Allah a portion of the crops and cattle which He has produced, and they say, ‘This is for Allah,’ as they imagine, ‘and this is for our idols.’ But that which is for their idols reaches not Allah, while that which is for Allah reaches their idols. Evil is what they judge.", "french": " Et ils ont attribué à Allāh une part des récoltes qu'Il a produites et des bestiaux qu’Il a créés, et ils disent : « Ceci est pour Allāh » – comme ils se l’imaginent – « et ceci est pour nos divinités. » Mais ce qui est pour leurs divinités n’arrive pas jusqu’à Allāh, tandis que ce qui est pour Allāh arrive à leurs divinités. Très mauvaise est la conclusion qu’ils en tirent.", "german": " Sie haben für Allah einen Anteil ausgesetzt an den Feldfrüchten und dem Vieh, das Er wachsen ließ, und sie sagen: \"Das ist für Allah\", wie sie meinen, \"und das ist für unsere Götzen\". Aber was für ihre Götzen ist, das erreicht Allah nicht, während das, was für Allah ist, ihre Götzen erreicht. Übel ist, wie sie urteilen.", "spanish": " Ellos asignan a Al-lah una parte de los cultivos y del ganado que Él ha producido, y dicen: “esto es para Al-lah”, según piensan ellos, “y esto es para nuestros ídolos”. Pero lo que es para sus ídolos no llega a Al-lah, mientras que lo que es para Al-lah llega a sus ídolos. ¡Qué malo es lo que concluyen!", "urdu": " اور انہوں نے ایک حصہ اس کھیتی میں سے یا جانوروں میں سے اللہ کا مقرر (کر چھوڑا) ہے جو (کھیتی یا جانور) اس (یعنی خدا) نے پیدا کئے ہیں۔ پھر اپنے گمان سے کہتے ہیں کہ اتنا تو اللہ کے لئے ہے اور اتنا ہمارے شریکوں کے لئے۔ پھر یہ دعوے کرتے ہیں کہ جو ان کے شریکوں کا (حصہ) ہوتا ہے وہ تو اللہ کو نہیں پہنچتا اور جو اللہ کا (حصہ) ہوتا ہے وہ ان کے شریکوں کو پہنچ جاتا ہے وہ کیا ہی برا فیصلہ کرتے ہیں۔"}, {"arabic": " وَ کَذٰلِکَ زَیَّنَ لِکَثِیۡرٍ مِّنَ الۡمُشۡرِکِیۡنَ قَتۡلَ اَوۡلَادِہِمۡ شُرَکَآؤُہُمۡ لِیُرۡدُوۡہُمۡ وَ لِیَلۡبِسُوۡا عَلَیۡہِمۡ دِیۡنَہُمۡ ؕ وَ لَوۡ شَآءَ اللّٰہُ مَا فَعَلُوۡہُ فَذَرۡہُمۡ وَ مَا یَفۡتَرُوۡنَ ﴿۱۳۸﴾", "english": " And in like manner have their associate-gods made the killing of their children appear beautiful to many of the idolaters that they may ruin them and cause them confusion in their religion. And if Allah had enforced His will, they would not have done this; so leave them alone with that which they invent.", "french": " Et pareillement, à un grand nombre d’associateurs, leurs associés imaginaires ont rendu sous un bel aspect le meurtre de leurs propres enfants, afin de les ruiner et les embrouiller dans leur religion. Et si Allāh l’avait voulu, ils n’auraient pas fait cela. Laisse-les donc dans leur situation et laisse aussi ce qu’ils inventent.", "german": " Und ebenso haben ihre Götter vielen der Götzenanbeter das Töten ihrer Kinder als wohlgefällig erscheinen lassen, damit sie sie verderben und ihnen ihren Glauben verwirren möchten. Und hätte Allah Seinen Willen erzwungen, sie hätten das nicht getan; so überlasse sie sich selbst mit dem, was sie erdichten.", "spanish": " De la misma manera sus asociados hicieron que el asesinato de sus hijos fuera considerado justo por muchos de los idólatras para rruinarlos y confundirlos en su religión. Y si Al-lah hubiese ejecutado su Voluntad, no habrían hecho esto; dejadlos pues solos con lo que inventan.", "urdu": " اور اسی طرح مشرکوں میں سے بہتوں کو ان کے شریکوں نے ان کے ہلاک کرنے کے لئے اور ان کے دین کو ان پر مشتبہ کرنے کے لئے اپنی اولاد کا قتل کرنا خوبصورت کرکے دکھایا تھا اور اگر اللہ چاہتا تووہ (مشرک) ایسا نہ کرتے۔ پس تو ان کو بھی اور ان کے جھوٹ کو بھی نظر انداز کر دے۔"}, {"arabic": " وَ قَالُوۡا ہٰذِہٖۤ اَنۡعَامٌ وَّ حَرۡثٌ حِجۡرٌ ٭ۖ لَّا یَطۡعَمُہَاۤ اِلَّا مَنۡ نَّشَآءُ بِزَعۡمِہِمۡ وَ اَنۡعَامٌ حُرِّمَتۡ ظُہُوۡرُہَا وَ اَنۡعَامٌ لَّا یَذۡکُرُوۡنَ اسۡمَ اللّٰہِ عَلَیۡہَا افۡتِرَآءً عَلَیۡہِ ؕ سَیَجۡزِیۡہِمۡ بِمَا کَانُوۡا یَفۡتَرُوۡنَ ﴿۱۳۹﴾", "english": " And they say, ‘Such and such cattle and crops are forbidden. None shall eat thereof save whom we please’ — so they allege — and there are cattle whose backs are forbidden, and there are cattle over which they pronounce not the name of Allah, forging a lie against Him. Soon will He requite them for that which they have fabricated.", "french": " Et ils disent : « Tels ou tels bestiaux ou telle ou telle récolte sont interdits ; personne n’a le droit d’en manger, sauf ceux que nous voudrons » – voilà ce qu’ils affirment. Il y a aussi des bestiaux dont le dos est interdit, et il y a des bestiaux sur lesquels ils ne prononcent pas le nom d’Allāh, inventant un mensonge contre Lui ; Il ne tardera pas à les rétribuer pour ce qu’ils ont inventé.", "german": " Sie sagen: \"Dieses Vieh und diese Feldfrüchte sind verboten; niemand soll davon essen außer wem wir es erlauben\" – so behaupten sie –, und es gibt Tiere, deren Rücken (zum Reiten) verboten ist, und Tiere, über die sie nicht den Namen Allahs aussprechen, Lüge wider Ihn erfindend. Bald wird Er ihnen vergelten, was sie erdichteten.", "spanish": " Mas dicen: “Estos y aquellos ganados y cultivos están prohibidos. Nadie los comerá salvo quien queramos” – así alegan– y hay ganado cuyos lomos están prohibidos y ganado sobre el que no invocan el nombre de Al-lah urdiendo una mentira contra Él. Pronto les dará su merecido por lo que han tramado.", "urdu": " اور وہ اپنے گمان کی بنا پر کہتے ہیں کہ فلاں فلاں جانور اور کھیتی (ایسے ہیں کہ ان کا کھانا) ممنوع ہے۔ انہیں صرف وہی کھا سکتا ہے جس کے متعلق ہم کہیں (کہ وہ کھائے) اور (کہتے ہیں کہ) کچھ جانور ایسے ہیں کہ ان کی پیٹھیں (سواری کے لئے) حرام کر دی گئی ہیں اور کچھ جانور ایسے ہیں کہ وہ ان پر اللہ کا نام نہیں لیتے (یہ ان کا قول و فعل) اس (اللہ) پر افتراء کے طور پر (ہوتا) ہے‘ وہ انہیں اس جھوٹ کے سبب سے جو وہ بناتے ہیں ضرور سزا دے گا۔"}, {"arabic": " وَ قَالُوۡا مَا فِیۡ بُطُوۡنِ ہٰذِہِ الۡاَنۡعَامِ خَالِصَۃٌ لِّذُکُوۡرِنَا وَ مُحَرَّمٌ عَلٰۤی اَزۡوَاجِنَا ۚ وَ اِنۡ یَّکُنۡ مَّیۡتَۃً فَہُمۡ فِیۡہِ شُرَکَآءُ ؕ سَیَجۡزِیۡہِمۡ وَصۡفَہُمۡ ؕ اِنَّہٗ حَکِیۡمٌ عَلِیۡمٌ ﴿۱۴۰﴾", "english": " And they say, ‘That which is in the wombs of such and such cattle is exclusively reserved for our males and is forbidden to our wives; but if it be born dead, then they are all partakers thereof. He will reward them for their assertion. Surely, He is Wise, All-Knowing.", "french": " Et ils disent : « Ce qui est dans le ventre de telle ou telle bête est exclusivement réservé à nos mâles et interdit à nos épouses ; mais si la bête est mort- née , alors ils y participent tous. Bientôt, Il les rétribuera pour leur assertion ; assurément, Il est Sage, Omniscient. »", "german": " Und sie sagen: \"Was im Schoße von diesen Tieren ist, das ist ausschließlich unseren Männern vorbehalten und unseren Frauen verboten; wird es aber tot (geboren), dann haben sie (alle) Anteil daran.\" Er wird ihnen vergelten für ihre Behauptung. Wahrlich, Er ist allweise, allwissend.", "spanish": " Y dicen: “Lo que está en el vientre de éste o aquel ganado está reservado exclusivamente para nuestros varones y está rohibido para nuestras esposas; pero si naciera muerto, entonces todos pueden participar de él. Él les dará su merecido por su afirmación sin fundamento. En verdad, Él es Sabio, Omnisciente.", "urdu": " اور وہ کہتے ہیں کہ جو کچھ ان جانوروں کے پیٹوں میں ہے وہ خالصتہ ہمارے مردوں کے لئے ہے اور ہماری بیویوں پر حرام کیا گیا ہے‘ ہاں اگر وہ مردہ ہو تو وہ (سب) اس شریک ہیں‘ وہ ضرور ان کی بات کی انہیں سزا دے گا۔ یاد رکھو کہ وہ حکمت والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " قَدۡ خَسِرَ الَّذِیۡنَ قَتَلُوۡۤا اَوۡلَادَہُمۡ سَفَہًۢا بِغَیۡرِ عِلۡمٍ وَّ حَرَّمُوۡا مَا رَزَقَہُمُ اللّٰہُ افۡتِرَآءً عَلَی اللّٰہِ ؕ قَدۡ ضَلُّوۡا وَ مَا کَانُوۡا مُہۡتَدِیۡنَ ﴿۱۴۱﴾٪", "english": " Losers indeed are they who kill their children foolishly for lack of knowledge, and make unlawful what Allah has provided for them, forging a lie against Allah. They have indeed gone astray and are not rightly guided.", "french": " En vérité, ils sont perdants, ceux qui, par imbécillité et ignorance, tuent leurs enfants, et rendent illicites des aliments qu'Allāh leur a accordés, inventant un mensonge contre Allāh. Ils se sont assurément égarés et ne sont pas bien guidés.", "german": " Verloren fürwahr sind jene, die ihre Kinder töricht töten, aus Unwissenheit, und das für unerlaubt erklären, was Allah ihnen gegeben hat, Lüge wider Allah erfindend. Sie sind wahrlich irregegangen und sind nicht rechtgeleitet.", "spanish": " Son ciertamente perdedores quienes matan neciamente a sus hijos por falta de conocimiento, y declaran ilícito lo que Al-lah les ha proporcionado, urdiendo una mentira contra Al-lah. En verdad se han extraviado y no están guiados rectamente.", "urdu": " وہ لوگ جنہوں نے اپنی اولاد کو بے وقوفی سے بغیر علم کے قتل کردیا ہے اور جو کچھ اللہ نے انہیں دیا تھا سے اللہ پر افتراء کرتے ہوئے (اپنے پر) حرام کر لیا ہے۔ وہ گھاٹا پانے والے ہو گئے ہیں اور گمراہ ہو گئے ہیں اور وہ ہدایت پانے والوں میں سے نہیں (بنے)"}, {"arabic": " وَ ہُوَ الَّذِیۡۤ اَنۡشَاَ جَنّٰتٍ مَّعۡرُوۡشٰتٍ وَّ غَیۡرَ مَعۡرُوۡشٰتٍ وَّ النَّخۡلَ وَ الزَّرۡعَ مُخۡتَلِفًا اُکُلُہٗ وَ الزَّیۡتُوۡنَ وَ الرُّمَّانَ مُتَشَابِہًا وَّ غَیۡرَ مُتَشَابِہٍ ؕ کُلُوۡا مِنۡ ثَمَرِہٖۤ اِذَاۤ اَثۡمَرَ وَ اٰتُوۡا حَقَّہٗ یَوۡمَ حَصَادِہٖ ۫ۖ وَ لَا تُسۡرِفُوۡا ؕ اِنَّہٗ لَا یُحِبُّ الۡمُسۡرِفِیۡنَ ﴿۱۴۲﴾ۙ", "english": " And He it is Who brings into being gardens, trellised and untrellised, and the date-palm and cornfields whose fruits are of diverse kinds, and the olive and the pomegranate, alike and unlike. Eat of the fruit of each when it bears fruit, but pay His due on the day of harvest and exceed not the bounds. Surely, Allah loves not those who exceed the bounds.", "french": " Et c’est Lui Qui produit des jardins, garnis de treillis et sans treillis, les datteraies et les cultures aux nourritures variées, et l’olive et la grenade, semblables et dissemblables. Mangez des fruits de chacun quand il en produit. Et au jour de la récolte, payez ce qui Lui est dû et ne dépassez pas les bornes. Assurément, Allāh n’aime pas ceux qui dépassent les bornes.", "german": " Er ist es, Der Gärten wachsen lässt, mit Rebspalieren und ohne Rebspalieren, und die Dattelpalme und Getreidefelder, deren Früchte von verschiedener Art sind, und die Olive und den Granatapfel, einander ähnlich und unähnlich. Esset von ihren Früchten, wenn sie Frucht tragen, doch gebet Ihm die Gebühr davon am Tage der Ernte und überschreitet die Grenzen nicht. Wahrlich, Er liebt die Maßlosen nicht.", "spanish": " Él es quien crea jardines, con emparrados y sin ellos, así como palmeras y trigales, con frutos de diversas clases, olivos y granados, similares y distintos. Comed de los frutos de cada uno cuando estén en sazón, pero pagad lo debido a Él el día de la recolección y no superéis los límites. En verdad Al-lah no ama a quienes se exceden.", "urdu": " وہ (خدا) ہی ہے جس نے لکڑیوں کے سہارے پر کھڑے ہونے والے باغات اور بغیر سہارے کھڑے ہونے والے باغات اور کھجوریں اور کھیتیاں جن کے مزے مختلف ہیں اور زیتون اور انار کو اس صورت میں کہ وہ (آپس میں) مشابہ (بھی) ہیں اور (بعض صورتوں میں) نہیں (بھی) پیدا کیا ہے تم جب ان درختوں کو پھل لگے تو ان کے پھل کھاٶ اور اس کے کاٹنے کے دن اس (خدا) کا حق ادا کرو‘ اور اسراف سے کام نہ لو کیونکہ وہ اسراف سے کام لینے والوں کو پسند نہیں کرتا۔"}, {"arabic": " وَ مِنَ الۡاَنۡعَامِ حَمُوۡلَۃً وَّ فَرۡشًا ؕ کُلُوۡا مِمَّا رَزَقَکُمُ اللّٰہُ وَ لَا تَتَّبِعُوۡا خُطُوٰتِ الشَّیۡطٰنِ ؕ اِنَّہٗ لَکُمۡ عَدُوٌّ مُّبِیۡنٌ ﴿۱۴۳﴾ۙ", "english": " And of the cattle He has created some for burden and some for slaughter. Eat of that which Allah has provided for you, and follow not the footsteps of Satan. Surely, he is to you an open foe.", "french": " Et parmi les bestiaux, Il en a créé certains pour être bêtes de somme et d’autres pour être abattus. Nourrissez-vous des aliments qu'Allāh vous a accordés et ne suivez pas les pas de Satan. Il est, assurément, votre ennemi déclaré.", "german": " Unter dem Vieh sind Lasttiere und Schlachttiere. Esset von dem, was Allah euch gegeben hat, und folget nicht den Fußstapfen Satans. Wahrlich, er ist euch ein offenkundiger Feind.", "spanish": " Y del ganado, a unos los creó para carga y a otros para el sacrificio. Comed de lo que Al-lah os ha proporcionado, y no sigáis los pasos de Satanás. En verdad, él es vuestro enemigo declarado.", "urdu": " اور چارپایوں میں سے لادو جانور بھی ہیں اور چھوٹے بھی ہیں۔ اللہ نے جو کچھ تمہیں دیا ہے تم اس میں سے کھاٶ اور شیطان کے قدم بقدم نہ چلو‘ وہ یقیناً تمہارا کھلا (کھلا) دشمن ہے۔"}, {"arabic": " ثَمٰنِیَۃَ اَزۡوَاجٍ ۚ مِنَ الضَّاۡنِ اثۡنَیۡنِ وَ مِنَ الۡمَعۡزِ اثۡنَیۡنِ ؕ قُلۡ ءٰٓالذَّکَرَیۡنِ حَرَّمَ اَمِ الۡاُنۡثَیَیۡنِ اَمَّا اشۡتَمَلَتۡ عَلَیۡہِ اَرۡحَامُ الۡاُنۡثَیَیۡنِ ؕ نَبِّـُٔوۡنِیۡ بِعِلۡمٍ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۱۴۴﴾ۙ", "english": " And of the cattle He has created eight mates: of the sheep two, and of the goats two; — say, ‘Is it the two males that He has forbidden or the two females or that which the wombs of the two females contain? Inform me with knowledge, if you are truthful.’", "french": " Huit couples en tout se composant de deux pour les moutons et deux pour les chèvres. Dis : « Est-ce les deux mâles qu’Il a interdits, ou les deux femelles, ou ce qui est encore dans le ventre des deux femelles ? Renseignez-moi avec connaissance, si vous êtes véridiques. »", "german": " Acht Paare: zwei von den Schafen und zwei von den Ziegen. Sprich: \"Sind es die beiden Männchen, die Er verboten hat, oder die beiden Weibchen oder das, was der Mutterschoß der beiden Weibchen umschließt? Verkündet es mir mit Wissen, wenn ihr wahrhaft seid.\"", "spanish": " Afirman que Al-lah ha creado ocho parejas en conjunto compuestas por dos de ovinos y dos de caprinos; diles: “¿son los dos machos los que Él ha prohibido, o las dos hembras, o lo que éstas llevan en sus vientres? Comunicádmelo con conocimiento, si sois veraces”.", "urdu": " (اس نے) آٹھ جوڑوں کو (پیدا کیا ہے) دنبہ میں سے دو کو‘ اور بکرے میں سے دو کو۔ تو ان سے کہہ کہ کیا اس نے دو نروں کو حرام کیا ہے یا دو مادینوں کو‘ یا مادینوں کے رحموں نے جس چیز کو بھی (اپنے اندر) لپیٹا ہوا ہے (اس کو حرام کیا ہے) اگر تم سچے ہو تو مجھے کسی علم کی بنا پر (یہ بات) بتاٶ۔"}, {"arabic": " وَ مِنَ الۡاِبِلِ اثۡنَیۡنِ وَ مِنَ الۡبَقَرِ اثۡنَیۡنِ ؕ قُلۡ ءٰٓالذَّکَرَیۡنِ حَرَّمَ اَمِ الۡاُنۡثَیَیۡنِ اَمَّا اشۡتَمَلَتۡ عَلَیۡہِ اَرۡحَامُ الۡاُنۡثَیَیۡنِ ؕ اَمۡ کُنۡتُمۡ شُہَدَآءَ اِذۡ وَصّٰکُمُ اللّٰہُ بِہٰذَا ۚ فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا لِّیُضِلَّ النَّاسَ بِغَیۡرِ عِلۡمٍ ؕ اِنَّ اللّٰہَ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿۱۴۵﴾٪", "english": " And of the camels two, and of the oxen two. Say, ‘Is it the two males that He has forbidden or the two females or that which the wombs of the two females contain? Were you present when Allah enjoined this on you?’ Who is then more unjust than he who forges a lie against Allah that he may lead men astray without knowledge? Surely, Allah guides not the unjust people.", "french": " Et deux pour les chameaux, et deux pour les bœufs. Dis : « Est-ce les deux mâles qu’Il a interdits, ou les deux femelles, ou bien encore ce que contient le ventre des deux femelles ? Etiez-vous là lorsque Allāh vous l’a enjoint ? » Qui donc est plus injuste que celui qui invente un mensonge contre Allāh par ignorance, pour égarer les hommes ? Assurément, Allāh ne guide pas les hommes injustes.", "german": " Und von den Kamelen zwei, und von den Rindern zwei. Sprich: \"Sind es die beiden Männchen, die Er verboten hat, oder die beiden Weibchen oder das, was der Mutterschoß der beiden Weibchen umschließt? Waret ihr dabei, als Allah euch dies gebot?\" Wer ist also ungerechter als der, welcher eine Lüge wider Allah ersinnt, um Leute ohne Wissen irrezuführen? Wahrlich, Allah weist dem ungerechten Volk nicht den Weg.", "spanish": " Y dos de los camélidos y dos de los bovinos. Diles: “¿son los dos machos los que Él ha prohibido, o las dos hembras o lo que éstas llevan en sus vientres? ¿Estabais presentes cuando Al-lah os impuso esto? ¿quién es más injusto que quien urde una mentira contra Al-lah para hacer que los hombres se extravíen sin conocimiento? Ciertamente, Al-lah no guía a los injustos.", "urdu": " اور (اس نے) اونٹ میں سے دو(۲) کو اور گائے میں سے دو کو (پیدا کیا ہے) تو ان سے کہہ کہ کیا اس نے دونوں نروں کو حرام کیا ہے یا دونوں مادینوں کو یا مادینوں کے رحموں نے جس چیز کو بھی (اپنے اندر) لپیٹا ہوا ہے (کہو) کیا تم اس وقت جب تمہیں اللہ نے اس (امر) کا حکم دیا تھا موجود تھے (اگر نہیں تو) پھر اس سے زیادہ ظالم کون ہو سکتا ہے جو جان بوجھ کر اللہ پر اس لئے جھوٹ باندھے کہ لوگوں کو بغیر علم کے گمراہ کر دے۔ اللہ ظالم لوگوں کو یقیناً راہ نہیں دکھاتا۔"}, {"arabic": " قُلۡ لَّاۤ اَجِدُ فِیۡ مَاۤ اُوۡحِیَ اِلَیَّ مُحَرَّمًا عَلٰی طَاعِمٍ یَّطۡعَمُہٗۤ اِلَّاۤ اَنۡ یَّکُوۡنَ مَیۡتَۃً اَوۡ دَمًا مَّسۡفُوۡحًا اَوۡ لَحۡمَ خِنۡزِیۡرٍ فَاِنَّہٗ رِجۡسٌ اَوۡ فِسۡقًا اُہِلَّ لِغَیۡرِ اللّٰہِ بِہٖ ۚ فَمَنِ اضۡطُرَّ غَیۡرَ بَاغٍ وَّ لَا عَادٍ فَاِنَّ رَبَّکَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۴۶﴾", "english": " Say, ‘I find not in what has been revealed to me aught forbidden to an eater who wishes to eat it, except it be that which dies of itself, or blood poured forth, or the flesh of swine — for all that is unclean — or what is profane, on which is invoked the name of other than Allah. But whoso is driven by necessity, being neither disobedient nor exceeding the limit , then surely thy Lord is Most Forgiving, Merciful.’", "french": " Dis : « Dans ce qui m’a été révélé, je ne trouve rien d’interdit à un mangeur d’en manger, sauf ce qui meurt de mort naturelle, ou bien du sang répandu, ou encore la chair de porc - car tout cela est impur - ou ce qui est profane, ce sur quoi un nom autre que celui d’Allāh a été invoqué. Mais pour celui qui y est poussé par nécessité, sans vouloir désobéir et ni dépasser les limites, alors assurément ton Seigneur est Très-Pardonnant, Miséricordieux. »", "german": " Sprich: \"Ich finde in dem, was mir offenbart ward, nichts, das einem Essenden, der es essen möchte, verboten wäre, es sei denn von selbst Verendetes oder vergossenes Blut oder Schweinefleisch – denn das ist unrein – oder Verbotenes, über das ein anderer Name angerufen ward als Allahs. Wer aber durch Not getrieben wird – nicht ungehorsam und das Maß überschreitend –, dann ist dein Herr allverzeihend, barmherzig.\"", "spanish": " Diles: “En lo que me ha sido revelado no encuentro nada prohibido para quien desee comerlo, excepto lo que ha muerto solo, la sangre derramada, la carne de cerdo – porque todo ello es impuro – o lo profano, sobre lo que ha sido invocado un nombre distinto del de Al-lah. Pero para quien se vea empujado por la desesperación, sin ser desobediente ni superar el límite , sepa que tu Señor es ciertamente el Sumo Indulgente, Misericordioso”.", "urdu": " تو ان سے کہہ کہ جو کچھ میری طرف نازل کیا گیا ہے میں تو اس میں اس شخص پر جو کسی چیز کو کھانا چاہے سوائے مردہ یا بہتے ہوئے خون یا سٶر کے گوشت کے کوئی چیز حرام نہیں پاتا (سٶر کا گوشت) اس لئے کہ وہ نجس ہے۔ یا فسق کو (حرام پاتا ہوں) یعنی اس چیز کو جس پر خدا کے سوا کسی اور چیز کا نام لیا گیا ہو۔ لیکن جو شخص (اس کے کھانے پر) مجبور ہو جائے بغیر اس کے کہ وہ (شریعت کا) مقابلہ کرنے والا ہو یا حد سے نکلنے والا ہو تو (وہ یاد رکھے کہ) تیرا رب یقیناً بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ عَلَی الَّذِیۡنَ ہَادُوۡا حَرَّمۡنَا کُلَّ ذِیۡ ظُفُرٍ ۚ وَ مِنَ الۡبَقَرِ وَ الۡغَنَمِ حَرَّمۡنَا عَلَیۡہِمۡ شُحُوۡمَہُمَاۤ اِلَّا مَا حَمَلَتۡ ظُہُوۡرُہُمَاۤ اَوِ الۡحَوَایَاۤ اَوۡ مَا اخۡتَلَطَ بِعَظۡمٍ ؕ ذٰلِکَ جَزَیۡنٰہُمۡ بِبَغۡیِہِمۡ ۫ۖ وَ اِنَّا لَصٰدِقُوۡنَ ﴿۱۴۷﴾", "english": " And to those who are Jews We forbade all animals having claws; and of the oxen and the sheep and goats did We forbid them their fats, save that which their backs bear or the intestines, or that which is mixed with a bone. That is the reward We gave them for their rebellion. And most surely We are truthful.", "french": " Et à ceux qui sont Juifs, Nous avons interdit tous les animaux qui ont des griffes ; et des bœufs, des moutons et des chèvres, Nous leur avons interdit le gras, sauf celui que portent leurs dos ou leurs entrailles, ou ce qui est attaché aux os. C’est là la rétribution que Nous leur avons accordée pour leur rébellion. Et assurément, Nous sommes véridique.", "german": " Und denen, die Juden sind, haben Wir alles Getier untersagt, das Klauen hat; und vom Rindvieh und den Schafen und Ziegen haben Wir ihnen das Fett verboten, ausgenommen das, was an ihren Rücken sitzt oder in den Eingeweiden oder am Knochen haftet. Das ist der Lohn, den Wir ihnen für ihre Abtrünnigkeit gaben. Und siehe, Wir sind wahrhaft.", "spanish": " En cuanto a los judíos, les prohibimos todos los animales con garra; y de los bovinos, ovinos y caprinos, les prohibimos sus grasas, salvo las que tienen sus lomos, los intestinos o lo que está mezclado con el hueso. Ésa es la recompensa que les dimos por su rebelión. Pues en verdad somos veraces.", "urdu": " اور جو لوگ یہودی ہیں ہم نے ان پر ہر اک ناخن والا جانور حرام کر دیا تھا۔ اور گائے (بیل) اور بھیڑ (بکری) میں سے ہم نے ان پر ان دونوں کی چربیاں باستثنا اس (چربی) کے جو ان کی پیٹھوں یا انتڑیوں پر ہو یا جو ہڈی سے ملی ہوئی ہو حرام کر دی تھیں‘ یہ ہم نے انہیں ان کی نافرمانی کی وجہ سے سزا دی تھی اور ہم یقیناً سچے ہیں۔"}, {"arabic": " فَاِنۡ کَذَّبُوۡکَ فَقُلۡ رَّبُّکُمۡ ذُوۡ رَحۡمَۃٍ وَّاسِعَۃٍ ۚ وَ لَا یُرَدُّ بَاۡسُہٗ عَنِ الۡقَوۡمِ الۡمُجۡرِمِیۡنَ ﴿۱۴۸﴾", "english": " But if they accuse thee of falsehood, say, ‘Your Lord is possessed of all-embracing mercy, and His wrath shall not be turned back from the guilty people.’", "french": " Mais s’ils t’accusent de mensonge, alors dis : « Votre Seigneur est Seigneur d’immense miséricorde et Son courroux ne sera point détourné du peuple coupable. »", "german": " Wenn sie dich aber der Lüge zeihen, so sprich: \"Euer Herr ist von allumfassender Barmherzigkeit, doch Seine Strenge soll nicht abgewendet werden von dem schuldigen Volk.\"", "spanish": " Mas si te acusan de falsedad, diles: “Vuestro Señor posee la más amplia misericordia, pero su cólera no se alejará de los hombres culpables”.", "urdu": " پھر اگر وہ تجھے جھٹلائیں تو تو (ان سے) کہہ دے کہ تمہارا رب وسیع رحمت والا ہے اور اس کا عذاب مجرم لوگوں سے ہٹایا نہیں جا سکتا۔"}, {"arabic": " سَیَقُوۡلُ الَّذِیۡنَ اَشۡرَکُوۡا لَوۡ شَآءَ اللّٰہُ مَاۤ اَشۡرَکۡنَا وَ لَاۤ اٰبَآؤُنَا وَ لَا حَرَّمۡنَا مِنۡ شَیۡءٍ ؕ کَذٰلِکَ کَذَّبَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ حَتّٰی ذَاقُوۡا بَاۡسَنَا ؕ قُلۡ ہَلۡ عِنۡدَکُمۡ مِّنۡ عِلۡمٍ فَتُخۡرِجُوۡہُ لَنَا ؕ اِنۡ تَتَّبِعُوۡنَ اِلَّا الظَّنَّ وَ اِنۡ اَنۡتُمۡ اِلَّا تَخۡرُصُوۡنَ ﴿۱۴۹﴾", "english": " Those who join gods with God will say, ‘If Allah had pleased, we could not have joined gods with Him , nor could our fathers; nor could we have made anything unlawful.’ In like manner did those who were before them accuse God’s Messengers of falsehood, until they tasted of Our wrath. Say, ‘Have you any knowledge? Then produce it for us. You follow nothing but mere conjecture. And you do nothing but lie.’", "french": " Ceux qui associent des partenaires à Allāh diront : « Si Allāh l’avait voulu, nous n’aurions pas pu Lui attribuer des associés, et nos pères non plus et nous n’aurions pas pu rendre quoi que ce soit illicite. » De la même façon, leurs devanciers ont accusé les Messagers d’Allāh de mentir jusqu’à ce qu’ils aient goûté Notre courroux. Dis : « Avez-vous quelque connaissance ? Alors, montrez-la-nous. Vous ne suivez que des conjectures, et vous ne faites que mentir. »", "german": " Die Götzendiener werden sagen: \"Wäre es Allahs Wille, wir – wie unsere Väter – hätten keine Götter angebetet; auch hätten wir nichts unerlaubt gemacht.\" Also leugneten schon jene, die vor ihnen waren, bis sie Unsere Strenge zu kosten bekamen. Sprich: \"Habt ihr irgendein Wissen? Dann bringt es für uns zum Vorschein. Doch ihr folgt nur einem Wahn, und ihr vermutet bloß.\"", "spanish": " Los que asocian partícipes a Al-lah dirán: “si Al-lah hubiese querido no habríamos podido asociar a Él otros dioses, ni lo habrían hecho nuestros padres; ni habríamos podido hacer nada ilícito”. e la misma manera quienes les precedieron acusaron de falsedad a los Mensajeros de Dios , hasta que probaron nuestra cólera. Diles: “¿Tenéis algún conocimiento? Presentádnoslo. No seguís más que conjeturas y no hacéis más que especular”.", "urdu": " جنہوں نے شرک کیا ہے ضرور کہیں گے کہ اگر اللہ چاہتا تو نہ ہم (اور) نہ ہمارے باپ دادے (کبھی) شرک کرتے اور نہ کسی چیز کو حرام کرتے جو ان سے پہلے (گزرے) ہیں انہوں نے (بھی) اسی طرح (ہماری وحی کو) اس وقت تک کہ انہوں نے ہمارے عذاب کو چکھ نہ لیا جھٹلایا تھا۔ تو ان سے کہہ کہ کیا تمہارے پاس کوئی ایسا علم ہے کہ تم اسے ہمارے خاموش کرنے کے لئے پیش کر سکو۔ تم گمان کے سوا کسی چیز کی پیروی نہیں کرتے اور تم صرف اٹکل سے باتیں کرتے ہو۔"}, {"arabic": " قُلۡ فَلِلّٰہِ الۡحُجَّۃُ الۡبَالِغَۃُ ۚ فَلَوۡ شَآءَ لَہَدٰٮکُمۡ اَجۡمَعِیۡنَ ﴿۱۵۰﴾", "english": " Say, ‘Allah’s is the argument that reaches home. If He had enforced His will, He could have surely guided you all.’", "french": " Dis : « C’est bien l’argument d’Allāh qui est concluant. S’Il l’avait voulu, Il vous aurait assurément tous guidés. »", "german": " Sprich: \"Bei Allah ist der überzeugende Beweis. Hätte Er Seinen Willen erzwungen, Er hätte euch allen den Weg gewiesen.\"", "spanish": " Diles: “El argumento conclusivo lo tiene Al-lah. Si hubiese ejecutado su Voluntad, ciertamente os habría guiado a todos”.", "urdu": " تو کہہ دے (تمہاری بے عقلی کی باتیں بتاتی ہیں) کہ اثر کرنے والی دلیل اللہ ہی کے قبضہ میں ہے‘ اور اگر وہ چاہتا تو تم سب کو ہدایت دے دیتا۔"}, {"arabic": " قُلۡ ہَلُمَّ شُہَدَآءَکُمُ الَّذِیۡنَ یَشۡہَدُوۡنَ اَنَّ اللّٰہَ حَرَّمَ ہٰذَا ۚ فَاِنۡ شَہِدُوۡا فَلَا تَشۡہَدۡ مَعَہُمۡ ۚ وَ لَا تَتَّبِعۡ اَہۡوَآءَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا وَ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ وَ ہُمۡ بِرَبِّہِمۡ یَعۡدِلُوۡنَ ﴿۱۵۱﴾٪", "english": " Say, ‘Bring forward your witnesses who testify that Allah has forbidden this.’ If they bear witness, bear thou not witness with them, nor follow thou the evil inclinations of those who treat Our Signs as lies and those who believe not in the Hereafter and who set up equals to their Lord.", "french": " Dis : « Produisez vos témoins qui attestent qu’Allāh a interdit ceci. » S’ils témoignent, ne témoigne pas avec eux, et ne suis pas les mauvais penchants de ceux qui traitent Nos Signes de mensonges, ni de ceux qui ne croient pas à l’au-delà et qui élèvent des égaux à leur Seigneur.", "german": " Sprich: \"Her mit euren Zeugen, die bezeugen, Allah habe dies verboten!\" Wenn sie bezeugen, so lege du nicht Zeugnis ab mit ihnen und folge nicht den bösen Gelüsten derer, die Unsere Zeichen als Lügen behandelten und die nicht an das Kommende glauben und die andere gleichstellen ihrem Herrn.", "spanish": " Diles: “Presentad vuestros testigos, los que testifican que Al-lah ha prohibido esto”. Si prestan testimonio, no testifiques tú con ellos ni sigas las malvadas inclinaciones de quienes tratan nuestros Signos de mentiras o de quienes no creen en el Más Allá y elevan a otros a la altura de su Señor.", "urdu": " تو (ان سے) کہہ دے کہ اپنے ان گواہوں کو بلاٶ جو یہ گواہی دیں کہ اللہ نے اس (یعنی فلاں فلاں) چیز کو حرام کیا ہے پھر اگر وہ ایسی گواہی دیں تو ان کے ساتھ (شامل ہو کر) تو گواہی نہ دے اور ان لوگوں کی خواہشوں کی پیروی نہ کر جو ہماری آیتوں کو جھٹلا چکے ہیں اور جو لوگ پیچھے آنے والی (باتوں) پر ایمان نہیں لاتے اور وہ اپنے رب کے شریک (بھی) بناتے ہیں۔"}, {"arabic": " قُلۡ تَعَالَوۡا اَتۡلُ مَا حَرَّمَ رَبُّکُمۡ عَلَیۡکُمۡ اَلَّا تُشۡرِکُوۡا بِہٖ شَیۡئًا وَّ بِالۡوَالِدَیۡنِ اِحۡسَانًا ۚ وَ لَا تَقۡتُلُوۡۤا اَوۡلَادَکُمۡ مِّنۡ اِمۡلَاقٍ ؕ نَحۡنُ نَرۡزُقُکُمۡ وَ اِیَّاہُمۡ ۚ وَ لَا تَقۡرَبُوا الۡفَوَاحِشَ مَا ظَہَرَ مِنۡہَا وَ مَا بَطَنَ ۚ وَ لَا تَقۡتُلُوا النَّفۡسَ الَّتِیۡ حَرَّمَ اللّٰہُ اِلَّا بِالۡحَقِّ ؕ ذٰلِکُمۡ وَصّٰکُمۡ بِہٖ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿۱۵۲﴾", "english": " Say, ‘Come, I will rehearse to you what your Lord has forbidden: that you associate not anything as partner with Him and that you do good to parents, and that you kill not your children for fear of poverty — it is We Who provide for you and for them — and that you approach not foul deeds, whether open or secret; and that you kill not the life which Allah has made sacred, save by right. That is what He has enjoined upon you, that you may understand.", "french": " Dis : « Venez, je vais vous réciter ce que votre Seigneur vous a rendu inviolable : que vous ne pouvez Lui associer quoi que ce soit comme partenaire, et que vous devez traiter vos parents avec infiniment de bonté ; que vous ne devez pas tuer vos enfants par crainte de pauvreté – c’est Nous Qui pourvoyons à vos besoins et aux leurs – et que vous devez vous tenir loin de toute infamie, qu’elle soit commise ouvertement ou en secret ; et que, sauf dans l’exercice de la justice, vous ne devez pas tuer la vie qu’Allāh a rendue sacrée. » Voilà ce qu’Il vous a enjoint, afin que vous puissiez comprendre.", "german": "", "spanish": " Diles: “Venid, os recitaré lo que Al-lah os ha hecho inviolable: que no asociéis a nada como partícipe con Él, que tratéis a vuestros adres con extrema bondad, que no matéis a vuestros hijos por temor a la pobreza. – Nosotros somos quienes proveemos para vosotros y para ellos–, que no os acerquéis a las malas acciones, ni manifiestas ni ocultas; y que no destruyáis la vida que Al-lah ha hecho sagrada, salvo por justicia. Esto es lo que os ha ordenado, para que entendáis.", "urdu": " تو (ان سے) کہہ کہ آٶ جو تمہارے رب نے تم پر حرام کیا ہے میں تمہیں پڑھ کر سناٶں (اس کا حکم ہے) کہ تم اس کے ساتھ کسی چیز کو شریک نہ کرو‘ اور والدین سے احسان کرو اور مفلس ہو جانے کے خوف سے اپنی اولاد کو قتل نہ کرو۔ ہم تمہیں بھی رزق دیتے ہیں اور انہیں بھی۔ اور بدیوں کے (بالکل) قریب نہ جاٶ۔ نہ ان میں سے ظاہر (بدیوں) کے نہ چھپی (بدیوں) کے۔ اور یہ کہ اس نفس کو جسے (قتل کرنا) اللہ نے منع فرمایا ہے (شریعت یا قانون کی) اجازت کے بغیر قتل نہ کرو۔ اللہ اس بات کا تمہیں تاکیدی حکم دیتا ہے تا کہ تم (بدیوں سے) رکو۔"}], "Surah": 6}