{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ الۡعَصۡرِ ۙ﴿۲﴾", "english": " By the fleeting Time,", "french": " Par le témoignage du Temps,", "german": " Bei der (flüchtigen) Zeit,", "spanish": " Por el testimonio del tiempo,", "urdu": " میں (محمد کے) زمانہ کو شہادت کے طور پر پیش کرتا ہوں۔"}, {"arabic": " اِنَّ الۡاِنۡسَانَ لَفِیۡ خُسۡرٍ ۙ﴿۳﴾", "english": " Surely, man is in a state of loss,", "french": " Sûrement, l’homme est perpétuellement dans un état de perte,", "german": " wahrlich, der Mensch ist in einem Zustand des Verlusts,", "spanish": " En verdad, el hombre se encuentra en estado de perdición,", "urdu": " (کہ) یقیناً (نبیوں کا مخالف) انسان (ہمیشہ ہی) گھاٹے میں (رہتا) ہے۔"}, {"arabic": " اِلَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ تَوَاصَوۡا بِالۡحَقِّ ۬ۙ وَ تَوَاصَوۡا بِالصَّبۡرِ ٪﴿۴﴾", "english": " Except those who believe and do good works, and exhort one another to accept truth, and exhort one another to be steadfast.", "french": " Excepté ceux qui croient et font de bonnes œuvres, et qui s’exhortent les uns les autres à promouvoir la vérité, et qui s’exhortent les uns les autres à l’endurance.", "german": " außer denen, die glauben und gute Werke tun und einander zur Wahrheit mahnen und einander zum Ausharren mahnen.", "spanish": " Excepto quienes creen y prac­tican el bien, se exhortan mutua­mente con la verdad, y se animan recíprocamente a ser perseverantes.", "urdu": " مگر وہ لوگ جو (انبیاء پر) ایمان لے آئے اور (پھر) انہوں نے (موقعہ کے) مناسب حال عمل کیے اور صداقت کے اصول پر قائم رہنے کی آپس میں ایک دوسرے کو تلقین کی اور (پیش آمدہ مشکلات پر صبر سے کام لینے کی) ایک دوسرے کو ہدایت کرتے رہے (ایسے لوگ کبھی بھی گھاٹے میں نہیں پڑ سکتے)"}], "Surah": 103}