{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں۔)"}, {"arabic": " الٓـمّٓ ۚ﴿۲﴾", "english": " Alif Lam Mim.", "french": " Alif Lām Mīm (Je suis Allāh, le Plus-Savant).", "german": " Alif Lâm Mîm.", "spanish": " Alif Lam Mim.", "urdu": " میں اللہ سب سے زیادہ جاننے والا ہوں۔"}, {"arabic": " ذٰلِکَ الۡکِتٰبُ لَا رَیۡبَ ۚۖۛ فِیۡہِ ۚۛ ہُدًی لِّلۡمُتَّقِیۡنَ ۙ﴿۳﴾", "english": " This is a perfect Book; there is no doubt in it; it is a guidance for the righteous,", "french": " Ceci est le Livre parfait , dans lequel il n’y a pas de doute. C’est une direction pour les gens pieux,", "german": " Dies ist ein vollkommenes Buch; es ist kein Zweifel darin: eine Richtschnur für die Rechtschaffenen;", "spanish": " Éste es un Libro perfecto; no hay duda en él; es una guía para los justos,", "urdu": " یہی کامل کتاب ہے‘ اس (امر) میں کوئی شک نہیں‘ متقیوں کو ہدایت دینے والی ہے۔"}, {"arabic": " الَّذِیۡنَ یُؤۡمِنُوۡنَ بِالۡغَیۡبِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ مِمَّا رَزَقۡنٰہُمۡ یُنۡفِقُوۡنَ ۙ﴿۴﴾", "english": " Who believe in the unseen and observe Prayer, and spend out of what We have provided for them;", "french": " Qui croient à l’invisible, qui observent la Prière, et qui dépensent de ces dons et richesses que Nous leur avons accordés ;", "german": " die da glauben an das Ungesehene und das Gebet verrichten und spenden von dem, was Wir ihnen gegeben haben;", "spanish": " Quienes creen en lo invisible y observan la Oración y gastan de lo que les hemos provisto;", "urdu": " جو غیب پر ایمان لاتے اور نماز کو قائم رکھتے ہیں اور جو (کچھ) ہم نے انہیں دیا ہے اس میں سے خرچ کرتے رہتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِمَاۤ اُنۡزِلَ اِلَیۡکَ وَ مَاۤ اُنۡزِلَ مِنۡ قَبۡلِکَ ۚ وَ بِالۡاٰخِرَۃِ ہُمۡ یُوۡقِنُوۡنَ ؕ﴿۵﴾", "english": " And who believe in that which has been revealed to thee, and that which was revealed before thee, and they have firm faith in what is yet to come.", "french": " Et qui croient à ce qui t’a été révélé, et à ce qui a été révélé avant ton avènement, et qui croient fermement à ce qui est encore à venir.", "german": " und die glauben an das, was dir offenbart worden, und an das, was vor dir offenbart ward, und fest auf das bauen, was kommen wird.", "spanish": " Y creen en lo que te ha sido revelado y en lo que fue revelado con anterioridad a ti y tienen una fe firme en lo que aún está por venir.", "urdu": " اور جو تجھ پر نازل کیا گیا ہے یا جو تجھ سے پہلے نازل کیا گیا تھا اس پر ایمان لاتے ہیں اورآئندہ ہونے والی (موعود باتوں) پر( بھی ) یقین رکھتے ہیں۔"}, {"arabic": " اُولٰٓئِکَ عَلٰی ہُدًی مِّنۡ رَّبِّہِمۡ ٭ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۶﴾", "english": " It is they who follow the guidance of their Lord and it is they who shall prosper.", "french": " Ceux-là suivent la voie indiquée par leur Seigneur et ce sont eux qui prospéreront.", "german": " Sie sind es, die der Führung ihres Herrn folgen, und sie werden Erfolg haben.", "spanish": " Son los que siguen la guía de su Señor y son los que alcanzarán la felicidad.", "urdu": " یہ لوگ (یقیناً) اس ہدایت پر (قائم) ہیں جو ان کے رب کی طرف سے (آئی) ہے اور یہی لوگ کامیاب ہونے والے ہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا سَوَآءٌ عَلَیۡہِمۡ ءَاَنۡذَرۡتَہُمۡ اَمۡ لَمۡ تُنۡذِرۡہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۷﴾", "english": " Those who have disbelieved — it being equal to them whether thou warn them or warn them not — they will not believe.", "french": " Quant à ceux qui n’ont pas cru – cela leur est égal que tu les avertisses ou que tu ne les avertisses pas – ils ne croiront pas.", "german": " Die nicht geglaubt haben – und denen gleich ist, ob du sie warnst oder nicht warnst –, sie werden nicht glauben.", "spanish": " Los que son incrédulos –les es igual que les adviertas o no– no creerán.", "urdu": " ایسے لوگ جنہوں نے کفر کیا ہے (اور) تیرا ان کو ڈرانا یا نہ ڈرانا ان کے لئے یکساں (اثر پیدا کرتا) ہے (جب تک وہ اس حالت کو نہ بدلیں) ایمان نہیں لائیں گے۔"}, {"arabic": " خَتَمَ اللّٰہُ عَلٰی قُلُوۡبِہِمۡ وَ عَلٰی سَمۡعِہِمۡ ؕ وَ عَلٰۤی اَبۡصَارِہِمۡ غِشَاوَۃٌ ۫ وَّ لَہُمۡ عَذَابٌ عَظِیۡمٌ ٪﴿۸﴾", "english": " Allah has set a seal on their hearts and their ears, and over their eyes is a covering; and for them is a great punishment.", "french": " Allāh a scellé leur cœur et leurs oreilles ; ils ont un voile sur les yeux. Et pour eux il y a un très grand châtiment.", "german": " Versiegelt hat Allah ihre Herzen und ihre Ohren, und über ihren Augen liegt eine Hülle, und ihnen wird schwere Strafe.", "spanish": " Al-lah ha puesto un sello en sus corazones y en sus oídos; y un velo cubre sus ojos; y para ellos hay reservado un grave castigo.", "urdu": " اللہ نے ان کے دلوں پر اور ان کے کانوں پر مہر کر دی ہے اور ان کی آنکھوں پر پردہ (پڑا ہوا) ہے اور ان کے لئے ایک بڑا عذاب (مقدر) ہے۔"}, {"arabic": " وَ مِنَ النَّاسِ مَنۡ یَّقُوۡلُ اٰمَنَّا بِاللّٰہِ وَ بِالۡیَوۡمِ الۡاٰخِرِ وَ مَا ہُمۡ بِمُؤۡمِنِیۡنَ ۘ﴿۹﴾", "english": " And of the people there are some who say, ‘We believe in Allah and the Last Day;’ while they are not believers at all.", "french": " Et parmi les hommes, certains disent : « Nous croyons en Allāh et au Jour Dernier ; et pourtant ce sont des mécréants.", "german": " Unter den Leuten sind solche, die sagen: \"Wir glauben an Allah und an den Jüngsten Tag\", und sind gar nicht Gläubige.", "spanish": " Y entre los hombres hay algunos que dicen: “creemos en Al-lah y en el Último Día”; pero no son en absoluto creyentes.", "urdu": " اور بعض لوگ ایسے بھی ہیں جو کہتے ہیں کہ ہم اللہ پر اور آنے والے دن پر ایمان رکھتے ہیں‘ حالانکہ وہ ہرگز ایمان نہیں رکھتے۔"}, {"arabic": " یُخٰدِعُوۡنَ اللّٰہَ وَ الَّذِیۡنَ اٰمَنُوۡا ۚ وَ مَا یَخۡدَعُوۡنَ اِلَّاۤ اَنۡفُسَہُمۡ وَ مَا یَشۡعُرُوۡنَ ؕ﴿۱۰﴾", "english": " They would deceive Allah and those who believe, and they deceive none but themselves; only they perceive it not.", "french": " Ils cherchent à tromper Allāh et les croyants, alors qu’ils ne trompent qu’eux-mêmes ; seulement, ils ne s’ en rendent pas compte.", "german": " Sie möchten Allah betrügen und diejenigen, die gläubig sind; doch sie betrügen nur sich selbst; allein sie begreifen es nicht.", "spanish": " Tratan de engañar a Al-lah y a los que creen, y no engañan a nadie sino a ellos mismos; pero no se dan cuenta de ello.", "urdu": " وہ اللہ کو اور ان لوگوں کو جو ایمان لائے ہیں دھوکا دینا چاہتے ہیں‘ مگر (واقعہ میں) وہ اپنے سوا کسی کو دھوکہ نہیں دیتے۔ اور وہ سمجھتے نہیں۔"}, {"arabic": " فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ ۙ فَزَادَہُمُ اللّٰہُ مَرَضًا ۚ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌۢ ۬ۙ بِمَا کَانُوۡا یَکۡذِبُوۡنَ ﴿۱۱﴾", "english": " In their hearts was a disease, and Allah has increased their disease to them; and for them is a grievous punishment because they lied.", "french": " Il y a une maladie dans leur cœur et Allāh a aggravé leur maladie. Et pour eux, il y a un châtiment douloureux parce qu’ils avaient l’habitude de mentir.", "german": " In ihren Herzen war Krankheit, und Allah hat ihre Krankheit vermehrt; und eine qualvolle Strafe wird ihnen, weil sie logen.", "spanish": " Había una enfermedad en sus corazones, y Al-lah les ha agravado la enfermedad; y tendrán un penoso castigo porque solían mentir.", "urdu": " ان کے دلوں میں ایک بیماری تھی پھر اللہ نے ان کی بیماری کو (اور بھی) بڑھا دیا اور انہیں ایک دردناک عذاب پہنچ رہا ہے کیونکہ وہ جھوٹ بولا کرتے تھے۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ لَا تُفۡسِدُوۡا فِی الۡاَرۡضِ ۙ قَالُوۡۤا اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ ﴿۱۲﴾", "english": " And when it is said to them: ‘Create not disorder on the earth,’ they say: ‘We are only promoters of peace.’", "french": " Et lorsqu’on leur dit : « Ne créez pas de désordre sur la terre, » ils répondent : « Nous ne faisons que préserver la paix. »", "german": " Und wenn ihnen gesagt wird: \"Stiftet kein Unheil auf Erden\", antworten sie: \"Wir sind nur Förderer des Friedens.\"", "spanish": " Y cuando se les dice: “no creéis el desorden en la tierra”, responden: “Sólo trabajamos por la paz”.", "urdu": " اور جب ان سے کہا جائے (کہ) زمین میں فساد نہ کرو‘ تو کہتے ہیں‘ ہم تو صرف اصلاح کرنے والے ہیں۔"}, {"arabic": " اَلَاۤ اِنَّہُمۡ ہُمُ الۡمُفۡسِدُوۡنَ وَ لٰکِنۡ لَّا یَشۡعُرُوۡنَ ﴿۱۳﴾", "english": " Beware! it is surely they who create disorder, but they do not perceive it .", "french": " Attention ! Ce sont sûrement eux qui créent le désordre, mais ils ne s’ en rendent pas compte.", "german": " Höret! gewiss sind sie es, die Unheil stiften; allein sie begreifen es nicht.", "spanish": " ¡Cuidado!; son ciertamente ellos los que crean el desorden, pero no se dan cuenta de ello.", "urdu": " (کان کھول کر) سنو! یہی لوگ بلاشبہ فساد کرنے والے ہیں‘ مگر وہ (اس حقیقت کو) سمجھتے نہیں۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ اٰمِنُوۡا کَمَاۤ اٰمَنَ النَّاسُ قَالُوۡۤا اَنُؤۡمِنُ کَمَاۤ اٰمَنَ السُّفَہَآءُ ؕ اَلَاۤ اِنَّہُمۡ ہُمُ السُّفَہَآءُ وَ لٰکِنۡ لَّا یَعۡلَمُوۡنَ ﴿۱۴﴾", "english": " And when it is said to them, ‘Believe as other people have believed,’ they say: ‘Shall we believe as the foolish have believed?’ Beware! it is surely they that are foolish, but they do not know.", "french": " Et lorsqu’on leur dit : « Croyez en Allāh comme les gens ont cru en Lui , » ils répondent : « Devons-nous croire comme ont cru les sots ? » Attention ! Ce sont sûrement eux qui sont sots, mais ils ne le savent pas.", "german": " Und wenn ihnen gesagt wird: \"Glaubet, wie andere geglaubt haben\", so sprechen sie: \"Sollen wir glauben, wie die Toren glaubten?\" Höret! sie sind die Toren, allein sie wissen es nicht.", "spanish": " Y cuando se les dice: “Creed como han creído otras personas”, responden: “¿Acaso hemos de creer como han creído los insensatos?” ¡Cuidado! ellos son ciertamente los insensatos, pero no lo saben.", "urdu": " اور جب انہیں کہا جائے کہ (اسی طرح) ایمان لاٶ‘ جس طرح (دوسرے) لوگ ایمان لائے ہیں تو کہتے ہیں کہ کیا ہم (اس طرح) ایمان لائیں جس طرح بیوقوف (لوگ) ایمان لائے ہیں یاد رکھو! (یہ جھوٹ بول رہے ہیں) وہ خود ہی بیوقوف ہیں مگر (اس بات کو) جانتے نہیں۔"}, {"arabic": " وَ اِذَا لَقُوا الَّذِیۡنَ اٰمَنُوۡا قَالُوۡۤا اٰمَنَّا ۚۖ وَ اِذَا خَلَوۡا اِلٰی شَیٰطِیۡنِہِمۡ ۙ قَالُوۡۤا اِنَّا مَعَکُمۡ ۙ اِنَّمَا نَحۡنُ مُسۡتَہۡزِءُوۡنَ ﴿۱۵﴾", "english": " And when they meet those who believe, they say: ‘We believe;’ but when they are alone with their ringleaders, they say: ‘We are certainly with you; we are only mocking.’", "french": " Et quand ils rencontrent les croyants, ils disent : « Nous croyons en Allāh « ; mais quand ils se trouvent seuls avec leurs meneurs, ils leur disent : « Nous sommes assurément de votre parti ; nous ne faisions que nous moquer d’eux. »", "german": " Und wenn sie mit denen zusammentreffen, die glauben, sagen sie: \"Wir glauben\"; sind sie jedoch allein mit ihren Bonzen, sagen sie: \"Gewiss sind wir mit euch, wir treiben nur Spott.\"", "spanish": " Y cuando se reúnen con los que creen, dicen: “Creemos”; pero cuando están solos con sus cabecillas, dicen: “En realidad estamos con vosotros; únicamente nos burlamos”.", "urdu": " اور جب وہ ان لوگوں سے ملیں جو ایمان لائے ہیں تو کہہ دیتے ہیں کہ ہم تو (اس رسول کو) مانتے ہیں اور جب وہ اپنے سرغنوں سے علیحدگی میں ملیں تو کہہ دیتے ہیں کہ ہم یقیناً تمہارے ساتھ ہیں ہم تو صرف (ان مومنوں سے) ہنسی کر رہے تھے۔"}, {"arabic": " اَللّٰہُ یَسۡتَہۡزِئُ بِہِمۡ وَ یَمُدُّہُمۡ فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۱۶﴾", "english": " Allah will punish their mockery and will let them continue in their transgression, wandering blindly.", "french": " Allāh les punira pour leur moquerie et les laissera errer pour quelque temps dans leur transgression comme des affolés.", "german": " Allah wird sie Spott lehren und wird sie in ihren Freveln verharren lassen, dass sie verblendet irregehen.", "spanish": " Al-lah les castigará por su burla y les dejará que continúen en su trasgresión, vagando ciegamente.", "urdu": " اللہ انہیں (ان کی) ہنسی کی سزا دے گا اور انہیں اپنی سرکشیوں میں بہکتے ہوئے چھوڑ دے گا۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ اشۡتَرَوُا الضَّلٰلَۃَ بِالۡہُدٰی ۪ فَمَا رَبِحَتۡ تِّجَارَتُہُمۡ وَ مَا کَانُوۡا مُہۡتَدِیۡنَ ﴿۱۷﴾", "english": " These are they who have taken error in exchange for guidance; but their traffic has brought them no gain, nor are they rightly guided.", "french": " Voilà ceux qui ont troqué le droit chemin contre l’égarement ; mais ils n’ont tiré aucun profit de leur transaction, et ils ne sont pas non plus guidés.", "german": " Sie sind es, die Irregehen eingetauscht haben gegen Führung; doch brachte ihr Handel keinen Gewinn, noch sind sie rechtgeleitet.", "spanish": " Son los que han preferido el camino erróneo al agrado de Al-lah; pero su comercio no les ha reportado beneficio, ni están rectamente guiados.", "urdu": " یہ وہ لوگ ہیں جنہوں نے ہدایت کو چھوڑ کر گمراہی کو اختیار کر لیا جس کا نتیجہ یہ ہوا کہ نہ تو انہیں دنیوی فائدہ پہنچا اور نہ انہوں نے ہدایت پائی۔"}, {"arabic": " مَثَلُہُمۡ کَمَثَلِ الَّذِی اسۡتَوۡقَدَ نَارًا ۚ فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَہٗ ذَہَبَ اللّٰہُ بِنُوۡرِہِمۡ وَ تَرَکَہُمۡ فِیۡ ظُلُمٰتٍ لَّا یُبۡصِرُوۡنَ ﴿۱۸﴾", "english": " Their case is like the case of a person who kindled a fire, and when it lighted up all around him, Allah took away their light and left them in thick darkness; they see not.", "french": " Leur cas est semblable à celui de quelqu’un qui alluma un feu, et lorsque ceci éclaira tout autour de lui, Allāh enleva leur lumière et les laissa dans l’obscurité complète ! Ils ne voient rien.", "german": " Sie sind jenem Manne vergleichbar, der ein Feuer anzündete; und als es alles um ihn erhellte, nahm Allah ihr Licht hinweg und ließ sie in Finsternissen; sie sehen nicht.", "spanish": " Les ocurre como a la persona que encendió un fuego, y cuando lo iluminaba todo a su alrededor, Al-lah se llevó la luz y le dejó en la más negra oscuridad; así no pueden ver.", "urdu": " ان کی حالت اس شخص کی حالت کی طرح ہے جس نے آگ جلائی پھر جب اس (آگ) نے اس کے ارد گرد (کے علاقہ) کو روشن کر دیا تو اللہ ان کی روشنی کو لے گیا اور اس نے انہیں (قسم قسم کے) اندھیروں میں (اس حال میں) چھوڑ دیا (کہ) وہ (کوئی راہ نجات) نہیں دیکھتے۔"}, {"arabic": " صُمٌّۢ بُکۡمٌ عُمۡیٌ فَہُمۡ لَا یَرۡجِعُوۡنَ ﴿ۙ۱۹﴾", "english": " They are deaf, dumb and blind; so they will not return.", "french": " Ils sont sourds, muets et aveugles ; aussi, ne retourneront-ils pas.", "german": " Taub, stumm, blind: also werden sie nicht zurückkehren.", "spanish": " Son sordos, mudos y ciegos; por eso no volverán.", "urdu": " وہ بہرے ہیں گونگے ہیں اندھے ہیں پس وہ لوٹیں گے نہیں۔"}, {"arabic": " اَوۡ کَصَیِّبٍ مِّنَ السَّمَآءِ فِیۡہِ ظُلُمٰتٌ وَّ رَعۡدٌ وَّ بَرۡقٌ ۚ یَجۡعَلُوۡنَ اَصَابِعَہُمۡ فِیۡۤ اٰذَانِہِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ ؕ وَ اللّٰہُ مُحِیۡطٌۢ بِالۡکٰفِرِیۡنَ ﴿۲۰﴾", "english": " Or it is like a heavy rain from the clouds, wherein is thick darkness and thunder and lightning; they put their fingers into their ears because of the thunderclaps for fear of death, and Allah encompasses the disbelievers.", "french": " Où c’est comme une pluie diluvienne, provenant de nuages, dans laquelle règnent des ténèbres, du tonnerre et des éclairs. Ils se bouchent les oreilles avec les doigts à cause du tonnerre par crainte de mourir ; et Allāh cerne les mécréants.", "german": " Oder: wie schwerer Wolkenregen, worin Finsternisse und Donner und Blitz; sie stecken ihre Finger in die Ohren, in Todesfurcht vor den Donnerschlägen, während Allah die Ungläubigen umringt.", "spanish": " O es como un fuerte chaparrón que cae de las nubes, con oscuras tinieblas, truenos y relámpagos; se introducen los dedos en los oídos, a causa de los truenos y por temor a la muerte; y Al-lah pone un cerco alrededor de los incrédulos.", "urdu": " یا (ان کا حال) اس بارش کی طرح ہے جو (گھٹا ٹوپ) بادل سے (برس رہی) ہو (ایسی بارش) جس کے ساتھ (قسم قسم کے) اندھیرے اور گرج اور بجلی ہوتی ہے‘ وہ اپنی انگلیوں کو کڑک کی وجہ سے موت کے ڈر سے کانوں میں ڈال لیتے ہیں حالانکہ اللہ تمام کافروں کو تباہ کرنے والا ہے۔"}, {"arabic": " یَکَادُ الۡبَرۡقُ یَخۡطَفُ اَبۡصَارَہُمۡ ؕ کُلَّمَاۤ اَضَآءَ لَہُمۡ مَّشَوۡا فِیۡہِ ٭ۙ وَ اِذَاۤ اَظۡلَمَ عَلَیۡہِمۡ قَامُوۡا ؕ وَ لَوۡ شَآءَ اللّٰہُ لَذَہَبَ بِسَمۡعِہِمۡ وَ اَبۡصَارِہِمۡ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿٪۲۱﴾", "english": " The lightning might well-nigh snatch away their sight; whenever it shines upon them, they walk therein; and when it becomes dark to them, they stand still. And if Allah willed, He could take away their hearing and their sight; surely, Allah has the power to do all that He wills.", "french": " L’éclair pourrait presque leur dérober la vue ; chaque fois qu’il leur donne de l’éclairage, ils y marchent, mais dès qu’il fait obscur pour eux, ils s’immobilisent. Si Allāh le voulait, Il pourrait leur ôter l’ouïe et la vue. En vérité, Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Der Blitz benimmt ihnen fast das Augenlicht; wann immer er auf sie zündet, wandeln sie darin, und wenn es über ihnen dunkel wird, stehen sie still. Und wäre es Allahs Wille, Er hätte ihr Gehör und ihr Gesicht fortgenommen. Allah hat die Macht, alles zu tun, was Er will.", "spanish": " Los relámpagos casi les dejan ciegos: Cuando brillan ante ellos, caminan a su luz; y cuando queda todo oscuro a su alrededor se detienen. Y si Al-lah quisiera, podría dejarlos sin oído y sin vista; ciertamente, Al-lah tiene poder para hacer todo lo que quiera.", "urdu": " قریب ہے کہ بجلی ان کی بینائی کو اچک کر لے جائے۔ جب بھی وہ ان پر چمکتی ہے تو وہ اس (کی روشنی) میں چلنے لگتے ہیں اور جب ان پر اندھیرا کر دیتی ہے تو کھڑے ہو جاتے ہیں اور اگر اللہ چاہتا تو یقیناً ان کی شنوائی اور ان کی بینائی کو ضائع کر دیتا اللہ ہر (اس) امر پر (جس کا وہ ارادہ کرے) یقیناً پوری طرح قادر ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّاسُ اعۡبُدُوۡا رَبَّکُمُ الَّذِیۡ خَلَقَکُمۡ وَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿ۙ۲۲﴾", "english": " O ye men, worship your Lord Who created you and those who were before you, that you may become righteous;", "french": " Ô hommes ! Adorez votre Seigneur Qui vous a créés, vous et ceux qui étaient avant vous, afin que vous agissiez avec droiture ;", "german": " O ihr Menschen, dienet eurem Herrn, Der euch erschuf und die, die vor euch waren, auf dass ihr beschirmt seid;", "spanish": " ¡Oh hombres! adorad a vuestro Señor que os ha creado a vosotros y a vuestros antepasados para que lleguéis a ser piadosos.", "urdu": " اے لوگو! اپنے (اس) رب کی عبادت کرو جس نے تمہیں (بھی) اور انہیں (بھی) جو تم سے پہلے گزرے ہیں پیدا کیا ہے تا کہ تم (ہر قسم کی آفات سے) بچو۔"}, {"arabic": " الَّذِیۡ جَعَلَ لَکُمُ الۡاَرۡضَ فِرَاشًا وَّ السَّمَآءَ بِنَآءً ۪ وَّ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً فَاَخۡرَجَ بِہٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّکُمۡ ۚ فَلَا تَجۡعَلُوۡا لِلّٰہِ اَنۡدَادًا وَّ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۲۳﴾", "english": " Who made the earth a bed for you, and the heaven a roof, and caused water to come down from the clouds and therewith brought forth fruits for your sustenance. Set not up, therefore, equals to Allah, while you know.", "french": " Qui a fait la terre un lit pour vous, et le ciel un toit, Qui a fait que l’eau descende des nuages, et par cela a produit des fruits pour votre subsistance. Ne donnez pas d’égaux à Allāh, puisque vous savez.", "german": " der die Erde gemacht hat zu einem Bette für euch, und den Himmel zu einem Dach, und Wasser hat niederregnen lassen von den Wolken und damit Früchte für euren Unterhalt hervorgebracht hat. Stellt Allah daher keine Götter zur Seite, denn ihr wisst es doch.", "spanish": " Que convirtió la tierra en lecho para vosotros y los cielos en techo, e hizo que cayera agua de las nubes y de ese modo hizo crecer frutos para vuestro sustento. No pongáis pues a nadie a la altura de Al-lah puesto que ya sabéis.", "urdu": " (وہی ہے) جس نے تمہارے لئے زمین کو بچھونے اور آسمان کو چھت کے طور پر بنایا ہے اور بادلوں سے پانی اتارا ہے‘ پھر اس (پانی) کے ذریعہ سے میووں کی قسم کا رزق تمہارے لئے نکالا ہے۔ پس تم سمجھتے بوجھتے ہوئے اللہ کے ہمسر نہ بناٶ۔"}, {"arabic": " وَ اِنۡ کُنۡتُمۡ فِیۡ رَیۡبٍ مِّمَّا نَزَّلۡنَا عَلٰی عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَۃٍ مِّنۡ مِّثۡلِہٖ ۪ وَ ادۡعُوۡا شُہَدَآءَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۲۴﴾", "english": " And if you are in doubt as to what We have sent down to Our servant, then produce a Chapter like it, and call upon your helpers beside Allah, if you are truthful.", "french": " Et si vous mettez en doute ce que Nous avons fait descendre sur Notre serviteur, alors produisez une sourate similaire, et invoquez vos divinités – aides en dehors d’Allāh, si vous dites la vérité.", "german": " Und wenn ihr im Zweifel seid über das, was Wir hinabgesandt haben zu Unserem Diener, dann bringt eine Sura hervor wie diesen (Qur-ân) und ruft eure Helfer auf außer Allah, wenn ihr wahrhaftig seid.", "spanish": " Y si dudáis sobre lo que hemos revelado a Nuestro siervo, entonces presentad un capítulo como éste, y llamad a quienes os ayudan, prescindiendo de Al-lah, si es que sois veraces.", "urdu": " اور اگر اس (کلام) کے سبب سے جو ہم نے اپنے بندے پر اتارا ہے تم کسی (قسم کے) شک میں (مبتلا ہو گئے) ہو تو اگر تم سچے ہو تو اس جیسی ایک سورۃ لے آٶ اور اپنے غیر اللہ مددگاروں کو (بھی اپنی مدد کے لئے) بلالو۔"}, {"arabic": " فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَ لَنۡ تَفۡعَلُوۡا فَاتَّقُوا النَّارَ الَّتِیۡ وَقُوۡدُہَا النَّاسُ وَ الۡحِجَارَۃُ ۚۖ اُعِدَّتۡ لِلۡکٰفِرِیۡنَ ﴿۲۵﴾", "english": " But if you do it not — and never shall you do it — then guard against the Fire, whose fuel is men and stones, which is prepared for the disbelievers.", "french": " Mais si vous ne le faites pas – et jamais vous ne le ferez – alors craignez le feu dont le combustible est fait d’hommes et de pierres et qui est préparé pour les mécréants.", "german": " Doch wenn ihr es nicht tut – und nie werdet ihr es vermögen –, dann hütet euch vor dem Feuer, dessen Nahrung Menschen und Steine sind, bereitet für die Ungläubigen.", "spanish": " Pero si no lo hacéis – y nunca lo haréis – temed entonces al Fuego, cuyo combustible son hombres y piedras, que está preparado para los impíos.", "urdu": " اور اگر تم نے ایسا نہ کیا اور تم ہرگز (ایسا) نہ کر سکو گے تو اس آگ سے بچو جس کا ایندھن آدمی اور پتھر ہیں۔ وہ کافروں کے لئے تیارکی گئی ہے۔"}, {"arabic": " وَ بَشِّرِ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ؕ کُلَّمَا رُزِقُوۡا مِنۡہَا مِنۡ ثَمَرَۃٍ رِّزۡقًا ۙ قَالُوۡا ہٰذَا الَّذِیۡ رُزِقۡنَا مِنۡ قَبۡلُ ۙ وَ اُتُوۡا بِہٖ مُتَشَابِہًا ؕ وَ لَہُمۡ فِیۡہَاۤ اَزۡوَاجٌ مُّطَہَّرَۃٌ ٭ۙ وَّ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۲۶﴾", "english": " And give glad tidings to those who believe and do good works, that for them are Gardens beneath which flow streams. Whenever they are given a portion of fruit therefrom, they will say: ‘This is what was given us before,’ and gifts mutually resembling shall be brought to them. And they will have therein mates perfectly pure, and therein will they abide.", "french": " Et annonce à ceux qui croient et font de bonnes œuvres, la bonne nouvelle qu’il y a pour eux des Jardins sous lesquels coulent des ruisseaux. Chaque fois qu’ils en recevront une portion de fruits, ils diront : « Voici ce qui nous a été accordé auparavant en guise de provision » ; alors que ce qui leur a été donné auparavant n’a qu’une ressemblance avec ceci. Ils y auront des conjoints/es purifiés/es par Nous et ils y demeureront éternellement.", "german": " Und bringe frohe Botschaft denen, die glauben und gute Werke tun, dass Gärten für sie sind, durch die Ströme fließen. Wann immer ihnen von den Früchten daraus gegeben wird, werden sie sprechen: \"Das ist, was uns zuvor gegeben wurde\", und (Gaben) gleicher Art sollen ihnen gebracht werden. Und sie werden darin Gefährten und Gefährtinnen haben von vollkommener Reinheit, und darin werden sie weilen.", "spanish": " Y anuncia la buena nueva a los que creen y hacen buenas obras, que para ellos hay jardines bajo los cuales corren arroyos. Cada vez que reciban los frutos producidos en ellos dirán: “Esto es lo que se nos había dado antes”, aunque solo se les entregarán dones similares. Y tendrán allí parejas, totalmente puras; y allí pondrán su morada.", "urdu": " اور تو ان لوگوں کو جو ایمان لائے ہیں اور انہوں نے نیک عمل کیے ہیں خوشخبری دے کہ ان کے لئے (ایسے) باغ ہیں جن کے نیچے نہریں بہتی ہیں۔ جب بھی ان (باغوں) کے پھل میں سے کچھ رزق انہیں دیا جائے گا‘ وہ کہیں گے یہ تو وہی (رزق) ہے جو ہمیں اس سے پہلے دیا گیا تھا اور ان کے پاس وہ (رزق) ملتا جلتا لایا جائے گا اور ان کے لئے ان (باغوں) میں پاک جوڑے ہونگے اور وہ ان (باغوں) کے اندر (ہمیشہ) بسیں گے۔"}, {"arabic": " اِنَّ اللّٰہَ لَا یَسۡتَحۡیٖۤ اَنۡ یَّضۡرِبَ مَثَلًا مَّا بَعُوۡضَۃً فَمَا فَوۡقَہَا ؕ فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا فَیَعۡلَمُوۡنَ اَنَّہُ الۡحَقُّ مِنۡ رَّبِّہِمۡ ۚ وَ اَمَّا الَّذِیۡنَ کَفَرُوۡا فَیَقُوۡلُوۡنَ مَا ذَاۤ اَرَادَ اللّٰہُ بِہٰذَا مَثَلًا ۘ یُضِلُّ بِہٖ کَثِیۡرًا ۙ وَّ یَہۡدِیۡ بِہٖ کَثِیۡرًا ؕ وَ مَا یُضِلُّ بِہٖۤ اِلَّا الۡفٰسِقِیۡنَ ﴿ۙ۲۷﴾", "english": " Allah disdains not to give an illustration as small as a gnat or even smaller. Those who believe know that it is the truth from their Lord, while those who disbelieve say: ‘What does Allah mean by such an illustration?’ Many does He adjudge by it to be erring and many by it does He guide, and none does He adjudge thereby to be erring except the disobedient,", "french": " En vérité, Allāh ne dédaigne pas de citer en exemple même un moustique et même ce qui est sur lui comme charge . Ceux qui croient savent que c’est la vérité de leur Seigneur, tandis que les mécréants demandent : « Que veut dire Allāh par un tel exemple ? » Nombreux sont ceux qu’Il juge ainsi comme étant égarés et nombreux aussi sont ceux qu’Il guide ; et Il ne juge comme étant égarés que les désobéissants,", "german": " Allah verschmäht nicht, über ein Ding zu sprechen, das klein ist wie eine Mücke oder gar noch kleiner. Die da glauben, wissen, dass es die Wahrheit von ihrem Herrn ist, dieweil die Ungläubigen sprechen: \"Was meint Allah mit solcher Rede?\" Damit erklärt Er viele zu Irrenden, und vielen weist Er damit den Weg", "spanish": " Al-lah no se avergüenza de usar como parábola un mosquito o incluso algo más pequeño. Los que creen saben que ésa es la verdad que viene de su Señor, mientras que los descreídos dicen: “¿Qué pretende Al-lah con esta parábola?”. Con ella juzga a muchos como extraviados y a otros muchos los guía, pero a nadie juzga como descarriados, excepto a los desobedientes,", "urdu": " اللہ ہرگز نہیں رکتا کسی بات کے بیان کرنے سے خواہ وہ مچھر کے برابر ہو یا اس سے بھی بڑھ کر۔ پھر جو لوگ ایمان رکھتے ہیں وہ (تو) جان لیتے ہیں کہ وہ ان کے رب کی طرف سے بالکل حق (بات) ہے اور جو لوگ کافر ہوئے وہ کہتے ہیں کہ (آخر) اللہ کا اس بات کے بیان کرنے سے منشا کیا ہے؟ (اصل بات یہ ہے کہ) وہ بہت (سے لوگوں) کو اس (قرآن) کے ذریعہ سے گمراہ قرار دیتا ہے اور بہت (سے لوگوں) کو اس (قرآن) کے ذریعہ سے ہدایت دیتا ہے اور وہ اس کے ذریعہ سے ان نافرمانوں کے سوا کسی کو گمراہ قرار نہیں دیتا۔"}, {"arabic": " الَّذِیۡنَ یَنۡقُضُوۡنَ عَہۡدَ اللّٰہِ مِنۡۢ بَعۡدِ مِیۡثَاقِہٖ ۪ وَ یَقۡطَعُوۡنَ مَاۤ اَمَرَ اللّٰہُ بِہٖۤ اَنۡ یُّوۡصَلَ وَ یُفۡسِدُوۡنَ فِی الۡاَرۡضِ ؕ اُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿۲۸﴾", "english": " Who break the covenant of Allah after having established it, and cut asunder what Allah has bidden to be joined, and create disorder in the earth; it is these that are the losers.", "french": " Qui brisent le pacte d’Allāh après l’avoir établi, qui tranchent les liens qu’Allāh a ordonné d’unir, et qui créent le désordre sur la terre ; ceux-là sont les perdants.", "german": " die den Bund Allahs brechen, nach seiner Errichtung, und zerschneiden, was Allah zu verbinden gebot, und Unfrieden auf Erden stiften: diese sind die Verlierenden.", "spanish": " Quienes rompen el pacto con Al-lah después de haberlo aceptado, y separan con ello lo que Al-lah ha ordenado que se mantenga unido, y crean el desorden en la tierra; ellos son los perdedores.", "urdu": " جو اللہ کے عہد کو اس کے پختہ کرنے کے بعد توڑ دیتے ہیں اور اس چیز کو جسے ملانے کا اللہ نے حکم دیا ہے کاٹتے ہیں اور زمین میں فساد کرتے ہیں‘ وہی لوگ نقصان اٹھانے والے ہیں۔"}, {"arabic": " کَیۡفَ تَکۡفُرُوۡنَ بِاللّٰہِ وَ کُنۡتُمۡ اَمۡوَاتًا فَاَحۡیَاکُمۡ ۚ ثُمَّ یُمِیۡتُکُمۡ ثُمَّ یُحۡیِیۡکُمۡ ثُمَّ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۲۹﴾", "english": " How can you disbelieve in Allah? When you were without life, He gave you life, and then He will cause you to die, then restore you to life, and then to Him shall you be made to return.", "french": " Comment pouvez-vous ne pas croire en Allāh ? Vous étiez sans vie et Il vous a donné la vie. Ensuite, Il vous fera mourir, puis Il vous rendra la vie, et alors vous serez ramenés à Lui.", "german": " Wie könnt ihr Allah verleugnen? Ihr waret doch ohne Leben, und Er gab euch Leben, und dann wird Er euch sterben lassen, dann euch dem Leben wiedergeben, und ihr kehrt dann zu Ihm zurück.", "spanish": " ¿Cómo podéis no creer en Al-lah? Cuando no teníais vida Él os dio la vida, y después os hará morir y os devolverá de nuevo la vida, y más tarde a Él seréis restituidos.", "urdu": " (اے لوگو)! تم کس طرح اللہ (کی باتوں) کا انکار کرتے ہو؟ حالانکہ تم بے جان تھے۔ پھر اس نے تمہیں جان دار بنایا‘ پھر (ایک دن آئے گا کہ) وہ تمہیں مارے گا پھر تمہیں زندہ کرے گا جس کے بعد تمہیں اس کی طرف لوٹایا جائے گا۔"}, {"arabic": " ہُوَ الَّذِیۡ خَلَقَ لَکُمۡ مَّا فِی الۡاَرۡضِ جَمِیۡعًا ٭ ثُمَّ اسۡتَوٰۤی اِلَی السَّمَآءِ فَسَوّٰٮہُنَّ سَبۡعَ سَمٰوٰتٍ ؕ وَ ہُوَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿٪۳۰﴾", "english": " He it is Who created for you all that is in the earth; then He turned towards the heavens, and He perfected them as seven heavens; and He knows all things.", "french": " C’est Lui Qui a créé pour vous tout ce qui est sur terre ; puis Il S’est tourné vers les cieux. Il les a parfaits en en formant sept et Il est Omniscient.", "german": " Er ist es, Der alles für euch erschuf, was auf Erden ist; dann wandte Er Sich nach dem Himmel; Er vollendete deren sieben Himmel, und Er weiß alle Dinge wohl.", "spanish": " Él es quien creó para vosotros todo lo que hay en la tierra; después se volvió al Cielo y lo dispuso en siete cielos; y Él sabe todas las cosas.", "urdu": " وہ (خدا) وہی (تو) ہے جس نے ان تمام چیزوں کو جو زمین میں ہیں تمہارے (فائدہ کے) لئے پیدا کیا۔ پھر وہ آسمانوں کی طرف متوجہ ہوا اور انہیں مکمل بنا دیا سات آسمان‘ اور وہ ہر ایک بات (کی حقیقت) کو خوب جانتا ہے۔"}, {"arabic": " وَ اِذۡ قَالَ رَبُّکَ لِلۡمَلٰٓئِکَۃِ اِنِّیۡ جَاعِلٌ فِی الۡاَرۡضِ خَلِیۡفَۃً ؕ قَالُوۡۤا اَتَجۡعَلُ فِیۡہَا مَنۡ یُّفۡسِدُ فِیۡہَا وَ یَسۡفِکُ الدِّمَآءَ ۚ وَ نَحۡنُ نُسَبِّحُ بِحَمۡدِکَ وَ نُقَدِّسُ لَکَ ؕ قَالَ اِنِّیۡۤ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ ﴿۳۱﴾", "english": " And when thy Lord said to the angels: ‘I am about to place a vicegerent in the earth,’ they said: ‘Wilt Thou place therein such as will cause disorder in it, and shed blood? — and we glorify Thee with Thy praise and extol Thy holiness.’ He answered: ‘I know what you know not.’", "french": "", "german": "", "spanish": "", "urdu": ""}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡا وَ کَذَّبُوۡا بِاٰیٰتِنَاۤ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿٪۴۰﴾", "english": " But they who will disbelieve and treat Our Signs as lies, these shall be the inmates of the Fire; therein shall they abide.", "french": " Mais ceux qui ne croient pas et qui considèrent Nos Signes comme des mensonges, ceux-là seront les compagnons du Feu où ils demeureront longtemps.", "german": "", "spanish": " Pero los que no crean y traten de falaces nuestros Signos, ésos serán huéspedes del Fuego; y en él tendrán su morada.", "urdu": " اور جو (لوگ) کفر کریں گے اور ہماری آیات کو جھٹلائیں گے وہ (ضرور) دوزخ (میں پڑنے) والے ہیں۔ وہ اس میں رہتے چلے جائیں گے۔"}, {"arabic": " یٰبَنِیۡۤ اِسۡرَآءِیۡلَ اذۡکُرُوۡا نِعۡمَتِیَ الَّتِیۡۤ اَنۡعَمۡتُ عَلَیۡکُمۡ وَ اَوۡفُوۡا بِعَہۡدِیۡۤ اُوۡفِ بِعَہۡدِکُمۡ ۚ وَ اِیَّایَ فَارۡہَبُوۡنِ ﴿۴۱﴾", "english": " O children of Israel! remember My favour which I bestowed upon you, and fulfil your covenant with Me, I will fulfil My covenant with you, and Me alone should you fear.", "french": " Ô Enfants d’Israël ! Souvenez-vous des grâces que J’ai répandues sur vous. Respectez votre alliance avec Moi et Je respecterai Mon alliance avec vous et c’est Moi Seul que vous devez craindre.", "german": " O ihr Kinder Israels! gedenket Meiner Gnade, die Ich euch erwiesen, und erfüllet euren Bund mit Mir, so will Ich erfüllen Meinen Bund mit euch, und Mich allein sollt ihr fürchten.", "spanish": " ¡Oh Hijos de Israel! acordaos de los favores que os concedí y sed fieles a vuestro pacto conmigo; yo seré fiel a mi alianza con vosotros, y sólo a Mí debéis temer.", "urdu": " اے بنی اسرائیل! میرے اس احسان کو یاد کرو‘ جو میں تم پر کر چکا ہوں اور تم (نے) میرے (ساتھ جو) عہد (کیا تھا اس) کو پورا کرو۔ تب میں نے جو عہد تمہارے ساتھ کیا تھا میں اس کو پورا کروں گا اور مجھ (ہی) سے (ڈرو) پھر (میں کہتا ہوں کہ) مجھ (ہی) سے ڈرو۔"}, {"arabic": " وَ اٰمِنُوۡا بِمَاۤ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَکُمۡ وَ لَا تَکُوۡنُوۡۤا اَوَّلَ کَافِرٍۭ بِہٖ ۪ وَ لَا تَشۡتَرُوۡا بِاٰیٰتِیۡ ثَمَنًا قَلِیۡلًا ۫ وَّ اِیَّایَ فَاتَّقُوۡنِ ﴿۴۲﴾", "english": " And believe in what I have sent down which fulfils that which is with you, and be not the first to disbelieve therein, and barter not My Signs for a paltry price, and take protection in Me alone.", "french": " Et croyez en ce que Je vous ai envoyé, en accomplissement de ce qui est déjà avec vous. Et ne soyez pas les premiers à ne pas y croire. Et n’échangez pas Mes Signes contre un vil prix et c’est Moi Seul que vous devez prendre comme protecteur.", "german": " Und glaubet an das, was Ich hinabsandte, Bestätigung dessen, was bei euch ist, und seid nicht die ersten, ihm den Glauben zu versagen, und verhandelt nicht Meine Zeichen für einen armseligen Preis, und suchet Schutz bei Mir allein.", "spanish": " Y creed en lo que he revelado, que cumple lo que ya tenéis, y no seáis de los primeros en no creer en ello, ni troquéis Mis Signos por algo de bajo precio, y acogeos únicamente a Mi protección.", "urdu": " اور اس (کلام) پر ایمان لاٶ جو میں نے (اب) اتارا ہے (اور) جو اس (کلام) کو جو تمہارے پاس ہے سچا کرنے والا ہے اور تم اس کے (سب سے) پہلے کافر نہ بنو‘ اور میری آیتوں کے بدلے میں تھوڑی قیمت مت لو۔ اور مجھ (ہی) سے (ڈرو) پھر (میں کہتا ہوں کہ) مجھ (ہی) سے ڈرو۔"}, {"arabic": " وَ لَا تَلۡبِسُوا الۡحَقَّ بِالۡبَاطِلِ وَ تَکۡتُمُوا الۡحَقَّ وَ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۴۳﴾", "english": " And confound not truth with falsehood nor hide the truth, knowingly.", "french": " Et ne confondez pas la vérité avec le mensonge, et ne cachez pas sciemment la vérité.", "german": " Und vermenget nicht Wahr mit Falsch noch verhehlet die Wahrheit wissentlich.", "spanish": " Y no confundáis la verdad con la falsedad ni escondáis a sabiendas la verdad.", "urdu": " اور جانتے بوجھتے ہوئے حق کو باطل کے ساتھ نہ ملاٶ اور نہ حق کو (جانتے بوجھتے ہوئے) چھپاٶ۔"}, {"arabic": " وَ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ وَ ارۡکَعُوۡا مَعَ الرّٰکِعِیۡنَ ﴿۴۴﴾", "english": " And observe Prayer and pay the Zakat, and bow down with those who bow.", "french": " Et observez la Prière et payez la Zakāt, et inclinez-vous avec ceux qui s’inclinent.", "german": " Und verrichtet das Gebet und zahlet die Zakât, und beugt euch mit denen, die sich beugen.", "spanish": " Y cumplid la Oración y pagad el Zakat, e inclinaos con los que se inclinan.", "urdu": " اور نماز کو قائم رکھو اور زکٰوۃ دو‘ اور خدا کی خالص پرستش کرنے والوں کے ساتھ مل کر خدا کی خالص پرستش کرو۔"}, {"arabic": " اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَ تَنۡسَوۡنَ اَنۡفُسَکُمۡ وَ اَنۡتُمۡ تَتۡلُوۡنَ الۡکِتٰبَ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۴۵﴾", "english": " Do you enjoin others to do what is good and forget your own selves, while you read the Book? Will you not then understand?", "french": " Enjoindrez-vous aux autres de faire le bien alors que vous vous oubliez vous-mêmes, et alors même que vous lisez le Livre ? Ne comprenez-vous donc pas ?", "german": " Wollt ihr andere ermahnen, das Rechte zu tun, und euer Selbst vergessen, obwohl ihr das Buch (Thora) leset? Wollt ihr denn nicht verstehen?", "spanish": " ¿Obligáis a otros a hacer buenas obras y vosotros lo olvidáis, mientras leéis el Libro? ¿No entenderéis, pues?", "urdu": " کیا تم (دوسرے) لوگوں کو (تو) نیکی (کرنے) کے لئے کہتے ہو اور اپنے آپ کو فراموش کر دیتے ہو؟ حالانکہ تم کتاب (یعنی تورات) پڑھتے ہو پھر (بھی) کیا تم عقل سے کام نہیں لیتے۔"}, {"arabic": " وَ اسۡتَعِیۡنُوۡا بِالصَّبۡرِ وَ الصَّلٰوۃِ ؕ وَ اِنَّہَا لَکَبِیۡرَۃٌ اِلَّا عَلَی الۡخٰشِعِیۡنَ ﴿ۙ۴۶﴾", "english": " And seek help with patience and Prayer; and this indeed is hard except for the humble in spirit,", "french": " Et cherchez l’aide avec patience et dans la Prière. En vérité, cela est difficile sauf pour ceux qui sont humbles en esprit,", "german": " Und sucht Hilfe in Geduld und Gebet; und das ist freilich schwer, es sei denn für die Demütigen im Geiste,", "spanish": " Y solicitad ayuda con paciencia y Oración; algo realmente difícil excepto para los humildes de espíritu,", "urdu": " اور صبر اور دعا کے ذریعہ سے (اللہ سے) مدد مانگو اور بے شک فروتنی اختیار کرنے والوں کے سوا (دوسروں کے لئے) یہ (امر) مشکل ہے۔"}, {"arabic": " الَّذِیۡنَ یَظُنُّوۡنَ اَنَّہُمۡ مُّلٰقُوۡا رَبِّہِمۡ وَ اَنَّہُمۡ اِلَیۡہِ رٰجِعُوۡنَ ﴿٪۴۷﴾", "english": " Who know for certain that they will meet their Lord, and that to Him will they return.", "french": " Qui savent, sans aucun doute, qu’ un jour ils rencontreront leur Seigneur et c’est vers Lui qu’ils reviendront.", "german": " die für gewiss wissen, dass sie ihrem Herrn begegnen und dass sie zu Ihm wiederkehren werden.", "spanish": " Quienes saben con certeza que encontrarán a su Señor, y que a Él volverán.", "urdu": " (وہ فروتن) جو (اس بات پر) یقین رکھتے ہیں کہ وہ اپنے رب سے ملنے والے ہیں اور اس بات پر بھی کہ وہ اسی کی طرف لوٹ کر جانے والے ہیں۔"}, {"arabic": " یٰبَنِیۡۤ اِسۡرَآءِیۡلَ اذۡکُرُوۡا نِعۡمَتِیَ الَّتِیۡۤ اَنۡعَمۡتُ عَلَیۡکُمۡ وَ اَنِّیۡ فَضَّلۡتُکُمۡ عَلَی الۡعٰلَمِیۡنَ ﴿۴۸﴾", "english": " O children of Israel! remember My favour which I bestowed upon you and that I exalted you above the peoples.", "french": " Ô Enfants d’Israël ! Souvenez-vous des grâces que J’ai répandues sur vous et rappelez-vous que Je vous ai élevés au-dessus de tous les peuples de l’époque .", "german": " O ihr Kinder Israels! gedenket Meiner Gnade, die Ich euch erwiesen, und dass Ich euch erhob über die Völker.", "spanish": " ¡Oh, Hijos de Israel! recordad los favores que Os concedí y que Os ensalcé por encima de los demás pueblos.", "urdu": " اے بنی اسرائیل! میرے اس احسان کو جو میں تم پر کر چکا ہوں یاد کرو۔ اور (اس احسان کو بھی) کہ میں نے تمہیں تمام جہانوں پر فضیلت دی تھی۔"}, {"arabic": " وَ اتَّقُوۡا یَوۡمًا لَّا تَجۡزِیۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَیۡئًا وَّ لَا یُقۡبَلُ مِنۡہَا شَفَاعَۃٌ وَّ لَا یُؤۡخَذُ مِنۡہَا عَدۡلٌ وَّ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿۴۹﴾", "english": " And fear the day when no soul shall serve as a substitute for another soul at all, nor shall intercession be accepted for it; nor shall ransom be taken from it; nor shall they be helped.", "french": " Et redoutez le jour où aucune âme ne pourra remplacer une autre, où aucune intercession ne sera acceptée pour elle, où aucune rançon ne sera reçue de sa part et où ils ne seront point secourus.", "german": " Und fürchtet den Tag, da keine Seele als Stellvertreterin wird dienen dürfen für eine andere Seele, da keine Fürbitte für sie gelten und kein Lösegeld von ihr genommen werden wird; und es wird ihnen nicht geholfen werden.", "spanish": " Y temed el día en que ningún alma podrá sustituir en absoluto a otra, ni se aceptará intersección alguna por ella, ni se recibirá rescate de ella; ni recibirán ayuda alguna.", "urdu": " اور اس دن سے ڈرو کہ (جس دن) کوئی شخص کسی دوسرے شخص کا قائم مقام نہ بن سکے گا اور نہ اس کی طرف سے کوئی سفارش منظور کی جائے گی اور نہ اس سے (کسی قسم کا) معاوضہ قبول کیا جائے گا اور نہ ان کی مدد کی جائے گی۔"}, {"arabic": " وَ اِذۡ نَجَّیۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ یَسُوۡمُوۡنَکُمۡ سُوۡٓءَ الۡعَذَابِ یُذَبِّحُوۡنَ اَبۡنَآءَکُمۡ وَ یَسۡتَحۡیُوۡنَ نِسَآءَکُمۡ ؕ وَ فِیۡ ذٰلِکُمۡ بَلَآ ءٌ مِّنۡ رَّبِّکُمۡ عَظِیۡمٌ ﴿۵۰﴾", "english": " And remember the time when We delivered you from Pharaoh’s people who afflicted you with grievous torment, slaying your sons and sparing your women; and in that there was a great trial for you from your Lord.", "french": " Et souvenez-vous quand Nous vous avons délivrés du peuple de Pharaon qui vous infligeait le pire châtiment, massacrant vos fils et épargnant vos femmes. C’était là une très grande épreuve de la part de votre Seigneur.", "german": " Und (gedenket der Zeit) da Wir euch erretteten von Pharaos Volk, das euch mit schlimmer Pein heimsuchte; sie erschlugen eure Söhne und schonten eurer Frauen; und darin war eine schwere Prüfung für euch von eurem Herrn.", "spanish": " Y acordaos de cuando Os libramos de las gentes del Faraón, que os afligían con crueles tormentos, matando a vuestros hijos y dejando vivir a vuestras mujeres. En eso había una gran prueba para vosotros por parte de vuestro Señor.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے تم کو فرعون کی قوم سے اس حالت میں نجات دی کہ وہ تمہیں بدترین عذاب دے رہی تھی تمہارے لڑکوں کو قتل کر دیتی تھی اور تمہاری عورتوں کو زندہ رکھتی تھی اور تمہارے رب کی طرف سے اس (بات) میں (تمہارے لئے) ایک بڑی آزمائش تھی۔"}, {"arabic": " وَ اِذۡ فَرَقۡنَا بِکُمُ الۡبَحۡرَ فَاَنۡجَیۡنٰکُمۡ وَ اَغۡرَقۡنَاۤ اٰلَ فِرۡعَوۡنَ وَ اَنۡتُمۡ تَنۡظُرُوۡنَ ﴿۵۱﴾", "english": " And remember the time when We divided the sea for you and saved you and drowned Pharaoh’s people, while you looked on.", "french": " Et souvenez-vous quand Nous avons partagé la mer pour vous. Nous vous avons donc délivrés et Nous avons noyé le peuple de Pharaon sous vos yeux.", "german": " Und (gedenket der Zeit) da Wir das Meer teilten für euch und euch erretteten und das Volk Pharaos vor eurem Angesicht ertränkten.", "spanish": " Y acordaos de cuando separamos el mar para vosotros, os salvamos y ahogamos a las gentes del Faraón, mientras observabais.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے تمہارے لئے سمندر کو پھاڑا۔ پھر ہم نے تمہیں نجات دی اور تمہاری نظروں کے سامنے فرعون کی قوم کو غرق کر دیا۔"}, {"arabic": " وَ اِذۡ وٰعَدۡنَا مُوۡسٰۤی اَرۡبَعِیۡنَ لَیۡلَۃً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِہٖ وَ اَنۡتُمۡ ظٰلِمُوۡنَ ﴿۵۲﴾", "english": " And remember the time when We made Moses a promise of forty nights; then you took the calf for worship in his absence and you were transgressors.", "french": " Et souvenez-vous quand Nous avons pris avec Moïse un engagement de quarante nuits. C’est alors que , pendant son absence, vous avez pris le veau en adoration et vous étiez des transgresseurs.", "german": " Und (gedenket der Zeit) da Wir Moses ein Versprechen gaben für vierzig Nächte; ihr aber nahmet euch das Kalb in seiner Abwesenheit, und ihr verginget euch.", "spanish": " Y acordaos de cuando hicimos a Moisés una promesa de cuarenta noches; y entonces tomasteis el becerro para adorarlo y fuisteis transgresores.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے موسیٰ سے چالیس راتوں کا وعدہ کیا پھر تم نے اس کے (چلے جانے کے) بعد ظالم بن کر بچھڑے کو (معبود) بنا لیا۔"}, {"arabic": " ثُمَّ عَفَوۡنَا عَنۡکُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۵۳﴾", "english": " Then We forgave you thereafter, that you might be grateful.", "french": " En dépit de cela, Nous vous avons pardonné afin que vous soyez reconnaissants.", "german": " Danach vergaben Wir euch, dass ihr möchtet dankbar sein.", "spanish": " Posteriormente, os perdonamos, para que pudierais ser agradecidos.", "urdu": " پھر ہم نے اس کے بعد (بھی) تمہیں معاف کر دیا تا کہ تم شکر گزار بنو۔"}, {"arabic": " وَ اِذۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ وَ الۡفُرۡقَانَ لَعَلَّکُمۡ تَہۡتَدُوۡنَ ﴿۵۴﴾", "english": " And remember the time when We gave Moses the Book and the Discrimination, that you might be rightly guided.", "french": " Et souvenez-vous quand Nous avons remis à Moïse le Livre et le Discernement, afin que vous soyez bien guidés.", "german": " Und (gedenket der Zeit) da Wir Moses die Schrift gaben und das Entscheidende, dass ihr möchtet rechtgeleitet sein.", "spanish": " Y acordaos de cuando dimos a Moisés el Libro y el Discernimiento, para que pudierais ser guiados rectamente.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے موسیٰ کو کتاب (یعنی تورات) اور فرقان (یعنی معجزات) دئیے تا کہ تم ہدایت پاٶ۔"}, {"arabic": " وَ اِذۡ قَالَ مُوۡسٰی لِقَوۡمِہٖ یٰقَوۡمِ اِنَّکُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِکُمُ الۡعِجۡلَ فَتُوۡبُوۡۤا اِلٰی بَارِئِکُمۡ فَاقۡتُلُوۡۤا اَنۡفُسَکُمۡ ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ عِنۡدَ بَارِئِکُمۡ ؕ فَتَابَ عَلَیۡکُمۡ ؕ اِنَّہٗ ہُوَ التَّوَّابُ الرَّحِیۡمُ ﴿۵۵﴾", "english": " And remember the time when Moses said to his people: ‘O my people, you have indeed wronged yourselves by taking the calf for worship ; turn you therefore to your Maker, and kill your evil desires; that is the best for you with your Maker.’ Then He turned towards you with compassion. Surely, He is Oft-Returning with compassion, and is Merciful.", "french": " Et souvenez-vous quand Moïse dit à son peuple : « Ô mon peuple, en vérité, vous vous êtes fait du tort en prenant le veau comme dieu . Tournez-vous donc avec repentir vers votre Créateur et supprimez vos mauvais désirs, cela est meilleur pour vous auprès de votre Créateur. » Alors Il Se tourna vers vous avec clémence. Assurément, Il est Celui Qui revient sans cesse avec compassion ; Il est le Miséricordieux.", "german": " Und (gedenket der Zeit) da Moses zu seinem Volke sprach: \"O mein Volk, du hast dich wahrlich an dir selbst versündigt, als du dir das Kalb nahmest; kehre dich denn zu deinem Schöpfer und töte dich selbst; das ist am besten für dich vor deinem Schöpfer.\" Da kehrte Er Sich wieder gnädig zu euch. Wahrlich, Er ist der oft gnädig Sich Wendende, der Barmherzige.", "spanish": " Y acordaos de cuando Moisés dijo a su pueblo: “Oh, pueblo mío, en verdad habéis obrado mal con vosotros mismos tomando al becerro para adorarlo ; volved pues a vuestro Creador y practicad la automortificación; eso será lo mejor para vosotros ante vuestro Creador.” Entonces Él volvió a vosotros con compasión . En verdad, Él es Remisorio con compasión y es Misericordioso.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب موسیٰ نے اپنی قوم سے کہا کہ اے میری قوم (کے لوگو)! تم نے بچھڑے کو (معبود) بنا کر یقیناً اپنی جانوں پر ظلم کیا ہے اس لئے تم اپنے پیدا کرنے والے کی طرف جھکو‘ اور ہر شخص اپنے آپ کو قتل کردے۔ یہ بات تمہارے پیدا کرنے والے کے نزدیک تمہارے حق میں بہت اچھی ہے (جب تم نے ایسا کر لیا) تب اس نے تمہاری طرف فضل کے ساتھ پھر توجہ کی وہ یقیناً (اپنے بندوں کی طرف) بہت توجہ کرنے والا بار بار رحم کرنے والا ہے۔"}, {"arabic": " وَ اِذۡ قُلۡتُمۡ یٰمُوۡسٰی لَنۡ نُّؤۡمِنَ لَکَ حَتّٰی نَرَی اللّٰہَ جَہۡرَۃً فَاَخَذَتۡکُمُ الصّٰعِقَۃُ وَ اَنۡتُمۡ تَنۡظُرُوۡنَ ﴿۵۶﴾", "english": " And remember when you said: ‘O Moses, we will by no means believe thee until we see Allah face to face;’ then the thunderbolt overtook you, while you gazed.", "french": " Et souvenez-vous quand vous avez dit : « Ô Moïse, nous ne te croirons pas avant d’avoir vu Allāh face à face. » C’est alors que, pendant que vous regardiez, la foudre vous frappa.", "german": " Und (gedenket der Zeit) da ihr sprachet: \"O Mose, wir wollen dir auf keine Weise glauben, ehe wir nicht Allah von Angesicht zu Angesicht schauen\"; da ereilte euch der Donnerschlag, dieweil ihr schautet.", "spanish": " Y acordaos de cuando dijisteis: “Oh, Moisés, no creeremos en ti en absoluto mientras no veamos a Al-lah cara a cara;” entonces el rayo os arrebató mientras mirabais.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب تم نے کہا تھا کہ اے موسیٰ! ہم تیری بات ہرگز نہیں مانیں گے جب تک ہم اللہ کو آمنے سامنے نہ دیکھ لیں‘ اس پر تمہیں ایک مہلک عذاب نے پکڑ لیا اور تم (اپنی آنکھوں سے اپنے فعل کا انجام) دیکھ رہے تھے۔"}, {"arabic": " ثُمَّ بَعَثۡنٰکُمۡ مِّنۡۢ بَعۡدِ مَوۡتِکُمۡ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۵۷﴾", "english": " Then We raised you up after your death, that you might be grateful.", "french": " Alors Nous vous avons ressuscités après votre état ressemblant à la mort afin que vous soyez reconnaissants.", "german": " Dann richteten Wir euch auf nach eurem Tode, dass ihr möchtet dankbar sein.", "spanish": " Acto seguido, os resucitamos después de vuestra muerte, para que fuerais agradecidos.", "urdu": " پھر ہم نے تمہاری ہلاکت کے بعد تمہیں اس لئے اٹھایا کہ تم شکر گزار بنو۔"}, {"arabic": " وَ ظَلَّلۡنَا عَلَیۡکُمُ الۡغَمَامَ وَ اَنۡزَلۡنَا عَلَیۡکُمُ الۡمَنَّ وَ السَّلۡوٰی ؕ کُلُوۡا مِنۡ طَیِّبٰتِ مَا رَزَقۡنٰکُمۡ ؕ وَ مَا ظَلَمُوۡنَا وَ لٰکِنۡ کَانُوۡۤا اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ﴿۵۸﴾", "english": " And We caused the clouds to be a shade over you and sent down on you Manna and Salwa, saying : ‘Eat of the good things We have provided for you.’ And they wronged Us not, but it was themselves that they wronged.", "french": " Et Nous avons fait les nuages vous couvrir de leur ombre. Et Nous avons fait descendre sur vous Manna et Salwā en disant : « Mangez de ces bonnes choses que Nous vous avons accordées comme provision. » Et ils ne Nous ont fait aucun tort, mais c’est à eux-mêmes qu’ils ont fait du tort.", "german": " Und Wir ließen die Wolken euch überschatten und sandten euch Manna und Salwa hernieder: \"Esset von den guten Dingen, die Wir euch beschert haben.\" Und sie schädigten nicht Uns, sondern sich selbst haben sie Schaden getan.", "spanish": " E hicimos que las nubes os cubrieran con su sombra y os enviamos el Manna y las Salwa, diciendo: “Comed de las cosas buenas que os hemos proporcionado.” Y no nos hicieron daño a Nos, sino a sí mismos.", "urdu": " اور ہم نے تم پر بادلوں کا سایہ کیا اور تمہارے لئے من اور سلوے اتارے۔ (اور کہا کہ) ان پاک چیزوں میں سے جو ہم نے تم کو دی ہیں کھاٶ۔ اور انہوں نے (نافرمانی کرکے) ہمارا نقصان نہیں کیا بلکہ وہ اپنا ہی نقصان کر رہے تھے۔"}, {"arabic": " وَ اِذۡ قُلۡنَا ادۡخُلُوۡا ہٰذِہِ الۡقَرۡیَۃَ فَکُلُوۡا مِنۡہَا حَیۡثُ شِئۡتُمۡ رَغَدًا وَّ ادۡخُلُوا الۡبَابَ سُجَّدًا وَّ قُوۡلُوۡا حِطَّۃٌ نَّغۡفِرۡ لَکُمۡ خَطٰیٰکُمۡ ؕ وَ سَنَزِیۡدُ الۡمُحۡسِنِیۡنَ ﴿۵۹﴾", "english": " And remember the time when We said: “Enter this village and eat therefrom — wherever you will — plentifully; and enter the gate submissively and say: ‘ God ! forgive us our sins.’ We shall forgive you your sins and We shall give increase to those who do good.”", "french": " Et souvenez-vous quand Nous avons dit : « Entrez dans cette ville et mangez-y abondamment partout où vous voudrez et entrez par la porte centrale en soumission en disant : Dieu ! Pardonne-nous nos péchés. » Nous vous pardonnerons vos péchés et Nous donnerons davantage aux bienfaisants.", "german": " Und (gedenket der Zeit) da Wir sprachen: \"Tretet ein in diese Stadt und esset reichlich von dem Ihren – wo immer ihr wollt – und tretet unterwürfig ein durch das Tor und sprechet: \"Vergebung!\" Wir werden euch eure Sünden vergeben und Wir werden jene mehren, die Gutes tun.\"", "spanish": " Y acordaos de cuando dijimos: “Entrad en este pueblo y comed de sus bienes –donde queráis- hasta saciaros; y entrad humildemente por la puerta y decid: “¡Dios! Perdónanos nuestros pecados.” Os perdonaremos vuestros pecados y aumentaremos Nuestros favores a quienes hagan buenas obras.”", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے کہا تھا کہ اس بستی میں داخل ہو جاٶ اور اس میں سے جہاں سے چاہو بافراغت کھاٶ اور (اس کے) دروازے میں پوری فرمانبرداری کرتے ہوئے داخل ہو اور کہتے جاٶ (کہ ہم) بوجھ ہلکا کرنے کی التجا (کرتے ہیں‘ تب) ہم تمہاری خطاٶں کو بالکل معاف کر دیں گے اور ہم محسنوں کو ضرور بڑھائیں گے۔"}, {"arabic": " فَبَدَّلَ الَّذِیۡنَ ظَلَمُوۡا قَوۡلًا غَیۡرَ الَّذِیۡ قِیۡلَ لَہُمۡ فَاَنۡزَلۡنَا عَلَی الَّذِیۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا کَانُوۡا یَفۡسُقُوۡنَ ﴿٪۶۰﴾", "english": " The transgressors changed it for a word other than that which was said to them. So We sent down upon the transgressors a punishment from heaven, because they were disobedient.", "french": " Mais ceux qui ont transgressé changèrent cela en une autre parole que celle qui leur avait été dite. Alors, Nous avons envoyé une punition du ciel sur les transgresseurs, parce qu’ils étaient désobéissants.", "german": " Die Ungerechten vertauschten das Wort, das zu ihnen gesprochen ward, mit einem anderen. So sandten Wir auf die Ungerechten eine Strafe vom Himmel, weil sie ungehorsam waren.", "spanish": " Los transgresores la cambiaron por una palabra contraria a la que se les había dicho. Por tanto enviamos desde los cielos un castigo a los injustos, porque fueron desobedientes.", "urdu": " پھر (ان کی شرارت دیکھو کہ) ظالموں نے اس بات کے خلاف جو انہیں کہی گئی تھی ایک اور بات بدل (کر کہنی شروع کر) دی جس پر ہم نے ان لوگوں پر جنہوں نے ظلم کیا تھا ان کے نافرمان ہونے کے سبب سے آسمان سے ایک عذاب نازل کیا۔"}, {"arabic": " وَ اِذِ اسۡتَسۡقٰی مُوۡسٰی لِقَوۡمِہٖ فَقُلۡنَا اضۡرِبۡ بِّعَصَاکَ الۡحَجَرَ ؕ فَانۡفَجَرَتۡ مِنۡہُ اثۡنَتَاعَشۡرَۃَ عَیۡنًا ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَہُمۡ ؕ کُلُوۡا وَ اشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰہِ وَ لَا تَعۡثَوۡا فِی الۡاَرۡضِ مُفۡسِدِیۡنَ ﴿۶۱﴾", "english": " And remember the time when Moses prayed for water for his people, and We said: ‘Strike the rock with thy rod,’ and there gushed forth from it twelve springs, so that every tribe knew their drinking place. ‘Eat and drink of what Allah has provided, and commit not iniquity in the earth, creating disorder.’", "french": " Et souvenez-vous quand Moïse pria pour que son peuple ait de l’eau et Nous avons dit : « Frappe le rocher de ton bâton » ; et il en jaillit douze sources afin que chaque tribu sût où elle devait boire. « Mangez et buvez de la provision d'Allāh. Et ne commettez pas d’iniquité sur terre comme des fauteurs de désordre. »", "german": " Und (gedenket der Zeit) da Moses um Wasser betete für sein Volk und Wir sprachen: \"Schlage an den Felsen mit deinem Stab\", und zwölf Quellen brachen aus ihm hervor; jeder Stamm kannte seinen Trinkplatz. \"Esset und trinket von Allahs Gaben und verübt nicht Unheil auf Erden, indem ihr Unfrieden stiftet.\"", "spanish": " Y acordaos cuando Moisés pidió agua para su pueblo y dijimos: “Golpea la roca con tu bastón”, y de ella brotaron doce fuentes, a fin de que cada tribu supiera en qué lugar debía beber. “Comed y bebed de lo que Al-lah ha proporcionado, y no cometáis iniquidades en la tierra, creando el desorden.”", "urdu": " اور (اس وقت کو بھی یاد کرو) جو موسیٰ نے اپنی قوم کے لئے پانی مانگا تو ہم نے (اسے) کہا کہ اپنا سونٹا فلاں پتھر پر مار۔ اس پر اس میں سے بارہ چشمے پھوٹ پڑے (اور) ہر ایک گروہ نے اپنے گھاٹ کو پہچان لیا‘ (تب انہیں کہا گیا کہ) اللہ کے رزق میں سے کھاٶ اور پیو اور مفسد بن کر زمین میں خرابی نہ پیدا کرو۔"}, {"arabic": " وَ اِذۡ قُلۡتُمۡ یٰمُوۡسٰی لَنۡ نَّصۡبِرَ عَلٰی طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّکَ یُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِہَا وَ قِثَّآئِہَا وَ فُوۡمِہَا وَ عَدَسِہَا وَ بَصَلِہَا ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِیۡ ہُوَ اَدۡنٰی بِالَّذِیۡ ہُوَ خَیۡرٌ ؕ اِہۡبِطُوۡا مِصۡرًا فَاِنَّ لَکُمۡ مَّا سَاَلۡتُمۡ ؕ وَ ضُرِبَتۡ عَلَیۡہِمُ الذِّلَّۃُ وَ الۡمَسۡکَنَۃُ ٭ وَ بَآءُوۡ بِغَضَبٍ مِّنَ اللّٰہِ ؕ ذٰلِکَ بِاَنَّہُمۡ کَانُوۡا یَکۡفُرُوۡنَ بِاٰیٰتِ اللّٰہِ وَ یَقۡتُلُوۡنَ النَّبِیّٖنَ بِغَیۡرِ الۡحَقِّ ؕ ذٰلِکَ بِمَا عَصَوۡا وَّ کَانُوۡا یَعۡتَدُوۡنَ ﴿٪۶۲﴾", "english": " And remember the time when you said: ‘O Moses, surely, we will not remain content with one kind of food; pray, then, to thy Lord for us that He bring forth for us of what the earth grows — of its herbs and its cucumbers and its wheat and its lentils and its onions.’ He said: ‘Would you take in exchange that which is inferior for that which is superior? Go down to some town, and there is for you what you ask.’ And they were smitten with abasement and destitution, and they incurred the wrath of Allah: that was because they rejected the Signs of Allah and would kill the Prophets unjustly; that was because they rebelled and transgressed.", "french": " Et souvenez-vous quand vous aviez dit : « Ô Moïse, en vérité nous ne pouvons plus nous contenter d’une seule sorte de nourriture. Prie donc ton Seigneur en notre faveur afin qu’Il fasse sortir pour nous de ce que la terre produit, de ses légumes, ses concombres, son froment, ses lentilles, ses oignons. » Il répondit : « Voudrez-vous prendre ce qui est inférieur en échange de ce qui est supérieur ? Descendez dans une ville quelconque où vous trouverez ce que vous demandez. » Et ils furent frappés d’humiliation et de misère et ils encoururent la colère d’Allāh. C’était parce qu’ils avaient rejeté les Signes d’Allāh, et mettaient injustement les Prophètes à mort chaque fois qu’ils le pouvaient ; c’était parce qu’ils avaient désobéi et avaient transgressé.", "german": " Und (gedenket der Zeit) da ihr sprachet: \"O Mose, gewiss, wir werden uns nicht zufrieden geben mit einerlei Speise; bitte also deinen Herrn für uns, dass Er für uns hervorbringe von dem, was die Erde wachsen lässt – von ihren Kräutern und ihren Gurken und ihrem Weizen und ihren Linsen und ihren Zwiebeln.\" Er sprach: \"Wolltet ihr das Geringere in Tausch nehmen für das Bessere? Geht in irgendeine Stadt, und ihr werdet finden, was ihr verlangt.\" Und sie wurden mit Schande und Elend geschlagen, und sie luden Allahs Zorn auf sich; dies, weil sie die Zeichen Allahs verwarfen und die Propheten zu Unrecht töten wollten; das war, weil sie widerspenstig waren und frevelten.", "spanish": " Y acordaos de cuando dijisteis: “Oh, Moisés, ciertamente no soportaremos una sola clase de comida; ruega, pues, a tu Señor por nosotros para que haga brotar a nuestro favor lo que la tierra produce: sus hierbas, sus pepinos, su trigo, sus lentejas y sus cebollas”. Él dijo: “¿Acaso vais a cambiar lo inferior por lo superior? Bajad a alguna ciudad y allí tendréis lo que pedís.” Y fueron golpeados con el abatimiento y la pobreza, e incurrieron en la cólera de Al-lah: así ocurrió porque rechazaron los Signos de Al-lah y mataron injustamente a los Profetas; y fue porque se rebelaron y fueron transgresores.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب تم نے کہا تھا کہ اے موسیٰ! ہم ایک ہی کھانے پر صبر نہیں کر سکیں گے اس لئے تو ہمارے لئے اپنے رب سے دعا کر کہ وہ ہمارے لئے بعض ایسی چیزیں جنہیں زمین اگاتی ہے پیدا کرے۔ یعنی اس کی سبزیاں‘ ککڑیاں‘ گیہوں‘ مسور اور پیاز۔ (اس پر اللہ نے) کہا کہ کیا تم اس چیز کی بجائے جو اعلیٰ ہے اس چیز کو لینا چاہتے ہو جو ادنیٰ ہے۔ کسی شہر میں چلے جاٶ (وہاں) جو کچھ تم نے مانگا ہے تمہیں ضرور مل جائے گا (تب) انہیں ہمیشہ کے لئے ذلیل اور بے بس کر دیا گیا اور وہ اللہ کے غضب کا مورد بن گئے۔ یہ اس وجہ سے (ہوا) کہ وہ اللہ کی آیتوں کا انکار کرتے تھے اور نبیوں کو ناحق قتل کرنا چاہتے تھے (اور) یہ (گناہ) ان کے نافرمانی کرنے اور حد سے بڑھے ہوئے ہونے کے سبب سے (ان میں پیدا ہو گیا) تھا۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ الَّذِیۡنَ ہَادُوۡا وَ النَّصٰرٰی وَ الصّٰبِئِیۡنَ مَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ عَمِلَ صَالِحًا فَلَہُمۡ اَجۡرُہُمۡ عِنۡدَ رَبِّہِمۡ ۪ۚ وَ لَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۶۳﴾", "english": " Surely, the Believers, and the Jews, and the Christians and the Sabians — whichever party from among these truly believes in Allah and the Last Day and does good deeds — shall have their reward with their Lord, and no fear shall come upon them, nor shall they grieve.", "french": " En vérité, les Croyants, et les Juifs, et les Chrétiens et les Sabéens, tous ceux qui croient sincèrement en Allāh et au Jour Dernier et qui font de bonnes œuvres, auront leur récompense auprès de leur Seigneur. Ils ne seront ni dans la crainte, ni ne seront-ils affligés.", "german": " Wahrlich, die Gläubigen und die Juden und die Christen und die Sabäer – wer immer (unter diesen) wahrhaft an Allah glaubt und an den Jüngsten Tag und gute Werke tut –, sie sollen ihren Lohn empfangen von ihrem Herrn, und keine Furcht soll über sie kommen, noch sollen sie trauern.", "spanish": " Ciertamente, los creyentes, los judíos, los cristianos y los sabeos –y cualquiera de entre aquellos que crea verdaderamente en Al-lah y el Último Día y haga buenas obras tendrán su recompensa con su Señor y no les sobrecogerá el temor, ni se afligirán.", "urdu": " جو لوگ ایمان لائے ہیں اور جو یہودی ہیں نیز نصاریٰ اور صابی (ان میں سے) جو (فریق) بھی اللہ پر اور آخرت کے دن پر (کامل) ایمان لایا ہے اور اس نے نیک عمل کیے ہیں یقیناً ان کے لئے ان کے رب کے پاس ان کا (مناسب) اجر ہے اور انہیں نہ (تو مستقبل کے متعلق) کسی قسم کا خوف ہوگا اور نہ (ماضی پر) وہ غمگین ہوں گے۔"}, {"arabic": " وَ اِذۡ اَخَذۡنَا مِیۡثَاقَکُمۡ وَ رَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَاۤ اٰتَیۡنٰکُمۡ بِقُوَّۃٍ وَّ اذۡکُرُوۡا مَا فِیۡہِ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿۶۴﴾", "english": " And remember the time when We took a covenant from you and raised high above you the Mount, saying : ‘Hold fast that which We have given you and bear in mind what is therein, that you may be saved.’", "french": " Et souvenez-vous quand Nous avons conclu un pacte avec vous, et que Nous avons élevé le Mont au-dessus de vous, Nous avons dit : « Tenez ferme à ce que Nous vous avons donné, et souvenez-vous de tout ce qu’il contient, afin que vous soyez sauvés de la destruction . »", "german": " Und (gedenket der Zeit) da Wir einen Bund schlossen mit euch und den Berg hoch über euch ragen ließen (und sprachen): \"Haltet fest, was Wir euch gegeben haben, und bewahret in eurem Sinn, was darinnen ist, auf dass ihr errettet werdet.\"", "spanish": " Y acordaos de cuando aceptamos vuestra alianza y elevamos sobre vosotros el Monte, diciendo: “Sujetad con fuerza lo que os hemos dado y recordad lo que contiene, a fin de que os salvéis.”", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے تم سے پختہ عہد لیا تھا اور طور کو تمہارے اوپر بلند کیا تھا (اور کہا تھا کہ) جو (کچھ) ہم نے تمہیں دیا ہے اسے مضبوطی سے پکڑ لو اور جو کچھ اس میں ہے اسے یاد رکھو‘ تا کہ تم متقی بن جاٶ۔"}, {"arabic": " ثُمَّ تَوَلَّیۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ ۚ فَلَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ لَکُنۡتُمۡ مِّنَ الۡخٰسِرِیۡنَ ﴿۶۵﴾", "english": " Then you turned back thereafter; and had it not been for Allah’s grace towards you and His mercy, you would surely have been of the losers.", "french": " Puis vous vous en êtes détournés après cela, et n’eussent-été la grâce et la miséricorde d’Allāh sur vous, vous auriez sûrement été parmi les perdants.", "german": " Danach aber kehrtet ihr euch ab; und wäre nicht Allahs Huld und Seine Gnade für euch gewesen, ihr wäret gewiss unter den Verlierern.", "spanish": " Pero, después de esto, os alejasteis; y de no haber sido por la gracia de Al-lah para vosotros y por Su misericordia, ciertamente os contaríais entre los desventurados.", "urdu": " پھر اس (واضح ہدایت کے مل جانے) کے بعد (بھی) تم نے پیٹھ پھیر لی اور اگر تم پر اللہ کا فضل اور اس کی رحمت نہ ہوتی تو تم ضرور نقصان اٹھانے والوں میں سے ہو جاتے۔"}, {"arabic": " وَ لَقَدۡ عَلِمۡتُمُ الَّذِیۡنَ اعۡتَدَوۡا مِنۡکُمۡ فِی السَّبۡتِ فَقُلۡنَا لَہُمۡ کُوۡنُوۡا قِرَدَۃً خٰسِئِیۡنَ ﴿ۚ۶۶﴾", "english": " And surely, you have known the end of those amongst you, who transgressed in the matter of the Sabbath. So We said to them: ‘Be ye apes, despised.’", "french": " Et vous avez sûrement appris la fin réservée à ceux des vôtres qui transgressèrent en ce qui concerne le Sabbat. Nous leur avons dit : « Soyez comme des singes, méprisés. »", "german": " Und sicherlich habt ihr Kenntnis von (dem Ende) derer unter euch, die das Sabbatgebot übertraten. So sprachen Wir zu ihnen: \"Seid denn Affen, Verachtete.\"", "spanish": " Y ciertamente, habéis conocido la suerte de aquellos de vosotros que violaron lo relacionado con el Sabbath. Por eso les dijimos, “Volveos monos despreciables.”", "urdu": " اور تم ان لوگوں (کے انجام) کو جنہوں نے تم میں سے (ہوتے ہوئے) سبت کے معاملہ میں زیادتی کی تھی یقیناً جان چکے ہو‘ اس پر ہم نے انہیں کہا تھا کہ (جاٶ) ذلیل بندر بن جاٶ۔"}, {"arabic": " فَجَعَلۡنٰہَا نَکَالًا لِّمَا بَیۡنَ یَدَیۡہَا وَ مَا خَلۡفَہَا وَ مَوۡعِظَۃً لِّلۡمُتَّقِیۡنَ ﴿۶۷﴾", "english": " Thus We made it an example to those of its time and to those who came after it, and a lesson to those who fear God.", "french": " Ainsi Nous en avons fait un exemple pour leurs contemporains et pour ceux qui devaient leur succéder, ainsi qu’un avertissement pour ceux qui ont la crainte d’Allāh.", "german": " Also machten Wir dies zu einem warnenden Beispiel für die, die damals waren, und für die, die nachher kamen, und zu einer Lehre für die Gottesfürchtigen.", "spanish": " Así lo convertimos en un ejemplo para sus contemporáneos y para los que vinieron después, y en una lección para los que temen a Dios.", "urdu": " پس ہم نے اس (واقعہ) کو ان (لوگوں) کے لئے بھی جو (اس وقت) موجود تھے اور اس (وقوعہ) کے بعد آنے والے لوگوں کے لئے بھی (موجب) عبرت اور متقیوں کے لئے (موجب) نصیحت بنا دیا۔"}, {"arabic": " وَ اِذۡ قَالَ مُوۡسٰی لِقَوۡمِہٖۤ اِنَّ اللّٰہَ یَاۡمُرُکُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَۃً ؕ قَالُوۡۤا اَتَتَّخِذُنَا ہُزُوًا ؕ قَالَ اَعُوۡذُ بِاللّٰہِ اَنۡ اَکُوۡنَ مِنَ الۡجٰہِلِیۡنَ ﴿۶۸﴾", "english": " And remember when Moses said to his people: ‘Allah commands you to slaughter a cow,’ they said: ‘Dost thou make a jest of us?’ He said: ‘I seek refuge with Allah from being one of the ignorant.’", "french": " Et souvenez-vous quand Moïse dit à son peuple : « Assurément, Allāh vous commande d’immoler une vache, » ils répondirent : « Te moques-tu de nous ? » Alors il dit : « Allāh me préserve d’être du nombre des ignorants ! »", "german": " Und (denket daran) als Moses zu seinem Volke sprach: \"Allah befiehlt euch, eine Kuh zu schlachten\"; da sagten sie: \"Treibst du Spott mit uns?\" Er sprach: \"Ich suche Zuflucht bei Allah, dass ich nicht sei der Unwissenden einer.\"", "spanish": " Y acordaos de cuando Moisés dijo a su pueblo: “Al-lah os ordena sacrificar una vaca”, y ellos dijeron: “¿Acaso pretendes burlarte de nosotros?” Dijo: “Busco refugio en Al-lah para no ser uno de los ignorantes.”", "urdu": " اور (اس وقت کو بھی یاد کرو) جب موسیٰ نے اپنی قوم سے کہا کہ اللہ تمہیں گائے کے ذبح کرنے کا حکم دیتا ہے‘ انہوں نے کہا کیا تو ہمیں تمسخر کا نشانہ بناتا ہے؟ (موسیٰ نے) کہا میں (اس بات سے) اللہ کی پناہ مانگتا ہوں کہ (ایسا فعل کرکے) جاہلوں میں شامل ہو جاٶں۔"}, {"arabic": " قَالُوا ادۡعُ لَنَا رَبَّکَ یُبَیِّنۡ لَّنَا مَا ہِیَ ؕ قَالَ اِنَّہٗ یَقُوۡلُ اِنَّہَا بَقَرَۃٌ لَّا فَارِضٌ وَّ لَا بِکۡرٌ ؕ عَوَانٌۢ بَیۡنَ ذٰلِکَ ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ ﴿۶۹﴾", "english": " They said: ‘Pray for us to thy Lord that He make plain to us what she is.’ He answered: ‘ God says, it is a cow, neither old nor young, fullgrown, between the two; now do what you are commanded.’", "french": " Ils dirent : « Prie ton Seigneur pour nous afin qu’Il nous explique comment elle est. » Il leur répondit : « Allāh dit que c’est une vache ni jeune, ni vieille, mais pleinement grandie entre les deux ; maintenant, faites ce qui vous est commandé. »", "german": " Sie sprachen: \"Bitte deinen Herrn für uns, dass Er uns deutlich mache, was sie ist.\" Er antwortete: \"Er spricht, es ist eine Kuh, weder alt noch jung, voll erwachsen, zwischen beidem; nun tut, wie euch geboten.\"", "spanish": " Ellos dijeron: “Ruega por nosotros a tu Señor para que nos indique cómo es”. Respondió: “ Dios dice: es una vaca, ni vieja ni joven, ya crecida, de edad intermedia entre las dos; y ahora haced lo que se os manda.”", "urdu": " انہوں نے کہا‘ ہماری خاطر اپنے رب سے دعا کیجیے ٔ کہ وہ ہمیں کھول کر بتائے کہ وہ (گائے) کیسی ہے؟ اس نے (یعنی موسیٰ نے) کہا کہ وہ فرماتا ہے وہ ایسی گائے ہے کہ نہ تو بڑھیا ہے اور نہ بچھیا‘ بلکہ اس کے درمیان پوری جوان ہے اس لئے جو حکم تمہیں دیا جاتا ہے اسے بجا لاٶ۔"}, {"arabic": " قَالُوا ادۡعُ لَنَا رَبَّکَ یُبَیِّنۡ لَّنَا مَا لَوۡنُہَا ؕ قَالَ اِنَّہٗ یَقُوۡلُ اِنَّہَا بَقَرَۃٌ صَفۡرَآءُ ۙ فَاقِعٌ لَّوۡنُہَا تَسُرُّ النّٰظِرِیۡنَ ﴿۷۰﴾", "english": " They said: ‘Pray for us to thy Lord that He make plain to us what colour she is.’ He answered: ‘ God says, it is a cow of a dun colour, pure and rich in tone ; delighting the beholders.’", "french": " Ils dirent : « Prie ton Seigneur pour nous pour qu’Il nous explique de quelle couleur elle est. » Il leur répondit : « Allāh dit que c’est une vache jaune, d’une nuance riche et pure qui réjouit les yeux de ceux qui la regardent. »", "german": " Sie sprachen: \"Bitte deinen Herrn für uns, dass Er uns deutlich mache, welches ihre Farbe ist.\" Er antwortete: \"Er spricht, es ist eine Kuh von hellgelber Farbe, rein und reich im Ton; eine Lust den Beschauenden.\"", "spanish": " Dijeron: “Ruega por nosotros a tu Señor para que nos indique de qué color es”. Él respondió: “ Dios dice que es una vaca de color pardo, de tono puro y rico; que agrada a cuantos la miran.”", "urdu": " انہوں نے کہا‘ ہماری خاطر اپنے رب سے (پھر) دعا کیجیے ٔ کہ وہ ہمیں کھول کر بتائے کہ اس کا رنگ کیا ہے؟ (موسیٰ نے) کہا‘ وہ فرماتا ہے کہ وہ ایک زرد رنگ کی گائے ہے‘ اس کا رنگ بہت شوخ ہے (اور) وہ دیکھنے والوں کو بہت پسند آتی ہے۔"}, {"arabic": " قَالُوا ادۡعُ لَنَا رَبَّکَ یُبَیِّنۡ لَّنَا مَا ہِیَ ۙ اِنَّ الۡبَقَرَ تَشٰبَہَ عَلَیۡنَا ؕ وَ اِنَّاۤ اِنۡ شَآءَ اللّٰہُ لَمُہۡتَدُوۡنَ ﴿۷۱﴾", "english": " They said: ‘Pray for us to thy Lord that He make plain to us what she is, for all such cows appear to us alike; and if Allah please, we shall indeed be guided.’", "french": " Ils dirent : « Prie ton Seigneur pour nous pour qu’Il dise précisément ce qu’elle est, car pour nous, toutes les vaches sont pareilles ; et, s’il plaît à Allāh, nous serons certainement guidés. »", "german": " Sie sprachen: \"Bitte deinen Herrn für uns, dass Er uns deutlich mache, welche es ist; denn (alle solchen) Kühe scheinen uns gleich; und wenn es Allah gefällt, werden wir rechtgeleitet sein.\"", "spanish": " Dijeron: “Ruega por nosotros a tu Señor para que nos indique cómo es, ya que para nosotros todas esas vacas se asemejan.” Y si Al-lah quiere, ciertamente, seremos guiados.", "urdu": " انہوں نے کہا‘ ہماری خاطر اپنے رب سے (پھر) دعا کیجیے ٔ کہ وہ ہمیں کھول کر بتائے کہ وہ (گائے) کیسی ہے؟ ہمیں تو اس قسم کی (سب) گائیں ایک ہی جیسی نظر آتی ہیں اور (یقین رکھیے کہ) اگر اللہ نے چاہا تو ہم ضرور ہدایت کو قبول کر لیں گے۔"}, {"arabic": " قَالَ اِنَّہٗ یَقُوۡلُ اِنَّہَا بَقَرَۃٌ لَّا ذَلُوۡلٌ تُثِیۡرُ الۡاَرۡضَ وَ لَا تَسۡقِی الۡحَرۡثَ ۚ مُسَلَّمَۃٌ لَّا شِیَۃَ فِیۡہَا ؕ قَالُوا الۡـٰٔنَ جِئۡتَ بِالۡحَقِّ ؕ فَذَبَحُوۡہَا وَ مَا کَادُوۡا یَفۡعَلُوۡنَ ﴿٪۷۲﴾", "english": " He answered: ‘ God says, it is a cow not broken in to plough the earth or water the tilth; one without blemish; of one colour.’ They said: ‘Now hast thou brought the truth.’ Then they slaughtered her, though they would rather not do so.", "french": " Il répondit : « Allāh dit qu’il s’agit d’une vache qui n’a été rompue ni au labourage du sol ni à l’arrosage des champs, d’une vache sans tare et d’une seule couleur. » Ils dirent : « Maintenant, tu nous as apporté la vérité. » Puis ils l’immolèrent, bien qu’ils eussent été presque à ne pas le faire.", "german": " Er antwortete: \"Er spricht, es ist eine Kuh, nicht gebeugt unter das Joch, das Land zu pflügen oder den Acker zu wässern; eine ohne Tadel; von einerlei Farbe.\" Sie sprachen: \"Nun hast du die Wahrheit gebracht.\" Dann schlachteten sie sie, obgleich sie es ungern taten.", "spanish": " Respondió: “ Dios dice que es una vaca no agotada a fuerza de arar la tierra o regar los cultivos; un animal sin tacha; de un solo color”. Dijeron: “Ahora has traído la verdad”. Entonces la sacrificaron, aunque a punto estuvieron de no hacerlo.", "urdu": " (موسیٰ نے) کہا‘ وہ فرماتا ہے کہ وہ ایسی گائے ہے جو نہ تو جوئے کے نیچے لائی گئی ہے کہ ہل چلاتی ہو اور نہ کھیتی کو پانی دیتی ہے‘ بالکل تندرست ہے‘اس میں کوئی غیر رنگ نہیں (پایا جاتا) انہوں نے کہا اب تو نے (ہم پر) حقیقت کھول دی ہے‘ چنانچہ انہوں نے اس (گائے) کو ذبح کر دیا‘ گو وہ ایسا کرنے پر آمادہ نہ تھے۔"}, {"arabic": " وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِیۡہَا ؕ وَ اللّٰہُ مُخۡرِجٌ مَّا کُنۡتُمۡ تَکۡتُمُوۡنَ ﴿ۚ۷۳﴾", "english": " And remember the time when you slew a person and differed among yourselves about it; and Allah would bring to light what you concealed.", "french": " Et souvenez-vous quand vous avez tué un homme et que vous vous êtes disputés à ce propos. Et Allāh devait éclaircir ce que vous dissimuliez.", "german": " Und (gedenket der Zeit) da ihr einen Menschen erschluget und darüber uneinig waret; und Allah würde ans Licht bringen, was ihr verhehltet.", "spanish": " Y acordaos de cuando matasteis a una persona y disputasteis entre vosotros por ese motivo, y Al-lah sacó a la luz lo que ocultasteis.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب تم نے ایک شخص کو قتل (کرنے کا دعویٰ) کیا‘ پھر تم نے اس کے بارے میں اختلاف کیا‘ حالانکہ جو (کچھ) تم چھپاتے تھے اللہ اسے ظاہر کرنے والا تھا۔"}, {"arabic": " فَقُلۡنَا اضۡرِبُوۡہُ بِبَعۡضِہَا ؕ کَذٰلِکَ یُحۡیِ اللّٰہُ الۡمَوۡتٰی ۙ وَ یُرِیۡکُمۡ اٰیٰتِہٖ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿۷۴﴾", "english": " Then We said: ‘Smite him (the murderer) for a part of the offence against him (the murdered person).’ Thus Allah gives life to the dead and shows you His Signs that you may understand.", "french": "", "german": "", "spanish": "", "urdu": ""}, {"arabic": " ثُمَّ قَسَتۡ قُلُوۡبُکُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ فَہِیَ کَالۡحِجَارَۃِ اَوۡ اَشَدُّ قَسۡوَۃً ؕ وَ اِنَّ مِنَ الۡحِجَارَۃِ لَمَا یَتَفَجَّرُ مِنۡہُ الۡاَنۡہٰرُ ؕ وَ اِنَّ مِنۡہَا لَمَا یَشَّقَّقُ فَیَخۡرُجُ مِنۡہُ الۡمَآءُ ؕ وَ اِنَّ مِنۡہَا لَمَا یَہۡبِطُ مِنۡ خَشۡیَۃِ اللّٰہِ ؕوَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۷۵﴾", "english": " Then your hearts became hardened after that, till they were like stones or harder still; for of stones indeed there are some out of which gush forth streams, and of them there are some out of which flows water when they cleave asunder. And indeed, of them there are some that humble themselves for fear of Allah. And Allah is not unmindful of what you do.", "french": " Mais ensuite vos cœurs se sont endurcis, au point de devenir comme des pierres et encore plus durs car, en vérité, il y a des pierres d’où jaillissent des ruisseaux, et il y en a d’autres d’où coule de l’eau quand elles se fendent. Et très certainement, il y a certains parmi eux qui s’humilient par crainte d’Allāh. Et Allāh n’est pas inattentif à ce que vous faites.", "german": " Danach aber wurden eure Herzen verhärtet, bis sie wie Steine waren oder noch härter; denn unter den Steinen sind ja solche, aus denen Ströme hervorbrechen, und solche, aus denen Wasser fließt, wenn sie sich spalten. Und gewiss sind unter ihnen manche, die sich demütigen in der Furcht Allahs; und Allah ist nicht achtlos eures Tuns.", "spanish": " Luego, posteriormente, se endurecieron vuestros corazones, hasta ser como piedras o aún más duros; pues en cuanto a las piedras hay, en verdad, algunas de las que brotan ríos y algunas de las que, una vez partidas, sale agua. Y en verdad, entre ellas hay otras que se humillan por temor a Al-lah. Y Al-lah no ignora lo que hacéis.", "urdu": " اس کے بعد پھر تمہارے دل سخت ہو گئے‘ چنانچہ وہ پتھروں کی طرح بلکہ ان سے بھی زیادہ سخت ہیں اور پتھروں میں سے تو یقیناً بعض ایسے بھی ہوتے ہیں جن میں سے دریا بہتے ہیں اور ان میں سے بعض ایسے بھی ہوتے ہیں کہ پھٹ جاتے ہیں تو ان میں سے پانی نکلنے لگتا ہے اور ان (دلوں) میں سے (بھی) بعض ایسے ہیں کہ اللہ کے ڈر سے (معافی مانگتے ہوئے) گر جاتے ہیں اور جو (کچھ) تم کر رہے ہو اللہ اس سے ہر گز بے خبر نہیں ہے۔"}, {"arabic": " اَفَتَطۡمَعُوۡنَ اَنۡ یُّؤۡمِنُوۡا لَکُمۡ وَ قَدۡ کَانَ فَرِیۡقٌ مِّنۡہُمۡ یَسۡمَعُوۡنَ کَلٰمَ اللّٰہِ ثُمَّ یُحَرِّفُوۡنَہٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡہُ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۷۶﴾", "english": " Do you expect that they will believe you when a party of them hear the word of Allah, then pervert it after they have understood it, and they know the consequences thereof ?", "french": " Gardez-vous espoir qu’ils croiront en vous, alors même qu’un groupe des leurs se sont déjà attachés à déformer délibérément la parole d’Allāh après qu’ils l’aient entendue, qu’ils l’aient comprise et qu’ils l’ aient sue très clairement ?", "german": " Erwartet ihr, dass sie (die Juden) euch glauben, wenn ein Teil von ihnen das Wort Allahs hört, es dann verdreht, nachdem sie es begriffen, und sie kennen (die Folgen) davon?", "spanish": " ¿Mantenéis la esperanza de que os crean cuando una parte de ellos ha pervertido conscientemente la palabra de Al-lah después de que la hubieran escuchado y la hubieran entendido y la conocieran perfectamente?", "urdu": " (اے مسلمانو)! کیا تم امید رکھتے ہو کہ وہ (یہودی) تمہاری بات مان لیں گے‘ حالانکہ ان میں سے کچھ لوگ ایسے ہیں جو اللہ کے کلام کو سنتے ہیں‘ پھر اسے سمجھ لینے کے بعد اس (کے مطلب) کو بگاڑ دیتے ہیں اور وہ (اس عمل کے بدنتائج کو خوب) جانتے ہیں۔"}, {"arabic": " وَ اِذَا لَقُوا الَّذِیۡنَ اٰمَنُوۡا قَالُوۡۤا اٰمَنَّا ۚۖ وَ اِذَا خَلَا بَعۡضُہُمۡ اِلٰی بَعۡضٍ قَالُوۡۤا اَتُحَدِّثُوۡنَہُمۡ بِمَا فَتَحَ اللّٰہُ عَلَیۡکُمۡ لِیُحَآجُّوۡکُمۡ بِہٖ عِنۡدَ رَبِّکُمۡ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۷۷﴾", "english": " And when they meet those who believe, they say: ‘We believe,’ and when they meet one another in private, they say: ‘Do you inform them of what Allah has unfolded to you, that they may thereby argue with you before your Lord? Will you not then understand?’", "french": " Et lorsqu’ils rencontrent ceux qui croient, ils disent : « Nous croyons, » et quand ils se rencontrent en particulier, ils disent : « Leur parlerez-vous de ce qu’Allāh vous a dévoilé, afin qu’ils en fassent un argument contre vous devant votre Seigneur ? Vous ne comprenez donc pas ? »", "german": " Und wenn sie den Gläubigen begegnen, sagen sie: \"Wir glauben\", und wenn sie einander heimlich begegnen, dann sagen sie: \"Wolltet ihr jenen mitteilen, was Allah euch enthüllt hat, dass sie deswegen mit euch streiten vor eurem Herrn? Begreift ihr das denn nicht?\"", "spanish": " Y cuando encuentran a los creyentes, dicen: “Creemos”, pero cuando se reúnen en privado, unos con otros, dicen: “¿Les informáis de lo que Al-lah os ha revelado, para que puedan así discutir con vosotros ante vuestro Señor?”. ¿No comprenderéis entonces?", "urdu": " اور جب یہ لوگ مومنوں سے ملتے ہیں تو کہہ دیتے ہیں کہ ہم مومن ہیں اور جب ایک دوسرے سے علیحدگی میں ملتے ہیں تو (ایک دوسرے کو الزام دیتے ہوئے) کہتے ہیں کیا تم انہیں وہ باتیں جو اللہ نے تم پر کھولی ہیں بتاتے ہو اس کا نتیجہ یہ ہوگا کہ وہ ان (معلومات) کے ذریعہ سے اللہ کے سامنے تم پر حجت قائم کریں گے۔ کیا تم عقل سے کام نہیں لیتے؟"}, {"arabic": " اَ وَ لَا یَعۡلَمُوۡنَ اَنَّ اللّٰہَ یَعۡلَمُ مَا یُسِرُّوۡنَ وَ مَا یُعۡلِنُوۡنَ ﴿۷۸﴾", "english": " Do they not know that Allah knows what they conceal and what they disclose?", "french": " Ne savent-ils pas qu’Allāh connaît ce qu’ils dissimulent et ce qu’ils dévoilent ?", "german": " Wissen sie nicht, dass Allah weiß, was sie verbergen und was sie kundtun?", "spanish": " ¿Acaso no saben que Al-lah conoce lo que ocultan y lo que revelan?", "urdu": " کیا یہ (اس بات کو) نہیں جانتے کہ جو کچھ وہ چھپاتے ہیں اور جو کچھ وہ ظاہر کرتے ہیں اللہ اسے جانتا ہے۔"}, {"arabic": " وَ مِنۡہُمۡ اُمِّیُّوۡنَ لَا یَعۡلَمُوۡنَ الۡکِتٰبَ اِلَّاۤ اَمَانِیَّ وَ اِنۡ ہُمۡ اِلَّا یَظُنُّوۡنَ ﴿۷۹﴾", "english": " And some of them are illiterate; they know not the Book but their own false notions, and they do nothing but conjecture.", "french": " Et il y a parmi eux des illettrés ; ceux-ci ne connaissent rien du Livre à part leurs propres idées erronées. Ils ne font que conjecturer.", "german": " Und einige unter ihnen sind Schriftunkundige; sie kennen das Buch nicht, nur eitle Wünsche, und sie meinen bloß.", "spanish": " Y algunos de ellos son analfabetos; no conocen el Libro sino sus propias falsas concepciones, y no hacen más que conjeturas.", "urdu": " اور ان میں سے بعض ان پڑھ ہیں جو چند جھوٹی باتوں کے سوا اپنی کتاب کا کچھ بھی علم نہیں رکھتے اور وہ صرف تک بندیاں کرتے رہتے ہیں۔"}, {"arabic": " فَوَیۡلٌ لِّلَّذِیۡنَ یَکۡتُبُوۡنَ الۡکِتٰبَ بِاَیۡدِیۡہِمۡ ٭ ثُمَّ یَقُوۡلُوۡنَ ہٰذَا مِنۡ عِنۡدِ اللّٰہِ لِیَشۡتَرُوۡا بِہٖ ثَمَنًا قَلِیۡلًا ؕ فَوَیۡلٌ لَّہُمۡ مِّمَّا کَتَبَتۡ اَیۡدِیۡہِمۡ وَ وَیۡلٌ لَّہُمۡ مِّمَّا یَکۡسِبُوۡنَ ﴿۸۰﴾", "english": " Woe, therefore, to those who write the Book with their own hands, and then say: ‘This is from Allah,’ that they may take for it a paltry price. Woe, then, to them for what their hands have written, and woe to them for what they earn.", "french": " Malheur donc à ceux qui écrivent le Livre de leurs propres mains et disent ensuite : « Ceci émane d’Allāh, » afin d’en recevoir un prix dérisoire ! Malheur donc à eux pour ce que leurs mains ont écrit et malheur à eux pour ce qu’ils gagnent !", "german": " Wehe darum denen, die das Buch schreiben mit ihren eigenen Händen und dann sprechen: \"Dies ist von Allah\", dass sie dafür einen armseligen Preis nehmen möchten! Wehe ihnen also um dessentwillen, was ihre Hände geschrieben, und wehe ihnen um dessentwillen, was sie verdienen!", "spanish": " ¡Ay, pues, de aquellos que escriben el Libro con sus propias manos y después dicen: “Esto viene de Al-lah”, para poder pedir por él un precio ridículo! ¡Ay, pues, de ellos por lo que han escrito sus manos, y ¡Ay! de ellos por lo que ganaron!", "urdu": " پس جو لوگ اپنے ہاتھوں سے کتاب لکھتے ہیں (اور) پھر اس کے ذریعہ سے (کچھ) تھوڑی سی قیمت حاصل کرنے کے لئے کہہ دیتے ہیں کہ یہ (کتاب) اللہ کی طرف سے ہے ان کے لئے (ایک سخت) عذاب (مقدر) ہے۔ پھر (ہم کہتے ہیں کہ) ان کے لئے ان کے ہاتھوں کے لکھے کے سبب سے (ایک سخت) عذاب (مقدر) ہے اور اس کے سبب سے (بھی) عذاب (مقدر) ہے جو وہ کماتے ہیں۔"}, {"arabic": " وَ قَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَیَّامًا مَّعۡدُوۡدَۃً ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰہِ عَہۡدًا فَلَنۡ یُّخۡلِفَ اللّٰہُ عَہۡدَہٗۤ اَمۡ تَقُوۡلُوۡنَ عَلَی اللّٰہِ مَا لَا تَعۡلَمُوۡنَ ﴿۸۱﴾", "english": " And they say: ‘The Fire shall not touch us except for a small number of days.’ Say: ‘Have you taken a promise from Allah? Then, Allah will never break His promise. Or, do you say of Allah what you know not?’", "french": " Et ils disent : « Le Feu de l’Enfer ne nous touchera que pour quelques jours comptés. » Dis- leur : « Avez-vous pris une promesse d’Allāh ? Alors, Allāh ne manquera pas à Sa promesse. Où est-ce que vous dites d’Allāh ce que vous ne savez pas ? »", "german": " Und sie sprechen: \"Das Feuer wird uns nicht berühren, es sei denn für eine geringe Zahl von Tagen.\" Sprich: \"Habt ihr ein Versprechen von Allah empfangen? Dann freilich wird Allah nimmer Sein Versprechen brechen. Oder sagt ihr von Allah, was ihr nicht wisst?\"", "spanish": " Y dicen: “El Fuego no nos tocará sino durante un número reducido de días” Diles: “¿Habéis recibido una promesa de Al-lah? Si es así, Al-lah nunca incumplirá Su promesa. O bien ¿afirmáis de Al-lah lo que desconocéis?”.", "urdu": " اور وہ کہتے ہیں کہ ہمیں چند گنتی کے دنوں کے سوا (دوزخ کی) آگ ہر گز نہ چھوئے گی۔ تو (ان سے) کہہ کیا تم نے اللہ کی بارگاہ سے کوئی عہد لیا (ہوا) ہے؟ (اگر ایسا ہے) تب تو وہ ہرگز اپنے عہد کے خلاف نہیں کرے گا‘ یا تم اللہ کے متعلق ایسی بات کہتے ہو‘ جس کا تمہیں (کوئی) علم نہیں ہے۔"}, {"arabic": " بَلٰی مَنۡ کَسَبَ سَیِّئَۃً وَّ اَحَاطَتۡ بِہٖ خَطِیۡٓــَٔتُہٗ فَاُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۸۲﴾", "english": " Aye, whoso does evil and is encompassed by his sins — those are the inmates of the Fire; therein shall they abide.", "french": " En vérité, quiconque fait le mal et est entouré de ses péchés – ceux-là sont les compagnons du Feu. Ils y demeureront longtemps.", "german": " Wahrlich, wer da übel tut und verstrickt ist in seinen Sünden – diese sind die Bewohner des Feuers; darin müssen sie bleiben.", "spanish": " ¡Ay de aquél que hace el mal y está rodeado de sus pecados!: Ésos son los prisioneros del Fuego; en él morarán.", "urdu": " کیوں نہیں‘ جو لوگ بھی کسی قسم کی بدی کمائیں گے اور ان کا گناہ انہیں (چاروں طرف سے) گھیر لے گا وہ دوزخ (میں پڑنے) والے ہیں۔ وہ اس میں (پڑے) رہیں گے۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اُولٰٓئِکَ اَصۡحٰبُ الۡجَنَّۃِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿٪۸۳﴾", "english": " But they who believe and do good works — those are the dwellers of Heaven; therein shall they abide.", "french": " Mais ceux qui croient et font de bonnes oeuvres – voilà les habitants du Paradis. Ils y demeureront éternellement.", "german": " Die aber glauben und gute Werke tun – diese sind die Bewohner des Himmels; darin sollen sie bleiben.", "spanish": " Pero los que creen y hacen buenas obras: ésos son los habitantes del Cielo; en él morarán eternamente.", "urdu": " اور جو لوگ ایمان لائے ہیں اور انہوں نے نیک عمل کیے ہیں وہ جنت (میں جانے) والے ہیں۔ وہ اس میں (ہمیشہ) بسیں گے۔"}, {"arabic": " وَ اِذۡ اَخَذۡنَا مِیۡثَاقَ بَنِیۡۤ اِسۡرَآءِیۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰہَ ۟ وَ بِالۡوَالِدَیۡنِ اِحۡسَانًا وَّ ذِی ‌الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ قُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ ؕ ثُمَّ تَوَلَّیۡتُمۡ اِلَّا قَلِیۡلًا مِّنۡکُمۡ وَ اَنۡتُمۡ مُّعۡرِضُوۡنَ ﴿۸۴﴾", "english": " And remember the time when We took a covenant from the children of Israel: ‘You shall worship nothing but Allah and show kindness to parents and to kindred and orphans and the poor, and speak to men kindly and observe Prayer, and pay the Zakat;’ then you turned away in aversion, except a few of you.", "french": " Et souvenez-vous quand Nous avons pris un engagement avec les Enfants d’Israël : « Vous ne devez rien adorer d’autre qu’Allāh ; vous serez bons envers vos parents et vos proches, envers les orphelins et les pauvres. Vous devez parler avec bienveillance aux hommes, observer la Prière et payer la Zakāt » ; alors, à part quelques-uns d’entre vous, vous avez tous tourné le dos à cet engagement , en aversion.", "german": " Und (gedenket der Zeit) da Wir einen Bund schlossen mit den Kindern Israels: \"Ihr sollt nichts anbeten denn Allah; und Güte (erzeigen) den Eltern und den Verwandten und den Waisen und den Armen; und redet Gutes zu den Menschen und verrichtet das Gebet und zahlet die Zakât.\" Ihr aber kehrtet euch späterhin ab in Widerwillen, bis auf einige wenige von euch.", "spanish": " Y acordaos de cuando aceptamos una alianza de los Hijos de Israel: “No adoréis sino a Al-lah, sed buenos con los padres, los parientes, los huérfanos y los pobres; hablad bondadosamente a los hombres, cumplid la Oración y pagad el Zakat, ”; entonces volvisteis la espalda alejándoos, excepto unos cuantos.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے بنی اسرائیل سے پختہ عہد لیا تھا کہ تم اللہ کے سوا کسی کی عبادت نہ کرو گے اور والدین سے احسان (کا معاملہ) کرو گے اور (اسی طرح) قرابت دار یتیموں اور مسکینوں کے ساتھ بھی‘ اور یہ (عہد بھی لیا تھا) کہ لوگوں کے ساتھ ملاطفت کے ساتھ کلام کیا کرو۔ اور نماز کو قائم رکھا کرو اور زکٰوۃ ادا کیا کرو۔ مگر (اس کے بعد) تم میں سے چند ایک کے سوا (باقی) سب (کے سب) اعراض کرتے ہوئے پھر گئے۔"}, {"arabic": " وَ اِذۡ اَخَذۡنَا مِیۡثَاقَکُمۡ لَا تَسۡفِکُوۡنَ دِمَآءَکُمۡ وَ لَا تُخۡرِجُوۡنَ اَنۡفُسَکُمۡ مِّنۡ دِیَارِکُمۡ ثُمَّ اَقۡرَرۡتُمۡ وَ اَنۡتُمۡ تَشۡہَدُوۡنَ ﴿۸۵﴾", "english": " And remember the time when We took a covenant from you: ‘You shall not shed your blood or turn your people out of your homes;’ then you confirmed it ; and you have been witness to it .", "french": " Et souvenez-vous quand Nous avons fait un pacte avec vous : « Vous ne devez point verser votre sang, ni chasser vos frères de vos demeures. » Ensuite, vous avez confirmé ce pacte, et vous en avez été témoins.", "german": " Und (gedenket der Zeit) da Wir einen Bund schlossen mit euch: \"Ihr sollt nicht das Blut der Eurigen vergießen oder sie austreiben aus euren Häusern\"; damals bekräftigtet ihr (es); und ihr habt es selber bezeugt.", "spanish": " Y acordaos de cuando acepté la alianza con vosotros: “No derramaréis vuestra propia sangre ni expulsaréis a los vuestros de vuestras casas”; luego lo confirmasteis; y habéis sido testigos de ello .", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے تم سے عہد لیا تھا کہ تم (آپس میں) اپنے خون نہ بہاٶ گے اور اپنے آپ کو (یعنی اپنی قوم کے لوگوں کو) اپنے گھروں سے نہ نکالو گے اور تم نے (اس کا) اقرار کر لیا تھا اور تم (اس عہد کے متعلق ہمیشہ) گواہی دیتے رہے ہو۔"}, {"arabic": " ثُمَّ اَنۡتُمۡ ہٰۤـؤُلَآءِ تَقۡتُلُوۡنَ اَنۡفُسَکُمۡ وَ تُخۡرِجُوۡنَ فَرِیۡقًا مِّنۡکُمۡ مِّنۡ دِیَارِہِمۡ ۫ تَظٰہَرُوۡنَ عَلَیۡہِمۡ بِالۡاِثۡمِ وَ الۡعُدۡوَانِ ؕ وَ اِنۡ یَّاۡتُوۡکُمۡ اُسٰرٰی تُفٰدُوۡہُمۡ وَ ہُوَ مُحَرَّمٌ عَلَیۡکُمۡ اِخۡرَاجُہُمۡ ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡکِتٰبِ وَ تَکۡفُرُوۡنَ بِبَعۡضٍ ۚ فَمَا جَزَآءُ مَنۡ یَّفۡعَلُ ذٰلِکَ مِنۡکُمۡ اِلَّا خِزۡیٌ فِی الۡحَیٰوۃِ الدُّنۡیَا ۚ وَ یَوۡمَ الۡقِیٰمَۃِ یُرَدُّوۡنَ اِلٰۤی اَشَدِّ الۡعَذَابِ ؕ وَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۸۶﴾", "english": " Yet you are the people who slay your own brethren and turn out a section of your people from their homes, backing up one another against them with sin and transgression. And if they come to you as captives, you ransom them, while their very expulsion was unlawful for you. Do you, then, believe in part of the Book and disbelieve in part? There is, therefore, no reward for such among you as do this, except disgrace in the present life; and on the Day of Judgment they shall be driven to a most severe chastisement; and surely, Allah is not unmindful of what you do.", "french": " Et pourtant, c’est vous qui vous vous entre-tuez, et qui chassez de chez eux certains de vos gens en soutenant leurs ennemis contre eux dans le péché et la transgression. Et s’ils tombent entre vos mains comme captifs, vous les rançonnez, alors que même les chasser de chez eux vous était interdit. Alors, croyez-vous en une partie du Livre en refusant de croire en une autre partie ? Quelle peut être alors la récompense pour ceux d’entre vous qui agissent ainsi, sauf le déshonneur dans la vie d’ici-bas ; et au Jour du Jugement, ils seront refoulés au châtiment le plus sévère ; et assurément Allāh n’est pas inattentif à ce que vous faites.", "german": " Dennoch seid ihr Leute, die ihr einander erschlagt und einen Teil der Eurigen aus ihren Häusern treibt, einer den anderen stützend gegen sie mit Sünde und Missetat. Und wenn sie als Gefangene zu euch kommen, kauft ihr sie los, obwohl ihre Austreibung selbst für euch ungesetzlich war. Glaubt ihr denn nur an einen Teil des Buches und verwerft den anderen? Es gibt darum keinen Lohn für jene unter euch, die also tun, denn Schande in diesem Leben, und am Tage der Auferstehung sollen sie der schwersten Strafe überantwortet werden; und Allah ist nicht achtlos eures Tuns.", "spanish": " No obstante, sois de los que matan a sus propios hermanos y expulsan a parte de vuestro pueblo de sus casas, ayudándoos mutuamente contra ellos con pecado y trasgresión. Y si os llegan como prisioneros, los rescatáis, aunque el hecho mismo de su expulsión sea ilegal para vosotros. ¿Acaso creéis en una parte del Libro y no creéis en otra parte? No hay pues recompensa alguna para aquellos de vosotros que así actúen, salvo la desgracia en esta vida; y en el Día del Juicio serán conducidos al más terrible castigo; y, en verdad, Al-lah no ignora lo que hacéis.", "urdu": " پھر تم لوگ ہی ہو کہ (اس عہد کے باوجود) آپس میں ایک دوسرے کو قتل کرتے ہو اور اپنے میں سے ایک جماعت کو گناہ اور ظلم کے ساتھ (ان کے دشمنوں کی) مدد کرتے ہوئے ان کے گھروں سے نکالتے ہو اور اگر وہ تمہارے پاس قیدی ہو کر (مدد مانگنے کے لئے) آئیں تو تم فدیہ دیکر انہیں چھڑا لیتے ہو گو حقیقتا ان کا (گھروں سے) نکالنا (بھی) تم پر حرام کیا گیا تھا۔ تو کیا تم کتاب کے ایک حصہ پر تو ایمان لاتے ہو اور ایک حصہ کا انکار کرتے ہو۔ پس تم میں سے جو ایسا کرتے ہیں ان کی سزا اس (جہان کی) زندگی (ہی) میں رسوائی (اٹھانے) کے سوا اور کیا ہے (جو انہیں ملے گی) اور وہ قیامت کے دن اس سے بھی سخت عذاب کی طرف لوٹائے جائیں گے اور جو کچھ تم کر رہے ہو اللہ اس سے ہر گز بے خبر نہیں۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ اشۡتَرَوُا الۡحَیٰوۃَ الدُّنۡیَا بِالۡاٰخِرَۃِ ۫ فَلَا یُخَفَّفُ عَنۡہُمُ الۡعَذَابُ وَ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿٪۸۷﴾", "english": " These are they who have preferred the present life to the Hereafter. Their punishment shall not therefore be lightened, nor shall they be helped in any other way .", "french": " Voilà ceux qui ont préféré la vie de ce monde à la vie future. Leur châtiment ne sera donc pas atténué et ils ne seront secourus d’aucune autre manière.", "german": " Diese sind es, die das jetzige Leben dem künftigen vorgezogen haben. Ihre Strafe soll darum nicht gemildert noch soll ihnen sonst Beistand werden.", "spanish": " Son éstos los que han preferido la presente vida a la Futura. Su castigo no será pues, aliviado, ni serán auxiliados de ninguna otra manera.", "urdu": " اور یہی وہ لوگ ہیں جنہوں نے اس (جہان کی) زندگی کو بعد میں آنے والی (زندگی) پر مقدم کر لیا ہے اس لئے نہ تو ان سے عذاب ہی ہلکا کیا جائے گا اور نہ ان کی (کسی اور رنگ میں) مدد کی جائے گی۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ وَ قَفَّیۡنَا مِنۡۢ بَعۡدِہٖ بِالرُّسُلِ ۫ وَ اٰتَیۡنَا عِیۡسَی ابۡنَ مَرۡیَمَ الۡبَیِّنٰتِ وَ اَیَّدۡنٰہُ بِرُوۡحِ الۡقُدُسِ ؕ اَفَکُلَّمَا جَآءَکُمۡ رَسُوۡلٌۢ بِمَا لَا تَہۡوٰۤی اَنۡفُسُکُمُ اسۡتَکۡبَرۡتُمۡ ۚ فَفَرِیۡقًا کَذَّبۡتُمۡ ۫ وَ فَرِیۡقًا تَقۡتُلُوۡنَ ﴿۸۸﴾", "english": " And verily, We gave Moses the Book and caused after him Messengers to follow in his footsteps; and to Jesus, son of Mary, We gave manifest Signs, and strengthened him with the Spirit of holiness. Will you then, every time a Messenger comes to you with what you yourselves desire not, behave arrogantly and treat some as liars and slay others?", "french": " Et en vérité, Nous avons donné le Livre à Moïse, et après lui, Nous avons envoyé des Messagers successifs. Nous avons donné des Signes manifestes à Jésus, fils de Marie, et Nous l’avons fortifié de l’Esprit de Sainteté. Toutes les fois qu’un Messager viendra vous apporter ce que vous ne désirez point, allez-vous agir avec arrogance ; traitant d’aucuns de menteurs et tuant d’autres ?", "german": " Wir gaben Moses fürwahr das Buch und ließen Gesandte folgen in seinen Fußstapfen; und Jesus, dem Sohn der Maria, gaben Wir offenkundige Zeichen und stärkten ihn mit dem Geiste der Heiligkeit. Wollt ihr denn, jedesmal da ein Bote zu euch kommt mit dem, was ihr selbst nicht wünschet, hoffärtig sein und einige als Lügner behandeln und andere erschlagen?", "spanish": " Y en verdad Dimos a Moisés el Libro y enviamos a Mensajeros tras él, para que siguieran sus pasos; y a Jesús, hijo de María, dimos Signos manifiestos y lo fortalecimos con el Espíritu de santidad. ¿Es que cada vez que os llegue un Mensajero con lo que no deseéis, os comportaréis con arrogancia, trataréis a unos de mentirosos y mataréis a otros?", "urdu": " اور ہم نے (یقیناً) موسیٰ کو کتاب دی تھی اور اس کے بعد ہم نے (ان) رسولوں کو (جنہیں تم جانتے ہو اس کے) پیچھے بھیجا اور عیسیٰ ابن مریم کو (بھی) ہم نے کھلے کھلے نشانات دئیے اور روح القدس کے ذریعہ اسے طاقت بخشی (لیکن تم نے سب کا مقابلہ کیا) تو پھر (تم ہی بتاٶ کہ) کیا (یہ بات ناپسندیدہ نہیں کہ) جب بھی تمہارے پاس کوئی رسول اس (تعلیم) کو لے کر آیا جسے تمہارے نفس پسند نہیں کرتے تھے تو تم نے تکبر (کا مظاہرہ) کیا چنانچہ بعض کو تم نے جھٹلا دیا اور بعض کو قتل کر دیا۔"}, {"arabic": " وَ قَالُوۡا قُلُوۡبُنَا غُلۡفٌ ؕ بَلۡ لَّعَنَہُمُ اللّٰہُ بِکُفۡرِہِمۡ فَقَلِیۡلًا مَّا یُؤۡمِنُوۡنَ ﴿۸۹﴾", "english": " They said: ‘Our hearts are wrapped in covers.’ Nay, Allah has cursed them for their disbelief. Little is that which they believe.", "french": " Et ils dirent : « Nos cœurs sont enveloppés dans des voiles. » En vérité Allāh les a maudits à cause de leur manque de foi. En somme , ils ont peu de foi.", "german": " Sie sprechen: \"Unsere Herzen sind in Hüllen gewickelt.\" Nein, Allah hat sie verflucht um ihres Unglaubens willen. Gering ist also, was sie glauben.", "spanish": " Dijeron, “Nuestros corazones están rodeados por una envoltura”. ¡No!, Al-lah los ha maldecido por su incredulidad. En muy pocas cosas creen.", "urdu": " اور (ہمیں معلوم ہے کہ) انہوں نے (یہ بھی) کہا ہے (کہ) ہمارے دل تو پردوں میں ہیں (مگر یہ بات) نہیں‘ بلکہ اللہ نے ان کے کفر کے سبب سے ان پر لعنت کی ہے پس وہ بہت ہی کم ایمان لاتے ہیں۔"}, {"arabic": " وَ لَمَّا جَآءَہُمۡ کِتٰبٌ مِّنۡ عِنۡدِ اللّٰہِ مُصَدِّقٌ لِّمَا مَعَہُمۡ ۙ وَ کَانُوۡا مِنۡ قَبۡلُ یَسۡتَفۡتِحُوۡنَ عَلَی الَّذِیۡنَ کَفَرُوۡا ۚۖ فَلَمَّا جَآءَہُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِہٖ ۫ فَلَعۡنَۃُ اللّٰہِ عَلَی الۡکٰفِرِیۡنَ ﴿۹۰﴾", "english": " And when there came to them a Book from Allah, fulfilling that which is with them — and before that they had prayed for victory over the disbelievers — yet when there came to them that which they knew, they rejected it. The curse of Allah be on the disbelievers.", "french": " Quand il leur vint un Livre de la part d’Allāh accomplissant ce qui est déjà avec eux – et auparavant, ils avaient demandé à Allāh la victoire sur les mécréants – cependant quand il leur vint ce qu’ils savaient être la vérité , ils le rejetèrent. Que la malédiction d’Allāh soit sur les mécréants !", "german": " Und als ihnen ein Buch von Allah zukam, bestätigend das, was sie haben – und sie hatten zuvor um Sieg gefleht über die Ungläubigen –, dennoch, als ihnen zukam, was sie doch kannten, da verwarfen sie es. Darum Allahs Fluch auf die Ungläubigen!", "spanish": " Y cuando les llegó un Libro enviado por Al-lah, cumpliendo lo que ya tenían, –y antes de eso habían implorado la victoria sobre los incrédulos-, no obstante, cuando les llegó lo que ya sabían, lo rechazaron. ¡Que la maldición de Dios caiga sobre los incrédulos!", "urdu": " اور جب ان کے پاس اللہ کی طرف سے ایک کتاب آئی جو اس (کتاب کی پیشگوئیوں) کو جو ان کے پاس ہے سچا کرنے والی ہے تو باوجود اس کے کہ پہلے یہ (لوگ اللہ سے) کافروں پر فتح (پانے کی دعا) مانگا کرتے تھے۔ جب ان کے پاس وہ چیز آگئی جس کو انہوں نے پہچان لیا تو اس کا انکار کر دیا۔ پس ایسے کافروں پر اللہ کی لعنت ہے۔"}, {"arabic": " بِئۡسَمَا اشۡتَرَوۡا بِہٖۤ اَنۡفُسَہُمۡ اَنۡ یَّکۡفُرُوۡا بِمَاۤ اَنۡزَلَ اللّٰہُ بَغۡیًا اَنۡ یُّنَزِّلَ اللّٰہُ مِنۡ فَضۡلِہٖ عَلٰی مَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰی غَضَبٍ ؕ وَ لِلۡکٰفِرِیۡنَ عَذَابٌ مُّہِیۡنٌ ﴿۹۱﴾", "english": " Evil is that for which they have sold their souls: that they should disbelieve in what Allah has revealed, grudging that Allah should send down His grace on whomsoever of His servants He pleases. So they incurred wrath upon wrath; and there is an humiliating chastisement for the disbelievers.", "french": " Combien est mauvais ce pour lequel ils ont vendu leur âme en ne croyant pas à ce qu’Allāh a révélé et ils voient d’un mauvais œil qu’Allāh puisse accorder quelque grâce de Sa part à n’importe lequel de Ses serviteurs, selon Son plaisir. Ils se sont ainsi attiré courroux sur courroux ; et pour les mécréants il y a un châtiment humiliant.", "german": " Übel ist das, wofür sie ihre Seelen verkauft haben: dass sie verwerfen sollten, was Allah offenbart hat, aus Wut, weil Allah Seine Huld herabsendet auf wen immer Seiner Diener, der Ihm gefällt. So luden sie (auf sich) Zorn über Zorn; und eine demütigende Strafe wartet der Ungläubigen.", "spanish": " Por maldad es por lo que vendieron sus almas: no creyeron en lo que Al-lah ha revelado, quejándose, por envidia, de que Al-lah enviara su gracia a aquellos de Sus siervos que deseara. De este modo, incurrieron en cólera sobre cólera; y hay un ignominioso castigo aguardando a los incrédulos.", "urdu": " وہ امر بہت ہی برا ہے جس کے بدلہ میں انہوں نے اپنی جانوں کو بیچ رکھا ہے (اور) وہ ان کا اللہ کے اتارے ہوئے کلام سے اس بات پر بگڑ کر انکار کرنا ہے کہ اللہ اپنے بندوں میں سے جس پر چاہتا ہے (کیوں) اپنا فضل نازل کر دیتا ہے۔ پس یہ لوگ غضب کے بعد غضب کا مورد ہو گئے ہیں۔ اور ایسے (ہی) کافروں کے لئے رسوا کرنے والا عذاب (مقدر) ہے۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمۡ اٰمِنُوۡا بِمَاۤ اَنۡزَلَ اللّٰہُ قَالُوۡا نُؤۡمِنُ بِمَاۤ اُنۡزِلَ عَلَیۡنَا وَ یَکۡفُرُوۡنَ بِمَا وَرَآءَہٗ ٭ وَ ہُوَ الۡحَقُّ مُصَدِّقًا لِّمَا مَعَہُمۡ ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡۢبِیَآءَ اللّٰہِ مِنۡ قَبۡلُ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۹۲﴾", "english": " And when it is said to them: ‘Believe in what Allah has sent down,’ they say: ‘We believe in what has been sent down to us;’ and they disbelieve in what has been sent down after that, yet it is the Truth, fulfilling that which is with them. Say: ‘Why, then, did you attempt to slay the Prophets of Allah before this, if you were believers?’", "french": " Et lorsqu’on leur dit : « Croyez à ce qu’Allāh a envoyé, » ils répondent : « Nous croyons à ce qui nous a été envoyé » et ils ne veulent pas croire à ce qui est révélé en dehors de cela, bien que ce soit la Vérité qui accomplit ce qu’ils ont déjà. Dis- leur : « Pourquoi donc avez-vous essayé de tuer les prophètes d’Allāh avant cela, si vous étiez croyants ? »", "german": " Und wenn ihnen gesagt wird: \"Glaubet an das, was Allah niedersandte\", sagen sie: \"Wir glauben an das, was auf uns niedergesandt ward\"; sie glauben aber nicht an das hernach (Gesandte), obwohl es die Wahrheit ist und das bekräftigt, was sie haben. Sprich: \"Warum habt ihr denn immer gewollt, die Propheten Allahs zu erschlagen, wenn ihr Gläubige waret?\"", "spanish": " Y cuando se les dice: “Creed en lo que Al-lah ha revelado”, responden: “Creemos en lo que se nos ha revelado”; pero no creen en lo que ha sido revelado posteriormente, aunque es la Verdad, que cumple lo que ya tienen. Diles: “¿Por qué, pues, intentasteis matar a los Profetas de Al-lah con anterioridad, si erais creyentes?”.", "urdu": " اور جب ان سے کہا جائے کہ جو کچھ اللہ نے اتارا ہے اس پر ایمان لاٶ تو وہ کہتے ہیں کہ ہم (تو) اس پر ایمان لاتے ہیں جو ہم پر اتارا گیا ہے اور (یہ کہتے ہوئے) اس کے بعد آنے والے (کلام) کا وہ انکار کر دیتے ہیں‘ حالانکہ وہ اس (کلام) کو جو ان کے پاس ہے سچا کرکے کامل طور پر سچا (ثابت ہو چکا) ہے۔ تو (ان سے) کہہ کہ اگر تم (واقعی) مومن ہو تو پھر تم کیوں اس سے پہلے اللہ کے نبیوں کے قتل کے درپے رہے ہو۔"}, {"arabic": " وَ لَقَدۡ جَآءَکُمۡ مُّوۡسٰی بِالۡبَیِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِہٖ وَ اَنۡتُمۡ ظٰلِمُوۡنَ ﴿۹۳﴾", "english": " And Moses came to you with manifest Signs, then you took the calf for worship in his absence and you were transgressors.", "french": " Et, en vérité, Moïse est venu à vous avec des Signes manifestes. Ensuite, vous avez pris le veau en adoration pendant son absence et vous avez été des transgresseurs.", "german": " Und Moses kam zu euch mit offenbaren Zeichen, ihr aber nahmt euch das Kalb in seiner Abwesenheit, und ihr waret Frevler.", "spanish": " Y Moisés vino a vosotros con Signos manifiestos, pero tomasteis en su ausencia al becerro para adorarlo, y fuisteis pecadores.", "urdu": " اور موسیٰ تمہارے پاس یقیناً کھلے کھلے نشان لے کر آیا تھا پھر (بھی) تم نے اس کے (پہاڑ پر جانے کے) بعد ظلم کرتے ہوئے (خداتعالیٰ کو چھوڑ کر) بچھڑے کو (معبود) بنا لیا۔"}, {"arabic": " وَ اِذۡ اَخَذۡنَا مِیۡثَاقَکُمۡ وَ رَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَاۤ اٰتَیۡنٰکُمۡ بِقُوَّۃٍ وَّ اسۡمَعُوۡا ؕ قَالُوۡا سَمِعۡنَا وَ عَصَیۡنَا ٭ وَ اُشۡرِبُوۡا فِیۡ قُلُوۡبِہِمُ الۡعِجۡلَ بِکُفۡرِہِمۡ ؕ قُلۡ بِئۡسَمَا یَاۡمُرُکُمۡ بِہٖۤ اِیۡمَانُکُمۡ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۹۴﴾", "english": " And remember the time , when We took a covenant from you and raised high above you the Mount, saying : ‘Hold firmly to what We have given you and hearken;’ they said: ‘We hear and we disobey;’ and their hearts were permeated with the love of the calf because of their disbelief. Say: ‘Evil is that which your faith enjoins on you, if you have any faith!’", "french": " Et souvenez-vous quand Nous avons fait un pacte avec vous et avons élevé le Mont au-dessus de vous en disant : « Tenez ferme à ce que Nous vous avons donné et prêtez l’oreille à Nos paroles » ; ils répondirent : « Nous entendons et nous désobéissons » ; et leurs cœurs étaient imprégnés de l’amour du veau à cause de leur manque de foi. Dis- leur : « Si vous êtes des croyants, alors vil est ce que votre foi vous enjoint de faire . »", "german": " Und (gedenket der Zeit) da Wir einen Bund schlossen mit euch und hoch über euch den Berg erhoben (und sprachen): \"Haltet fest an dem, was Wir euch gegeben, und höret\"; sie aber sprachen: \"Wir hören und wir gehorchen nicht\"; und ihre Herzen waren erfüllt vom Kalb, um ihres Unglaubens willen. Sprich: \"Schlimm ist das, was euch euer Glaube auferlegt, wenn ihr überhaupt Glauben habt!\"", "spanish": " Y acordaos de cuando aceptamos vuestra alianza y elevamos sobre vosotros el Monte, diciendo: “Sujetad firmemente lo que os hemos dado y escuchad”; ellos dijeron: “Escuchamos pero desobedecemos;” y sus corazones se inundaron de amor por el becerro, debido a su incredulidad. Diles: “¡Mala cosa es lo que os impone vuestra fe, si es que tenéis alguna fe!”.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے تم سے پختہ عہد لیا تھا اور طور کو تمہارے اوپر بلند کیا تھا (یہ کہتے ہوئے کہ) جو کچھ ہم نے تمہیں دیا ہے اسے مضبوطی سے پکڑو اور اس (یعنی اللہ) کی اطاعت کرو۔ اس پر (تم میں سے جو لوگ اس وقت ہمارے مخاطب تھے) انہوں نے کہا تھا کہ (بہت اچھا) ہم نے سن لیا اور (ہم یہ بھی کہہ دیتے ہیں کہ) ہم نے (اس حکم کے) نہ ماننے کا فیصلہ کر لیا ہے اور ان کے کفر کے سبب سے ان کے دلوں میں بچھڑا (یعنی اس کی محبت کا جذبہ) گھر کر گیا۔ تو (ان سے) کہہ کہ اگر تم (جیسا کہ دعویٰ کرتے ہو) مومن ہو تو وہ کام جس کا تمہیں تمہارا ایمان حکم دیتا ہے بہت برا ہے۔"}, {"arabic": " قُلۡ اِنۡ کَانَتۡ لَکُمُ الدَّارُ الۡاٰخِرَۃُ عِنۡدَ اللّٰہِ خَالِصَۃً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۹۵﴾", "english": " Say: ‘If the abode of the Hereafter, with Allah, is solely for you to the exclusion of all other people, then wish for death, if you are truthful.’", "french": " Dis- leur : « Si la Demeure de l’au-delà auprès d’Allāh vous est réservée à l’exclusion de tous les autres peuples alors souhaitez la mort, si vous êtes véridiques. »", "german": " Sprich: \"Wenn die Wohnstatt im Jenseits bei Allah nur für euch ist, unter Ausschluss der anderen Menschen, dann wünschet den Tod, wenn ihr wahrhaft seid.\"", "spanish": " Diles: “Si la morada del Más Allá, junto a Al-lah, es únicamente para vosotros, excluidos todos los demás pueblos, entonces desead la muerte, si sois veraces”.", "urdu": " تو (ان سے) کہہ اگر اللہ کے نزدیک آخرت کا گھر (باقی) لوگوں کو چھوڑ کر صرف تمہارے ہی لئے ہے تو اگر تم (اس دعویٰ میں) سچے ہو تو موت کی خواہش کرو۔"}, {"arabic": " وَ لَنۡ یَّتَمَنَّوۡہُ اَبَدًۢا بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِالظّٰلِمِیۡنَ ﴿۹۶﴾", "english": " But never shall they wish for it, because of what their own hands have sent on before them ; and Allah knows the wrongdoers well.", "french": " Mais ils ne la souhaiteront jamais à cause de ce que leurs propres mains ont envoyé devant eux , et Allāh connaît très bien les pécheurs.", "german": " Nie aber werden sie ihn wünschen um dessentwillen, was ihre Hände vorausgeschickt haben; und Allah kennt die Frevler wohl.", "spanish": " Pero nunca la desearán, a causa de lo que les precede, causado por sus propias manos; y Al-lah conoce bien a los que hacen el mal.", "urdu": " اور (اے مسلمانو! یاد رکھو کہ) جو کچھ ان کے ہاتھ آگے بھیج چکے ہیں اس کے سبب سے وہ کبھی بھی اس (قسم کی موت) کی تمنا نہیں کریں گے اور اللہ ظالموں کو خوب جانتا ہے۔"}, {"arabic": " وَ لَتَجِدَنَّہُمۡ اَحۡرَصَ النَّاسِ عَلٰی حَیٰوۃٍ ۚۛ وَ مِنَ الَّذِیۡنَ اَشۡرَکُوۡا ۚۛ یَوَدُّ اَحَدُہُمۡ لَوۡ یُعَمَّرُ اَلۡفَ سَنَۃٍ ۚ وَ مَا ہُوَ بِمُزَحۡزِحِہٖ مِنَ الۡعَذَابِ اَنۡ یُّعَمَّرَ ؕ وَ اللّٰہُ بَصِیۡرٌۢ بِمَا یَعۡمَلُوۡنَ ﴿٪۹۷﴾", "english": " And thou shalt surely find them of all people, the most covetous of life, even more than those who set up equals with God . Every one of them wishes that he may be granted a life of a thousand years, but his being granted such life shall not keep him away from the punishment; and Allah sees all that they do.", "french": " Et assurément tu verras qu’ils convoitent la vie avec une plus grande avidité que tous les autres, même plus que les associateurs. Chacun d’entre eux veut qu’une vie de mille ans lui soit accordée ; mais même qu’il ait une telle longévité, cela ne l’éloignerait pas du châtiment ; et Allāh voit bien tout ce qu’ils font.", "german": " Und unter allen Menschen wirst du sie und einige Götzendiener gewiss am gierigsten nach Leben finden. Jeder einzelne von ihnen wünscht, es möchten ihm tausend Jahre Leben gewährt werden, allein selbst die Gewährung (solchen) Lebens hielte die Strafe nicht von ihm fern; und Allah sieht alles, was sie tun.", "spanish": " Y encontrarás en verdad que son, entre todas las gentes, los más ávidos de vivir, incluso más que los que elevan a otros a la altura de Dios. Todos desean que se les conceda una vida de mil años, pero aunque se les concediera tal vida eso no les ahorraría el castigo; y Al-lah ve todo lo que hacen.", "urdu": " اور تو یقیناً انہیں (بھی) اور بعض ان لوگوں کو (بھی) جو مشرک ہیں سب لوگوں سے زیادہ زندگی کا حریص پائے گا۔ ان میں سے (ہر) ایک (یہی) چاہتا ہے کہ اسے ہزار سال کی عمر مل جائے حالانکہ یہ (امر یعنی) اس کا (لمبی) عمر پانا اس کو عذاب سے نہیں بچا سکتا اور جو کچھ وہ کرتے ہیں اللہ اسے دیکھ رہا ہے۔"}, {"arabic": " قُلۡ مَنۡ کَانَ عَدُوًّا لِّجِبۡرِیۡلَ فَاِنَّہٗ نَزَّلَہٗ عَلٰی قَلۡبِکَ بِاِذۡنِ اللّٰہِ مُصَدِّقًا لِّمَا بَیۡنَ یَدَیۡہِ وَ ہُدًی وَّ بُشۡرٰی لِلۡمُؤۡمِنِیۡنَ ﴿۹۸﴾", "english": " Say: ‘Whoever is an enemy to Gabriel — for he it is who has caused it to descend on thy heart by the command of Allah, which fulfils that which precedes it, and is a guidance and glad tidings to the believers —", "french": " Dis- leur : « Quiconque est ennemi de Gabriel – car c’est bien lui qui l’a fait descendre sur ton cœur sur l'ordre d’Allāh, en accomplissement de ce qui a été révélé auparavant, et c'est une direction et une bonne nouvelle pour les croyants –", "german": "", "spanish": " Diles: “Quien sea enemigo de Gabriel –porque él fue quien lo hizo bajar a tu corazón, por mandato de Al-lah, lo que cumple todo lo anterior, y es una guía y buena nueva para los creyentes-.”", "urdu": " تو (ان سے) کہہ دے کہ جو شخص اس وجہ سے جبرائیل کا دشمن ہو کہ اس نے تیرے دل پر اللہ کے حکم سے اس (کتاب) کو اتارا ہے جو اس (کلام) کو جو اس سے پہلے موجود ہے سچا کرنے والی ہے اور مومنوں کے لئے ہدایت اور بشارت ہے۔"}, {"arabic": " مَنۡ کَانَ عَدُوًّا لِّلّٰہِ وَ مَلٰٓئِکَتِہٖ وَ رُسُلِہٖ وَ جِبۡرِیۡلَ وَ مِیۡکٰٮلَ فَاِنَّ اللّٰہَ عَدُوٌّ لِّلۡکٰفِرِیۡنَ ﴿۹۹﴾", "english": " ‘Whoever is an enemy to Allah, and His angels, and His Messengers, and Gabriel, and Michael, then surely, Allah is an enemy to such disbelievers.’", "french": " »Quiconque est ennemi d’Allāh, de Ses anges et de Ses Messagers, de Gabriel et de Michel, alors assurément Allāh est ennemi de pareils mécréants. »", "german": " wer immer ein Feind Allahs ist und Seiner Engel, und Seiner Gesandten, und Gabriels, und Michaels, gewiss ist Allah feind (solchen) Ungläubigen.", "spanish": " “Quien sea enemigo de Al-lah y de sus Ángeles, y de sus Mensajeros, de Gabriel y de Miguel, sepa que , en verdad, Al-lah es enemigo de tales incrédulos.”", "urdu": " (تو اسے یاد رہے کہ) جو شخص (بھی) اللہ اور اس کے فرشتوں اور اس کے رسولوں اور جبرائیل اور میکائیل کا دشمن ہو تو (ایسے) کافروں کا اللہ بھی یقیناً دشمن ہے۔"}, {"arabic": " وَ لَقَدۡ اَنۡزَلۡنَاۤ اِلَیۡکَ اٰیٰتٍۭ بَیِّنٰتٍ ۚ وَ مَا یَکۡفُرُ بِہَاۤ اِلَّا الۡفٰسِقُوۡنَ ﴿۱۰۰﴾", "english": " And surely, We have sent down to thee manifest Signs, and no one disbelieves in them but the disobedient.", "french": " Et assurément, Nous t’avons envoyé des Signes manifestes, et seuls les désobéissants n’y croient pas.", "german": " Wahrlich, Wir haben offenbare Zeichen zu dir hinabgesandt, und niemand versagt ihnen Glauben als die Ungehorsamen.", "spanish": " Y en verdad, te hemos revelado Signos manifiestos, y nadie se niega a creer en ellos, excepto los desobedientes.", "urdu": " اور ہم نے تجھ پر یقیناً کھلے کھلے نشان نازل کیے ہیں اور نافرمانوں کے سوا ان کا کوئی انکار نہیں کرتا۔"}, {"arabic": " اَوَ کُلَّمَا عٰہَدُوۡا عَہۡدًا نَّبَذَہٗ فَرِیۡقٌ مِّنۡہُمۡ ؕ بَلۡ اَکۡثَرُہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۱۰۱﴾", "english": " What! every time they make a covenant, will a party among them throw it aside? Nay, most of them have no faith.", "french": " Comment ! Toutes les fois qu’ils feront un pacte, y aura-t-il certains d’entre eux qui voudront le rejeter ? La vérité est que la plupart d’entre eux n’ont aucune foi.", "german": " Wie! sooft sie einen Bund schlossen, verwarf ihn ein Teil von ihnen! Nein, die meisten von ihnen haben keinen Glauben.", "spanish": " ¡Cómo! ¿cada vez que concluyen un pacto ha de ser rechazado por un grupo de ellos?. No, la mayoría no tienen fe.", "urdu": " اور کیا (یہ بری بات نہیں کہ) جب بھی ان لوگوں نے کوئی عہد کیا تو ان میں سے ایک فریق نے اسے پھینک دیا (یہی نہیں) بلکہ ان میں سے اکثر (تو) ایمان کے قریب بھی نہیں پھٹکتے۔"}, {"arabic": " وَ لَمَّا جَآءَہُمۡ رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰہِ مُصَدِّقٌ لِّمَا مَعَہُمۡ نَبَذَ فَرِیۡقٌ مِّنَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ ٭ۙ کِتٰبَ اللّٰہِ وَرَآءَ ظُہُوۡرِہِمۡ کَاَنَّہُمۡ لَا یَعۡلَمُوۡنَ ﴿۱۰۲﴾۫", "english": " And now when there has come to them a Messenger from Allah, fulfilling that which is with them, a party of the people to whom the Book was given have thrown the Book of Allah behind their backs, as if they knew it not.", "french": " Et quand un Messager d’Allāh leur est venu, confirmant ce qui est en leur possession, certains d’entre ceux à qui le Livre avait été donné ont rejeté le Livre d’Allāh, comme s’ils en ignoraient l’existence.", "german": " Und da ein Gesandter Allahs zu ihnen gekommen ist, bestätigend das, was bei ihnen ist, hat ein Teil jener, denen die Schrift gegeben ward, Allahs Buch hinter den Rücken geworfen, als wüssten sie nichts.", "spanish": " Y ahora, cuando les ha llegado un Mensajero de Al-lah confirmando lo que ya tienen, un grupo del pueblo al que se le dio el Libro han arrojado el Libro de Al-lah a sus espaldas, como si no lo conocieran.", "urdu": " اور جب ان کے پاس اللہ کی طرف سے ایک ایسا رسول آیا جو اس (کتاب) کو جو ان کے پاس ہے سچا کرنے والا ہے تو ان لوگوں میں سے جنہیں (وہ) کتاب دی گئی تھی ایک فریق نے اللہ کی (تازہ) کتاب کو اپنی پیٹھوں کے پیچھے پھینک دیا گویا کہ وہ (اسے) جانتے ہی نہیں۔"}, {"arabic": " وَ اتَّبَعُوۡا مَا تَتۡلُوا الشَّیٰطِیۡنُ عَلٰی مُلۡکِ سُلَیۡمٰنَ ۚ وَ مَا کَفَرَ سُلَیۡمٰنُ وَ لٰکِنَّ الشَّیٰطِیۡنَ کَفَرُوۡا یُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ ٭ وَ مَاۤ اُنۡزِلَ عَلَی الۡمَلَکَیۡنِ بِبَابِلَ ہَارُوۡتَ وَ مَارُوۡتَ ؕ وَ مَا یُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰی یَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَۃٌ فَلَا تَکۡفُرۡ ؕ فَیَتَعَلَّمُوۡنَ مِنۡہُمَا مَا یُفَرِّقُوۡنَ بِہٖ بَیۡنَ الۡمَرۡءِ وَ زَوۡجِہٖ ؕ وَ مَا ہُمۡ بِضَآرِّیۡنَ بِہٖ مِنۡ اَحَدٍ اِلَّا بِاِذۡنِ اللّٰہِ ؕ وَ یَتَعَلَّمُوۡنَ مَا یَضُرُّہُمۡ وَ لَا یَنۡفَعُہُمۡ ؕ وَ لَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮہُ مَا لَہٗ فِی الۡاٰخِرَۃِ مِنۡ خَلَاقٍ ۟ؕ وَ لَبِئۡسَ مَا شَرَوۡا بِہٖۤ اَنۡفُسَہُمۡ ؕ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۱۰۳﴾", "english": " And they pursue the course which the rebellious men followed during the reign of Solomon. And Solomon did not disbelieve; but it was the rebellious ones who disbelieved, teaching people falsehood and deception. And they pursue what was revealed to the two angels in Babylon, Harut and Marut. But these two taught no one until they had said: ‘We are but a trial, do not therefore disbelieve.’ So men learnt from them that by which they made a difference between a man and his wife, but they harmed no one thereby, except by the command of Allah; on the contrary , these people are learning that which would harm them and do them no good. And they have certainly known that he who trafficks therein has no share of good in the Hereafter; and surely, evil is that for which they have sold their souls; had they but known!", "french": " Et ils suivent ce que les rebelles racontaient contre le règne de Salomon. Et Salomon ne devint pas un mécréant. Mais c’était les rebelles qui ne crurent pas. Ils enseignaient aux hommes la duplicité. Et ils prétendent suivre ce qui avait été révélé à Babylone aux deux anges Hārūt et Mārūt. Mais ces deux anges n’ont rien enseigné à quiconque avant d’avoir dit : « Nous ne sommes qu’une tentation, ne soyez donc pas mécréants. » Ainsi, les hommes ont appris d’eux le moyen de maintenir une distance entre un homme et sa femme. Toutefois, ils n’ont fait de mal à personne par cela, sauf par ordre d’Allāh. Au contraire, ces gens n’apprennent que ce qui leur nuira et qui ne leur fera aucun bien. En outre, ils ont assurément compris que celui qui trafique ainsi n’a aucune part de bien dans l’au-delà. Et vraiment est mauvais ce prix pour lequel ils ont vendu leur âme, si seulement ils avaient su !", "german": " Und sie (die Juden) folgen, wohin die Aufrührer unter der Herrschaft Salomos gingen; und Salomo war kein Ungläubiger, sondern es waren die Aufrührer, die Ungläubige waren und das Volk Falschheit und Betrug lehrten. Und (sie wähnten auch dem zu folgen,) was den beiden Engeln in Babel, Hârut und Mârut, offenbart ward. Doch diese beiden belehrten keinen, bevor sie nicht sagten: \"Wir sind bloß eine Prüfung (von Gott), verwirf (uns) also nicht.\" So lernten (die Menschen) von ihnen das, was den Mann von seiner Frau trennte, doch sie taten damit niemandem etwas zuleide, es sei denn auf Allahs Gebot; (im Gegenteil) diese Leute lernen das, was ihnen schaden und nichts nützen würde. Und sie wussten sicherlich, dass einer, der sich solches erhandelt, keinen Anteil am Jenseits haben kann; und fürwahr, um Schlimmes verkauften sie ihre Seelen; hätten sie es nur gewusst!", "spanish": " Y caminan por la senda que recorrieron los hombres rebeldes durante el reinado de Salomón. Y Salomón no fue un incrédulo, fueron incrédulos los rebeldes, enseñando a las gentes la falsedad y el engaño. Y persiguen lo que fue revelado a los dos ángeles de Babilonia, Harut y Marut. Pero estos dos no enseñaron a nadie sin antes decirles: “No somos más que una prueba, no dejes de creer”. Así los hombres aprendieron de ellos aquello en lo que se diferencia un hombre de su mujer, y no hicieron con ello mal a nadie, excepto por mandato de Al-lah; por el contrario, estas gentes aprenden lo que les perjudica y no les es de utilidad. Y han sabido ciertamente que el que comercia con ello no participará en las delicias de la Vida Futura; y, en verdad, por la maldad es por lo que vendieron sus almas; ¡si lo hubiesen sabido!", "urdu": " نیز وہ (یہودی) اس (طریق عمل) کے پیچھے پڑ گئے جس کے پیچھے سلیمان کی حکومت کے زمانہ میں (اس کی حکومت کے) باغی پڑے رہتے تھے۔ اور سلیمان کافر نہ تھا بلکہ (اس کے) باغی کافر تھے۔ وہ لوگوں کو دھوکا دینے والی باتیں سکھاتے تھے اور (بزعم خود) اس بات کی (بھی نقل کرتے ہیں) جو بابل میں دو فرشتوں ہاروت و ماروت پر اتاری گئی تھی۔ حالانکہ وہ دونوں (تو) جب تک یہ نہ کہہ لیتے تھے کہ ہم (خداتعالیٰ کی طرف سے) آزمائش کے طور پر (مقرر ہوئے) ہیں۔ اس لئے (اے مخاطب! ہمارے احکام کا) انکار نہ کرنا‘ کسی کو (کچھ) نہیں سکھاتے تھے جس پر وہ (لوگ) ان (دونوں) سے وہ بات سیکھتے تھے جس کے ذریعہ سے وہ مرد اور اس کی بیوی کے درمیان تفریق کر دیتے تھے اور وہ اللہ کے حکم کے سوا کسی کو بھی اس (بات) کے ذریعہ سے ضرر نہیں پہنچاتے تھے اور (اس کے بالمقابل) یہ (یعنی رسول اللہ صلی اللہ علیہ وسلم کے دشمن) تو وہ بات سیکھ رہے ہیں جو انہیں ضرر دے گی اور نفع نہیں دے گی اور یہ لوگ یقیناً جان چکے ہیں کہ جو اس (طریق) کو اختیار کر لے آخرت میں اس کا کوئی بھی حصہ نہیں اور وہ چیز جس کے بدلہ میں انہوں نے اپنے آپ کو بیچ رکھا ہے‘ بہت ہی بری ہے‘ کاش کہ یہ جانتے۔"}, {"arabic": " وَ لَوۡ اَنَّہُمۡ اٰمَنُوۡا وَ اتَّقَوۡا لَمَثُوۡبَۃٌ مِّنۡ عِنۡدِ اللّٰہِ خَیۡرٌ ؕ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۱۰۴﴾٪", "english": " And if they had believed and acted righteously, better surely would have been the reward from Allah, had they but known!", "french": " Et s’ils avaient été croyants et avaient agi avec droiture, la récompense d’Allāh aurait sûrement été meilleure pour eux . Si seulement ils avaient su !", "german": " Und wenn sie geglaubt und recht gehandelt hätten, besser wäre gewiss der Lohn von Allah gewesen; hätten sie es nur gewusst!", "spanish": " Si hubiesen creído y actuado santamente, mejor hubiera sido en verdad la recompensa de Al-lah; ¡si lo hubiesen sabido!", "urdu": " اور اگر یہ لوگ ایمان لاتے اور تقویٰ اختیار کرتے تو (انہیں معلوم ہو جاتا کہ) اللہ کی طرف سے ملنے والا بدلہ (ہی) بہترین (بدلہ) ہے۔ کاش کہ یہ جانتے!"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَ اسۡمَعُوۡا ؕ وَ لِلۡکٰفِرِیۡنَ عَذَابٌ اَلِیۡمٌ ﴿۱۰۵﴾", "english": " O ye who believe! say not ‘Ra‘ina,’ but say, ‘Unzurna’ and hearken. And for the disbelievers is a painful punishment.", "french": " Ô croyants ! Ne dites pas au Prophète 'Rā‘inā,' dites plutôt 'Unẓurnā,' et écoutez- le . Et pour les mécréants, il y a un châtiment douloureux.", "german": " O die ihr glaubt, saget nicht: \"Sei uns nachsichtig\", sondern sagt: \"Schaue gnädig auf uns\", und höret. Denn den Ungläubigen wird schmerzliche Strafe.", "spanish": " ¡Oh creyentes!, no digáis al Profeta, “escúchanos”, sino “obsérvanos” y escuchad. Y para los incrédulos hay un doloroso castigo.", "urdu": " اے ایمان دارو! (رسول کو مخاطب کرکے) رَاعِنَا مت کہا کرو اور اُ نْظُرْنَا کہا کرو۔ اور (توجہ سے اس کی بات) سنا کرو اور (یاد رکھو کہ) منکروں کے لئے دردناک عذاب (مقدر) ہے۔"}, {"arabic": " مَا یَوَدُّ الَّذِیۡنَ کَفَرُوۡا مِنۡ اَہۡلِ الۡکِتٰبِ وَ لَا الۡمُشۡرِکِیۡنَ اَنۡ یُّنَزَّلَ عَلَیۡکُمۡ مِّنۡ خَیۡرٍ مِّنۡ رَّبِّکُمۡ ؕ وَ اللّٰہُ یَخۡتَصُّ بِرَحۡمَتِہٖ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿۱۰۶﴾", "english": " They who disbelieve from among the People of the Book, or from among those who associate gods with Allah , desire not that any good should be sent down to you from your Lord; but Allah chooses for His mercy whomsoever He pleases; and Allah is of exceeding bounty.", "french": " Ni les mécréants, parmi les Gens du Livre, ni les associateurs, ne désirent qu’un bienfait quelconque ne descende sur vous de la part de votre Seigneur. Mais Allāh choisit pour Sa miséricorde qui Il veut. Et Allāh est le Seigneur de la grande munificence.", "german": " Die da ungläubig sind unter dem Volk der Schrift oder unter den Götzendienern, sie wünschen nicht, dass irgendein Gutes niedergesandt werde auf euch von eurem Herrn; doch Allah erwählt für Seine Gnade, wen Er will; und Allah ist Herr großer Huld.", "spanish": " Los que no creen de entre el Pueblo del Libro, o de entre aquellos que asocian otros dioses a Al-lah , no desean que se os envíe nada bueno de parte de vuestro Señor; pero Al-lah elige para Su misericordia a quien le place; y Al-lah es de extrema generosidad.", "urdu": " اہل کتاب میں سے اور نیز مشرکوں میں سے جن لوگوں نے (ہمارے رسولوں کا) انکار کیا ہے وہ پسند نہیں کرتے کہ تم پر تمہارے رب کی طرف سے کسی قسم کی خیر (اور برکت) اتاری جائے اور (بھول جاتے ہیں کہ) اللہ جسے چاہتا ہے اپنی رحمت کے لئے خاص کر لیتا ہے اور اللہ بڑا فضل کرنے والا ہے۔"}, {"arabic": " مَا نَنۡسَخۡ مِنۡ اٰیَۃٍ اَوۡ نُنۡسِہَا نَاۡتِ بِخَیۡرٍ مِّنۡہَاۤ اَوۡ مِثۡلِہَا ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۱۰۷﴾", "english": " Whatever Sign We abrogate or cause to be forgotten, We bring one better than that or the like thereof. Dost thou not know that Allah has the power to do all that He wills?", "french": " Quelque message que Nous abrogions où que Nous fassions oublier, Nous en apportons un qui y soit meilleur ou qui soit son équivalent. Ne sais-tu pas qu’Allāh a le pouvoir de faire tout ce qu’Il veut ?", "german": " Welches Zeichen Wir auch aufheben oder dem Vergessen anheimgeben, Wir bringen ein besseres dafür oder ein gleichwertiges. Weißt du nicht, dass Allah die Macht hat, alles zu tun, was Er will?", "spanish": " Si abrogamos o hacemos que se olvide cualquier Signo, traemos otro mejor o similar a él. ¿No sabes acaso que Al-lah tiene el poder de hacer todo lo que le place?", "urdu": " جس کسی پیغام کو بھی ہم منسوخ کر دیں یا بھلوا دیں تو اس سے بہتر یا اس جیسا (پیغام) ہم (دوبارہ دنیا میں) لے آتے ہیں‘ کیا تجھے معلوم نہیں کہ اللہ ہر ایک امر پر (جس کا وہ ارادہ کرے) پورا (پورا) قادر ہے۔"}, {"arabic": " اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰہَ لَہٗ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ مَا لَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۱۰۸﴾", "english": " Dost thou not know that the kingdom of the heavens and the earth belongs to Allah alone? And there is no protector or helper for you beside Allah.", "french": " Ne sais-tu pas que c’est à Allāh Seul qu’appartient le royaume des cieux et de la terre ? Et il n’y a qu’Allāh pour vous protéger et vous venir en aide.", "german": " Weißt du nicht, dass die Herrschaft der Himmel und der Erde Allah allein gehört? Und es ist kein Beschützer noch Helfer für euch als Allah.", "spanish": " ¿No sabes acaso que el Reino de los Cielos y la Tierra pertenece a Al-lah sólo? Y fuera de Al-lah no tienes protector ni defensor alguno.", "urdu": " کیا تجھے معلوم نہیں کہ آسمانوں اور زمین کی بادشاہت اللہ ہی کی ہے اور اللہ کے سوا تمہارا نہ کوئی دوست ہے اور نہ کوئی مددگار۔"}, {"arabic": " اَمۡ تُرِیۡدُوۡنَ اَنۡ تَسۡـَٔلُوۡا رَسُوۡلَکُمۡ کَمَا سُئِلَ مُوۡسٰی مِنۡ قَبۡلُ ؕ وَ مَنۡ یَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِیۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ السَّبِیۡلِ ﴿۱۰۹﴾", "english": " Would you question the Messenger sent to you as Moses was questioned before this? And whoever takes disbelief in exchange for belief has undoubtedly gone astray from the right path.", "french": " Voulez-vous questionner votre Messager tout comme Moïse avait été questionné auparavant ? Et quiconque échange la foi contre l’incroyance s’égare certainement du droit chemin.", "german": " Wolltet ihr euren Gesandten befragen, wie Moses vordem befragt ward? Wer aber Unglauben in Tausch nimmt für Glauben, der ist schon unzweifelhaft abgeirrt vom rechten Weg.", "spanish": " ¿Queréis interrogar al Mensajero enviado a vosotros como antes fue interrogado Moisés? Y quien cambia la fe por la incredulidad evidentemente se ha apartado del camino recto.", "urdu": " کیا تم اپنے رسول سے اسی طرح سوال کرنا چاہتے ہو جس طرح (اس سے) پہلے موسیٰ سے سوال کیے گئے تھے اور (بھول جاتے ہو کہ) جو شخص کفر کو ایمان سے بدل لے تو سمجھو کہ وہ سیدھے راستے سے بھٹک گیا۔"}, {"arabic": " وَدَّ کَثِیۡرٌ مِّنۡ اَہۡلِ الۡکِتٰبِ لَوۡ یَرُدُّوۡنَکُمۡ مِّنۡۢ بَعۡدِ اِیۡمَانِکُمۡ کُفَّارًا ۚۖ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِہِمۡ مِّنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُمُ الۡحَقُّ ۚ فَاعۡفُوۡا وَ اصۡفَحُوۡا حَتّٰی یَاۡتِیَ اللّٰہُ بِاَمۡرِہٖ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۱۱۰﴾", "english": " Many of the People of the Book wish out of sheer envy from their own selves that, after you have believed, they could turn you again into disbelievers after the truth has become manifest to them. But forgive and turn away from them , till Allah brings about His decree. Surely, Allah has the power to do all that He wills.", "french": " Un grand nombre de Gens du Livre aimeraient par pure jalousie vous ramener à l’incroyance, après que vous ayez cru, une fois que la vérité leur soit devenue manifeste. Pardonnez- leur et laissez passer, en attendant qu’Allāh envoie Son jugement. Assurément, Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Viele unter dem Volke der Schrift wünschen aus dem Neid ihrer Seelen, dass sie vermöchten, euch, die ihr schon geglaubt, wieder in Ungläubige zu verwandeln, nachdem ihnen doch selbst die Wahrheit deutlich kundgetan ward. Aber vergebt und wendet euch ab (von ihnen), bis Allah Seinen Ratschluss kundtut. Wahrlich, Allah hat die Macht, alles zu tun, was Er will.", "spanish": " Muchos del Pueblo del Libro desearían, por la mera envidia que sienten sus almas, convertiros en incrédulos después de que habéis creído, tras habérseles hecho evidente la verdad. Mas perdonadlos y alejaos de ellos, hasta que Al-lah traiga su decreto. En verdad, Al-lah tiene el poder de hacer todo lo que le place.", "urdu": " اہل کتاب میں سے بہت سے لوگ بعد اس کے کہ حق ان پر خوب کھل چکا ہے اس حسد کی وجہ سے جو ان کی اپنی ہی جانوں سے (پیدا ہوا) ہے چاہتے ہیں کہ تمہارے ایمان لے آنے کے بعد تمہیں پھر کافر بنا دیں۔ پس تم اس وقت تک کہ اللہ اپنے حکم کو نازل فرمائے انہیں معاف کرو اور (ان سے) درگزر کرو۔ اللہ یقیناً ہر ایک امر پر پورا (پورا) قادر ہے۔"}, {"arabic": " وَ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ ؕ وَ مَا تُقَدِّمُوۡا لِاَنۡفُسِکُمۡ مِّنۡ خَیۡرٍ تَجِدُوۡہُ عِنۡدَ اللّٰہِ ؕ اِنَّ اللّٰہَ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۱۱۱﴾", "english": " And observe Prayer and pay the Zakat; and whatever good you send on before you for yourselves, you shall find it with Allah; surely, Allah sees all that you do.", "french": " Et observez la Prière et payez la Zakāt, et tout le bien que vous aurez envoyé à l’avance pour vous-mêmes vous le retrouverez auprès d’Allāh ; sûrement, Allāh voit bien tout ce que vous faites.", "german": " Verrichtet das Gebet und zahlet die Zakât; und was ihr Gutes für euch voraussendet, das sollt ihr bei Allah wiederfinden. Wahrlich, Allah sieht alles, was ihr tut.", "spanish": " Y observad la Oración y pagad el Zakat; y todo el bien que hayáis practicado antes por vosotros mismos, lo encontraréis con Al-lah. En verdad, Al-lah ve todo lo que hacéis.", "urdu": " اور نماز کو (مطابق شرائط) قائم رکھو اور زکوٰۃ ادا کرو‘ اور (یاد رکھو کہ) جو نیکی بھی تم اپنی ذات کے لئے آگے بھیجو گے تم اسے اللہ کے پاس پاٶ گے۔ اللہ تمہارے اعمال کو یقیناً دیکھ رہا ہے۔"}, {"arabic": " وَ قَالُوۡا لَنۡ یَّدۡخُلَ الۡجَنَّۃَ اِلَّا مَنۡ کَانَ ہُوۡدًا اَوۡ نَصٰرٰی ؕ تِلۡکَ اَمَانِیُّہُمۡ ؕ قُلۡ ہَاتُوۡا بُرۡہَانَکُمۡ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۱۱۲﴾", "english": " And they say, ‘None shall ever enter Heaven unless he be a Jew or a Christian.’ These are their vain desires. Say, ‘Produce your proof, if you are truthful.’", "french": " Et ils disent : « Personne n’ira au paradis à moins d’être Juif ou Chrétien. » Ce sont là leurs vains désirs. Dis- leur : « Si vous dites la vérité, apportez votre preuve. »", "german": " Und sie sprechen: \"Keiner soll je in den Himmel eingehen, er sei denn ein Jude oder ein Christ.\" Solches sind ihre eitlen Wünsche. Sprich: \"Bringt her euren Beweis, wenn ihr wahrhaftig seid.\"", "spanish": " Y dicen: “Nadie entrará en el Cielo a menos que sea judío o cristiano.” Estos son sus vanos deseos. Decidles: “Probadlo, si sois veraces.”", "urdu": " اور وہ (یعنی یہودی اور مسیحی یہ بھی) کہتے ہیں کہ جنت میں سوائے ان (لوگوں) کے جو یہودی ہوں یا مسیحی ہوں ہرگز کوئی نہیں داخل ہوگا‘ یہ (محض) ان کی آرزوئیں ہیں‘ تو (انہیں) کہہ دے کہ اگر تم سچے ہو تو اپنی دلیل پیش کرو۔"}, {"arabic": " بَلٰی ٭ مَنۡ اَسۡلَمَ وَجۡہَہٗ لِلّٰہِ وَ ہُوَ مُحۡسِنٌ فَلَہٗۤ اَجۡرُہٗ عِنۡدَ رَبِّہٖ ۪ وَ لَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۱۱۳﴾٪", "english": " Nay, whoever submits himself completely to Allah, and is the doer of good, shall have his reward with his Lord. No fear shall come upon such, neither shall they grieve.", "french": " En vérité, quiconque se soumet complètement à Allāh et dont la conduite est excellente aura sa récompense auprès de son Seigneur. Ils ne seront ni dans la crainte, ni ne seront-ils affligés.", "german": " Nein, wer sich gänzlich Allah unterwirft und Gutes tut, ihm wird sein Lohn bei seinem Herrn. Keine Furcht soll auf solche kommen, noch sollen sie trauern.", "spanish": " ¡No!, quien se someta completamente a Al-lah, siendo excelente en conducta, tendrá su recompensa con su Señor. Ningún temor les sobrecogerá ni sufrirán aflicción.", "urdu": " (اور بتاٶ کہ دوسرے لوگ) کیوں نہیں (داخل ہوں گے) جو بھی اپنے آپ کو اللہ کے سپرد کردے اور وہ نیک کام کرنے والا (بھی) ہو تو اس کے رب کے ہاں اس کے لئے بدلہ (مقرر) ہے اور ان (لوگوں) کو نہ (آئندہ کے متعلق) کسی قسم کا خوف ہوگا اور نہ وہ (کسی سابق نقصان پر) غمگین ہوں گے۔"}, {"arabic": " وَ قَالَتِ الۡیَہُوۡدُ لَیۡسَتِ النَّصٰرٰی عَلٰی شَیۡءٍ ۪ وَّ قَالَتِ النَّصٰرٰی لَیۡسَتِ الۡیَہُوۡدُ عَلٰی شَیۡءٍ ۙ وَّ ہُمۡ یَتۡلُوۡنَ الۡکِتٰبَ ؕ کَذٰلِکَ قَالَ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ مِثۡلَ قَوۡلِہِمۡ ۚ فَاللّٰہُ یَحۡکُمُ بَیۡنَہُمۡ یَوۡمَ الۡقِیٰمَۃِ فِیۡمَا کَانُوۡا فِیۡہِ یَخۡتَلِفُوۡنَ ﴿۱۱۴﴾", "english": " And the Jews say, ‘The Christians stand on nothing;’ and the Christians say, ‘The Jews stand on nothing;’ while they both read the same Book. Even thus said those who had no knowledge, like what they say. But Allah shall judge between them on the Day of Resurrection concerning that wherein they disagree.", "french": " Et les Juifs disent : « Les Chrétiens ne se fondent sur rien » ; et les Chrétiens disent : « Les Juifs ne se fondent sur rien » ; et pourtant, ils lisent tous deux le même Livre. Ainsi s’exprimaient aussi ceux qui n’avaient aucune connaissance. Mais, le Jour de la Résurrection, Allāh jugera entre eux concernant ce sur quoi ils étaient en désaccord.", "german": " Die Juden sagen: \"Die Christen fußen auf nichts\"; und die Christen sagen: \"Die Juden fußen auf nichts\", obwohl sie doch (beide) die Schrift lesen. So, gleich ihrer Rede, sprachen schon die, die keine Kenntnis hatten. Allah aber wird richten unter ihnen am Tage der Auferstehung über das, worin sie uneinig sind.", "spanish": " Y los judíos dicen: “Los cristianos no se apoyan en nada”; y los cristianos dicen: “Los judíos no se apoyan en nada”; aunque ambos leen el mismo Libro. Y lo mismo que ellos dicen, dijeron los que no tenían conocimiento. Pero Al-lah juzgará entre ellos, el Día de la Resurrección, en relación con sus diferencias.", "urdu": " اور یہودی کہتے ہیں کہ مسیحی کسی (سچی) بات پر قائم نہیں ہیں اور مسیحی کہتے ہیں کہ یہود کسی (سچی) بات پر قائم نہیں ہیں۔ حالانکہ وہ دونوں (ایک ہی) کتاب (یعنی تورات) پڑھتے ہیں اسی طرح وہ (دوسرے) لوگ جو علم نہیں رکھتے انہی کی سی بات کہا کرتے تھے۔ سو جس (بات) میں یہ اختلاف کرتے ہیں اس کے متعلق اللہ قیامت کے دن ان کے درمیان فیصلہ کرے گا۔"}, {"arabic": " وَ مَنۡ اَظۡلَمُ مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰہِ اَنۡ یُّذۡکَرَ فِیۡہَا اسۡمُہٗ وَ سَعٰی فِیۡ خَرَابِہَا ؕ اُولٰٓئِکَ مَا کَانَ لَہُمۡ اَنۡ یَّدۡخُلُوۡہَاۤ اِلَّا خَآئِفِیۡنَ ۬ؕ لَہُمۡ فِی الدُّنۡیَا خِزۡیٌ وَّ لَہُمۡ فِی الۡاٰخِرَۃِ عَذَابٌ عَظِیۡمٌ ﴿۱۱۵﴾", "english": " And who is more unjust than he who prohibits the name of Allah being glorified in Allah’s temples and seeks to ruin them? It was not proper for such men to enter therein except in fear. For them is disgrace in this world; and theirs shall be a great punishment in the next.", "french": " Et qui est plus injuste que celui qui empêche qu’on rende gloire au nom d’Allāh dans Ses temples et qui s’efforce à les mettre en ruines ? Il n’était pas convenable que de tels hommes y entrent, sauf avec crainte. Pour eux, il y a la honte ici-bas et un très grand châtiment dans l’au-delà.", "german": " Und wer ist ungerechter, als wer verhindert, dass Allahs Name verherrlicht werde in Allahs Tempeln, und bestrebt ist, sie zu zerstören? Es ziemte sich nicht für solche, sie anders zu betreten denn in Ehrfurcht. Für sie ist Schande in dieser Welt; und in jener harrt ihrer schwere Strafe.", "spanish": " Y ¿hay alguien más injusto que quien prohíbe que el nombre de Al-lah sea glorificado en los templos de Al-lah y busca su ruina? No era apropiado que tales hombres entraran en ellos sino con temor. Sobre ellos caerá la ignominia en este mundo; y les está reservado un duro castigo en el próximo.", "urdu": " اور اس (شخص) سے بڑھ کر کون ظالم (ہو سکتا) ہے جس نے اللہ کی مساجد سے (لوگوں کو) روکا کہ ان میں اس کا نام لیا جائے اور ان کی ویرانی کے درپے ہو گیا ان (لوگوں) کے لئے مناسب نہ تھا کہ ان (مساجد) کے اندر داخل ہوتے مگر (خدا سے) ڈرتے ہوئے ان کے لئے دنیا میں (بھی) رسوائی ہے اور آخرت میں (بھی) ان کے لئے بڑا عذاب (مقدر) ہے۔"}, {"arabic": " وَ لِلّٰہِ الۡمَشۡرِقُ وَ الۡمَغۡرِبُ ٭ فَاَیۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡہُ اللّٰہِ ؕ اِنَّ اللّٰہَ وَاسِعٌ عَلِیۡمٌ ﴿۱۱۶﴾", "english": " To Allah belong the East and the West; so withersoever you turn, there will be the face of Allah. Surely, Allah is Bountiful, All- Knowing.", "french": " A Allāh appartiennent l’Est et l’Ouest ; et où que vous vous tourniez, il y aura la face d’Allāh. En vérité, Allāh est Munificent et Omniscient.", "german": " Allahs ist der Osten und der Westen; wohin immer ihr also euch wendet, dort ist Allahs Angesicht. Wahrlich, Allah ist freigebig, allwissend.", "spanish": " A Al-lah pertenecen el Oriente y el Occidente; por ello, a donde quiera que os volváis, allí estará el rostro de Al-lah. En verdad, Al-lah es Generoso, Omnisciente.", "urdu": " اور مشرق و مغرب اللہ ہی کے ہیں اس لئے جدھر بھی تم رخ کرو گے ادھر ہی اللہ کی توجہ ہوگی۔ اللہ یقیناً وسعت دینے والا (اور) بڑا جاننے والا ہے۔"}, {"arabic": " وَ قَالُوا اتَّخَذَ اللّٰہُ وَلَدًا ۙ سُبۡحٰنَہٗ ؕ بَلۡ لَّہٗ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ کُلٌّ لَّہٗ قٰنِتُوۡنَ ﴿۱۱۷﴾", "english": " And they say, ‘Allah has taken to Himself a son.’ Holy is He! Nay, everything in the heavens and the earth belongs to Him. To Him are all obedient.", "french": " Et ils disent qu’Allāh S’est donné un fils. Béni est-Il ! En vérité, tout ce qui est aux cieux et sur terre appartient à Allāh. Tous Lui obéissent.", "german": " Und sie sagen: \"Allah hat Sich einen Sohn zugesellt.\" Heilig ist Er! Nein, alles in den Himmeln und auf der Erde ist Sein. Ihm sind alle gehorsam.", "spanish": " Y dicen: “Al-lah ha tomado para Sí un hijo” ¡Santo sea!”. No, cuanto hay en los cielos y en la tierra a Él pertenece. A Él todo le obedece.", "urdu": " اور وہ کہتے ہیں کہ اللہ نے (اپنے لئے) ایک بیٹا بنا لیا ہے (ان کی بات درست نہیں) وہ (تو ہر کمزوری سے) پاک ہے‘ بلکہ جو کچھ آسمانوں اور زمین میں ہے‘ اسی کا ہے۔ سب اس کے فرمانبردار ہیں۔"}, {"arabic": " بَدِیۡعُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ اِذَا قَضٰۤی اَمۡرًا فَاِنَّمَا یَقُوۡلُ لَہٗ کُنۡ فَیَکُوۡنُ ﴿۱۱۸﴾", "english": " He is the Originator of the heavens and the earth. When He decrees a thing, He does only say to it, ‘Be!’ and it is.", "french": " L’Initiateur des cieux et de la terre. Lorsqu’Il décrète une chose, Il n’a qu’à dire : « Sois, » et elle commence à être.", "german": " Der Schöpfer der Himmel und der Erde! Wenn Er ein Ding beschließt, so spricht Er nur zu ihm: \"Sei!\", und es ist.", "spanish": " Él es el Originador de los cielos y de la tierra. Cuando decreta una cosa, sólo es preciso que diga “¡Sea!”, y es.", "urdu": " وہ آسمانوں اور زمین کو (بغیر کسی سابق نمونہ کے) پیدا کرنے والا ہے اور جب وہ کسی امر (کے عالم وجود میں لانے) کا فیصلہ کر لیتا ہے تو اس کے متعلق صرف یہ فرماتا ہے کہ تو ہو جا۔ سو وہ ہو جاتا ہے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ لَوۡ لَا یُکَلِّمُنَا اللّٰہُ اَوۡ تَاۡتِیۡنَاۤ اٰیَۃٌ ؕ کَذٰلِکَ قَالَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ مِّثۡلَ قَوۡلِہِمۡ ؕ تَشَابَہَتۡ قُلُوۡبُہُمۡ ؕ قَدۡ بَیَّنَّا الۡاٰیٰتِ لِقَوۡمٍ یُّوۡقِنُوۡنَ ﴿۱۱۹﴾", "english": " And those who have no knowledge say, ‘Why does not Allah speak to us, or a Sign come to us?’ Likewise said those before them similar to their saying. Their hearts are alike. We have certainly made the Signs plain for a people who firmly believe.", "french": " Et ceux qui n’ont aucune connaissance disent : « Pourquoi Allāh ne nous parle-t-Il pas ou ne nous envoie-t-Il pas un Signe ? » C’est ainsi que parlaient leurs prédécesseurs tout comme eux. Leurs cœurs se ressemblent. Et pourtant, Nous avons rendu clairs les Signes pour ceux qui croient fermement.", "german": " Und die Unwissenden sagen: \"Warum spricht Allah nicht zu uns, oder (warum) kommt uns kein Zeichen?\" So, gleich ihrer Rede, sprachen schon die, die vor ihnen waren. Ihre Herzen sind einander ähnlich. Wir haben die Zeichen deutlich gemacht für Leute, die fest im Glauben sind.", "spanish": " Y los que no tienen conocimiento dicen: “¿Por qué no nos habla Al-lah o viene a nosotros un Signo?”. Lo mismo dijeron los que los precedieron, similar a lo que dicen. Sus corazones se asemejan. Ciertamente, hemos hecho patentes los Signos para un pueblo que cree firmemente.", "urdu": " اور وہ لوگ جو (خدا کی حکمتوں کا) علم نہیں رکھتے کہتے ہیں کہ اللہ کیوں ہم سے (براہ راست) بات نہیں کرتا یا (کیوں) ہمارے پاس کوئی نشان (نہیں) آتا؟ اسی طرح۔۔۔۔۔ (بالکل) انہی کی سی بات۔۔۔۔۔ (وہ بھی) کہا کرتے تھے جو ان سے پہلے (زمانہ کے لوگ) تھے۔ ان سب کے دل ہمرنگ ہو گئے ہیں ہم تو ایسے لوگوں کے لئے جو یقین لے آتے ہیں ہر طرح کے نشانات کھول کر بیان کر چکے ہیں (مگر یہ لوگ مانتے نہیں۔)"}, {"arabic": " اِنَّاۤ اَرۡسَلۡنٰکَ بِالۡحَقِّ بَشِیۡرًا وَّ نَذِیۡرًا ۙ وَّ لَا تُسۡئَلُ عَنۡ اَصۡحٰبِ الۡجَحِیۡمِ ﴿۱۲۰﴾", "english": " We have sent thee with the Truth, as a bearer of glad tidings and a warner. And thou wilt not be questioned about the inmates of Hell.", "french": " Vraiment, Nous t’avons envoyé avec la Vérité, en tant que Porteur de la bonne nouvelle et Avertisseur. Et on ne te demandera pas compte des gens de l’Enfer.", "german": " Wir haben dich entsandt mit der Wahrheit, als einen Bringer froher Botschaft und einen Warner. Und du wirst nicht zur Rede gestellt werden über die Insassen der Hölle.", "spanish": " Te hemos enviado con la Verdad, como portador de buenas nuevas y para que les adviertas. Y no se te preguntará sobre los moradores del infierno.", "urdu": " ہم نے تجھے یقیناً خوشخبری دینے والا اور ڈرانے والا بنا کر حق (اور راستی) کے ساتھ بھیجا ہے اور دوزخیوں کے متعلق تجھ سے کوئی باز پرس نہ کی جائے گی۔"}, {"arabic": " وَ لَنۡ تَرۡضٰی عَنۡکَ الۡیَہُوۡدُ وَ لَا النَّصٰرٰی حَتّٰی تَتَّبِعَ مِلَّتَہُمۡ ؕ قُلۡ اِنَّ ہُدَی اللّٰہِ ہُوَ الۡہُدٰی ؕ وَ لَئِنِ اتَّبَعۡتَ اَہۡوَآءَہُمۡ بَعۡدَ الَّذِیۡ جَآءَکَ مِنَ الۡعِلۡمِ ۙ مَا لَکَ مِنَ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۱۲۱﴾ؔ", "english": " And the Jews will by no means be pleased with thee, nor the Christians, unless thou follow their creed. Say, ‘Surely, Allah’s guidance alone is the guidance.’ And if thou follow their evil desires after the knowledge that has come to thee, thou shalt have, from Allah, no friend nor helper.", "french": " Ni les Juifs ni les Chrétiens ne seront en aucune façon contents de toi, à moins que tu ne suives leurs doctrines. Dis- leur : « En vérité, la direction d’Allāh est la seule direction. » Et si tu suivais leurs mauvais désirs après que la connaissance t’ait été accordée, tu n’aurais en Allāh ni ami ni aide.", "german": " Und weder die Juden werden mit dir zufrieden sein noch die Christen, es sei denn, du folgst ihrem Glauben. Sprich: \"Allahs Führung allein ist die Führung.\" Und wenn du nach der Kenntnis, die dir zuteil geworden, ihren bösen Gelüsten folgst, so wirst du bei Allah weder Freund noch Helfer finden.", "spanish": " Y los judíos no estarán en absoluto satisfechos contigo, ni tampoco los cristianos, salvo que sigas su religión. Diles: “en verdad, la orientación de Al-lah es la única orientación”. Y si sigues sus perversos deseos después del conocimiento que te ha venido, no tendrás en Al-lah ni amigo ni protector.", "urdu": " اور (یاد رکھ کہ) جب تک تو ان کے دین کی پیروی نہ کرے یہودی تجھ سے ہر گز خوش نہ ہوں گے اور نہ ہی مسیحی (خوش ہوں گے) تو (ان سے) کہہ دے کہ اللہ کی ہدایت ہی یقیناً اصل ہدایت ہے اور اگر (اے مخاطب)! تو اس علم کے بعد (بھی) جو تیرے پاس آچکا ہے ان کی خواہشات کی پیروی کرے گا تو اللہ (کی طرف) سے نہ کوئی تیرا دوست ہوگا اور نہ مددگار۔"}, {"arabic": " اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَتۡلُوۡنَہٗ حَقَّ تِلَاوَتِہٖ ؕ اُولٰٓئِکَ یُؤۡمِنُوۡنَ بِہٖ ؕ وَ مَنۡ یَّکۡفُرۡ بِہٖ فَاُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿۱۲۲﴾٪", "english": " They to whom We have given the Book follow it as it ought to be followed; it is these that believe therein. And whoso believes not therein, these are they who are the losers.", "french": " Ceux à qui Nous avons donné le Livre le suivent comme il le faut ; ceux-là y croient. Et ceux qui n’y croient pas, ceux-là sont les perdants.", "german": " Sie, denen Wir das Buch gegeben, folgen ihm, wie man ihm folgen sollte; sie sind es, die daran glauben. Die aber nicht daran glauben, das sind die Verlierer.", "spanish": " Aquellos, a los que hemos dado el Libro, lo siguen como debe ser seguido; son ésos los que creen en él. Y quienes no crean en él, ésos serán los perdedores.", "urdu": " (وہ لوگ) جنہیں ہم نے کتاب دی ہے وہ اس کی (اسی طرح) پیروی کرتے ہیں جس طرح اس کی پیروی کرنی چاہیئے۔ وہ لوگ اس پر (پختہ) ایمان رکھتے ہیں اور جو لوگ اس کا انکار کریں وہی نقصان اٹھانے والے ہیں۔"}, {"arabic": " یٰبَنِیۡۤ اِسۡرَآءِیۡلَ اذۡکُرُوۡا نِعۡمَتِیَ الَّتِیۡۤ اَنۡعَمۡتُ عَلَیۡکُمۡ وَ اَنِّیۡ فَضَّلۡتُکُمۡ عَلَی الۡعٰلَمِیۡنَ ﴿۱۲۳﴾", "english": " O ye children of Israel! remember My favour which I bestowed upon you, and that I exalted you above all peoples.", "french": " Ô Enfants d’Israël ! Souvenez-vous des grâces que Je vous ai accordées et rappelez-vous que Je vous ai élevés au-dessus de tous les peuples de votre époque .", "german": " O ihr Kinder Israels! gedenket Meiner Gnade, die Ich euch erwiesen, und dass Ich euch erhob über die Völker.", "spanish": " ¡Oh, hijos de Israel! acordaos de los favores que os concedí, y de que os levanté por encima de todos los pueblos.", "urdu": " اے بنی اسرائیل! میرے اس احسان کو جو میں تم پر کر چکا ہوں یاد کرو اور (اس بات کو بھی) کہ میں نے تمہیں تمام جہانوں پر فضیلت دی۔"}, {"arabic": " وَ اتَّقُوۡا یَوۡمًا لَّا تَجۡزِیۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَیۡئًا وَّ لَا یُقۡبَلُ مِنۡہَا عَدۡلٌ وَّ لَا تَنۡفَعُہَا شَفَاعَۃٌ وَّ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿۱۲۴﴾", "english": " And fear the day when no soul shall serve as a substitute for another soul at all, nor shall any ransom be accepted from it, nor any intercession avail it, nor shall they be helped.", "french": " Et redoutez le jour où aucune âme ne pourra remplacer une autre âme, où aucune rançon n’en sera reçue, où aucune intercession ne lui sera utile, où aucune aide ne leur sera accordée.", "german": " Und fürchtet den Tag, da keine Seele als Stellvertreterin dienen soll für eine andere Seele, noch soll Lösegeld von ihr genommen werden, noch Fürbitte ihr frommen; und sie sollen nicht Hilfe finden.", "spanish": " Y temed el día en que ningún alma podrá en absoluto ocupar el lugar de otra alma, ni se aceptará rescate alguno de ella, ni le valdrá intercesión alguna, ni serán socorridas.", "urdu": " اور اس دن سے ڈرو کہ جب کوئی شخص قطعاً کسی دوسرے شخص کا قائم مقام نہ ہو سکے گا اور نہ اس سے کسی قسم کا معاوضہ قبول کیا جائے گا اور نہ کوئی سفارش اسے فائدہ دے گی اور نہ ان کی مدد کی جائے گی۔"}, {"arabic": " وَ اِذِ ابۡتَلٰۤی اِبۡرٰہٖمَ رَبُّہٗ بِکَلِمٰتٍ فَاَتَمَّہُنَّ ؕ قَالَ اِنِّیۡ جَاعِلُکَ لِلنَّاسِ اِمَامًا ؕ قَالَ وَ مِنۡ ذُرِّیَّتِیۡ ؕ قَالَ لَا یَنَالُ عَہۡدِی الظّٰلِمِیۡنَ ﴿۱۲۵﴾", "english": " And remember when his Lord tried Abraham with certain commands which he fulfilled. He said, ‘I will make thee a Leader of men.’ Abraham asked, ‘And from among my offspring?’ He said, ‘My covenant does not embrace the transgressors.’", "french": " Et souvenez-vous quand Son Seigneur mit Abraham à l’épreuve, par certains commandements, et qu’il les accomplit. Il dit : « Certainement, Je ferai de toi un chef pour les hommes. » Abraham demanda : « Et de parmi ma postérité ? » Il lui répondit : « Mon alliance ne concerne pas les transgresseurs. »", "german": " Und (denket daran) als sein Herr Abraham auf die Probe stellte durch gewisse Gebote, die er erfüllte, da sprach Er: \"Ich will dich zu einem Führer für die Menschen machen.\" (Abraham) fragte: \"Und aus meiner Nachkommenschaft?\" Er sprach: \"Mein Bund erstreckt sich nicht auf die Ungerechten.\"", "spanish": " Y acordaos de cuando su Señor puso a prueba a Abraham con ciertas órdenes que él cumplió. Dijo; “te convertiré en Guía de los hombres”. Abraham preguntó: “¿Y de entre mi descendencia?”. Él dijo: “Mi pacto no alcanza a los transgresores.”", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ابراہیم کو اس کے رب نے بعض باتوں کے ذریعہ سے آزمایا اور اس نے ان کو پورا کر دکھایا (اس پر اللہ نے) فرمایا کہ میں تجھے یقیناً لوگوں کا امام مقرر کرنے والا ہوں (ابراہیم نے) کہا اورمیری اولاد میں سے بھی (امام بنائیو) (اللہ نے) فرمایا (ہاں مگر) میرا وعدہ ظالموں تک نہیں پہنچے گا۔"}, {"arabic": " وَ اِذۡ جَعَلۡنَا الۡبَیۡتَ مَثَابَۃً لِّلنَّاسِ وَ اَمۡنًا ؕ وَ اتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰہٖمَ مُصَلًّی ؕ وَ عَہِدۡنَاۤ اِلٰۤی اِبۡرٰہٖمَ وَ اِسۡمٰعِیۡلَ اَنۡ طَہِّرَا بَیۡتِیَ لِلطَّآئِفِیۡنَ وَ الۡعٰکِفِیۡنَ وَ الرُّکَّعِ السُّجُوۡدِ ﴿۱۲۶﴾", "english": " And remember the time when We made the House a resort for mankind and a place of security; and take ye the station of Abraham as a place of Prayer. And We commanded Abraham and Ishmael, saying , ‘Purify My House for those who perform the circuit and those who remain therein for devotion and those who bow down and fall prostrate in Prayer .’", "french": " Et souvenez-vous quand Nous avons fait de la Maison un lieu de rassemblement continuel pour l’humanité et un endroit de sécurité. A l’heure de la Prière, adoptez un peu le niveau d’Abraham dans son acte d’adoration . Et Nous avons commandé à Abraham et Ismaël : « Purifiez Ma Maison pour ceux qui en font le tour et pour ceux qui y séjournent pour leurs dévotions et ceux qui s’inclinent et se prosternent en Prière. »", "german": " Und (gedenket der Zeit) da Wir das Haus zu einem Versammlungsort für die Menschheit machten und zu einer Sicherheit: \"Nehmet die Stätte Abrahams als Bethaus an.\" Und Wir geboten Abraham und Ismael: \"Reinigt Mein Haus für die, die (es) umwandeln, und die in Andacht verweilen und die sich beugen und niederfallen (im Gebet).\"", "spanish": " Y acordaos de cuando hicimos de la Casa un lugar de reunión para la humanidad y un lugar de seguridad; y ocupad vosotros el sitio de Abraham como lugar de Oración. Y dimos una orden a Abraham y a Ismael, diciendo : “Purificad Mi Casa para los que hacen el circuito y para los que permanecen en ella por devoción y para los que se inclinan y se postran en Oración”.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے اس گھر (یعنی کعبہ) کو لوگوں کے لئے باربار جمع ہونے کی جگہ اور امن (کا مقام) بنایا تھا اور (حکم دیا تھا کہ) ابراہیم کے کھڑے ہونے کی جگہ کو نماز کا مقام بناٶ۔ اور ہم نے ابراہیم اور اسماعیل کو تاکیدی حکم دیا تھا کہ میرے گھر کو طواف کرنے والوں اور اعتکاف کرنے والوں اور رکوع کرنے والوں اور سجدہ کرنے والوں کے لئے پاک (اور صاف) رکھو۔"}, {"arabic": " وَ اِذۡ قَالَ اِبۡرٰہٖمُ رَبِّ اجۡعَلۡ ہٰذَا بَلَدًا اٰمِنًا وَّ ارۡزُقۡ اَہۡلَہٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡہُمۡ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ؕ قَالَ وَ مَنۡ کَفَرَ فَاُمَتِّعُہٗ قَلِیۡلًا ثُمَّ اَضۡطَرُّہٗۤ اِلٰی عَذَابِ النَّارِ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۱۲۷﴾", "english": " And remember when Abraham said, ‘My Lord, make this a town of peace and provide with fruits such of its dwellers as believe in Allah and the Last Day,’ He said, ‘And on him too who believes not will I bestow benefits for a little while; then will I drive him to the punishment of the Fire, and an evil destination it is.’", "french": " Et souvenez-vous quand Abraham dit : « Mon Seigneur, fais de ce lieu une ville de paix, et accorde des fruits en guise de provision à ceux de ses habitants qui croient en Allāh et au Jour Dernier. » Allāh répondit : « Quant à celui qui ne croit pas, Je lui accorderai pendant quelque temps des bienfaits ; ensuite, Je l’astreindrai au châtiment du Feu – et quelle mauvaise destination ! »", "german": " Und (denket daran) als Abraham sprach: \"Mein Herr, mache dies zu einer Stadt des Friedens und versorge mit Früchten die unter ihren Bewohnern, die an Allah und den Jüngsten Tag glauben\", da sprach Er: \"Und auch dem, der nicht glaubt, will Ich einstweilen Wohltaten erweisen; dann will Ich ihn in die Pein des Feuers treiben, und das ist eine üble Bestimmung.\"", "spanish": " Y acordaos de cuando Abraham dijo: “Mi Señor, convierte a ésta en ciudad de paz y proporciona frutos a aquellos de sus habitantes que crean en Al-lah y en el Último Día”. Él dijo: “e incluso a quien no crea le concederé también mis beneficios durante algún tiempo; luego le empujaré al castigo del Fuego, ¡un destino desdichado!”.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ابراہیم نے کہا تھا کہ اے میرے رب اس (جگہ) کو ایک پرامن شہر بنا دے اور اس کے باشندوں میں سے جو بھی اللہ پر اور آنے والے دن پر ایمان لائیں انہیں (ہر قسم کے) پھل عطا فرما (اس پر اللہ نے) فرمایا اور جو شخص کفر کرے اسے (بھی) میں تھوڑی مدت تک فائدہ پہنچاٶں گا۔ پھر اسے مجبور کرکے دوزخ کے عذاب کی طرف لے جاٶں گا۔ اور (یہ) بہت برا انجام ہے۔"}, {"arabic": " وَ اِذۡ یَرۡفَعُ اِبۡرٰہٖمُ الۡقَوَاعِدَ مِنَ الۡبَیۡتِ وَ اِسۡمٰعِیۡلُ ؕ رَبَّنَا تَقَبَّلۡ مِنَّا ؕ اِنَّکَ اَنۡتَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۱۲۸﴾", "english": " And remember the time when Abraham and Ishmael raised the foundations of the House, praying , ‘Our Lord, accept this from us; for Thou art All-Hearing, All-Knowing.", "french": " Et souvenez-vous quand Abraham et Ismaël élevaient les fondations de la Maison, tout en implorant : ''Notre Seigneur, accepte ceci de nous ; car Tu es Celui Qui entend tout, Tu es l’Omniscient.", "german": "", "spanish": " Y acordaos de cuando Abraham e Ismael levantaron los cimientos de la Casa, pidiendo: “Señor Nuestro acepta esto de nosotros; porque Tú eres el que todo lo oye, el que todo lo sabe”;", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ابراہیم اس گھر کی بنیادیں اٹھا رہا تھا اور (اس کے ساتھ) اسماعیل بھی (اور وہ دونوں کہتے جاتے تھے کہ) اے ہمارے رب ہماری طرف سے (اس خدمت کو) قبول فرما۔ تو ہی (ہے جو) بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " رَبَّنَا وَ اجۡعَلۡنَا مُسۡلِمَیۡنِ لَکَ وَ مِنۡ ذُرِّیَّتِنَاۤ اُمَّۃً مُّسۡلِمَۃً لَّکَ ۪ وَ اَرِنَا مَنَاسِکَنَا وَ تُبۡ عَلَیۡنَا ۚ اِنَّکَ اَنۡتَ التَّوَّابُ الرَّحِیۡمُ ﴿۱۲۹﴾", "english": " ‘Our Lord, make us submissive to Thee and make of our offspring a people submissive to Thee. And show us our ways of worship, and turn to us with mercy; for Thou art Oft-Returning with compassion and Merciful.", "french": " Notre Seigneur, fais-nous tous deux soumis à Toi, et fais , de notre postérité, un peuple soumis à Toi. Et montre-nous nos façons de prier et tourne-Toi vers nous avec clémence ; car Tu es Celui Qui revient sans cesse avec compassion, le Miséricordieux.", "german": " Unser Herr, mache uns beide Dir ergeben und (mache) aus unserer Nachkommenschaft eine Schar, die Dir ergeben sei. Und weise uns unsere Wege der Verehrung, und kehre Dich gnädig zu uns; denn Du bist der oft gnädig Sich Wendende, der Barmherzige.", "spanish": " “Señor Nuestro, haznos sumisos a Ti, y haz de nuestra descendencia un pueblo sumiso a Ti. Y enséñanos nuestros lugares de culto y vuélvete a nosotros con misericordia; porque Tú eres Remisorio con compasión y Misericordioso”;", "urdu": " اے ہمارے رب! اور (ہم یہ بھی التجا کرتے ہیں کہ) ہم دونوں کو اپنا فرمانبردار (بندہ) بنالے اور ہماری اولاد میں سے بھی اپنی ایک فرماں بردار جماعت (بنا) اور ہمیں ہمارے (مناسب حال) عبادت کے طریق بتا اور ہماری طرف (اپنے) فضل کے ساتھ توجہ فرما یقیناً تو (اپنے بندوں کی طرف) بہت توجہ کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " رَبَّنَا وَ ابۡعَثۡ فِیۡہِمۡ رَسُوۡلًا مِّنۡہُمۡ یَتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِکَ وَ یُعَلِّمُہُمُ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ یُزَکِّیۡہِمۡ ؕ اِنَّکَ اَنۡتَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۱۳۰﴾٪", "english": " ‘And, our Lord, raise up among them a Messenger from among themselves, who may recite to them Thy Signs and teach them the Book and Wisdom and may purify them; surely, Thou art the Mighty, the Wise.’", "french": " Notre Seigneur, élève parmi eux un Messager d’entre eux-mêmes, qui puisse leur réciter Tes Signes et leur enseigner le Livre et la Sagesse et qui puisse les rendre purs ; assurément, Tu es le Puissant, le Sage. »", "german": "", "spanish": " “Y, Señor Nuestro, suscita de entre ellos un Mensajero, que les recite Tus Signos y les enseñe el Libro y la Sabiduría y les purifique; en verdad, Tú eres el Poderoso, el Sabio”.", "urdu": " اور اے ہمارے رب! (ہماری یہ بھی التجا ہے کہ تو) انہی میں سے ایک ایسا رسول مبعوث فرما جو انہیں تیری آیات پڑھ کر سنائے اور انہیں کتاب اور حکمت سکھائے اور انہیں پاک کرے۔ یقیناً تو ہی غالب (اور) حکمتوں والا ہے۔"}, {"arabic": " وَ مَنۡ یَّرۡغَبُ عَنۡ مِّلَّۃِ اِبۡرٰہٖمَ اِلَّا مَنۡ سَفِہَ نَفۡسَہٗ ؕ وَ لَقَدِ اصۡطَفَیۡنٰہُ فِی الدُّنۡیَا ۚ وَ اِنَّہٗ فِی الۡاٰخِرَۃِ لَمِنَ الصّٰلِحِیۡنَ ﴿۱۳۱﴾", "english": " And who will turn away from the religion of Abraham but he who is foolish of mind? Him did We choose in this world, and in the next he will surely be among the righteous.", "french": " Et qui se détournera de la foi d’Abraham, excepté celui qui se leurre ? C’est lui que Nous avons choisi dans ce monde, et il se trouvera dans l’autre assurément au nombre des justes.", "german": " Und wer wird sich abwenden von dem Glauben Abrahams, es sei denn einer, der sich betört? Ihn erwählten Wir in dieser Welt, und im Jenseits wird er gewiss unter den Rechtschaffenen sein.", "spanish": " Y ¿quién se apartará de la religión de Abraham sino el insensato? A él lo escogimos en este mundo, y en el futuro estará ciertamente entre los justos.", "urdu": " اور اس شخص کے سوا جس نے اپنے آپ کو ہلاک کر دیا ہو ابراہیم کے دین سے کون اعراض کر سکتا ہے اور ہم نے یقیناً اسے (اس) دنیا میں بھی برگزیدہ کیا تھا اور وہ آخرت میں بھی یقیناً نیک لوگوں میں (شمار) ہوگا۔"}, {"arabic": " اِذۡ قَالَ لَہٗ رَبُّہٗۤ اَسۡلِمۡ ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِیۡنَ ﴿۱۳۲﴾", "english": " When his Lord said to him, ‘Submit,’ he said, ‘I have submitted to the Lord of the worlds.’", "french": " Quand son Seigneur lui dit : « Soumets-toi, » il répondit : « Je me suis déjà soumis au Seigneur des mondes. »", "german": " Als sein Herr zu ihm sprach: \"Ergib dich\", da sagte er: \"Ich habe mich ergeben dem Herrn der Welten.\"", "spanish": " Cuando su Señor le dijo “sométete”, él contestó: “Me he sometido al Señor de los mundos”.", "urdu": " جب اس کے رب نے اسے کہا کہ (ہماری) فرمانبرداری اختیار کر۔ اس نے (جواب میں) کہا کہ میں (تو پہلے ہی سے) تمام جہانوں کے رب کی فرمانبرداری اختیار کر چکا ہوں۔"}, {"arabic": " وَ وَصّٰی بِہَاۤ اِبۡرٰہٖمُ بَنِیۡہِ وَ یَعۡقُوۡبُ ؕ یٰبَنِیَّ اِنَّ اللّٰہَ اصۡطَفٰی لَکُمُ الدِّیۡنَ فَلَا تَمُوۡتُنَّ اِلَّا وَ اَنۡتُمۡ مُّسۡلِمُوۡنَ ﴿۱۳۳﴾ؕ", "english": " The same did Abraham enjoin upon his sons — and so did Jacob — saying : ‘O my sons, truly Allah has chosen this religion for you; so let not death overtake you except when you are in a state of submission.’", "french": " C’est ce qu’Abraham enjoignit à ses fils – et Jacob aussi – en leur disant : « Ô mes fils, en vérité, c’est cette foi qu’Allāh a choisie pour vous. Ne laissez donc pas la mort vous surprendre que lorsque vous êtes en état de soumission. »", "german": " Und ebenso beschwor Abraham – und Jakob – seine Söhne: \"O meine Söhne, in Wahrheit hat Allah (diesen) Glauben für euch erwählt; sterbet also nicht, außer ihr seid Gottergebene.\"", "spanish": " Lo mismo impuso Abraham a sus hijos –y así hizo Jacob- diciendo : “¡Oh, hijos míos!, en verdad, Al-lah ha escogido esta religión para vosotros; así pues, no dejéis que la muerte caiga sobre vosotros a menos que estéis en estado de sumisión”.", "urdu": " اور ابراہیم نے اپنے بیٹوں کو اور (اسی طرح) یعقوب نے بھی (اپنے بیٹوں کو) اس بات کی تاکید کی (اور کہا کہ) اے میرے بیٹو! اللہ نے یقیناً اس دین کو تمہارے لئے چن لیا ہے۔ پس ہر گز نہ مرنا مگر اس حالت میں کہ تم (اللہ کے) پورے فرمانبردار ہو۔"}, {"arabic": " اَمۡ کُنۡتُمۡ شُہَدَآءَ اِذۡ حَضَرَ یَعۡقُوۡبَ الۡمَوۡتُ ۙ اِذۡ قَالَ لِبَنِیۡہِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِیۡ ؕ قَالُوۡا نَعۡبُدُ اِلٰہَکَ وَ اِلٰـہَ اٰبَآئِکَ اِبۡرٰہٖمَ وَ اِسۡمٰعِیۡلَ وَ اِسۡحٰقَ اِلٰـہًا وَّاحِدًا ۚۖ وَّ نَحۡنُ لَہٗ مُسۡلِمُوۡنَ ﴿۱۳۴﴾", "english": " Were you present when death came to Jacob, when he said to his sons, ‘What will you worship after me?’ They answered, ‘We will worship thy God, the God of thy fathers, Abraham and Ishmael and Isaac, the One God; and to Him we submit ourselves.’", "french": " Etiez-vous présents quand l’heure de la mort est arrivée pour Jacob, lorsqu’il dit à ses fils : « Qu’adorerez-vous après moi ? » Ils lui répondirent : « Nous adorerons ton Dieu : le Dieu de tes pères, d’Abraham, d’Ismaël, d’Isaac, Dieu Unique ; et c’est à Lui que nous nous soumettons. »", "german": " Waret ihr zugegen, als der Tod Jakob nahte? Da er zu seinen Söhnen sprach: \"Was werdet ihr nach mir anbeten?\", antworteten sie: \"Wir werden anbeten deinen Gott, den Gott deiner Väter – des Abraham, des Ismael und des Isaak –, den Einigen Gott; und Ihm ergeben wir uns.\"", "spanish": " ¿Estuvisteis presentes cuando vino la muerte a Jacob y dijo a sus hijos: “¿qué adoraréis después de mí”? Ellos respondieron: “Adoraremos a tu Dios, el Dios de tus padres, Abraham e Ismael e Isaac, el Dios Único; y a Él nos sometemos”.", "urdu": " کیا تم اس وقت موجود تھے جب یعقوب پر موت (کی گھڑی) آئی (اور) جب اس نے اپنے بیٹوں سے کہا کہ تم میرے بعد کس کی عبادت کرو گے؟ انہوں نے (جواباً) کہا کہ ہم تیرے معبود اور تیرے باپ دادوں ابراہیم اور اسماعیل اور اسحاق کے معبود کی جو ایک ہی معبود ہے عبادت کریں گے اور ہم اسی کے فرمانبردار ہیں۔"}, {"arabic": " تِلۡکَ اُمَّۃٌ قَدۡ خَلَتۡ ۚ لَہَا مَا کَسَبَتۡ وَ لَکُمۡ مَّا کَسَبۡتُمۡ ۚ وَ لَا تُسۡـَٔلُوۡنَ عَمَّا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۳۵﴾", "english": " Those are a people that have passed away; for them is what they earned, and for you shall be what you earn; and you shall not be questioned as to what they did.", "french": " Ces gens-là ne sont plus de ce monde ; ils ont ce qu’ils ont acquis ; vous aurez aussi ce que vous aurez acquis, et on ne vous questionnera pas sur ce qu’ils ont fait.", "german": " Jenes Volk ist nun dahingefahren; ihnen ward nach ihrem Verdienst, und euch wird nach eurem Verdienst, und ihr sollt nicht befragt werden nach ihren Taten.", "spanish": " Son un pueblo que ha pasado; para ellos lo que ganaron, y para vosotros será lo que ganéis; y no seréis interrogados sobre lo que ellos hicieron.", "urdu": " یہ وہ جماعت ہے جو (اپنا زمانہ پورا کرکے) فوت ہو چکی ہے جو کچھ اس نے کمایا (اس کا نفع نقصان) اس کے لئے ہے اور جو کچھ تم نے کمایا (اس کا نفع نقصان) تمہارے لئے ہے اور جو کچھ وہ کرتے تھے اس کے متعلق تم سے (کچھ) نہیں پوچھا جائے گا۔"}, {"arabic": " وَ قَالُوۡا کُوۡنُوۡا ہُوۡدًا اَوۡ نَصٰرٰی تَہۡتَدُوۡا ؕ قُلۡ بَلۡ مِلَّۃَ اِبۡرٰہٖمَ حَنِیۡفًا ؕ وَ مَا کَانَ مِنَ الۡمُشۡرِکِیۡنَ ﴿۱۳۶﴾", "english": " And they say, ‘Be ye Jews or Christians that you may be rightly guided.’ Say: ‘Nay, follow ye the religion of Abraham who was ever inclined to God ; he was not of those who set up gods with God .’", "french": " Et ils disent : « Soyez Juifs ou Chrétiens afin d’être bien guidés. » Dis : « Suivez plutôt la foi d’Abraham qui était toujours incliné vers Allāh, car Abraham n’était pas du nombre des associateurs. »", "german": " Und sie sprechen: \"Werdet Juden oder Christen, auf dass ihr rechtgeleitet seiet.\" Sprich: \"Nein, (folget) dem Glauben Abrahams, des Aufrichtigen; er war keiner der Götzendiener.\"", "spanish": " Y dicen: “Sed judíos o cristianos para que seáis bien guiados”. Decid: “No, seguid la religión de Abraham que siempre se inclinó ante Dios; no fue de aquellos que elevan dioses a la altura de Dios”.", "urdu": " اور (کیا تم نے سنا کہ) وہ یہ بھی کہتے ہیں کہ یہودی یا مسیحی ہو جاٶ (اس طرح) تم ہدایت پا جاٶ گے تو (ان سے) کہدے (کہ یوں) نہیں بلکہ ابراہیم کے دین کو جو (خدا ہی کی طرف) جھکنے والا تھا (اختیار کرو) اور (یاد رکھو کہ) وہ مشرکوں میں سے نہ تھا۔"}, {"arabic": " قُوۡلُوۡۤا اٰمَنَّا بِاللّٰہِ وَ مَاۤ اُنۡزِلَ اِلَیۡنَا وَ مَاۤ اُنۡزِلَ اِلٰۤی اِبۡرٰہٖمَ وَ اِسۡمٰعِیۡلَ وَ اِسۡحٰقَ وَ یَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَ مَاۤ اُوۡتِیَ مُوۡسٰی وَ عِیۡسٰی وَ مَاۤ اُوۡتِیَ النَّبِیُّوۡنَ مِنۡ رَّبِّہِمۡ ۚ لَا نُفَرِّقُ بَیۡنَ اَحَدٍ مِّنۡہُمۡ ۫ۖ وَ نَحۡنُ لَہٗ مُسۡلِمُوۡنَ ﴿۱۳۷﴾", "english": " Say ye: ‘We believe in Allah and what has been revealed to us, and what was revealed to Abraham and Ishmael, and Isaac, and Jacob and his children, and what was given to Moses and Jesus, and what was given to all other Prophets from their Lord. We make no difference between any of them; and to Him we submit ourselves.’", "french": " Dites : « Nous croyons en Allāh et à ce qui nous a été révélé, et à ce qui a été révélé à Abraham, à Ismaël, à Isaac, à Jacob et à ses enfants, et à ce qui a été donné à Moïse et à Jésus, et à ce qui a été donné à tous les autres prophètes de la part de leur Seigneur. Nous ne faisons aucune distinction entre eux ; et c’est à Lui que nous nous soumettons. »", "german": " Sprecht: \"Wir glauben an Allah und was zu uns herabgesandt worden, und was herabgesandt ward Abraham und Ismael und Isaak und Jakob und (seinen) Kindern, und was gegeben ward Moses und Jesus, und was gegeben ward (allen anderen) Propheten von ihrem Herrn. Wir machen keinen Unterschied zwischen ihnen; und Ihm ergeben wir uns.\"", "spanish": " Decid: “Creemos en Al-lah y en lo que nos ha sido revelado, y en lo que fue revelado a Abraham e Ismael, e Isaac y Jacob y sus hijos, y en lo que fue dado a Moisés y Jesús, y en lo que fue dado a todos los demás Profetas por su Señor. Nosotros no hacemos diferencias entre ninguno de ellos; y a Él nos sometemos.”", "urdu": " تم کہو کہ ہم اللہ پر اور جو کچھ ہماری طرف اتارا گیا ہے اور جو کچھ ابراہیم‘ اسماعیل‘ اسحاق‘ یعقوب اور (اس کی) اولاد پر اتارا گیا تھا اور جو کچھ موسیٰ اور عیسیٰ کو دیا گیا تھا اور (اسی طرح) جو کچھ (باقی) انبیاء کو ان کے رب کی طرف سے دیا گیا تھا (اس تمام وحی پر) ایمان رکھتے ہیں ہم ان میں سے ایک (نبی اور دوسرے نبی) کے درمیان (کوئی) بھی فرق نہیں کرتے اور ہم اسی کے فرمانبردار ہیں۔"}, {"arabic": " فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَاۤ اٰمَنۡتُمۡ بِہٖ فَقَدِ اہۡتَدَوۡا ۚ وَ اِنۡ تَوَلَّوۡا فَاِنَّمَا ہُمۡ فِیۡ شِقَاقٍ ۚ فَسَیَکۡفِیۡکَہُمُ اللّٰہُ ۚ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۱۳۸﴾ؕ", "english": " And if they believe as you have believed, then are they surely guided; but if they turn back, then they are only creating a schism, and Allah will surely suffice thee against them, for He is All-Hearing, All-Knowing.", "french": " Et s’ils croient comme vous avez cru, alors certainement ils sont bien guidés ; mais s’ils s’ en détournent, ils demeureront certainement dans le schisme, et Allāh te suffira assurément contre eux, car Il est Celui Qui entend tout, l’Omniscient.", "german": " Und wenn sie glauben, wie ihr geglaubt habt; dann sind sie rechtgeleitet; kehren sie jedoch um, dann bringen sie Spaltung, aber Allah wird dir sicherlich genügen gegen sie, denn Er ist der Allhörende, der Allwissende.", "spanish": " Y si creen como vosotros habéis creído, están, en verdad, bien guiados; pero si vuelven la espalda, entonces no hacen más que crear un cisma, y Al-lah te bastará ciertamente contra ellos, porque Él es el que todo lo oye, El Omnisciente.", "urdu": " پس اگر وہ لوگ (اسی طرح) ایمان لے آئیں جس طرح تم اس (تعلیم) پر ایمان لائے ہو تو (بس) وہ ہدایت پا گئے اور اگر وہ پھر جائیں تو (سمجھو کہ) وہ صرف اختلاف (کرنے) پر (تلے ہوئے) ہیں۔ اس صورت میں اللہ تجھے ضرور ان (کے شر) سے بچائے گا۔ وہ بہت ہی سننے والا (اور) بہت ہی جاننے والا ہے۔"}, {"arabic": " صِبۡغَۃَ اللّٰہِ ۚ وَ مَنۡ اَحۡسَنُ مِنَ اللّٰہِ صِبۡغَۃً ۫ وَّ نَحۡنُ لَہٗ عٰبِدُوۡنَ ﴿۱۳۹﴾", "english": " Say, ‘We will adopt the religion of Allah; and who is better than Allah in teaching religion, and Him alone do we worship.’", "french": " Dis : « Nous avons adopté la religion d’Allāh ; et qui est meilleur qu’Allāh dans l’enseignement de la religion ? Et c’est Lui Seul que nous adorons. »", "german": " (Sprich:) \"Allahs Religion (wollen wir annehmen); und wer ist ein besserer (Lehrer) im Glauben als Allah? Ihn allein verehren wir.\"", "spanish": " Decid : “ Nosotros adoptaremos la religión de Al-lah; ¿quién posee mejores atributos que Al-lah?, y a Él sólo adoramos”.", "urdu": " (اے مسلمانو! ان سے کہو کہ ہم تو) اللہ کا دین (اختیار کریں گے) اور دین (سکھانے کے معاملہ) میں اللہ سے کون بہتر ہو سکتا ہے اور ہم اسی کی عبادت کرنے والے ہیں۔"}, {"arabic": " قُلۡ اَتُحَآجُّوۡنَنَا فِی اللّٰہِ وَ ہُوَ رَبُّنَا وَ رَبُّکُمۡ ۚ وَ لَنَاۤ اَعۡمَالُنَا وَ لَکُمۡ اَعۡمَالُکُمۡ ۚ وَ نَحۡنُ لَہٗ مُخۡلِصُوۡنَ ﴿۱۴۰﴾ۙ", "english": " Say: ‘Do you dispute with us concerning Allah, while He is our Lord and your Lord? And for us are our works, and for you your works; and to Him alone we are sincerely devoted.’", "french": " Dis : « Allez-vous débattre avec nous au sujet d’Allāh, alors qu’Il est notre Seigneur et votre Seigneur ? A nous nos oeuvres et à vous vos oeuvres ; et c’est à Lui Seul que nous sommes sincèrement dévoués.", "german": "", "spanish": " Di: ¿Disputaréis con nosotros acerca de Al-lah, siendo así que Él es nuestro Señor y vuestro Señor? Y para nosotros son nuestras obras, y para vosotros las vuestras; y sólo de Él somos sinceros devotos”.", "urdu": " تو (ان سے) کہہ کیا تم ہم سے اللہ کے متعلق جھگڑتے ہو حالانکہ وہ ہمارا (بھی) رب ہے اور تمہارا (بھی) رب ہے اور ہمارے اعمال ہمارے لئے ہیں اور تمہارے اعمال تمہارے لئے۔ اور ہم تو اس سے اخلاص (کا تعلق) رکھتے ہیں۔"}], "Surah": 2}