{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سُبۡحٰنَ الَّذِیۡۤ اَسۡرٰی بِعَبۡدِہٖ لَیۡلًا مِّنَ الۡمَسۡجِدِ الۡحَرَامِ اِلَی الۡمَسۡجِدِ الۡاَقۡصَا الَّذِیۡ بٰرَکۡنَا حَوۡلَہٗ لِنُرِیَہٗ مِنۡ اٰیٰتِنَا ؕ اِنَّہٗ ہُوَ السَّمِیۡعُ الۡبَصِیۡرُ ﴿۲﴾", "english": " Glory be to Him Who carried His servant by night from the Sacred Mosque to the Distant Mosque, the environs of which We have blessed, that We might show him some of Our Signs. Surely, He alone is the Hearing, the Seeing.", "french": " Gloire à Celui Qui emmena de nuit Son serviteur de la Mosquée Sacrée à la Mosquée Eloignée dont Nous avons béni les environs, afin de lui montrer quelques-uns de Nos Signes. En vérité, Lui Seul est Celui Qui entend tout, Celui Qui voit tout.", "german": " Preis Ihm, Der bei Nacht Seinen Diener hinwegführte von der Heiligen Moschee zu der Fernen Moschee, deren Umgebung Wir gesegnet haben, auf dass Wir ihm einige Unserer Zeichen zeigen. Wahrlich, Er ist der Allhörende, der Allsehende.", "spanish": " Glorificado sea Aquel que llevó a Su siervo durante la noche, desde la Mezquita Sagrada a la Mezquita Lejana, cuyos alrededores hemos bendecido, para mostrarle algunos de Nuestros Signos. En verdad, sólo Él es el Oyente, el Vidente.", "urdu": " (میں) اُس (خدا) کی پاکیزگی (بیان کرتا ہوں) جو رات کے وقت اپنے بندے کو (اس) حرمت والی مسجد سے (اُس) دُور والی مسجد تک جس کے اردگرد کو (بھی) ہم نے برکت دی ہے (اس لئے) لے گیا کہ تاہم اسے اپنے بعض نشان دکھلائیں یقیناً وہی (خدا) ہے جو (اپنے بندوں کی پکار کو) خوب سننے والا (اور ان کی حالتوں کو) خوب دیکھنے والا ہے۔"}, {"arabic": " وَ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ وَ جَعَلۡنٰہُ ہُدًی لِّبَـنِیۡۤ اِسۡرَآءِیۡلَ اَلَّا تَتَّخِذُوۡا مِنۡ دُوۡنِیۡ وَکِیۡلًا ؕ﴿۳﴾", "english": " And We gave Moses the Book, and We made it a guidance for the children of Israel, saying , ‘Take no guardian beside Me,", "french": " Et Nous avons donné le Livre à Moïse, et Nous en avons fait une direction pour les Enfants d’Israël, en leur disant : « Ne prenez aucun protecteur hormis Moi,", "german": " Wir gaben Moses die Schrift und machten sie zu einer Führung für die Kinder Israels (und sprachen): \"Nehmt keinen zum Hüter außer Mir,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:3&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:3&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic4\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic4\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:4' style='text-decoration:underline'>17:4</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(4)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control4\"></i></button> <audio id=\"player4\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ذُرِّیَّۃَ مَنۡ حَمَلۡنَا مَعَ نُوۡحٍ ؕ اِنَّہٗ کَانَ عَبۡدًا شَکُوۡرًا ﴿۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘O ye the progeny of those whom We carried <em>in the Ark </em>with Noah.’ He was indeed a grateful servant.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘O ye, the progeny of those <sup class='ref'>[<a class='ref' data-id='ref_17_4_c' href='#'>c</a>]</sup>whom We carried <i>in the Ark </i>with Noah.’ He was indeed a grateful servant <i>of Ours.</i> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_17_4_c'>c</span></div> <div><div class='reference' data-id='ref_17_4_c' style='display:none'> <p><b>c.</b> <a href='/quran/19:59' target=_blank>19:59</a>; <a href='/quran/23:28' target=_blank>23:28</a>. (<a href='javascript:void(0)' data-id='ref_17_4_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">(یہ لوگ) اُن کی ذرّیت تھے جنہیں ہم نے نوح کے ساتھ سوار کیا تھا۔ یقیناً وہ بہت ہی شکرگزار بندہ تھا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اور یہ بھی کہا تھا کہ اے) ان لوگوں کی نسل! جنہیں ہم نے نوح کے ساتھ (کشتی پر) سوار کیا تھا (یاد رکھو کہ) وہ یقیناً (ہمارا) نہایت شکر گذار بندہ تھا (پس تم بھی شکر گذار بنو) ۔</span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ô descendants de ceux que Nous avons transportés <em>dans l’Arche</em> avec Noé. » Il était en vérité un serviteur reconnaissant.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Oh vosotros, descendientes de aquellos a los que llevamos <em>en el Arca</em> con Noé”. Fue en verdad un siervo agradecido.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">O ihr Kinder derer, die Wir mit Noah (über Wasser) trugen! Er war fürwahr ein dankbarer Diener.\"", "spanish": " Dimos a Moisés el Libro, y lo hicimos una guía para los hijos de Israel, diciéndoles: “No toméis guardián alguno fuera de Mí”,", "urdu": " اور ہم نے موسیٰ کو کتاب (یعنی تورات) دی تھی اور اس کو ہم نے بنی اسرائیل کے لئے ہدایت (کا ذریعہ) بنایا تھا (اور اس میں انہیں حکم دیا تھا) کہ تم میرے سوا کسی کو (اپنا) کارساز نہ ٹھہراٶ۔"}, {"arabic": " وَ قَضَیۡنَاۤ اِلٰی بَنِیۡۤ اِسۡرَآءِیۡلَ فِی الۡکِتٰبِ لَتُفۡسِدُنَّ فِی الۡاَرۡضِ مَرَّتَیۡنِ وَ لَتَعۡلُنَّ عُلُوًّا کَبِیۡرًا ﴿۵﴾", "english": " And We revealed to the children of Israel in the Book, saying , ‘You will surely do mischief in the land twice, and you will surely become excessively overbearing.’", "french": " Et dans le Livre, Nous avons informé clairement les Enfants d’Israël du décret que voici : « Vous causerez sûrement du désordre à deux reprises sur la terre, et certainement vous y ferez preuve d'un orgueil excessif. »", "german": " Und Wir hatten den Kindern Israels in der Schrift klargelegt: \"Siehe, ihr werdet gewisslich zweimal im Land Verderben anstiften, und ihr werdet gewisslich unmäßig hoffärtig und herrisch werden.\"", "spanish": " Y revelamos a los hijos de Israel en el Libro, diciéndoles: “En verdad cometeréis dos veces una gran perversidad en la tierra, y ciertamente os haréis orgullosos en extremo”.", "urdu": " اور ہم نے اس کتاب میں بنی اسرائیل کو یہ بات (کھول کر) پہنچا دی تھی کہ تم یقیناً اس ملک میں دو بار فساد کرو گے اور یقیناً تم بہت بڑی سرکشی (اختیار) کرو گے۔"}, {"arabic": " فَاِذَا جَآءَ وَعۡدُ اُوۡلٰٮہُمَا بَعَثۡنَا عَلَیۡکُمۡ عِبَادًا لَّنَاۤ اُولِیۡ بَاۡسٍ شَدِیۡدٍ فَجَاسُوۡا خِلٰلَ الدِّیَارِ ؕ وَ کَانَ وَعۡدًا مَّفۡعُوۡلًا ﴿۶﴾", "english": " So when the time for the first of the two warnings came, We sent against you some servants of Ours possessed of great might in war, and they penetrated the innermost parts of your houses, and it was a warning that was bound to be carried out.", "french": " Alors quand arriva l’heure de l’accomplissement du premier des deux avertissements, Nous envoyâmes contre vous quelques-uns de Nos serviteurs doués d’une grande puissance pour la guerre, et ils pénétrèrent jusqu’ à l’intérieur de vos demeures, et c’était un avertissement qui devait être accompli.", "german": " Als nun die Zeit für die Erfüllung der ersten der beiden Warnungen kam, da sandten Wir wider euch Unsere Diener, begabt mit gewaltiger Kriegsmacht, und sie drangen in ihre Häuser ein, und so ward erfüllt die Verheißung.", "spanish": " Así, cuando llegó el tiempo de cumplimiento de la primera de las dos advertencias, enviamos contra vosotros a algunos siervos Nuestros que poseían una gran fuerza para la guerra, y que penetraron en las partes más recónditas de vuestras casas; y fue una advertencia que estaba destinada a cumplirse.", "urdu": " اور جب ان دو (بار کے فسادوں) میں سے پہلی (بار) کا وعدہ (پورا ہونے کا وقت) آیا تو ہم نے بعض اپنے ایسے بندوں کو (تمہاری سرکوبی کے لئے) تم پر (مستولی کرکے) کھڑا کر دیا جو سخت جنگجو تھے۔ اور وہ تمہارے گھروں کے اندر جا گھسے اور یہ وعدہ (بہرحال) پورا ہو کر رہنے والا تھا۔"}, {"arabic": " ثُمَّ رَدَدۡنَا لَکُمُ الۡکَرَّۃَ عَلَیۡہِمۡ وَ اَمۡدَدۡنٰکُمۡ بِاَمۡوَالٍ وَّ بَنِیۡنَ وَ جَعَلۡنٰکُمۡ اَکۡثَرَ نَفِیۡرًا ﴿۷﴾", "english": " Then We gave you back the power against them, and aided you with wealth and children, and made you larger in numbers.", "french": " Puis Nous vous avons redonné la capacité de prévaloir contre eux, et Nous vous avons aidé en biens et en fils, et Nous vous avons rendus plus nombreux.", "german": " Dann gaben Wir euch wiederum die Macht über sie und stärkten euch mit Reichtum und Kindern und machten euch größer an Zahl.", "spanish": " A continuación os devolvimos el poder contra ellos, y os ayudamos con riqueza e hijos, aumentando vuestro número.", "urdu": " (اس کے بعد) پھرہم نے تمہیں (دشمن پر) حملہ کی طاقت عطا کی اورہم نے مالوں اور بیٹوں کے ذریعہ سے تمہاری مدد کی اورہم نے تمہیں جتھے کے لحاظ سے بھی (پہلے سے) زیادہ کردیا۔"}, {"arabic": " اِنۡ اَحۡسَنۡتُمۡ اَحۡسَنۡتُمۡ لِاَنۡفُسِکُمۡ ۟ وَ اِنۡ اَسَاۡتُمۡ فَلَہَا ؕ فَاِذَا جَآءَ وَعۡدُ الۡاٰخِرَۃِ لِیَسُوۡٓءٗا وُجُوۡہَکُمۡ وَ لِیَدۡخُلُوا الۡمَسۡجِدَ کَمَا دَخَلُوۡہُ اَوَّلَ مَرَّۃٍ وَّ لِیُتَبِّرُوۡا مَا عَلَوۡا تَتۡبِیۡرًا ﴿۸﴾", "english": " Now , if you do well, you will do well for your own souls; and if you do evil, it will only go against them. So when the time for the latter warning came, We raised a people against you to cover your faces with grief, and to enter the Mosque as they entered it the first time, and to destroy all that they conquered with utter destruction.", "french": " Si vous faites le bien, vous le faites pour votre propre âme, et si vous faites le mal c’est à son détriment. Alors, lorsque arrivera l’heure promise des derniers jours, ceci aussi est décrété que vos ennemis déshonorent vos visages et pénètrent dans la mosquée tout comme ils y pénétrèrent la première fois et qu’ils détruisent complètement tout ce qu’ils auront conquis.", "german": " (Nun) wenn ihr Gutes tut, so tut ihr Gutes für euren eigenen Seelen; und wenn ihr Böses tut, so ist es gegen sie. Als nun die Zeit für die zweite Warnung kam (sandten Wir Diener), damit sie euren Großen Unbill antaten und die Moschee beträten, wie sie sie das erste Mal betreten hatten, und alles, was sie erobert hatten, bis auf den Grund zerstörten.", "spanish": " Si actuáis bien, lo haréis para beneficio de vuestras propias almas; pero si actuáis mal, lo haréis en perjuicio de ellas. Por ello, cuando llegue la hora prometida de los últimos días, intentarán causaros aflicción, y entrar en la mezquita como entraron en ella la primera vez: destruyendo todo cuanto habían conquistado con la más completa destrucción.", "urdu": " (سنو)! اگر تم نیکو کار بنو گے تو نیکو کار بن کر اپنی جانوں کو ہی فائدہ پہنچاٶ گے‘ اور اگر تم برے اعمال کرو گے تو (بھی) ان (یعنی اپنی جانوں) کے لئے (برا کرو گے) پھر جب دوسری بار والا وعدہ (پورا ہونے کا وقت) آگیا‘ تا کہ وہ (یعنی تمہارے دشمن) تمہارے معزز لوگوں سے ناپسندیدہ معاملہ کریں اور (اسی طرح) مسجد میں داخل ہوں جس طرح وہ اس میں پہلی بار داخل ہوئے تھے اور جس چیز پر غلبہ پائیں اُسے بالکل تباہ (اور برباد) کرکے رکھ دیں (تو یہ بات بھی پوری ہوگئی)"}, {"arabic": " عَسٰی رَبُّکُمۡ اَنۡ یَّرۡحَمَکُمۡ ۚ وَ اِنۡ عُدۡتُّمۡ عُدۡنَا ۘ وَ جَعَلۡنَا جَہَنَّمَ لِلۡکٰفِرِیۡنَ حَصِیۡرًا ﴿۹﴾", "english": " It may be that your Lord will now have mercy on you; but if you return to your previous state, We too will return, and We have made Hell a prison for the disbelievers.", "french": " Il se peut que votre Seigneur ait maintenant pitié de vous ; mais si vous retournez à votre état antérieur , Nous aussi Nous retournerons avec Notre châtiment et Nous avons fait de l’Enfer une prison pour les mécréants.", "german": " Es ist möglich, dass euer Herr Sich euer erbarmt; doch wenn ihr (zu eurem früheren Zustande) zurückkehrt, so wollen (auch) Wir zurückkehren, und Wir haben die Hölle zu einem Gefängnis gemacht für die Ungläubigen.", "spanish": " Tal vez vuestro Señor tenga ahora misericordia de vosotros; ero si volvéis a vuestro estado anterior, Nosotros volveremos también, y hemos hecho del Infierno una cárcel para los incrédulos.", "urdu": " (اب بھی) کچھ بعید نہیں (بلکہ عین ممکن ہے) کہ تمہارا رب تم پر رحم کر دے اور اگر تم (پھر اپنے غلط رویہ کی طرف) لوٹے تو ہم بھی (اپنی سزا کی طرف) لوٹیں گے اور (یاد رکھو کہ) جہنم کو ہم نے کافروں کے لئے قید خانہ بنایا ہے۔"}, {"arabic": " اِنَّ ہٰذَا الۡقُرۡاٰنَ یَہۡدِیۡ لِلَّتِیۡ ہِیَ اَقۡوَمُ وَ یُبَشِّرُ الۡمُؤۡمِنِیۡنَ الَّذِیۡنَ یَعۡمَلُوۡنَ الصّٰلِحٰتِ اَنَّ لَہُمۡ اَجۡرًا کَبِیۡرًا ۙ﴿۱۰﴾", "english": " Surely, this Qur’an guides to what is most right; and gives to the believers who do good deeds the glad tidings that they shall have a great reward.", "french": " Assurément, ce Coran guide vers ce qu’il y a de plus droit, et donne aux croyants qui font de bonnes œuvres la bonne nouvelle qu’ils auront une grande récompense.", "german": " Fürwahr, dieser Qur-ân leitet zum Richtigsten und bringt den Gläubigen, die gute Werke tun, die frohe Botschaft, dass ihnen großer Lohn werden soll,", "spanish": " En verdad, este Corán guía hacia lo que es más recto; y comunica a los creyentes que realizan buenas obras la buena nueva de que tendrán una gran recompensa.", "urdu": " یہ قرآن یقیناً اس (راہ کی) طرف راہنمائی کرتا ہے جوسب سے زیادہ درست ہے اور مومنوں کوجو مناسب حال کام کرتے ہیں بشارت دیتاہے کہ ان کیلئے (بہت) بڑااجر (مقدر) ہے۔"}, {"arabic": " وَّ اَنَّ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ اَعۡتَدۡنَا لَہُمۡ عَذَابًا اَلِیۡمًا ﴿٪۱۱﴾", "english": " And that for those who do not believe in what is to come later We have prepared a grievous punishment.", "french": " Et que pour ceux qui ne croient pas à l’au-delà, Nous avons préparé un châtiment douloureux.", "german": " und dass Wir denen, die nicht an das Jenseits glauben, eine schmerzliche Strafe bereitet haben.", "spanish": " Para quienes no creen en lo que vendrá más tarde, hemos preparado un doloroso castigo.", "urdu": " اور (قرآن) یہ (بھی کہتا ہے) کہ جو لوگ آخرت پر ایمان نہیں لاتے ان کے لئے ہم نے دردناک عذاب تیار کیا ہے۔"}, {"arabic": " وَ یَدۡعُ الۡاِنۡسَانُ بِالشَّرِّ دُعَآءَہٗ بِالۡخَیۡرِ ؕ وَ کَانَ الۡاِنۡسَانُ عَجُوۡلًا ﴿۱۲﴾", "english": " And man asks for evil as he should ask for good; and man is hasty.", "french": " Et l’homme implore pour obtenir le mal comme s’il implorait pour le bien ; et l’homme est hâtif.", "german": " Der Mensch bittet um das Schlimme, wie er um das Gute bitten sollte; und der Mensch ist voreilig.", "spanish": " Pero el hombre ruega por el mal como si estuviera pidiendo por el bien; y el hombre es impaciente.", "urdu": " اور انسان شر کو (اسی جوش سے) بلاتا ہے جس جوش سے اللہ اس (بندہ) کو خیر کی طرف بلا رہا ہوتا ہے اور انسان بڑا ہی جلد باز (واقع ہوا) ہے۔"}, {"arabic": " وَ جَعَلۡنَا الَّیۡلَ وَ النَّہَارَ اٰیَتَیۡنِ فَمَحَوۡنَاۤ اٰیَۃَ الَّیۡلِ وَ جَعَلۡنَاۤ اٰیَۃَ النَّہَارِ مُبۡصِرَۃً لِّتَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡ وَ لِتَعۡلَمُوۡا عَدَدَ السِّنِیۡنَ وَ الۡحِسَابَ ؕ وَ کُلَّ شَیۡءٍ فَصَّلۡنٰہُ تَفۡصِیۡلًا ﴿۱۳﴾", "english": " And We have made the night and the day two Signs, and the Sign of night We have made dark, and the Sign of day We have made sightgiving, that you may seek bounty from your Lord, and that you may know the computation of years and the science of reckoning. And everything We have explained with a detailed explanation.", "french": " Et Nous avons fait de la nuit et du jour deux Signes, et Nous avons effacé le Signe de la nuit , le remplaçant par le jour , et le Signe du jour Nous avons rendu plein de lumière, afin que vous puissiez rechercher quelque munificence de votre Seigneur, et que vous puissiez connaître la computation des années et la science du calcul. Et Nous avons expliqué toute chose par une explication détaillée.", "german": " Wir machten die Nacht und den Tag zu zwei Zeichen, indem Wir das Zeichen der Nacht dunkel gemacht haben, und das Zeichen des Tags haben Wir licht gemacht, auf dass ihr nach Fülle von eurem Herrn trachtet und kennt die Bemessung der Jahre und die Rechenkunst. Und jegliches Ding haben Wir klar gemacht mit deutlicher Erklärung.", "spanish": " Y hemos hecho que la noche y el día sean dos Signos, y extinguimos el Signo de la noche reemplazándolo con el del día , y al Signo del día lo hicimos luminoso, para que busquéis la magnanimidad de uestro Señor, y conozcáis el cálculo de los años y la ciencia del cómputo. Pues todo lo hemos explicado detalladamente.", "urdu": " اور ہم نے رات اور دن دو نشان بنائے ہیں۔ اس طرح پر کہ رات والے نشان کے اثر کو تو ہم نے مٹا دیا اور دن والے نشان کو ہم نے بینائی بخشنے والا بنا دیا تا کہ تم خدا کے فضل کو تلاش کرو اور (آسانی سے) سالوں کی گنتی اور حساب معلوم کر سکو‘ اور ہم نے ہر ایک چیز کو خوب کھول کھول کر بیان کر دیا ہے۔"}, {"arabic": " وَ کُلَّ اِنۡسَانٍ اَلۡزَمۡنٰہُ طٰٓئِرَہٗ فِیۡ عُنُقِہٖ ؕ وَ نُخۡرِجُ لَہٗ یَوۡمَ الۡقِیٰمَۃِ کِتٰبًا یَّلۡقٰٮہُ مَنۡشُوۡرًا ﴿۱۴﴾", "english": " And every man’s works have We fastened to his neck, and on the Day of Resurrection We shall bring out for him a book which he will find wide open.", "french": " Et au cou de chaque homme Nous avons attaché le registre de ses œuvres, et au Jour de la Résurrection, Nous sortirons pour lui un livre qu’il trouvera grand ouvert.", "german": " Und einem jeden Menschen haben Wir seine Werke an den Nacken geheftet; und am Tage der Auferstehung werden Wir ihm ein Buch vorlegen, das er entsiegelt finden wird.", "spanish": " Y hemos ajustado al cuello de cada hombre el recuento de sus acciones; y en el Día de la Resurrección sacaremos para él un libro que encontrará totalmente abierto.", "urdu": " اور ہم نے ہر انسان کی گردن میں اس کے عمل کو باندھ دیا ہے اور ہم قیامت کے دن اس (کے اعمال) کی ایک کتاب نکال کر اس کے سامنے رکھ دیں گے‘ جسے وہ (بالکل) کھلی ہوئی پائے گا۔"}, {"arabic": " اِقۡرَاۡ کِتٰبَکَ ؕ کَفٰی بِنَفۡسِکَ الۡیَوۡمَ عَلَیۡکَ حَسِیۡبًا ﴿ؕ۱۵﴾", "english": " ‘Read thy book. Sufficient is thy own soul this day as reckoner against thee.’", "french": " »Lis ton livre. Aujourd’hui ta propre âme suffit pour faire le décompte contre toi. »", "german": " Lies dein Buch. Heute genügt deine eigene Seele als Rechnerin wider dich.", "spanish": " “Lee tu libro. Hoy te bastará tu propia alma para juzgarte a ti mismo”.", "urdu": " (اور اسے کہا جائے گا) اپنی کتاب (خود ہی) پڑھ (کر دیکھ لے) آج تیرا نفس ہی تیرا حساب لینے کے لئے کافی ہے۔"}, {"arabic": " مَنِ اہۡتَدٰی فَاِنَّمَا یَہۡتَدِیۡ لِنَفۡسِہٖ ۚ وَ مَنۡ ضَلَّ فَاِنَّمَا یَضِلُّ عَلَیۡہَا ؕ وَ لَا تَزِرُ وَازِرَۃٌ وِّزۡرَ اُخۡرٰی ؕ وَ مَا کُنَّا مُعَذِّبِیۡنَ حَتّٰی نَبۡعَثَ رَسُوۡلًا ﴿۱۶﴾", "english": " He who follows the right way follows it only for the good of his own soul: and he who goes astray, goes astray only to his own loss. And no bearer of burden shall bear the burden of another. We never punish until We have sent a Messenger.", "french": " Celui qui suit le bon chemin le suit seulement pour le biende son âme : et celui qui s’égare, s’égare seulement à son propre détriment. Et aucun porteur de fardeau ne portera le fardeau d’un autre. Et Nous ne châtions jamais avant d’avoir envoyé un Messager.", "german": " Wer den rechten Weg befolgt, der befolgt ihn nur zu seinem eigenen Heil; und wer irregeht, der geht irre allein zu seinem eigenen Schaden. Und keine lasttragende (Seele) trägt die Last einer anderen. Und Wir strafen nie, ehe Wir denn einen Gesandten geschickt haben.", "spanish": " Quien sigue el camino recto lo hace únicamente por el bien de su propia alma: y quien se extravía, se extravía únicamente para su propia pérdida. Y nadie que soporte una carga llevará la carga de otro. Nosotros nunca castigamos mientras no hayamos enviado un Mensajero.", "urdu": " (پس یاد رکھو کہ) جو ہدایت کو قبول کرے گا اس کا ہدایت پانا اسی کی ذات کے فائدہ کے لئے ہے جو (اس ہدایت کو رد کرکے) گمراہ ہوگا۔ اس کا گمراہ ہونا اسی کے (نفس کے) خلاف پڑے گا اور کوئی بوجھ اٹھانے والی جان کسی دوسری (جان) کا بوجھ نہیں اٹھائے گی اور ہم (کسی قوم پر) ہرگز عذاب نہیں بھیجتے جب تک (ان کی طرف) کوئی رسول نہ بھیج لیں۔"}, {"arabic": " وَ اِذَاۤ اَرَدۡنَاۤ اَنۡ نُّہۡلِکَ قَرۡیَۃً اَمَرۡنَا مُتۡرَفِیۡہَا فَفَسَقُوۡا فِیۡہَا فَحَقَّ عَلَیۡہَا الۡقَوۡلُ فَدَمَّرۡنٰہَا تَدۡمِیۡرًا ﴿۱۷﴾", "english": " And when We intend to destroy a township, We address Our commandment to its rebellious people, but they transgress therein; so the sentence of punishment becomes due against it, and We destroy it with utter destruction.", "french": " Et lorsque Nous projetons de détruire une ville, Nous laissons ceux parmi eux qui vivent dans l’opulence d’agir à leur guise . Par conséquent, ils s’y adonnent dans cette ville à toutes sortes de péchés jusqu’à ce que soit justifié le châtiment qui leur tombe dessus. Nous la détruisons alors d’une destruction complète.", "german": " Und wenn Wir eine Stadt zu zerstören beabsichtigen, lassen Wir Unser Gebot an ihre Reichen ergehen; sie aber freveln darin, so wird der Richterspruch fällig gegen sie, und Wir zerstören sie bis auf den Grund.", "spanish": " Y cuando pensamos destruir una ciudad, permitimos que sus gentes más acomodadas hagan lo que deseen . Así, se entregan en ella a todo tipo de pecado, hasta que el decreto queda justificado que se le aplique, y entonces la destruimos completamente.", "urdu": " اور جب ہم کسی بستی کو ہلاک کرنے کا ارادہ کریں تو (پہلے) ہم اس کے آسودہ حال لوگوں کو (نیکی کا) حکم دیتے ہیں جس پر وہ (الٹا) اس (بستی) میں نافرمانی (کی راہ) اختیار کر لیتے ہیں۔ تب اس بستی کے متعلق ہمارا کلام پورا ہو جاتا ہے اور ہم اسے پوری طرح تباہ کر دیتے ہیں۔"}, {"arabic": " وَ کَمۡ اَہۡلَکۡنَا مِنَ الۡقُرُوۡنِ مِنۡۢ بَعۡدِ نُوۡحٍ ؕ وَ کَفٰی بِرَبِّکَ بِذُنُوۡبِ عِبَادِہٖ خَبِیۡرًۢا بَصِیۡرًا ﴿۱۸﴾", "english": " How many generations have We destroyed after Noah! And thy Lord suffices as the Knower and Seer of the sins of His servants.", "french": " Que de générations n’avons-Nous détruites après Noé ! Et ton Seigneur suffit comme Connaisseur et Observateur des péchés de Ses serviteurs.", "german": " Wie viele Geschlechter haben Wir nach Noah vernichtet! Und dein Herr kennt und sieht die Sünden Seiner Diener zur Genüge.", "spanish": " ¡Cuántas generaciones hemos destruido después de Noé! Mas tu Señor basta como Conocedor y Observador de los pecados de Sus siervos.", "urdu": " اور (اسی قانون کے مطابق) ہم نے نوح (کی قوم کو اور اس) کے بعد (یکے بعد دیگرے) بہت سی نسلوں کو ہلاک کیا اور تیرا رب اپنے بندوں کے گناہوں پر (اچھی طرح) آگاہی رکھنے والا (ہے اور انہیں) خوب دیکھتا ہے۔"}, {"arabic": " مَنۡ کَانَ یُرِیۡدُ الۡعَاجِلَۃَ عَجَّلۡنَا لَہٗ فِیۡہَا مَا نَشَآءُ لِمَنۡ نُّرِیۡدُ ثُمَّ جَعَلۡنَا لَہٗ جَہَنَّمَ ۚ یَصۡلٰٮہَا مَذۡمُوۡمًا مَّدۡحُوۡرًا ﴿۱۹﴾", "english": " Whoso desires the present life, We hasten for him therein what We will — for such of them as We please; then have We appointed Hell for him; he shall burn therein, condemned and rejected.", "french": " Quiconque désire uniquement la vie d’ici-bas, Nous y hâtons pour lui ce que Nous voulons – et pour ceux d’entre eux que Nous voulons ; ensuite c’est l’Enfer que Nous lui avons réservé ; il y brûlera, condamné et rejeté.", "german": " Wer das Irdische begehrt, schnell bereiten Wir ihm darin das, was Wir wollen, dem, der Uns beliebt; danach haben Wir die Hölle für ihn bestimmt; da wird er eingehen, verdammt und verstoßen.", "spanish": " A quien desea la presente vida, nos apresuraremos a darle en ella lo que deseamos -para aquellos que nos plazca-; luego le asignamos el Infierno; en él se quemará, condenado y rechazado.", "urdu": " جو شخص (صرف) دنیا کا خواہاں ہو۔ ہم اس قسم کے لوگوں میں سے جس کو چاہتے ہیں‘ اس دنیا میں کچھ جلدی والا (دنیوی) فائدہ دے دیتے ہیں۔ اس کے بعد اس کے لئے جہنم (کا عذاب) مقرر کر دیتے ہیں جس میں وہ الزام لگوا کر اور دھتکارا جاکر داخل ہو جاتا ہے۔"}, {"arabic": " وَ مَنۡ اَرَادَ الۡاٰخِرَۃَ وَ سَعٰی لَہَا سَعۡیَہَا وَ ہُوَ مُؤۡمِنٌ فَاُولٰٓئِکَ کَانَ سَعۡیُہُمۡ مَّشۡکُوۡرًا ﴿۲۰﴾", "english": " And whoso desires the Hereafter and strives for it as it should be striven for, and he is a believer — these are the ones whose striving shall find favour with God .", "french": " Et quiconque désire l’au-delà et s’efforce de l’obtenir comme on devrait s’y efforcer, et qui est croyant – ce sont ceux-là dont les efforts seront reconnus par Allāh.", "german": " Wer aber das Jenseits begehrt und es beharrlich erstrebt und gläubig ist – derer Streben wird belohnt werden.", "spanish": " Mas quien desea el Más Allá y se sacrifica por él como debe hacerse, y es creyente: éstos son aquellos cuyo sacrificio encontrará el favor ante Dios.", "urdu": " اور جن لوگوں نے ایمان کی حالت میں آخرت کی خواہش کی اور اس کے لئے اس کے مطابق کوشش (بھی) کی تو (یاد رکھو) ایسے ہی لوگ ہیں جن کی کوشش کی قدر کی جائے گی۔"}, {"arabic": " کُلًّا نُّمِدُّ ہٰۤؤُلَآءِ وَ ہٰۤؤُلَآءِ مِنۡ عَطَآءِ رَبِّکَ ؕ وَ مَا کَانَ عَطَـآءُ رَبِّکَ مَحۡظُوۡرًا ﴿۲۱﴾", "english": " To all We render aid — both to these and those — a gift from thy Lord. And the gift of thy Lord is not restricted.", "french": " Nous les aidons tous – ceux-ci comme ceux-là – des dons de ton Seigneur. Et les dons de ton Seigneur ne sont pas restreints.", "german": " Ihnen allen, diesen und jenen, gewähren Wir von der Gabe deines Herrn. Und die Gabe deines Herrn ist unbeschränkt.", "spanish": " Ayudamos a todos –tanto a éstos como a aquellos– como merced de tu Señor. Y el don de tu Señor no está limitado.", "urdu": " ہم سبھی کو مدد دیتے ہیں ان کو بھی (یعنی دین والوں کو بھی) اور ان کو بھی (یعنی دنیا والوں کو بھی) (اور یہ مدد) تیرے رب کی عطا میں سے ہے اور تیرے رب کی عطا (کسی خاص گروہ سے) روکی نہیں جاتی۔"}, {"arabic": " اُنۡظُرۡ کَیۡفَ فَضَّلۡنَا بَعۡضَہُمۡ عَلٰی بَعۡضٍ ؕ وَ لَلۡاٰخِرَۃُ اَکۡبَرُ دَرَجٰتٍ وَّ اَکۡبَرُ تَفۡضِیۡلًا ﴿۲۲﴾", "english": " Behold, how We have exalted some of them over others in the present life ; and surely, the Hereafter shall be greater in degrees of rank and greater in excellence.", "french": " Vois comment Nous avons élevé certains d’entre eux au-dessus d’autres dans la vie présente ; et assurément l’au-delà sera plus grand en degrés de rang et plus grand en excellence.", "german": " Schau, wie Wir die einen von ihnen über die anderen erhöht haben; und wahrhaftig, das Jenseits soll noch größer sein an Rängen und größer an Auszeichnung.", "spanish": " Observa cómo hemos exaltado a algunos de ellos sobre otros en la vida presente; pero en verdad, el Más Allá será mayor en rangos elevados y mayor en excelencia.", "urdu": " دیکھ کس طرح ہم نے (دنیوی سامانوں کی رو سے بھی) ان میں سے بعض کو بعض پر فضیلت دی (ہوئی) ہے اور آخرت کی (زندگی) تو یقیناً (اور بھی) بڑے درجات والی اور زیادہ فضیلت والی (زندگی) ہوگی۔"}, {"arabic": " لَا تَجۡعَلۡ مَعَ اللّٰہِ اِلٰـہًا اٰخَرَ فَتَقۡعُدَ مَذۡمُوۡمًا مَّخۡذُوۡلًا ﴿٪۲۳﴾", "english": " Set not up with Allah another God lest thou sit down disgraced and forsaken.", "french": " N’érige pas un autre dieu avec Allāh, pour que tu ne te trouves pas déshonoré et abandonné.", "german": " Setze neben Allah nicht einen anderen Gott, auf dass du nicht mit Schimpf bedeckt und verlassen dasitzest.", "spanish": " No encumbres a otro dios juntamente con Al-lah para que no te quedes sentado, despreciado y abandonado.", "urdu": " پس (اے مخاطب) اللہ کے ساتھ کوئی دوسرا معبود نہ بنا‘ ورنہ تو الزام لگوا کر (اور) نصرت (الٰہی) سے محروم ہو کر بیٹھ جائے گا۔"}, {"arabic": " وَ قَضٰی رَبُّکَ اَلَّا تَعۡبُدُوۡۤا اِلَّاۤ اِیَّاہُ وَ بِالۡوَالِدَیۡنِ اِحۡسَانًا ؕ اِمَّا یَبۡلُغَنَّ عِنۡدَکَ الۡکِبَرَ اَحَدُہُمَاۤ اَوۡ کِلٰہُمَا فَلَا تَقُلۡ لَّہُمَاۤ اُفٍّ وَّ لَا تَنۡہَرۡہُمَا وَ قُلۡ لَّہُمَا قَوۡلًا کَرِیۡمًا ﴿۲۴﴾", "english": " Thy Lord has commanded, “Worship none but Him, and show kindness to parents. If one of them or both of them attain old age with thee, never say unto them any word expressive of disgust nor reproach them, but address them with excellent speech.", "french": " Ton Seigneur a ordonné que vous n’adoriez nul autre que Lui, et que vous montriez de la bonté aux parents. Si l’un d’entre eux, ou tous deux, atteignent la vieillesse auprès de toi, ne leur dis jamais aucune parole exprimant le dégoût, ni ne leur fais aucun reproche, mais adresse-toi à eux avec douceur et respect.", "german": " Dein Herr hat geboten: «Verehret keinen denn Ihn, und (erweiset) Güte den Eltern. Wenn einer von ihnen oder beide bei dir ein hohes Alter erreichen, sage nie \"Pfui!\" zu ihnen, und stoße sie nicht zurück, sondern sprich zu ihnen ein ehrerbietiges Wort.", "spanish": " Tu Señor ha ordenado: “No adoréis a nadie sino a Él, y mostrad bondad a vuestros padres. Si uno o los dos alcanzan la ancianidad contigo, no les digas nunca ninguna palabra que exprese disgusto ni les reproches, mas bien dirígete a ellos con palabras amables.", "urdu": " تیرے رب نے (اس بات کا) تا کیدی حکم دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو اور (نیز یہ کہ اپنے) ماں باپ سے اچھا سلوک کرو۔ اگر ان میں سے کسی ایک پر یا ان دونوں پر تیری زندگی میں بڑھاپا آجائے‘ تو انہیں (ان کی کسی بات پر ناپسندیدگی کا اظہار کرتے ہوئے) اُف تک نہ کہہ اور نہ انہیں جھڑک اور ان سے (ہمیشہ) نرمی سے بات کر۔"}, {"arabic": " وَ اخۡفِضۡ لَہُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحۡمَۃِ وَ قُلۡ رَّبِّ ارۡحَمۡہُمَا کَمَا رَبَّیٰنِیۡ صَغِیۡرًا ﴿ؕ۲۵﴾", "english": " “And lower to them the wing of humility out of tenderness. And say, ‘My Lord, have mercy on them even as they nourished me in my childhood.’”", "french": " Et, animé de tendresse, abaisse pour eux l’aile de ton humilité. Et dis : « Mon Seigneur, aie pitié d’eux tout comme ils m’ont élevé dans mon enfance. »", "german": " Und neige gütig gegen sie den Fittich der Demut und sprich: \"Mein Herr, erbarme Dich ihrer, so wie sie mich als Kleines betreuten.\"»", "spanish": " Y haz descender sobre ellos el ala de la humildad y de la ternura. i: “Señor mío, ten misericordia de ellos al igual que ellos me criaron en mi niñez”.", "urdu": " اور رحم کے جذبہ کے ماتحت ان کے سامنے عاجزانہ رویہ اختیار کر اور (ان کے لئے دعا کرتے وقت) کہا کر (کہ اے) میرے رب! ان پر مہربانی فرما کیونکہ انہوں نے بچپن کی حالت میں میری پرورش کی تھی۔"}, {"arabic": " رَبُّکُمۡ اَعۡلَمُ بِمَا فِیۡ نُفُوۡسِکُمۡ ؕ اِنۡ تَکُوۡنُوۡا صٰلِحِیۡنَ فَاِنَّہٗ کَانَ لِلۡاَوَّابِیۡنَ غَفُوۡرًا ﴿۲۶﴾", "english": " Your Lord knows best what is in your minds; if you are righteous, then surely, He is Most Forgiving to those who turn to Him again and again.", "french": " Votre Seigneur sait le mieux ce qui est dans votre esprit : si vous êtes justes, alors assurément Il est Très-Pardonnant envers ceux qui se tournent vers Lui avec constance.", "german": " Euer Herr weiß am besten, was in euren Seelen ist: Wenn ihr rechtgesinnt seid, dann ist Er gewiss nachsichtig gegenüber den sich Bekehrenden.", "spanish": " Vuestro Señor conoce mejor que nadie lo que hay en vuestras mentes; si sois virtuosos, Él es en verdad el Sumo Indulgente para los que acuden a Él una y otra vez.", "urdu": " تمہارا رب جو کچھ (بھی) تمہارے دلوں میں ہو اسے (سب سے) بہتر جانتا ہے (اور) اگر تم نیک ہوگے تو (یاد رکھو کہ) وہ باربار رجوع کرنے والوں کو بہت ہی بخشنے والا ہے۔"}, {"arabic": " وَ اٰتِ ذَاالۡقُرۡبٰی حَقَّہٗ وَ الۡمِسۡکِیۡنَ وَ ابۡنَ السَّبِیۡلِ وَ لَا تُبَذِّرۡ تَبۡذِیۡرًا ﴿۲۷﴾", "english": " And give thou to the kinsman his due, and to the poor and the wayfarer, and squander not thy wealth extravagantly.", "french": " Et donne au parent ce qui lui est dû, ainsi qu’au pauvre et au voyageur, et ne gaspille pas tes biens de façon extravagante.", "german": " Gib dem Verwandten, was ihm gebührt, und ebenso dem Armen und dem Wanderer, aber vergeude nicht in Verschwendung.", "spanish": " Y dale al pariente lo que se le debe, así como al menesteroso y al viajero, y no malgastes tus bienes con extravagancia.", "urdu": " اور قرابت والے (رشتہ دار) کو اور مسکین کو اور مسافر کو اس کا حق دو اور اسراف کسی رنگ میں (بھی) نہ کرو۔"}, {"arabic": " اِنَّ الۡمُبَذِّرِیۡنَ کَانُوۡۤا اِخۡوَانَ الشَّیٰطِیۡنِ ؕ وَ کَانَ الشَّیۡطٰنُ لِرَبِّہٖ کَفُوۡرًا ﴿۲۸﴾", "english": " Verily, the extravagant are brothers of satans, and Satan is ungrateful to his Lord.", "french": " En vérité, les gaspilleurs sont des frères des satans, et Satan est ingrat envers son Seigneur.", "german": " Die Verschwender sind Brüder der Teufel, und der Teufel ist undankbar gegen seinen Herrn.", "spanish": " En verdad, los extravagantes son hermanos de los satanicos, y Satanás es desagradecido con su Señor.", "urdu": " اسراف کرنے والے لوگ یقیناً شیطانوں کے بھائی ہوتے ہیں اور شیطان اپنے رب کا بہت ہی ناشکر گذار ہے۔"}, {"arabic": " وَ اِمَّا تُعۡرِضَنَّ عَنۡہُمُ ابۡتِغَآءَ رَحۡمَۃٍ مِّنۡ رَّبِّکَ تَرۡجُوۡہَا فَقُلۡ لَّہُمۡ قَوۡلًا مَّیۡسُوۡرًا ﴿۲۹﴾", "english": " And if thou hast to turn away from them while seeking thy Lord’s mercy for which thou hopest, even then speak to them a gentle word.", "french": " Et si, dans ta quête prioritaire de quelque miséricorde de ton Seigneur que tu espères, tu dois te détourner d'eux, même alors dis-leur une parole bienveillante.", "german": " Und wenn du dich von ihnen abkehrst im Trachten nach Barmherzigkeit von deinem Herrn, auf die du hoffst, so sprich zu ihnen ein hilfreich Wort.", "spanish": " Mas si has de apartarte de ellos buscando la misericordia que esperas de tu Señor, incluso entonces háblales con palabras amables.", "urdu": " اور اپنے رب کی کسی عظیم الشان رحمت کے حصول کے لئے جس کی تجھے امید لگی ہوئی ہو اگر تو ان (رشتہ داروں) سے اعراض کرے (تو اس صورت میں اعراض جائز ہے مگر) تب بھی ان سے تلطف والے طریق پر بات کر۔"}, {"arabic": " وَ لَا تَجۡعَلۡ یَدَکَ مَغۡلُوۡلَۃً اِلٰی عُنُقِکَ وَ لَا تَبۡسُطۡہَا کُلَّ الۡبَسۡطِ فَتَقۡعُدَ مَلُوۡمًا مَّحۡسُوۡرًا ﴿۳۰﴾", "english": " And keep not thy hand chained to thy neck, nor stretch it out an entire stretching, lest thou sit down blamed or exhausted.", "french": " Ne garde pas ta main attachée à ton cou poussée par l’avarice et ne l’étends pas non plus hors de mesure par extravagance, afin que tu ne te retrouves pas accablé de blâme et des regrets.", "german": " Und lass deine Hand nicht an deinen Nacken gefesselt sein [in äußerstem Geiz], aber strecke sie auch nicht zu weit geöffnet [in Verschwendung] aus; damit du nicht getadelt (und) zerschlagen niedersitzen musst.", "spanish": " Y no mantengas tu mano encadenada al cuello por tacañería extrema, ni la abras completamente con extravagancia; pues acabarás totalmente condenado y no servirá de nada.", "urdu": " اور تو نہ (تو بخل سے) اپنے ہاتھ کو باندھ کر اپنی گردن میں ڈال لے اور نہ (اسراف میں پڑ کر) اسے بالکل کھول دے ورنہ (یاتو) تو ملامت کا نشانہ بن کر یا تھکان کے اثر سے بیٹھ جائے گا۔"}, {"arabic": " اِنَّ رَبَّکَ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ وَ یَقۡدِرُ ؕ اِنَّہٗ کَانَ بِعِبَادِہٖ خَبِیۡرًۢا بَصِیۡرًا ﴿٪۳۱﴾", "english": " Surely, thy Lord enlarges His provision for whom He pleases, and straitens it for whom He pleases . Verily, He knows and sees His servants full well.", "french": " Assurément, ton Seigneur augmente les moyens de subsistance de Sa part pour qui Il veut, et les réduit pour qui Il veut . En vérité, Il connaît bien Ses serviteurs et les voit très bien.", "german": " Wahrlich, dein Herr erweitert und beschränkt die Mittel zum Unterhalt, wem Er will, denn Er kennt und sieht Seine Diener wohl.", "spanish": " En verdad, tu Señor amplía Sus provisiones a quien Le place, y las escatima a quien desea. Ciertamente, Él conoce y ve perfectamente bien a Sus siervos.", "urdu": " تیرا رب جس کے لئے چاہتا ہے رزق کو وسیع کر دیتا ہے اور (جس کے لئے چاہتا ہے) تنگ کرتا ہے۔ وہ یقیناً اپنے بندوں (کے حالات) کو جاننے والا (اور) دیکھنے والا ہے۔"}, {"arabic": " وَ لَا تَقۡتُلُوۡۤا اَوۡلَادَکُمۡ خَشۡیَۃَ اِمۡلَاقٍ ؕ نَحۡنُ نَرۡزُقُہُمۡ وَ اِیَّاکُمۡ ؕ اِنَّ قَتۡلَہُمۡ کَانَ خِطۡاً کَبِیۡرًا ﴿۳۲﴾", "english": " Kill not your children for fear of poverty. It is We Who provide for them and for you. Surely, the killing of them is a great sin.", "french": " Et ne tuez pas vos enfants par peur de la pauvreté. C’est Nous Qui pourvoyons à leurs besoins et aux vôtres. Assurément, les tuer est un grand péché.", "german": " Tötet eure Kinder nicht aus Furcht vor Armut; Wir sorgen für sie und für euch. Fürwahr, sie zu töten ist eine große Sünde.", "spanish": " No matéis a vuestros hijos por temor a la pobreza. Somos Nosotros Quienes proveemos para ellos y para vosotros. En verdad, su muerte es un grave pecado.", "urdu": " اور تم مفلسی کے خوف سے اپنی اولاد کو قتل مت کرو انہیں (بھی) ہم ہی رزق دیتے ہیں اور تمہیں بھی (ہم ہی دیتے ہیں) انہیں قتل کرنا یقیناً (بہت) بڑی خطا ہے۔"}, {"arabic": " وَ لَا تَقۡرَبُوا الزِّنٰۤی اِنَّہٗ کَانَ فَاحِشَۃً ؕ وَ سَآءَ سَبِیۡلًا ﴿۳۳﴾", "english": " And come not near unto adultery; surely, it is a foul thing and an evil way.", "french": " Et n’approchez pas l’adultère ; assurément, c’est une obscénité et une mauvaise voie.", "german": " Und nahet nicht dem Ehebruch; siehe, das ist eine Schändlichkeit und ein übler Weg.", "spanish": " No os acerquéis al adulterio; en verdad, es una obscenidad y un mal camino.", "urdu": " اور زنا کے قریب (بھی) نہ جاٶ‘ وہ یقیناً ایک کھلی بے حیائی اور بہت برا راستہ ہے۔"}, {"arabic": " وَ لَا تَقۡتُلُوا النَّفۡسَ الَّتِیۡ حَرَّمَ اللّٰہُ اِلَّا بِالۡحَقِّ ؕ وَ مَنۡ قُتِلَ مَظۡلُوۡمًا فَقَدۡ جَعَلۡنَا لِوَلِیِّہٖ سُلۡطٰنًا فَلَا یُسۡرِفۡ فِّی الۡقَتۡلِ ؕ اِنَّہٗ کَانَ مَنۡصُوۡرًا ﴿۳۴﴾", "english": " And kill not the soul which Allah has forbidden save for just cause. And whoso is killed wrongfully, We have surely given his heir authority to demand retaliation , but let him not exceed the prescribed bounds in slaying; for therein he is helped by law .", "french": " Et ne tuez pas l’âme qu’Allāh vous a interdit de tuer , sauf pour une cause juste. Et quiconque est tué injustement, Nous avons assurément donné autorisation à son héritier de demander des représailles ; mais qu’en tuant il ne dépasse pas les limites prescrites ; car il y est aidé par la loi .", "german": " Und tötet nicht das Leben, das Allah unverletzlich gemacht hat, es sei denn mit Recht. Und wer da freventlich getötet wird, dessen Erben haben Wir gewiss Ermächtigung gegeben (Sühne zu fordern); doch soll er bei der Tötung die (vorgeschriebenen) Grenzen nicht überschreiten, denn er findet Hilfe (im Gesetz).", "spanish": " No matéis al ser que Al-lah os ha prohibido salvo por causa justa. Y quien es matado injustamente, ciertamente hemos dado a su heredero autoridad para exigir represalia, pero sin que supere los límites prescritos al matar; pues para ello cuenta con la ayuda de la ley.", "urdu": " اور جس جان کو (مارنا) اللہ نے حرام ٹھہرایا ہے اسے (شرعی) حق کے سوا قتل نہ کرو۔ اور جو شخص مظلوم مارا جائے اس کے وارث کو ہم نے (قصاص) کا اختیار دیا ہے پس (اس کے لئے یہ ہدایت ہے کہ) وہ (قاتل کو) قتل کرنے میں (ہماری مقرر کردہ) حد سے آگے نہ بڑھے (اگر وہ حد کے اندر رہے گا) تو یقیناً (ہماری) مدد اس کے شامل حال ہوگی۔"}, {"arabic": " وَ لَا تَقۡرَبُوۡا مَالَ الۡیَتِیۡمِ اِلَّا بِالَّتِیۡ ہِیَ اَحۡسَنُ حَتّٰی یَبۡلُغَ اَشُدَّہٗ ۪ وَ اَوۡفُوۡا بِالۡعَہۡدِ ۚ اِنَّ الۡعَہۡدَ کَانَ مَسۡـُٔوۡلًا ﴿۳۵﴾", "english": " And come not near the property of the orphan, except in the best way, until he attains his maturity, and fulfil the covenant; for the covenant shall be questioned about.", "french": " Et n’approchez pas les biens de l’orphelin, sauf de la meilleure manière, jusqu’à ce qu’il atteigne sa maturité. Et remplissez le pacte ; car l’on sera interrogé au sujet du pacte.", "german": " Und nahet nicht dem Gut der Waise, es sei denn zum Besten, bis sie ihre Reife erreicht hat. Und haltet die Verpflichtung, denn über die Verpflichtung muss Rechenschaft abgelegt werden.", "spanish": " Y no os acerquéis a los bienes del huérfano, excepto de la mejor manera posible, hasta que alcance la madurez; y cumplid el pacto; pues se pedirá cuenta del pacto.", "urdu": " اور تم اس طریق کے سوا جو (یتیم کے حق میں) زیادہ اچھا ہو (کسی اور طرح) یتیم کے مال کے پاس نہ پھٹکو۔ یہاں تک کہ وہ اپنی مضبوطی کی عمر کو پہنچ جائے اور (اپنے) عہد کو پورا کرو۔ (کیونکہ) ہر عہد کی نسبت یقیناً (ایک نہ ایک دن) جواب طلبی ہوگی۔"}, {"arabic": " وَ اَوۡفُوا الۡکَیۡلَ اِذَا کِلۡتُمۡ وَ زِنُوۡا بِالۡقِسۡطَاسِ الۡمُسۡتَقِیۡمِ ؕ ذٰلِکَ خَیۡرٌ وَّ اَحۡسَنُ تَاۡوِیۡلًا ﴿۳۶﴾", "english": " And give full measure when you measure, and weigh with a right balance; that is best and most commendable in the end.", "french": " Et faites pleine mesure quand vous mesurez ; et pesez avec une balance juste ; cela vaut mieux et le résultat en est meilleur.", "german": " Und gebet volles Maß, wenn ihr messet, und wäget mit richtiger Waage; das ist durchaus vorteilhaft und letzten Endes das Beste.", "spanish": " Cuando midáis dad la medida completa y pesad con una balanza justa; esto es lo mejor y lo más recomendable en última instancia.", "urdu": " اور جب تم (کسی کو کچھ) ماپ کر دینے لگو تو ماپ پورا دیا کرو اور (جب تول کر دو تو بھی) سیدھے ترازو کے ساتھ تول کر دیا کرو۔ یہ بات سب سے بہتر اور انجام کے لحاظ سے سب سے اچھی ہے۔"}, {"arabic": " وَ لَا تَقۡفُ مَا لَیۡسَ لَکَ بِہٖ عِلۡمٌ ؕ اِنَّ السَّمۡعَ وَ الۡبَصَرَ وَ الۡفُؤَادَ کُلُّ اُولٰٓئِکَ کَانَ عَنۡہُ مَسۡـُٔوۡلًا ﴿۳۷﴾", "english": " And follow not that of which thou hast no knowledge. Verily, the ear and the eye and the heart — all these shall be called to account.", "french": " Et ne suis pas ce dont tu n’as aucun savoir. En vérité, l’oreille et l’œil et le cœur – on leur demandera à tous des comptes.", "german": " Und verfolge nicht das, wovon du keine Kenntnis hast. Wahrlich, das Ohr und das Auge und das Herz – sie alle sollen zur Rechenschaft gezogen werden.", "spanish": " No sigas lo que no conoces. En verdad, el oído, el ojo y el corazón, serán todos llamados para dar cuenta.", "urdu": " اور (اے مخاطب) جس بات کا تجھے علم نہ ہو اس کی اتباع نہ کیا کر (کیونکہ) کان اور آنکھ اور دل ان سب کے متعلق (تجھ سے) پوچھا جائے گا۔"}, {"arabic": " وَ لَا تَمۡشِ فِی الۡاَرۡضِ مَرَحًا ۚ اِنَّکَ لَنۡ تَخۡرِقَ الۡاَرۡضَ وَ لَنۡ تَبۡلُغَ الۡجِبَالَ طُوۡلًا ﴿۳۸﴾", "english": " And walk not in the earth haughtily, for thou canst not rend the earth, nor canst thou reach the mountains in height.", "french": " Et ne marche pas hautainement sur la terre, car tu ne peux pas fendre la terre, et tu ne peux pas non plus atteindre la hauteur des montagnes.", "german": " Und wandle nicht hochmütig auf Erden, denn du kannst die Erde nicht spalten, noch kannst du die Berge an Höhe erreichen.", "spanish": " No andes por la tierra con jactancia, porque así no puedes hendir la tierra ni igualar a las montañas en altura.", "urdu": " اور زمین پر اکڑ کر مت چل‘ کیونکہ نہ تو تو اس طرح ملک کی انتہا کو پہنچ سکتا ہے‘ اور نہ تو (اس طرح قوم کے) سرداروں کے بلند درجہ کو پا سکتا ہے۔"}, {"arabic": " کُلُّ ذٰلِکَ کَانَ سَیِّئُہٗ عِنۡدَ رَبِّکَ مَکۡرُوۡہًا ﴿۳۹﴾", "english": " The evil of all these is hateful in the sight of thy Lord.", "french": " Le mal de toutes ces choses est détestable aux yeux de ton Seigneur.", "german": " Das Üble alles dessen ist hassenswert vor deinem Herrn.", "spanish": " La maldad de todo esto es detestable a la Vista de tu Señor.", "urdu": " ان (حکموں) میں سے ہر ایک (فعل) کی بری صورت تیرے رب کے نزدیک ناپسندیدہ ہے۔"}, {"arabic": " ذٰلِکَ مِمَّاۤ اَوۡحٰۤی اِلَیۡکَ رَبُّکَ مِنَ الۡحِکۡمَۃِ ؕ وَ لَا تَجۡعَلۡ مَعَ اللّٰہِ اِلٰـہًا اٰخَرَ فَتُلۡقٰی فِیۡ جَہَنَّمَ مَلُوۡمًا مَّدۡحُوۡرًا ﴿۴۰﴾", "english": " This is part of that wisdom which thy Lord has revealed to thee. And set not up with Allah any other God, lest thou be cast into Hell, condemned and rejected.", "french": " Ceci fait partie de cette sagesse que ton Seigneur t’a révélée. Et n’installe aucun autre dieu avec Allāh, afin que tu ne sois pas jeté en Enfer, condamné et rejeté.", "german": " Dies ist ein Teil von der Weisheit, die dir dein Herr offenbart hat. Und setze nicht neben Allah einen anderen Gott, auf dass du nicht in die Hölle geworfen werdest, verdammt und verstoßen.", "spanish": " Esto es parte de esa sabiduría que te ha revelado tu Señor. No levantes pues ningún otro dios a la altura de Al-lah, para que no seas arrojado al Infierno, condenado y rechazado.", "urdu": " یہ (شاندار تعلیم) اس (علم اور) حکمت کا (ایک حصہ) ہے جو تیرے رب نے وحی کے ذریعہ سے تیری طرف بھیجی ہے اور تو اللہ کے ساتھ کوئی اور معبود مت بنا‘ ورنہ تو ملامت کا نشانہ بن کر (اور) دھتکارا جا کر دوزخ میں ڈال دیا جائے گا۔"}, {"arabic": " اَفَاَصۡفٰٮکُمۡ رَبُّکُمۡ بِالۡبَنِیۡنَ وَ اتَّخَذَ مِنَ الۡمَلٰٓئِکَۃِ اِنَاثًا ؕ اِنَّکُمۡ لَتَقُوۡلُوۡنَ قَوۡلًا عَظِیۡمًا ﴿٪۴۱﴾", "english": " Has, then, your Lord honoured you with sons, and taken for Himself females from among the angels? Surely, you say a grievous saying.", "french": " Alors, votre Seigneur vous aurait-Il accordé une distinction en vous accordant des fils, et aurait-Il pris pour Lui-Même des femelles de parmi les anges ? Vous dites là assurément une parole affligeante.", "german": " Hat euer Herr euch denn mit Söhnen bevorzugt und für Sich Selbst Töchter von den Engeln genommen? Wahrlich, ihr sprecht da ein großes Wort.", "spanish": " ¿Os ha distinguido, pues, vuestro Señor y ha tomado para Él hembras de entre los ángeles? En verdad, decís algo terrible.", "urdu": " کیا تمہارے رب نے تم کو لڑکوں (کی نعمت) سے مخصوص کر دیا ہے اور (خود) اس نے بعض فرشتوں کو (اپنی) لڑکیاں بنا لیا ہے۔ یقیناً تم (یہ) بڑی (خطرناک) بات کہتے ہو۔"}, {"arabic": " وَ لَقَدۡ صَرَّفۡنَا فِیۡ ہٰذَا الۡقُرۡاٰنِ لِیَذَّکَّرُوۡا ؕ وَ مَا یَزِیۡدُہُمۡ اِلَّا نُفُوۡرًا ﴿۴۲﴾", "english": " We have explained the truth in this Qur’an in the various ways that they may be admonished, but it only increases them in aversion.", "french": " Dans ce Coran Nous avons expliqué la vérité de diverses manières afin qu’ils soient avertis, mais cela ne fait qu’augmenter leur aversion.", "german": " Wir haben in diesem Qur-ân auf verschiedene Art (die Wahrheit) dargelegt, damit sie ermahnt seien, doch es mehrt nur ihren Widerwillen.", "spanish": " Hemos explicado la verdad en este Corán de diversas maneras para que sean advertidos, pero esto no hace más que aumentar su aversión.", "urdu": " اور ہم نے اس قرآن میں (ہر ایک بات کو) اس لئے بار بار بیان کیا ہے کہ وہ (اس سے) نصیحت حاصل کریں لیکن (باوجود اس کے) وہ (قرآن) انہیں (عجب اور) نفرت ہی میں بڑھا رہا ہے۔"}, {"arabic": " قُلۡ لَّوۡ کَانَ مَعَہٗۤ اٰلِـہَۃٌ کَمَا یَقُوۡلُوۡنَ اِذًا لَّابۡتَغَوۡا اِلٰی ذِی الۡعَرۡشِ سَبِیۡلًا ﴿۴۳﴾", "english": " Say, had there been other gods with Him, as they say, then they (idolaters) would have surely sought out a way to the Owner of the Throne.", "french": " Dis, « S’il y avait eu d’autres divinités avec Lui, comme ils le prétendent, alors ils - les idolâtres - auraient sûrement cherché une voie vers le Possesseur du Trône. »", "german": " Sprich: \"Gäbe es neben Ihm noch andere Götter, wie sie behaupten, dann hätten sie gewisslich einen Weg zum Herrn des Throns gesucht.\"", "spanish": " Diles: “Si hubiesen existido otros dioses con Él, como dicen ellos (los idólatras) habrían ciertamente buscado un camino para llegar al Soberano del Trono”.", "urdu": " تو کہہ (کہ) اگر ان کے قول کے مطابق اس (اللہ) کے ساتھ (کوئی) اور معبود (بھی) ہوتے تو اس صورت میں وہ (مشرکین ان معبودوں کی مدد سے) عرش والے (خدا) تک (پہنچنے کا) کوئی راستہ ضرور ڈھونڈ لیتے۔"}, {"arabic": " سُبۡحٰنَہٗ وَ تَعٰلٰی عَمَّا یَقُوۡلُوۡنَ عُلُوًّا کَبِیۡرًا ﴿۴۴﴾", "english": " Holy is He, and exalted far above that which they say.", "french": " Saint est-Il, et élevé bien au-dessus de ce qu’ils prétendent.", "german": " Heilig ist Er und hoch erhaben über all das, was sie behaupten.", "spanish": " ¡Santo es Él y Exaltado muy por encima de lo que dicen!", "urdu": " وہ ان (مشرکین) کی شرک کی باتوں سے پاک اور بہت ہی بالا ہے۔"}, {"arabic": " تُسَبِّحُ لَہُ السَّمٰوٰتُ السَّبۡعُ وَ الۡاَرۡضُ وَ مَنۡ فِیۡہِنَّ ؕ وَ اِنۡ مِّنۡ شَیۡءٍ اِلَّا یُسَبِّحُ بِحَمۡدِہٖ وَ لٰکِنۡ لَّا تَفۡقَہُوۡنَ تَسۡبِیۡحَہُمۡ ؕ اِنَّہٗ کَانَ حَلِیۡمًا غَفُوۡرًا ﴿۴۵﴾", "english": " The seven heavens and the earth and those that are therein extol His glory; and there is not a thing but glorifies Him with His praise; but you understand not their glorification. Verily, He is Forbearing, Most Forgiving.", "french": " Les sept cieux et la terre et ceux qui s’y trouvent, célèbrent Sa gloire ; et il n’y a aucune chose qui ne Le glorifie par Ses louanges ; mais vous ne comprenez pas leur glorification. En vérité, Il est Indulgent, Très-Pardonnant.", "german": " Die sieben Himmel und die Erde und wer darinnen ist, sie lobpreisen Ihn; und es gibt kein Ding, das Seine Herrlichkeit nicht preist; ihr aber versteht ihre Lobpreisung nicht. Wahrlich, Er ist langmütig, allverzeihend.", "spanish": " Los siete cielos, la tierra y los que en ella están, ensalzan Su gloria; y no hay ni una sola cosa que no Lo glorifique con Su alabanza; mas vosotros no comprendéis su glorificación. En verdad, Él es Tolerante, el Sumo Indulgente.", "urdu": " ساتوں آسمان اور زمین اور جو ان میں (بسنے والے) ہیں اس کی تسبیح کرتے ہیں اور (دنیا کی) ہر چیز اس کی تعریف کرتی ہوئی (اس کی) تسبیح کرتی ہے لیکن تم ان (اشیائ) کی تسبیح کو نہیں سمجھتے۔ وہ یقیناً پردہ پوشی کرنے والا (اور) بہت (ہی) بخشنے والا ہے۔"}, {"arabic": " وَ اِذَا قَرَاۡتَ الۡقُرۡاٰنَ جَعَلۡنَا بَیۡنَکَ وَ بَیۡنَ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ حِجَابًا مَّسۡتُوۡرًا ﴿ۙ۴۶﴾", "english": " And when thou recitest the Qur’an, We put between thee and those who believe not in the Hereafter a hidden veil;", "french": " Et lorsque tu récites le Coran, Nous mettons un voile invisible entre toi et ceux qui ne croient pas à l’au-delà ;", "german": " Und wenn du den Qur-ân vorträgst, legen Wir zwischen dich und jene, die nicht an das Jenseits glauben, einen verborgenen Schleier;", "spanish": " Cuando recitas el Corán, interponemos un velo oculto entre ti y aquellos que no creen en el Más Allá;", "urdu": " اور جب تو قرآن کو پڑھتا ہے تو (اس وقت) ہم تیرے درمیان اور ان لوگوں کے درمیان جو آخرت پر ایمان نہیں رکھتے ایک مخفی (اور عام نظروں سے پوشیدہ) پردہ پیدا کر دیتے ہیں۔"}, {"arabic": " وَّ جَعَلۡنَا عَلٰی قُلُوۡبِہِمۡ اَکِنَّۃً اَنۡ یَّفۡقَہُوۡہُ وَ فِیۡۤ اٰذَانِہِمۡ وَقۡرًا ؕ وَ اِذَا ذَکَرۡتَ رَبَّکَ فِی الۡقُرۡاٰنِ وَحۡدَہٗ وَلَّوۡا عَلٰۤی اَدۡبَارِہِمۡ نُفُوۡرًا ﴿۴۷﴾", "english": " And We put coverings over their hearts lest they should understand it, and in their ears a deafness. And when thou makest mention in the Qur’an of thy Lord alone, they turn their backs in aversion.", "french": " Et sur leurs cœurs Nous avons tiré des couvertures, de sorte qu’ils ne le comprennent pas, et dans leurs oreilles Nous avons mis une surdité. Et lorsque dans le Coran tu fais mention de Ton Seigneur, Lui Seul, ils tournent le dos avec aversion.", "german": " und Wir legen Hüllen auf ihre Herzen, so dass sie ihn nicht verstehen, und in ihre Ohren Taubheit. Und wenn du in der Lesung deinen Herrn nennst, Ihn allein, so wenden sie ihre Rücken im Widerwillen.", "spanish": " Y colocamos cubiertas sobre sus corazones, de manera que no lo comprenden, y provocamos la sordera en sus oídos. Y cuando mencionas en el Corán a tu Señor el Único, vuelven las espaldas desdeñosamente.", "urdu": " اور ہم ان کے دلوں پر کئی پردے ڈال دیتے ہیں تا کہ وہ اس (سچائی) کو سمجھ نہ سکیں اور ان کے کانوں میں بہرا پن (پیدا کر دیا) ہے اور جب تو قرآن میں اپنے رب کو جو ایک ہی ہے یاد کرتا ہے تو وہ نفرت سے اپنی پیٹھیں پھیر کر چل پڑتے ہیں۔"}, {"arabic": " نَحۡنُ اَعۡلَمُ بِمَا یَسۡتَمِعُوۡنَ بِہٖۤ اِذۡ یَسۡتَمِعُوۡنَ اِلَیۡکَ وَ اِذۡ ہُمۡ نَجۡوٰۤی اِذۡ یَقُوۡلُ الظّٰلِمُوۡنَ اِنۡ تَتَّبِعُوۡنَ اِلَّا رَجُلًا مَّسۡحُوۡرًا ﴿۴۸﴾", "english": " We know best what they listen for, when they listen to thee, and when they confer in private, when the wrongdoers say, ‘You follow none but a man who is a victim of deception.’", "french": " Nous savons mieux que quiconque ce qu’ils écoutent lorsqu’ils t’écoutent, et lorsqu’ils confèrent en secret, et que les impies disent, « Vous ne suivez qu’un homme ensorcelé. »", "german": " Wir wissen es am besten, worauf sie horchen, wenn sie dir zuhören, und wenn sie sich insgeheim bereden, dieweil die Frevler sprechen: \"Ihr folgt nur einem der Sinne beraubten Manne.\"", "spanish": " Sabemos muy bien lo que escuchan, cuando te oyen y cuando charlan en privado, cuando dicen los inicuos: “No seguís más que a un hombre víctima del engaño”.", "urdu": " (اور) جب وہ (بظاہر) تیری باتیں سن رہے ہوتے ہیں تو جس غرض کے ماتحت وہ تیری باتیں سن رہے ہوتے ہیں ہم اس کی حقیقت کو خوب جانتے ہیں اور (نیز) جب وہ باہم سرگوشی کر رہے ہوتے ہیں (اس کا بھی ہمیں علم ہوتا ہے اور) جب وہ ظالم (ایک دوسرے سے) کہہ رہے ہوتے ہیں (کہ) تم ایک فریب خوردہ شخص ہی کی پیروی کر رہے ہو (تو اس وقت بھی ہم سن رہے ہوتے ہیں)"}, {"arabic": " اُنۡظُرۡ کَیۡفَ ضَرَبُوۡا لَکَ الۡاَمۡثَالَ فَضَلُّوۡا فَلَا یَسۡتَطِیۡعُوۡنَ سَبِیۡلًا ﴿۴۹﴾", "english": " See, how they coin similitudes for thee, and have thus gone astray so that they cannot find a way.", "french": " Vois comme ils inventent pour toi des comparaisons, et ainsi ils se sont tellement égarés qu’ils ne peuvent trouver aucune voie.", "german": " Schau, wie sie von dir Gleichnisse erdichten und damit so sehr in die Irre gegangen sind, dass sie keinen Weg mehr zu finden vermögen!", "spanish": " Mira cómo inventan semejanzas para ti, mas de este modo se han extraviado, por lo que no podrán encontrar el camino.", "urdu": " دیکھ انہوں نے تیرے متعلق کس طرح باتیں بنائی ہیں جس کے نتیجہ میں وہ گمراہ ہو گئے ہیں اور (اب) وہ (ہدایت کے حاصل کرنے کے لئے) کوئی راہ نہیں پا سکتے۔"}, {"arabic": " وَ قَالُوۡۤاءَ اِذَا کُنَّا عِظَامًا وَّ رُفَاتًاءَ اِنَّا لَمَبۡعُوۡثُوۡنَ خَلۡقًا جَدِیۡدًا ﴿۵۰﴾", "english": " And they say, ‘When we shall have become bones and broken particles, shall we be really raised up as a new creation?’", "french": " Et ils disent, « Quand nous serons devenus ossements et parcelles brisées, serons-nous réellement ressuscités en une nouvelle création ? »", "german": " Und sie sprechen: \"Wenn wir Gebeine und Staub geworden sind, sollen wir dann wirklich zu einer neuen Schöpfung auferweckt werden?\"", "spanish": " Pues dicen: “Cuando nos convirtamos en huesos y partículas, ¿seremos realmente resucitados como nueva criatura?”.", "urdu": " اور انہوں نے (یہ بھی) کہا ہے (کیا) جب ہم (مرکر) ہڈیاں ہو جائیں گے اور کچھ عرصہ کے بعد گل کر ہڈیوں کا (بھی) چورا بن جائیں گے (تو ہمیں از سر نو زندہ کیا جائے گا اور) کیا واقعی ہمیں ایک نئی مخلوق کی صورت میں اٹھایا جائے گا؟"}, {"arabic": " قُلۡ کُوۡنُوۡا حِجَارَۃً اَوۡ حَدِیۡدًا ﴿ۙ۵۱﴾", "english": " Say, ‘Be ye stones or iron,", "french": " Dis, « Soyez pierre ou fer,", "german": " Sprich: \"Ob ihr Steine seid oder Eisen</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:51&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:51&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic52\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic52\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:52' style='text-decoration:underline'>17:52</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(52)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control52\"></i></button> <audio id=\"player52\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَوۡ خَلۡقًا مِّمَّا یَکۡبُرُ فِیۡ صُدُوۡرِکُمۡ ۚ فَسَیَقُوۡلُوۡنَ مَنۡ یُّعِیۡدُنَا ؕ قُلِ الَّذِیۡ فَطَرَکُمۡ اَوَّلَ مَرَّۃٍ ۚ فَسَیُنۡغِضُوۡنَ اِلَیۡکَ رُءُوۡسَہُمۡ وَ یَقُوۡلُوۡنَ مَتٰی ہُوَ ؕ قُلۡ عَسٰۤی اَنۡ یَّکُوۡنَ قَرِیۡبًا ﴿۵۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Or created matter of <em>any kind</em> which appears hardest in your minds, <I>even then shall you be raised up</I>.’ Then will they ask, ‘Who shall restore us to life?’ Say, ‘He Who created you the first time.’ They will then shake their heads at thee and say, ‘When will it be?’ Say, ‘Maybe it is nigh,</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Or created matter of <i>any kind </i>which appears hardest<sup class='ref'>[<a class='ref' data-id='ref_17_52_1624' href='#'>1624</a>]</sup> in your minds, <i>even then shall you be raised up.</i>’ <sup class='ref'>[<a class='ref' data-id='ref_17_52_d' href='#'>d</a>]</sup>Then will they ask, ‘Who shall restore us to life?’ Say, ‘He Who created you the first time.’ Still they will shake their heads at thee and say, <sup class='ref'>[<a class='ref' data-id='ref_17_52_e' href='#'>e</a>]</sup>‘When will it be?’ Say, ‘May be, it is nigh, <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_17_52_1624'>1624</span><span class='collapsible plus' data-id='ref_17_52_d'>d</span><span class='collapsible plus' data-id='ref_17_52_e'>e</span></div> <div><a name='1624'></a><div class='reference' data-id='ref_17_52_1624' style='display:none'> <p><b>1624.</b> The verse may either be taken as saying to disbelievers that even if their hearts should become hard like iron or stone or any other similar substance, God would bring about among them that wholesome change which He has decreed to bring about through the Holy Prophet. Or, it may be taken as answering their doubts about Resurrection mentioned in the previous verse, and says to them that they could not escape Divine punishment even if they became converted into iron or stone or any other hard substance. (<a href='javascript:void(0)' data-id='ref_17_52_1624' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_17_52_d' style='display:none'> <p><b>d.</b> <a href='/quran/36:79' target=_blank>36:79</a>, <a href='/quran/36:80' target=_blank>80</a>. (<a href='javascript:void(0)' data-id='ref_17_52_d' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_17_52_e' style='display:none'> <p><b>e.</b> <a href='/quran/34:30' target=_blank>34:30</a>; <a href='/quran/36:49' target=_blank>36:49</a>; <a href='/quran/67:26' target=_blank>67:26</a>. (<a href='javascript:void(0)' data-id='ref_17_52_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یا ایسی مخلوق جو تمہاری دانست میں (سختی میں) اس سے بھی بڑھ کر ہو۔ تواس پر وہ ضرور کہیں گے کہ کون (ہے جو) ہمیں لوٹائے گا؟ تُو کہہ دے وہی جس نے تمہیں پہلی مرتبہ پیداکیا تھا۔ تو وہ تیری طرف (منہ کرکے) اپنے سر مٹکائیں گے اور کہیں گے ایسا کب ہوگا؟ تُو کہہ دے ہو سکتا ہے کہ جلد ایسا ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یا کوئی اور ایسی مخلوق جو تمہارے دلوں میں ان سے بھی سخت نظر آتی ہو (تب بھی تم کو دوبارہ زندہ کیا جائے گا) (یہ سن کر) وہ ضرور کہیں گے (کہ) کون ہمیں دوبارہ (زندہ کرکے وجود میں) لائے گا۔ تو (انہیں) کہہ (کہ) وہی (خدا) جس نے تمہیں پہلی بار پیدا کیا تھا۔ اس پر وہ لازماً تعجب سے تمہاری طرف (دیکھتے ہوئے) سر ہلائیں گے اور کہیں گے (کہ) یہ (زندہ کیے جانے کا معاملہ) کب ہوگا؟ (جب وہ ایسا کہیں تو) تو (ان سے) کہہ (کہ) بالکل ممکن ہے کہ وہ (وقت اب) قریب (آچکا) ہو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ou une telle créature qui, dans votre esprit, soit plus dure<em>que la pierre et le fer</em>, <em>même alors vous serez ressuscités</em>. » Ensuite ils demanderont, « Qui <em>donc</em> nous fera revenir <em>à la vie</em> ? » Dis, « Celui Qui vous a créés la première fois. » Ils secoueront la tête vers toi et te diront, « Quand cela arrivera-t-il ? » Dis, « Il se peut que ce soit proche ;</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“O materia creada de <em>cualquier tipo</em> de lo que parezca más ifícil para vuestras mentes, <em>incluso entonces seréis resucitados”.</em> Entonces preguntarán: “¿quién nos devolverá la vida?”. Diles: “Quien os creó la primera vez”. Entonces moverán sus cabezas hacia ti y dirán: “¿cuándo será eso?”. Diles: “Tal vez esté cerca”,</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">oder sonst geschaffener Stoff von der Art, die in eurem Sinn am schwersten wiegt.\" Dann werden sie sprechen: \"Wer soll uns ins Leben zurückrufen?\" Sprich: \"Er, Der euch das erste Mal erschuf.\" Dann werden sie ihre Köpfe wider dich schütteln und sprechen: \"Wann geschieht es?\" Sprich: \"Vielleicht geschieht es gar bald.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:52&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:52&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic53\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic53\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:53' style='text-decoration:underline'>17:53</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(53)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control53\"></i></button> <audio id=\"player53\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">یَوۡمَ یَدۡعُوۡکُمۡ فَتَسۡتَجِیۡبُوۡنَ بِحَمۡدِہٖ وَ تَظُنُّوۡنَ اِنۡ لَّبِثۡتُمۡ اِلَّا قَلِیۡلًا ﴿٪۵۳﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘<em>It will be </em>on the day when He will call you; then will you respond praising Him and you will think that you have tarried but a little while.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘<i>It will be </i>on the day when He will call you; then you will respond praising Him and you will think that <sup class='ref'>[<a class='ref' data-id='ref_17_53_a' href='#'>a</a>]</sup>you have tarried <i>in the world </i>but a little while.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_17_53_a'>a</span></div> <div><div class='reference' data-id='ref_17_53_a' style='display:none'> <p><b>a.</b> <a href='/quran/20:105' target=_blank>20:105</a>; <a href='/quran/23:114' target=_blank>23:114</a>, <a href='/quran/23:115' target=_blank>115</a>. (<a href='javascript:void(0)' data-id='ref_17_53_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">جس دن وہ تمہیں بُلائے گا اور تم اس کی حمد کے ساتھ لبیک کہو گے اور تم گمان کروگے کہ تم تھوڑی سی مدت کے سوا نہیں رہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(یہ وعدہ اس دن پورا ہوگا) جس دن وہ تمہیں بلائے گا تو تم اس کی تعریف کرتے ہوئے اس کا حکم مانو گے (اور فوراً حاضر ہو جاٶ گے) اور تم سمجھ رہے ہوگے کہ تم (دنیا میں) تھوڑا ہی ٹھہرے تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Ce sera</em> le jour où Il vous appellera ; alors vous répondrez en<em>chantant</em> Ses louanges, et vous penserez que vous n’êtes demeurés <em>dans le monde</em> que peu de temps. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“<em>Será</em> en el día en el que Él os llame; entonces responderéis, glorificándole y pensaréis que sólo os habéis detenido poco tiempo”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">An dem Tage, an dem Er euch ruft, da werdet ihr antworten, mit Seinem Preis, und werdet meinen, ihr hättet nur eine geringe Weile gesäumt.\"", "spanish": " Diles: “Aunque fueseis piedras o hierro”,", "urdu": " تو (انہیں) کہہ (کہ) تم (خواہ) پتھر بن جاٶ یا لوہا۔"}, {"arabic": " وَ قُلۡ لِّعِبَادِیۡ یَقُوۡلُوا الَّتِیۡ ہِیَ اَحۡسَنُ ؕ اِنَّ الشَّیۡطٰنَ یَنۡزَغُ بَیۡنَہُمۡ ؕ اِنَّ الشَّیۡطٰنَ کَانَ لِلۡاِنۡسَانِ عَدُوًّا مُّبِیۡنًا ﴿۵۴﴾", "english": " And say to My servants that they should speak that which is best. Surely, Satan stirs up discord among them. Surely, Satan is an open enemy to man.", "french": " Et dis à Mes serviteurs qu’ils doivent toujours dire ce qui est meilleur. Assurément, Satan fomente la discorde parmi eux. Assurément, Satan est, pour l’homme, un ennemi déclaré.", "german": " Sage Meinen Dienern, sie möchten nur das Beste reden, denn Satan stiftet zwischen ihnen Zwietracht. Satan ist dem Menschen fürwahr ein offenkundiger Feind.", "spanish": " Di a Mis siervos que deben hablar lo mejor. En verdad, Satanás siembra la discordia entre ellos. Ciertamente Satanás es un enemigo declarado del hombre.", "urdu": " اور تو میرے بندوں سے کہہ (کہ) وہی بات کہا کریں جو (سب سے) زیادہ اچھی ہو (کیونکہ) شیطان یقیناً ان کے درمیان فساد ڈالتا رہتا ہے۔ شیطان انسان کا کھلا (کھلا) دشمن ہے۔"}, {"arabic": " رَبُّکُمۡ اَعۡلَمُ بِکُمۡ ؕ اِنۡ یَّشَاۡ یَرۡحَمۡکُمۡ اَوۡ اِنۡ یَّشَاۡ یُعَذِّبۡکُمۡ ؕ وَ مَاۤ اَرۡسَلۡنٰکَ عَلَیۡہِمۡ وَکِیۡلًا ﴿۵۵﴾", "english": " Your Lord knows you best. If He please, He will have mercy on you; or if He please, He will punish you. And We have not sent thee to be a keeper over them.", "french": " Votre Seigneur vous connaît le mieux. S’Il le veut, Il aura pitié de vous ; ou s’Il le veut, Il vous châtiera. Et Nous ne t’avons pas envoyé pour être leur gardien.", "german": " Euer Herr kennt euch am besten. Wenn Er will, so wird Er Sich euer erbarmen, oder wenn Er will, so wird Er euch strafen. Und Wir haben dich nicht entsandt als einen Wächter über sie.", "spanish": " Vuestro Señor os conoce muy bien. Si Le place, tendrá misericordia de vosotros; o si quiere, os castigará. Pero no te hemos enviado como guardián de ellos.", "urdu": " تمہارا رب تمہیں (سب سے) زیادہ جانتا ہے اگر وہ چاہے گا تو تم پر رحم کرے گا اور اگر وہ چاہے گا تو تمہیں عذاب دے گا اور (اے رسول)! ہم نے تجھے ان کا ذمہ وار بنا کر نہیں بھیجا۔"}, {"arabic": " وَ رَبُّکَ اَعۡلَمُ بِمَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ لَقَدۡ فَضَّلۡنَا بَعۡضَ النَّبِیّٖنَ عَلٰی بَعۡضٍ وَّ اٰتَیۡنَا دَاوٗدَ زَبُوۡرًا ﴿۵۶﴾", "english": " And thy Lord knows best those that are in the heavens and the earth. And We exalted some of the Prophets over the others, and to David We gave a Book.", "french": " Et ton Seigneur connaît le mieux ceux qui sont dans les cieux et sur la terre. Et Nous avons élevé certains d’entre les Prophètes au-dessus d’autres, et à David Nous avons donné le Zabūr.", "german": " Dein Herr kennt am besten jene, die in den Himmeln und auf der Erde sind. Wir erhöhten einige der Propheten über die anderen, und David gaben Wir ein Buch.", "spanish": " Y tu Señor conoce muy bien a quienes están en los cielos y en la tierra. Hemos exaltado a algunos de los Profetas sobre los otros, y entregamos a David los Zabur.", "urdu": " اور جو (وجود بھی) آسمانوں اور زمین میں (بسنے والے) ہیں انہیں تمہارا رب (سب سے) زیادہ جانتا ہے اور ہم نے یقیناً انبیاء میں سے بعض کو بعض (دوسرے انبیائ) پر فضیلت دی ہے اور داٶد کو (بھی) ہم نے زبور دی تھی۔"}, {"arabic": " قُلِ ادۡعُوا الَّذِیۡنَ زَعَمۡتُمۡ مِّنۡ دُوۡنِہٖ فَلَا یَمۡلِکُوۡنَ کَشۡفَ الضُّرِّ عَنۡکُمۡ وَ لَا تَحۡوِیۡلًا ﴿۵۷﴾", "english": " Say, ‘Call on those whom you think to be gods beside Him; then you will know that they have no power to remove affliction from you or to avert it .", "french": " Dis : « Faites appel à ceux que vous pensez être des dieux en dehors de Lui ; vous saurez alors qu’ ils n’ont aucun pouvoir pour vous enlever une affliction, ou pour l ’écarter.", "german": " Sprich: \"Rufet doch die an, die ihr neben Ihm wähnet; sie haben keine Macht, das Unheil von euch zu nehmen noch abzuwenden.\"", "spanish": " Diles: “Invocad a quienes pensáis que son dioses en lugar de Él; entonces sabréis que no tienen poder para libraros de la adversidad ni apartarla de vosotros.", "urdu": " تو (انہیں) کہہ (کہ) جن لوگوں کے متعلق تمہارا دعویٰ ہے کہ وہ اس کے سوا الوہیت رکھتے ہیں انہیں (اپنی مدد کے لئے) پکارو (تو تمہیں معلوم ہو جائے گا کہ) نہ وہ (تمہاری کسی) تکلیف کو تم سے دور کرنے کا اختیار رکھتے ہیں اور نہ (تمہاری حالت میں) کوئی تبدیلی پیدا کرنے کی (طاقت رکھتے ہیں) ۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ یَدۡعُوۡنَ یَبۡتَغُوۡنَ اِلٰی رَبِّہِمُ الۡوَسِیۡلَۃَ اَیُّہُمۡ اَقۡرَبُ وَ یَرۡجُوۡنَ رَحۡمَتَہٗ وَ یَخَافُوۡنَ عَذَابَہٗ ؕ اِنَّ عَذَابَ رَبِّکَ کَانَ مَحۡذُوۡرًا ﴿۵۸﴾", "english": " Those whom they call on themselves seek nearness to their Lord — even those of them who are nearest — and hope for His mercy, and fear His punishment. Surely, the punishment of thy Lord is a thing to be feared.", "french": " Ceux à qui ils font appel cherchent eux-mêmes, à qui mieux mieux, le moyen de se rapprocher le plus de leur Seigneur – et espèrent Sa miséricorde, et redoutent Son châtiment. Assurément, le châtiment de ton Seigneur est chose à redouter.", "german": " Jene, die sie anrufen, suchen selbst die Nähe ihres Herrn – wer von ihnen am nächsten sei – und hoffen auf Sein Erbarmen und fürchten Seine Strafe. Wahrlich, die Strafe deines Herrn ist etwas zu Fürchtendes.", "spanish": " Aquellos a quienes invocan buscan ellos mismos la cercanía a su Señor –i ncluso los que están más cerca– y esperan Su misericordia y temen Su castigo. En verdad, el castigo de tu Señor es una cosa temible.", "urdu": " وہ لوگ جنہیں وہ پکارتے ہیں وہ بھی اپنے رب کے قرب کے لئے کوئی ذریعہ تلاش کرتے ہیں (یعنی یہ دیکھتے رہتے ہیں) کہ کون خدا کے زیادہ قریب ہے (تا کہ ہم اس کی مدد حاصل کریں) اور وہ ہمیشہ اس کی رحمت کے امیدوار رہتے ہیں اور اس کے عذاب سے ڈرتے رہتے ہیں۔ تیرے رب کا عذاب یقیناً ایسا ہے جس سے خوف کیا جاتا ہے۔"}, {"arabic": " وَ اِنۡ مِّنۡ قَرۡیَۃٍ اِلَّا نَحۡنُ مُہۡلِکُوۡہَا قَبۡلَ یَوۡمِ الۡقِیٰمَۃِ اَوۡ مُعَذِّبُوۡہَا عَذَابًا شَدِیۡدًا ؕ کَانَ ذٰلِکَ فِی الۡکِتٰبِ مَسۡطُوۡرًا ﴿۵۹﴾", "english": " There is not a township but We shall destroy it before the Day of Resurrection, or punish it with a severe punishment. That is written down in the Book.", "french": " Il n’y a aucune ville que Nous ne détruirons avant le Jour de la Résurrection, ou que Nous ne châtierons d’un châtiment rigoureux. Cela est consigné par écrit dans le Livre.", "german": " Es gibt keine Stadt, die Wir nicht vernichten werden vor dem Tage der Auferstehung oder züchtigen mit strenger Züchtigung. Das ist niedergeschrieben in dem Buch.", "spanish": " No existe ciudad alguna a la que no destruyamos antes del Día de la Resurrección, o a la que castiguemos con un severo castigo. Esto está escrito en el Libro.", "urdu": " اور (روئے زمین پر) کوئی ایسی بستی نہیں (ہوگی) جسے ہم قیامت کے دن سے پہلے ہلاک نہ کر دیں یا اسے بہت سخت عذاب نہ دیں۔ یہ بات تقدیر (الٰہی) میں (پہلے سے) لکھی ہوئی ہے۔"}, {"arabic": " وَ مَا مَنَعَنَاۤ اَنۡ نُّرۡسِلَ بِالۡاٰیٰتِ اِلَّاۤ اَنۡ کَذَّبَ بِہَا الۡاَوَّلُوۡنَ ؕ وَ اٰتَیۡنَا ثَمُوۡدَ النَّاقَۃَ مُبۡصِرَۃً فَظَلَمُوۡا بِہَا ؕ وَ مَا نُرۡسِلُ بِالۡاٰیٰتِ اِلَّا تَخۡوِیۡفًا ﴿۶۰﴾", "english": " And nothing could hinder Us from sending Signs, except that the former people rejected them, but this is no hindrance . And We gave Thamud the she-camel as a clear Sign, but they unjustly rejected it. And We send not Signs but to warn.", "french": " Et rien ne peut Nous empêcher d’envoyer des Signes, à part le fait que les peuples anciens les rejetèrent. Et Nous avons donné aux Thamūd la chamelle comme un Signe très clair, mais ils la traitèrent injustement. Et Nous n’envoyons des Signes que pour avertir.", "german": " Und nichts könnte Uns hindern, Zeichen zu senden, als dass die Früheren sie verworfen hatten. Und Wir gaben den Thamûd die Kamelstute als ein sichtbares Zeichen, doch sie frevelten an ihr. Wir senden Zeichen, nur um zu warnen.", "spanish": " Y nada pudo impedirnos el envío de los Signos, salvo que los ueblos anteriores los rechazaron, aunque esto no constituyó un obstáculo . Y dimos la camella a los Zamud como Signo claro, pero ellos la trataron injustamente. Y sólo enviamos los Signos para amonestarlos.", "urdu": " کیا ہمیں نشانات کے بھیجنے میں اس کے سوا اور کوئی (امر) مانع ہو سکتا ہے کہ پہلے لوگوں نے (ان نشانات کو) جھٹلا دیا تھا (اور ان سے کوئی فائدہ نہ اٹھایا تھا لیکن یہ کوئی وجہ نشان بھیجنے سے رکنے کی نہیں) چنانچہ (جب) ہم نے ثمود (کی قوم) کو ایک اونٹنی ایک روشن نشان کے طور پر دی تو انہوں نے اس پر ظلم کیا اور ہم نشانوں کو (بدانجام سے) ڈرانے کے لئے ہی بھیجا کرتے ہیں۔"}, {"arabic": " وَ اِذۡ قُلۡنَا لَکَ اِنَّ رَبَّکَ اَحَاطَ بِالنَّاسِ ؕ وَ مَا جَعَلۡنَا الرُّءۡیَا الَّتِیۡۤ اَرَیۡنٰکَ اِلَّا فِتۡنَۃً لِّلنَّاسِ وَ الشَّجَرَۃَ الۡمَلۡعُوۡنَۃَ فِی الۡقُرۡاٰنِ ؕ وَ نُخَوِّفُہُمۡ ۙ فَمَا یَزِیۡدُہُمۡ اِلَّا طُغۡیَانًا کَبِیۡرًا ﴿٪۶۱﴾", "english": " And remember the time when We said to thee: ‘Surely, thy Lord has encompassed the people.’ And We made not the vision which We showed thee but as a trial for men, as also the tree cursed in the Qur’an. And We warn them, but it only increases them in great transgression.", "french": " Et souviens-toi lorsque Nous t’avons dit : « Assurément, ton Seigneur cerne les gens. » Et Nous n’avons fait la vision que Nous t’avons montrée que comme une épreuve pour les hommes, tout comme l’arbre maudit dans le Coran. Et Nous les avertissons, mais cela ne fait pour eux qu’accentuer leur grande transgression.", "german": " Und (gedenke der Zeit) da Wir zu dir sprachen: \"Dein Herr umfasst die Menschen.\" Und Wir haben das Traumgesicht, das Wir dich sehen ließen, nur als eine Prüfung für die Menschen gemacht und ebenso den verfluchten Baum im Qur-ân. Und Wir warnen sie, jedoch es bestärkt sie nur in großer Ruchlosigkeit.", "spanish": " Y acuérdate de cuando te dijimos: “En verdad, tu Señor ha rodeado a las gentes”. La visión que te mostramos sólo fue una prueba para los hombres, como también lo fue el árbol maldito en el Corán. Y les exhortamos, pero eso no hace más que acrecentar en ellos su gran rebeldía.", "urdu": " اور جب ہم نے تجھے کہا تھا (کہ) تمہارا رب ضرور ان لوگوں کو ہلاک (کرنے کا فیصلہ) کر چکا ہے (تب بھی انہوں نے فائدہ نہیں اٹھایا) اور جو رٶیا ہم نے تجھے دکھائی تھی اسے (بھی) اور اس درخت کو (بھی) جسے قرآن میں ملعون قرار دیا گیا ہے ہم نے لوگوں کے لئے صرف امتحان کا ذریعہ بنایا تھا اور(باوجود اس کے کہ) ہم انہیں ڈراتے (چلے جاتے) ہیں پھر (بھی) وہ (یعنی ہمارا ڈرانا) انہیں ایک خطرناک سرکشی میں بڑھا رہا ہے۔"}, {"arabic": " وَ اِذۡ قُلۡنَا لِلۡمَلٰٓئِکَۃِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡۤا اِلَّاۤ اِبۡلِیۡسَ ؕ قَالَ ءَاَسۡجُدُ لِمَنۡ خَلَقۡتَ طِیۡنًا ﴿ۚ۶۲﴾", "english": " And remember the time when We said to the angels, ‘Submit to Adam,’ and they all submitted, except Iblis. He said, ‘Shall I submit to one whom Thou hast created of clay?’", "french": " Et souviens-toi lorsque Nous dîmes aux anges : « Soumettez-vous à Adam, » et tous ils se soumirent excepté Iblīs. Il dit : « Dois-je me soumettre à quelqu’un que Tu as créé d’argile ? »", "german": " Als Wir zu den Engeln sprachen: \"Bezeuget Adam Ehrerbietung\", da bezeugten sie Ehrerbietung. Nur Iblis nicht. Er sprach: \"Soll ich mich beugen vor einem, den Du aus Ton erschaffen hast?\"", "spanish": " Y acuérdate de cuando dijimos a los ángeles: “Someteos a Adán”, y todos ellos se sometieron, excepto Iblis. Dijo: “¿Acaso debo someterme a quien creaste de barro?”.", "urdu": " اور (اس وقت کو بھی یاد کرو) جب ہم نے فرشتوں کو کہا تھا (کہ) تم آدم کے ساتھ (مل) کر سجدہ کرو تو انہوں نے (اس حکم کے مطابق آدم کے ساتھ مل کر) سجدہ کیا تھا۔ مگر ابلیس نے (نہ کیا تھا) اس نے کہا تھا (کہ) کیا میں اس (بشر) کے ساتھ (مل کر) سجدہ کروں جسے تو نے کیچڑ سے پیدا کیا ہے۔"}, {"arabic": " قَالَ اَرَءَیۡتَکَ ہٰذَا الَّذِیۡ کَرَّمۡتَ عَلَیَّ ۫ لَئِنۡ اَخَّرۡتَنِ اِلٰی یَوۡمِ الۡقِیٰمَۃِ لَاَحۡتَنِکَنَّ ذُرِّیَّتَہٗۤ اِلَّا قَلِیۡلًا ﴿۶۳﴾", "english": " And he said, ‘What thinkest Thou? Can this whom Thou hast honoured above me be my superior ? If Thou wilt grant me respite till the Day of Resurrection, I will most surely bring his descendants under my sway except a few.’", "french": " Il dit : « Vois un peu ! Est-ce là celui que Tu as préféré à moi ? Si Tu voulais bien m’accorder un répit jusqu’au Jour de la Résurrection, très certainement je détruirais ses descendants, un petit nombre excepté. »", "german": " Er sprach (weiter): \"Was dünket Dich? Dieser ist´s, den Du höher geehrt hast als mich! Willst Du mir Frist geben bis zum Tage der Auferstehung, so will ich gewisslich Gewalt erlangen über seine Nachkommen, bis auf wenige.\"", "spanish": " Y dijo: “¿Qué piensas Tú? Éste es aquel a quien preferiste sobre mí. Si me concedes un respiro hasta el Día de la Resurrección, ciertamente pondré a sus descendientes bajo mi dominio, excepto a unos pocos”.", "urdu": " (نیز) اس نے کہا (کہ اے اللہ! تو ہی مجھے) بتا کہ کیا یہ (میرا مطاع ہو سکتا) ہے جسے تو نے مجھ پر شرف دے دیا ہے اگر تو نے مجھے قیامت کے دن تک مہلت دی تو (مجھے تیری ہی ذات کی قسم ہے کہ) میں اس کی (تمام) اولاد کو قابو میں کرلوں گا۔ سوائے تھوڑے سے لوگوں کے (جنہیں تو بچالے) ۔"}, {"arabic": " قَالَ اذۡہَبۡ فَمَنۡ تَبِعَکَ مِنۡہُمۡ فَاِنَّ جَہَنَّمَ جَزَآؤُکُمۡ جَزَآءً مَّوۡفُوۡرًا ﴿۶۴﴾", "english": " He said, ‘Begone! and whoso shall follow thee from among them, Hell shall surely be the recompense of you all — an ample recompense.", "french": " Allāh dit : « Va-t’en ! Et quant à ceux d’entre eux qui te suivront, c’est l’Enfer qui sera assurément la récompense de vous tous – une ample récompense.", "german": " Er sprach: \"Fort mit dir! und wer von ihnen dir folgt, fürwahr, die Hölle soll euer aller Lohn sein, ein ausgiebiger Lohn.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:64&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:64&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic65\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic65\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:65' style='text-decoration:underline'>17:65</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(65)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control65\"></i></button> <audio id=\"player65\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اسۡتَفۡزِزۡ مَنِ اسۡتَطَعۡتَ مِنۡہُمۡ بِصَوۡتِکَ وَ اَجۡلِبۡ عَلَیۡہِمۡ بِخَیۡلِکَ وَ رَجِلِکَ وَ شَارِکۡہُمۡ فِی الۡاَمۡوَالِ وَ الۡاَوۡلَادِ وَ عِدۡہُمۡ ؕ وَ مَا یَعِدُہُمُ الشَّیۡطٰنُ اِلَّا غُرُوۡرًا ﴿۶۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And entice whomsoever of them thou canst, with thy voice, and urge against them thy horsemen and thy footmen and be their partner in wealth, and children, and make promises to them.’ And Satan promises them naught but deceit.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_17_65_c' href='#'>c</a>]</sup>‘And entice whomsoever of them thou canst with thy voice, and urge against them thy horsemen and thy footmen and share with them in wealth, and <i>their </i>children, and make promises to them.’<sup class='ref'>[<a class='ref' data-id='ref_17_65_1632' href='#'>1632</a>]</sup> <sup class='ref'>[<a class='ref' data-id='ref_17_65_a' href='#'>a</a>]</sup>And Satan promises them naught but deceit. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_17_65_c'>c</span><span class='collapsible plus' data-id='ref_17_65_1632'>1632</span><span class='collapsible plus' data-id='ref_17_65_a'>a</span></div> <div><div class='reference' data-id='ref_17_65_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:18' target=_blank>7:18</a>. (<a href='javascript:void(0)' data-id='ref_17_65_c' class='ref'>close</a>)</p> </div> </div><div><a name='1632'></a><div class='reference' data-id='ref_17_65_1632' style='display:none'> <p><b>1632.</b> The verse describes the three devices that are adopted by the sons of darkness to entice men away from the right way: (1) They try to intimidate the poor and the weak by holding out threats of violence to them. (2) They use more drastic measures against those who are not frightened by verbal threats of violence by forming alliances against them and making a concerted attack upon them and persecuting and oppressing them in every way. (3) They seek to entice away the powerful and the more influential by offering to make them their leaders if only they cease to support the cause of truth. (<a href='javascript:void(0)' data-id='ref_17_65_1632' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_17_65_a' style='display:none'> <p><b>a.</b> <a href='/quran/4:121' target=_blank>4:121</a>; <a href='/quran/14:23' target=_blank>14:23</a>. (<a href='javascript:void(0)' data-id='ref_17_65_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس اپنی آواز سے ان میں سے جسے چاہے بہکا اور ان پر اپنے سوار اور پیادے چڑھا لا اور اموال میں اور اولاد میں ان کا شریک بن جا اور ان سے وعدے کر۔ اور شیطان دھوکے کے سوا ان سے کوئی وعدہ نہیں کرتا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور (ہم نے کہا جا) ان میں سے جس پر تیرا بس چلے اسے اپنی آواز سے فریب دے کر (اپنی طرف) بلا اور اپنے سواروں اور پیادوں کو ان پر چڑھالا۔ اور (ان کے) مالوں اور اولادوں میں ان کا حصہ دار بن اور ان سے (جھوٹے) وعدے کر (اور پھر اپنی کوششوں کا نتیجہ دیکھ) اور شیطان جو وعدے بھی کرتا ہے فریب کی نیت ہی سے کرتا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et séduis ceux d’entre eux que tu pourras, par ta voix, et envoie contre eux ta cavalerie et ton infanterie, et sois leur associé en biens et en enfants, et fais-leur des promesses. Et Satan ne leur promet que des tromperies.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y seduce a quienes puedas de ellos con tu voz, y lanza contra ellos tus caballos y tus hombres y asóciate con ellos en la riqueza y en los hijos, y hazles promesas”. Mas Satanás no promete sino el engaño.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und betöre nun von ihnen, wen du vermagst, mit deiner Stimme und treibe gegen sie dein Ross und deinen Fuß und sei ihr Teilhaber an Vermögen und Kindern und mache ihnen Versprechungen.\" – Und Satan verspricht ihnen nur Trug. –", "spanish": " Dijo: “¡Vete!: tú y quienes te sigan de entre ellos; el Infierno será en verdad la recompensa de todos vosotros, una abundante recompensa”;", "urdu": " (اللہ نے) فرمایا‘ چل (دُور ہو) کیونکہ تیری بھی اور ان میں سے جو تیری پیروی کریں‘ (ان کی بھی) سزا جہنم ہے (اور یہ) پورا پورا بدلہ (ہے)"}, {"arabic": " اِنَّ عِبَادِیۡ لَیۡسَ لَکَ عَلَیۡہِمۡ سُلۡطٰنٌ ؕ وَ کَفٰی بِرَبِّکَ وَکِیۡلًا ﴿۶۶﴾", "english": " As to My servants, thou shalt certainly have no power over them, and sufficient is thy Lord as a Guardian.", "french": " Quant à Mes serviteurs, tu n’auras certainement aucun pouvoir sur eux, et ton Seigneur suffit comme Protecteur. »", "german": " Über Meine Diener aber wirst du gewiss keine Macht haben. Und dein Herr genügt als Beschützer.", "spanish": " En cuanto a Mis siervos, ciertamente no tendrás poder sobre ellos, pues te basta tu Señor como Guardián.", "urdu": " جو میرے بندے ہیں‘ ان پر ہرگز تیرا تسلط نہیں (ہوسکتا) اور (اے میرے بندے)! تیرا رب کارسازی میں (تیرے لئے) کافی ہے۔"}, {"arabic": " رَبُّکُمُ الَّذِیۡ یُزۡجِیۡ لَکُمُ الۡفُلۡکَ فِی الۡبَحۡرِ لِتَبۡتَغُوۡا مِنۡ فَضۡلِہٖ ؕ اِنَّہٗ کَانَ بِکُمۡ رَحِیۡمًا ﴿۶۷﴾", "english": " Your Lord is He Who drives for you the ships in the sea, that you may seek of His bounty. Surely, He is merciful toward you.", "french": " Votre Seigneur est Celui Qui fait voguer pour vous les navires sur la mer, afin que vous puissiez rechercher quelque munificence de Sa part. Assurément, Il est Miséricordieux envers vous.", "german": " Euer Herr ist es, Der die Schiffe auf dem Meere für euch treibt, auf dass ihr nach Seiner Gnade trachten möget. Fürwahr, Er ist gegen euch barmherzig.", "spanish": " Vuestro Señor es Quien os conduce los buques por el mar, para que busquéis de Su magnanimidad. En verdad, Él es Misericordioso con vosotros.", "urdu": " (اور اے میرے بندو)! تمہارا رب (تو) وہ ہے جو تمہارے لئے کشتیوں کو سمندر میں چلاتا ہے تا کہ تم اس کے فضل کو ڈھونڈو۔ وہ یقیناً تم پر باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ اِذَا مَسَّکُمُ الضُّرُّ فِی الۡبَحۡرِ ضَلَّ مَنۡ تَدۡعُوۡنَ اِلَّاۤ اِیَّاہُ ۚ فَلَمَّا نَجّٰٮکُمۡ اِلَی الۡبَرِّ اَعۡرَضۡتُمۡ ؕ وَ کَانَ الۡاِنۡسَانُ کَفُوۡرًا ﴿۶۸﴾", "english": " And when harm touches you on the sea, all those whom you call upon, except Him, become lost to you . But when He brings you safe to land, you turn aside; and man is very ungrateful.", "french": " Et quand le malheur vous touche en mer, tous ceux que vous invoquez, sauf Lui, sont perdus pour vous . Mais quand Il vous ramène sains et saufs à terre, vous vous détournez ; et l’homme est très ingrat.", "german": " Und wenn euch auf dem Meere ein Unheil trifft: verloren sind jene, die ihr anruft statt Ihn. Hat Er euch aber ans Land gerettet, dann kehrt ihr euch ab, denn der Mensch ist undankbar.", "spanish": " Y cuando os azota la adversidad en el mar, todos aquellos a quienes invocáis, excepto Él, desaparecen para vosotros . Pero cuando Él os lleva seguros a tierra, os apartáis; pues el hombre es muy desagradecido.", "urdu": " اور جب سمندر میں (طغیانی پیدا ہونے کی وجہ سے) تمہیں تکلیف پہنچے تو اس کے سوا (دوسرے وجود) جن کو تم پکارتے ہو (تمہارے ذہنوں سے) غائب ہو جاتے ہیں۔ پھر جب وہ تمہیں بچا کر خشکی پر لاتا ہے تو تم (اس کی طرف سے) اعراض کر لیتے ہو اور انسان بہت ہی ناشکر گذار ہے۔"}, {"arabic": " اَفَاَمِنۡتُمۡ اَنۡ یَّخۡسِفَ بِکُمۡ جَانِبَ الۡبَرِّ اَوۡ یُرۡسِلَ عَلَیۡکُمۡ حَاصِبًا ثُمَّ لَا تَجِدُوۡا لَکُمۡ وَکِیۡلًا ﴿ۙ۶۹﴾", "english": " Do you then feel secure that He will not cause you to sink in the side of the land or send against you a violent sandstorm and then you will find no guardian for yourselves?", "french": " Vous sentez-vous donc assurés qu’Il ne vous engloutira pas par un glissement de terrain, ou n’ enverra pas contre vous une violente tempête de sable, et alors vous ne trouveriez pour vous-mêmes aucun protecteur ?", "german": " Fühlt ihr euch denn sicher davor, dass Er euch nicht auf dem Festland vernichten oder einen heftigen Wind gegen euch senden wird, (so dass) ihr dann keinen Beschützer für euch findet?", "spanish": " ¿Estáis seguros de que Él no hará que os hundáis cerca de la tierra o enviará contra vosotros una violenta tormenta de arena, sin que entonces podáis encontrar protector?", "urdu": " کیا پھر تم (یہ سمجھتے ہو کہ تم) اس بات سے بالکل امن میں ہو کہ وہ (یاتو) تمہیں خشکی کے کنارہ پر (زمین میں) دھنسا دے یا تم پر سنگریزے نازل کرے اور پھر تم اپنا کوئی کارساز (اور چارہ گر) نہ پاٶ۔"}, {"arabic": " اَمۡ اَمِنۡتُمۡ اَنۡ یُّعِیۡدَکُمۡ فِیۡہِ تَارَۃً اُخۡرٰی فَیُرۡسِلَ عَلَیۡکُمۡ قَاصِفًا مِّنَ الرِّیۡحِ فَیُغۡرِقَکُمۡ بِمَا کَفَرۡتُمۡ ۙ ثُمَّ لَا تَجِدُوۡا لَکُمۡ عَلَیۡنَا بِہٖ تَبِیۡعًا ﴿۷۰﴾", "english": " Or, do you feel secure that He will not send you back therein a second time, and then send against you as a storm-blast, and drown you because of your disbelief? You will then find therein no helper for yourselves against Us.", "french": " Ou, vous sentez-vous assurés qu’Il ne vous y renverra pas une seconde fois, et n’ enverra pas contre vous un vent tempétueux, et ne vous noiera pas à cause de votre manque de foi ? Vous n’y trouverez alors pour vous-mêmes aucun protecteur contre Nous.", "german": " Oder fühlt ihr euch sicher davor, dass Er euch nicht noch ein zweites Mal dorthin zurückschickt und einen Sturmwind gegen euch entsendet und euch ertrinken lässt für euren Unglauben? Ihr werdet dann darauf keinen Helfer finden für euch wider Uns.", "spanish": " ¿O estáis seguros de que no os devolverá allí una segunda vez, enviando entonces contra vosotros un huracán que os haga naufragar por vuestra incredulidad? Allí no encontraréis entonces quien os socorra contra Nosotros.", "urdu": " یا تم اس بات سے بے خوف ہو کہ وہ تمہیں (پھر) دوسری بار اس (سمندر) میں لوٹا لائے اور تم پر ایک تند ہوا چھوڑدے اور تمہارے کفر کی وجہ سے تمہیں غرق کر دے (اور) پھر اس (عذاب) پر تم ہمارے خلاف اپنا کوئی مددگار نہ پاٶ۔"}, {"arabic": " وَ لَقَدۡ کَرَّمۡنَا بَنِیۡۤ اٰدَمَ وَ حَمَلۡنٰہُمۡ فِی الۡبَرِّ وَ الۡبَحۡرِ وَ رَزَقۡنٰہُمۡ مِّنَ الطَّیِّبٰتِ وَ فَضَّلۡنٰہُمۡ عَلٰی کَثِیۡرٍ مِّمَّنۡ خَلَقۡنَا تَفۡضِیۡلًا ﴿٪۷۱﴾", "english": " Indeed, We have honoured the children of Adam, and carried them by land and sea, and given them of good things and exalted them far above many of those whom We have created.", "french": " Et, en vérité, Nous avons honoré les enfants d’Adam, et les avons transportés sur terre et sur mer, et Nous les avons approvisionnés en de bonnes choses, et les avons élevés grandement au-dessus de beaucoup de ceux que Nous avons créés.", "german": " Wir haben doch wahrlich die Kinder Adams geehrt und sie über Land und Meer getragen und sie versorgt mit guten Dingen und sie ausgezeichnet, eine Auszeichnung vor jenen vielen, die Wir geschaffen.", "spanish": " En verdad, hemos honrado a los hijos de Adán, llevándolos por tierra y por mar; les dimos cosas buenas y los ensalzamos muy por encima de muchos de los que hemos creado.", "urdu": " اور ہم نے بنی آدم کو (بہت) شرف بخشا ہے اور ان کے لئے خشکی اور تری میں سواری کا سامان پیدا کیا ہے اور انہیں پاکیزہ چیزوں سے رزق دیا ہے اور جو مخلوق ہم نے پیدا کی ہے اس میں سے ایک کثیر حصہ پر ہم نے انہیں بڑی فضیلت دی ہے۔"}, {"arabic": " یَوۡمَ نَدۡعُوۡا کُلَّ اُنَاسٍۭ بِاِمَامِہِمۡ ۚ فَمَنۡ اُوۡتِیَ کِتٰبَہٗ بِیَمِیۡنِہٖ فَاُولٰٓئِکَ یَقۡرَءُوۡنَ کِتٰبَہُمۡ وَ لَا یُظۡلَمُوۡنَ فَتِیۡلًا ﴿۷۲﴾", "english": " Remember the day when We shall summon every people with their Leader. Then whoso shall be given his book in his right hand — such will read their book, and they will not be wronged a whit.", "french": " Rappellez le jour où Nous convoquerons chaque peuple avec son chef. Alors ceux à qui leur livre leur sera donné dans la main droite – ceux-là liront leur livre, et ils ne seront point lésés.", "german": " (Gedenke) des Tags, da Wir ein jedes Volk mit seinem Führer vorladen werden. Wer dann sein Buch in seine Rechte empfangen wird, diese werden ihr Buch verlesen und nicht ein Jota Unrecht werden sie leiden.", "spanish": " Acuérdate del día en el que convoquemos a cada hombre con su Jefe. Entonces, a quienes se les entregue el libro en su mano derecha ésos leerán su libro y no serán defraudados en lo más mínimo.", "urdu": " اور (اس دن کو یاد کرو) جس دن ہم ہر ایک گروہ کو ان کے پیشوا سمیت بلائیں گے پھر جن کے دائیں ہاتھ میں ان (کے اعمال) کی کتاب دی جائے گی‘ وہ (بڑے شوق سے) اپنی کتاب کو پڑھیں گے اور ان پر ذرہ بھر (بھی) ظلم نہیں کیا جائے گا۔"}, {"arabic": " وَ مَنۡ کَانَ فِیۡ ہٰذِہٖۤ اَعۡمٰی فَہُوَ فِی الۡاٰخِرَۃِ اَعۡمٰی وَ اَضَلُّ سَبِیۡلًا ﴿۷۳﴾", "english": " But whoso is blind in this world will be blind in the Hereafter, and even more astray from the way.", "french": " Mais quiconque est aveugle dans ce monde sera aveugle dans l’au-delà, et encore plus égaré de la voie.", "german": " Wer aber blind ist in dieser Welt, der wird auch im Jenseits blind sein und weit abirrend vom Weg.", "spanish": " Pero quien sea ciego en este mundo, será ciego en el Más Allá, incluso más extraviado del camino.", "urdu": " اور جو اس (دنیا) میں اندھا رہے گا وہ آخرت میں (بھی) اندھا ہوگا اور (اسی طرح وہ) اپنے (طور اور) طریق میں سب سے بڑھ کر بھٹکا ہوا ہوگا۔"}, {"arabic": " وَ اِنۡ کَادُوۡا لَیَفۡتِنُوۡنَکَ عَنِ الَّذِیۡۤ اَوۡحَیۡنَاۤ اِلَیۡکَ لِتَفۡتَرِیَ عَلَیۡنَا غَیۡرَہٗ ٭ۖ وَ اِذًا لَّاتَّخَذُوۡکَ خَلِیۡلًا ﴿۷۴﴾", "english": " And they had well-nigh caused thee severest affliction on account of what We have revealed to thee, that thou mightest invent against Us something other than that; and then they would have certainly taken thee for a special friend.", "french": " Et assurément ils étaient sur le point de te causer des afflictions profondes à cause de ce que Nous t’avons révélé, afin que tu inventes contre Nous quelque chose d’autre que cela ; et alors ils t’auraient certainement pris pour ami.", "german": " Sie hätten dich beinahe in schwere Bedrängnis gebracht um dessentwillen, was Wir dir offenbarten, damit du etwas anderes wider Uns erdichten möchtest; und dann hätten sie dich gewiss zum Freund genommen.", "spanish": " Mas estuvieron a punto de causarte la más grave aflicción en razón de lo que Te revelamos, para que inventaras contra Nosotros algo distinto a eso; y ciertamente entonces te habrían considerado un amigo especial.", "urdu": " اور قریب تھا کہ اس (کلام) کی وجہ سے جو ہم نے تجھ پر وحی سے نازل کیا ہے وہ تجھے (سخت سے سخت) عذاب میں مبتلا کرتے تا کہ تو (ان سے ڈر کر) اس (کلام) کے سوا کچھ اور (کلام اپنے پاس سے) بنا کر ہماری طرف منسوب کردے اور (اگر تو ایسا کرتا تو) اس صورت میں وہ یقیناً تجھے (اپنا) گہرا دوست بنا لیتے۔"}, {"arabic": " وَ لَوۡ لَاۤ اَنۡ ثَبَّتۡنٰکَ لَقَدۡ کِدۡتَّ تَرۡکَنُ اِلَیۡہِمۡ شَیۡئًا قَلِیۡلًا ﴿٭ۙ۷۵﴾", "english": " And if We had not strengthened thee with the Qur ’ an , thou mightest have inclined to them a little.", "french": " Et si Nous ne t’avions pas affermi, tu aurais pu t’incliner légèrement vers eux.", "german": " Hätten Wir aber dich nicht (mit dem Qur-ân) gefestigt, du hättest dich ihnen nur wenig zugeneigt.", "spanish": " Mas si no te hubiésemos fortalecido con el Corán, te habrías inclinado un poco hacia ellos.", "urdu": " اور اگر ہم تجھے (قرآن دے کر) ثبات نہ بخش چکے ہوتے تو پھر بھی (یہی ہوتا کہ) تو (بغیر الہام کے بھی) ان کی طرف بہت کم باتوں میں مائل ہوتا (مگر اب تو تجھے وحی الٰہی نے صحیح راستہ بتا دیا ہے) ۔"}, {"arabic": " اِذًا لَّاَذَقۡنٰکَ ضِعۡفَ الۡحَیٰوۃِ وَ ضِعۡفَ الۡمَمَاتِ ثُمَّ لَا تَجِدُ لَکَ عَلَیۡنَا نَصِیۡرًا ﴿۷۶﴾", "english": " In that case We would have made thee taste similar afflictions of life and similar afflictions of death, and then thou wouldst not have found for thyself any helper against Us.", "french": " Dans ce cas, Nous t’aurions fait goûter le double châtiment de cette vie et le double châtiment de la mort, et alors tu n’aurais trouvé pour toi-même aucun aide contre Nous.", "german": " Dann hätten Wir dich Doppeltes im Leben und Doppeltes im Tode auskosten lassen und du hättest dir keinen Helfer wider Uns gefunden.", "spanish": " En ese caso, te habríamos hecho probar aflicciones imilares en la vida y aflicciones similares en la muerte, y no habrías encontrado para ti socorredor alguno contra Nosotros.", "urdu": " (اور اگر جیسا کہ ان کا خیال ہے تو ہم پر افترا باندھنے والا ہوتا) تو اس صورت میں ہم تجھے زندگی کا بڑا عذاب اور موت کا بڑا عذاب چکھاتے (اور) پھر تو ہمارے مقابل پر اپنا کوئی (بھی) مددگار نہ پاتا۔"}, {"arabic": " وَ اِنۡ کَادُوۡا لَیَسۡتَفِزُّوۡنَکَ مِنَ الۡاَرۡضِ لِیُخۡرِجُوۡکَ مِنۡہَا وَ اِذًا لَّا یَلۡبَثُوۡنَ خِلٰفَکَ اِلَّا قَلِیۡلًا ﴿۷۷﴾", "english": " And indeed they are near to unsettling thee from the land that they might expel thee therefrom; but in that case they themselves would not have stayed after thee save a little.", "french": " Et en vérité ils sont sur le point de te déstabiliser dans le pays afin de t’en chasser ; mais dans ce cas, eux-mêmes n’ y seraient pas restés après toi, sauf pendant très peu de temps.", "german": " Und in der Tat hätten sie dich fast des Landes verschreckt, dass sie dich vertrieben hätten; aber dann wären sie nach dir nur eine geringe Zeit geblieben.", "spanish": " En verdad, están a punto de moverte de la tierra para poder expulsarte de ella; pero en ese caso, ellos mismos no habrían permanecido después de ti excepto por poco tiempo.", "urdu": " اور وہ یقیناً تجھے اس ملک سے نکالنے کے مختلف حیلے کرتے رہتے ہیں تا کہ تجھے ڈرا کر ملک سے باہر نکال دیں۔ مگر (ایسا ہوا تو) وہ (خود بھی) تیرے بعد تھوڑا عرصہ ہی (محفوظ) رہیں گے (اور جلد تباہ ہو جائیں گے) ۔"}, {"arabic": " سُنَّۃَ مَنۡ قَدۡ اَرۡسَلۡنَا قَبۡلَکَ مِنۡ رُّسُلِنَا وَ لَا تَجِدُ لِسُنَّتِنَا تَحۡوِیۡلًا ﴿٪۷۸﴾", "english": " This has been Our way with Our Messengers whom We sent before thee; and thou wilt not find any change in Our way.", "french": " Telle a été Notre façon d’agir envers Nos Messagers que Nous avons envoyés avant toi ; et tu ne trouveras aucun changement dans Nos façons d’agir.", "german": " (So war Unser) Verfahren mit Unsern Gesandten, die Wir vor dir schickten; und du wirst keine Änderung in Unserem Verfahren finden.", "spanish": " Ésta ha sido Nuestra actitud con Nuestros Mensajeros a quienes enviamos antes de ti, y no encontrarás cambio alguno en Nuestra actitud.", "urdu": " یہ سلوک ہمارے اس سلوک کے مطابق ہوگا جو ہم نے تجھ سے پہلے (گذرے ہوئے) اپنے رسولوں (کی قوموں) کے ساتھ کیا تھا اور تو ہمارے طریق عمل میں کوئی فرق نہیں پائے گا۔"}, {"arabic": " اَقِمِ الصَّلٰوۃَ لِدُلُوۡکِ الشَّمۡسِ اِلٰی غَسَقِ الَّیۡلِ وَ قُرۡاٰنَ الۡفَجۡرِ ؕ اِنَّ قُرۡاٰنَ الۡفَجۡرِ کَانَ مَشۡہُوۡدًا ﴿۷۹﴾", "english": " Observe Prayer at the declining and paling of the sun on to the darkness of the night, and the recitation of the Qur ’ an in Prayer at dawn. Verily, the recitation of the Qur ’ an at dawn is specially acceptable to God.", "french": " Observe la Prière au palissement et au déclin du soleil jusqu’à l’obscurité de la nuit ; et la récitation du Coran à l’aube. En vérité, témoignage est fait de la récitation du Coran à l’aube.", "german": " Verrichte das Gebet beim Neigen der Sonne bis zum Dunkel der Nacht, und das Lesen des Qur-ân bei Tagesanbruch. Wahrlich, die Lesung des Qur-ân bei Tagesanbruch ist besonders angezeigt.", "spanish": " Cumple la Oración al declinar el sol y hasta la oscuridad de la oche, y recita el Corán en el alba. En verdad, la recitación del Corán al alba es especialmente aceptable para Dios .", "urdu": " تو سورج کے ڈھلنے (کے وقت) سے لیکر رات کے خوب تاریک ہو جانے (کے وقت) تک (مختلف گھڑیوں میں) نماز کو عمدگی سے ادا کیا کر اور صبح کے وقت (قرآن) کے پڑھنے کو بھی (لازم سمجھ) صبح کے وقت (قرآن) کا پڑھنا یقیناً (اللہ کے حضور میں ایک) مقبول عمل ہے۔"}, {"arabic": " وَ مِنَ الَّیۡلِ فَتَہَجَّدۡ بِہٖ نَافِلَۃً لَّکَ ٭ۖ عَسٰۤی اَنۡ یَّبۡعَثَکَ رَبُّکَ مَقَامًا مَّحۡمُوۡدًا ﴿۸۰﴾", "english": " And wake up for it (the Qur’an) in the latter part of the night as a supererogatory service for thee. It may be that thy Lord will raise thee to an exalted station.", "french": " Et pendant une partie de la nuit, dis ta prière de Tahajjud à l’aide de ce Coran : une offrande facultative pour toi. Il se peut que ton Seigneur t’élève à un rang hautement loué.", "german": " Und wache auf dazu in der Nacht – ein weiteres für dich. Mag sein, dass dich dein Herr zu einem löblichen Rang erhebt.", "spanish": " Y despiértate para recitarlo (el Corán) durante la oración de Tahayyud de la noche como servicio supererogatorio tuyo. Podría ser que tu Señor te elevara a un puesto loable.", "urdu": " اور رات کو بھی تو اس (قرآن) کے ذریعہ سے کچھ سو لینے کے بعد شب بیداری کیا کر‘ جو تجھ پر ایک زائد انعام ہے (اس طرح پر) بالکل متوقع ہے کہ تیرا رب تجھے حمد والے مقام پر کھڑا کر دے۔"}, {"arabic": " وَ قُلۡ رَّبِّ اَدۡخِلۡنِیۡ مُدۡخَلَ صِدۡقٍ وَّ اَخۡرِجۡنِیۡ مُخۡرَجَ صِدۡقٍ وَّ اجۡعَلۡ لِّیۡ مِنۡ لَّدُنۡکَ سُلۡطٰنًا نَّصِیۡرًا ﴿۸۱﴾", "english": " And say, ‘O my Lord, make my entry a good entry and then make me come forth with a good forthcoming. And grant me from Thyself a helping power.’", "french": " Et dis : « Ô mon Seigneur, rends mon entrée une entrée empreinte de vérité et rends ma sortie une sortie empreinte de vérité. Et accorde-moi de Ta part un assistant puissant.", "german": " Und sprich: \"O mein Herr, lass meinen Eingang einen guten Eingang sein und lass meinen Ausgang einen guten Ausgang sein. Und gewähre mir von Dir aus eine helfende Kraft.\"", "spanish": " Y di: “Oh mi Señor, haz que mi entrada sea una entrada buena y mi salida una salida buena. Y concédeme, de Ti mismo , un poder inquebrantable”.", "urdu": " اور کہہ (کہ) اے میرے رب! مجھے نیک طور پر (دوبارہ مکہ میں) داخل کر اور ذکر نیک چھوڑنے والے طریق پر (مکہ سے) نکال اور اپنے پاس سے میرا کوئی مددگار (اور) گواہ مقرر کر۔"}, {"arabic": " وَ قُلۡ جَآءَ الۡحَقُّ وَ زَہَقَ الۡبَاطِلُ ؕ اِنَّ الۡبَاطِلَ کَانَ زَہُوۡقًا ﴿۸۲﴾", "english": " And say, ‘Truth has come and falsehood has vanished away. Falsehood does indeed vanish away fast .’", "french": " Et proclame : « La Vérité est arrivée, et le mensonge a disparu. Le mensonge, en effet, est appelé à disparaître. »", "german": " Und sprich: \"Gekommen ist die Wahrheit und dahingeschwunden ist das Falsche. Siehe, das Falsche schwindet schnell.\"", "spanish": " Di también: “Ha llegado la Verdad y se ha desvanecido la falsedad. En verdad, la falsedad se desvanece rápidamente” .", "urdu": " اور سب لوگوں سے کہہ دے (کہ بس اب) حق آگیا ہے اور باطل بھاگ گیا ہے اور باطل تو ہے ہی بھاگ جانے والا۔"}, {"arabic": " وَ نُنَزِّلُ مِنَ الۡقُرۡاٰنِ مَا ہُوَ شِفَآءٌ وَّ رَحۡمَۃٌ لِّلۡمُؤۡمِنِیۡنَ ۙ وَ لَا یَزِیۡدُ الظّٰلِمِیۡنَ اِلَّا خَسَارًا ﴿۸۳﴾", "english": " And We are gradually revealing of the Qur’an that which is a healing and a mercy to the believers; but it only adds to the loss of the wrongdoers.", "french": " Et Nous révélons graduellement du Coran ce qui est une guérison et une miséricorde pour les croyants ; mais il ne fait qu’augmenter la perte des injustes.", "german": " Wir senden vom Qur-ân (allmählich) das hinab, was Heilung ist und Barmherzigkeit für die Gläubigen; den Ungerechten aber mehrt es nur den Schaden.", "spanish": " Y estamos revelando gradualmente el Corán, que es curación y misericordia para los creyentes; aunque no hace más que aumentar la pérdida de los inicuos.", "urdu": " اور ہم قرآن میں آہستہ آہستہ وہ (تعلیم) اتار رہے ہیں جو مومنوں کے لئے (تو) شفا اور رحمت (کا موجب) ہے اور ظالموں کو صرف خسارہ میں بڑھاتی ہے۔"}, {"arabic": " وَ اِذَاۤ اَنۡعَمۡنَا عَلَی الۡاِنۡسَانِ اَعۡرَضَ وَ نَاٰ بِجَانِبِہٖ ۚ وَ اِذَا مَسَّہُ الشَّرُّ کَانَ یَــُٔوۡسًا ﴿۸۴﴾", "english": " And when We bestow favour on man, he turns away and goes aside; and when evil touches him, he gives himself up to despair.", "french": " Et quand Nous accordons des faveurs à l’homme, il se détourne et repliant sur lui-même, il s’éloigne ; et quand le mal le touche, il se laisse aller au désespoir.", "german": " Und wenn Wir dem Menschen Gnade erweisen, wendet er sich ab und geht beiseite; wenn ihn aber ein Übel trifft, gibt er sich der Verzweiflung hin.", "spanish": " Cuando concedemos favores al hombre, se aparta y nos da de lado; mas cuando lo azota la adversidad, se entrega a la desesperación.", "urdu": " اور جب ہم انسان پر انعام کریں تو وہ روگردان ہو جاتا ہے اور اپنے پہلو کو (اس سے) دور کر لیتا ہے اور جب اسے تکلیف پہنچے تو وہ بہت ہی مایوس ہو جاتا ہے۔"}, {"arabic": " قُلۡ کُلٌّ یَّعۡمَلُ عَلٰی شَاکِلَتِہٖ ؕ فَرَبُّکُمۡ اَعۡلَمُ بِمَنۡ ہُوَ اَہۡدٰی سَبِیۡلًا ﴿٪۸۵﴾", "english": " Say, ‘Everyone acts according to his own way, and your Lord knows full well who is best guided.’", "french": " Dis : « Chacun agit selon sa façon, et votre Seigneur connait mieux que quiconque qui est le mieux guidé en ce qui concerne la voie. »", "german": " Sprich: \"Ein jeder handelt nach seiner Weise, und euer Herr weiß am besten, wessen Weg der beste ist.\"", "spanish": " Diles: “Cada cual actúa según su propia forma, y tu Señor sabe muy bien quién está rectamente guiado”.", "urdu": " تو (انہیں) کہہ (کہ ہم میں سے) ہر ایک (فریق) اپنے (اپنے) طریق پر عمل کر رہا ہے پس (اپنے رب پر ہی فیصلہ چھوڑ دو کیونکہ) تمہارا رب اسے جو زیادہ صحیح راستہ پر ہے بہتر جانتا ہے (اس لئے اس کا فیصلہ سچے کی سچائی کو ضرور روشن کر دے گا)"}, {"arabic": " وَ یَسۡـَٔلُوۡنَکَ عَنِ الرُّوۡحِ ؕ قُلِ الرُّوۡحُ مِنۡ اَمۡرِ رَبِّیۡ وَ مَاۤ اُوۡتِیۡتُمۡ مِّنَ الۡعِلۡمِ اِلَّا قَلِیۡلًا ﴿۸۶﴾", "english": " And they ask thee concerning the soul. Say, ‘The soul is by the command of my Lord; and of the knowledge thereof you have been given but a little.’", "french": " Et ils t’interrogent sur l’âme. Dis : « L’âme a été créée par le commandement de mon Seigneur et il ne vous a été accordé que peu de savoir là-dessus . »", "german": " Und sie fragen dich über die Seele. Sprich: \"Die Seele entsteht auf den Befehl meines Herrn; und euch ist von Wissen nur wenig gegeben.\"", "spanish": " Te preguntan acerca del alma. Diles: “El alma es por mandato de mi Señor; y de su conocimiento se os ha dado una pequeña parte”.", "urdu": " اور وہ تجھ سے روح کے متعلق سوال کرتے ہیں تو (انہیں) کہہ (کہ) روح میرے رب کے حکم سے (پیدا ہوئی) ہے اور تمہیں (اس کے متعلق) علم سے کم ہی (حصہ) دیا گیا ہے۔"}, {"arabic": " وَ لَئِنۡ شِئۡنَا لَنَذۡہَبَنَّ بِالَّذِیۡۤ اَوۡحَیۡنَاۤ اِلَیۡکَ ثُمَّ لَا تَجِدُ لَکَ بِہٖ عَلَیۡنَا وَکِیۡلًا ﴿ۙ۸۷﴾", "english": " And if We pleased, We could certainly take away that which We have revealed to thee and then thou wouldst find in the matter no guardian for thee against Us,", "french": " Et si Nous le voulions, Nous pourrions certainement enlever ce que Nous t’avons révélé et alors tu n’y trouverais pour toi aucun protecteur contre Nous,", "german": " Und wenn Wir es wollten, Wir könnten gewisslich wieder fortnehmen, was Wir dir offenbart; du fändest dann für dich in dieser Sache keinen Beschützer wider Uns,", "spanish": " Si lo hubiésemos querido, ciertamente hubiéramos podido retirarte o que te hemos revelado y no encontrarías al respecto guardián alguno que te protegiera contra Nosotros,", "urdu": " اوراگر ہم چاہیں تو یقیناً جو (کلام الٰہی) ہم نے تجھ پروحی (کے ذریعہ سے نازل) کیا ہے اسے (دنیا سے) اٹھالیں۔ پھرتواس امرمیں اپنے لئے ہمارے خلاف کوئی کارساز نہیں پاسکے گا۔"}, {"arabic": " اِلَّا رَحۡمَۃً مِّنۡ رَّبِّکَ ؕ اِنَّ فَضۡلَہٗ کَانَ عَلَیۡکَ کَبِیۡرًا ﴿۸۸﴾", "english": " Except mercy from thy Lord. Surely, His grace towards thee is great.", "french": " Excepté à travers la miséricorde de ton Seigneur. Assurément, Sa grâce envers toi est grande.", "german": " außer der Barmherzigkeit deines Herrn. Wahrlich, Seine Gnade gegen dich ist groß.", "spanish": " Salvo la misericordia de tu Señor. En verdad, Su gracia para contigo es grande.", "urdu": " سوائے اس کے کہ تیرے رب کی (خاص) رحمت ہو (جو اسے واپس لے آئے مگر یہ قرآن مٹ نہیں سکتا کیونکہ) تجھ پر تیرے رب کا یقیناً (بہت) بڑا فضل ہے۔"}, {"arabic": " قُلۡ لَّئِنِ اجۡتَمَعَتِ الۡاِنۡسُ وَ الۡجِنُّ عَلٰۤی اَنۡ یَّاۡتُوۡا بِمِثۡلِ ہٰذَا الۡقُرۡاٰنِ لَا یَاۡتُوۡنَ بِمِثۡلِہٖ وَ لَوۡ کَانَ بَعۡضُہُمۡ لِبَعۡضٍ ظَہِیۡرًا ﴿۸۹﴾", "english": " Say, ‘If mankind and the Jinn gathered together to produce the like of this Qur’an, they could not produce the like thereof, even though they should help one another.’", "french": " Dis : « Si les hommes et les djinns concouraient à produire le pareil de ce Coran, ils ne pourraient pas en produire le pareil, même s’ils s’aidaient les uns les autres. »", "german": " Sprich: \"Ob sich auch die Menschen und die Jinn vereinigten, um ein diesem Qur-ân Gleiches hervorzubringen, sie brächten doch kein ihm Gleiches hervor, selbst wenn sie einander beistünden.\"", "spanish": " Diles: “Si la humanidad y los Yinn se reunieran para producir algo semejante a este Corán, jamás harían nada parecido, aunque se ayudaran mutuamente”.", "urdu": " تو (انہیں) کہہ (کہ) اگر تمام انسان (بھی) اور جن (بھی) اس قرآن کی نظیر لانے کے لئے جمع ہو جائیں تو (پھر بھی) وہ اس کی نظیر نہیں لا سکیں گے خواہ وہ ایک دوسرے کے مددگار (ہی کیوں نہ) بن جائیں۔"}, {"arabic": " وَ لَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِیۡ ہٰذَا الۡقُرۡاٰنِ مِنۡ کُلِّ مَثَلٍ ۫ فَاَبٰۤی اَکۡثَرُ النَّاسِ اِلَّا کُفُوۡرًا ﴿۹۰﴾", "english": " And surely, We have set forth for mankind in various ways all kinds of similitudes in this Qur’an, but most men would reject everything but disbelief.", "french": " Et assurément dans ce Coran Nous avons exposé pour les hommes de diverses manières toutes sortes de similitudes, mais la plupart des hommes refuseront tout, sauf la mécréance.", "german": " Wir haben fürwahr den Menschen in diesem Qur-ân Gleichnisse aller Art auf mannigfache Weise vorgelegt, allein die meisten Menschen weisen alles zurück, nur nicht den Unglauben.", "spanish": " En verdad, hemos presentado a la humanidad, de diversas maneras, toda clase de ejemplos en este Corán, pero la mayoría de los hombres rechazan todo excepto la incredulidad.", "urdu": " اور ہم نے اس قرآن میں یقیناً ہر ایک (ضروری) بات کو مختلف پیرایوں سے بیان کیا ہے۔ پھر (بھی) اکثر لوگوں نے (اس کے متعلق) کفر (کی راہ اختیار کرنے) کے سوا ہر بات سے انکار کر دیا ہے۔"}, {"arabic": " وَ قَالُوۡا لَنۡ نُّؤۡمِنَ لَکَ حَتّٰی تَفۡجُرَ لَنَا مِنَ الۡاَرۡضِ یَنۡۢبُوۡعًا ﴿ۙ۹۱﴾", "english": " And they say, ‘We will never believe thee until thou cause a spring to gush forth for us from the earth;", "french": " Et ils disent : « Nous ne croirons jamais en toi avant que tu n’aies fait jaillir de la terre pour nous une source.", "german": " Und sie sprechen: \"Wir werden dir nimmermehr glauben, bis du uns einen Quell aus der Erde hervorbrechen lässt;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:91&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:91&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic92\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic92\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:92' style='text-decoration:underline'>17:92</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(92)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control92\"></i></button> <audio id=\"player92\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَوۡ تَکُوۡنَ لَکَ جَنَّۃٌ مِّنۡ نَّخِیۡلٍ وَّ عِنَبٍ فَتُفَجِّرَ الۡاَنۡہٰرَ خِلٰلَہَا تَفۡجِیۡرًا ﴿ۙ۹۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Or thou have a garden of datepalms and vines, and cause streams to gush forth in the midst thereof in abundance;</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_17_92_a' href='#'>a</a>]</sup>‘Or, thou have a garden of date-palms and vines and cause streams to gush forth in the midst thereof in abundance;<sup class='ref'>[<a class='ref' data-id='ref_17_92_1651' href='#'>1651</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_17_92_a'>a</span><span class='collapsible plus' data-id='ref_17_92_1651'>1651</span></div> <div><div class='reference' data-id='ref_17_92_a' style='display:none'> <p><b>a.</b> <a href='/quran/25:11' target=_blank>25:11</a>. (<a href='javascript:void(0)' data-id='ref_17_92_a' class='ref'>close</a>)</p> </div> </div><div><a name='1651'></a><div class='reference' data-id='ref_17_92_1651' style='display:none'> <p><b>1651.</b> When the Meccans were confounded by the answers of the Qur’an to their questions and objections, they turned round and demanded of the Holy Prophet that if the Qur’an comprehended every kind of knowledge then he should be able to work miracles—cause springs to gush forth from the earth, grow gardens and build houses of gold for himself, etc. (<a href='javascript:void(0)' data-id='ref_17_92_1651' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یا تیرے لئے کھجوروں اور انگوروں کا کوئی باغ ہو پھر تُو اس کے بیچوں بیچ خوب نہریں کھود ڈالے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یا تیرا کھجوروں اور انگوروں کا کوئی باغ ہو اور تو اس کے اندر خوب (کثرت سے) نہریں جاری کرے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ou que tu n’aies un jardin de dattiers et de vignes, et qu’entre lequel tu ne fasses jaillir à flots des ruisseaux.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“O a menos que poseas un jardín de palmeras y vid y hagas que broten corrientes abundantes de agua en mitad del mismo”;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">oder [bis] du einen Garten von Dattelpalmen und Trauben hast und lässest mitten darin Ströme hervorsprudeln im Überfluss;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:92&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:92&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic93\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic93\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:93' style='text-decoration:underline'>17:93</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(93)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control93\"></i></button> <audio id=\"player93\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَوۡ تُسۡقِطَ السَّمَآءَ کَمَا زَعَمۡتَ عَلَیۡنَا کِسَفًا اَوۡ تَاۡتِیَ بِاللّٰہِ وَ الۡمَلٰٓئِکَۃِ قَبِیۡلًا ﴿ۙ۹۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Or thou cause the heaven to fall upon us in pieces, as thou hast claimed, or thou bring Allah and the angels before us face to face;</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Or, thou cause the heaven to fall upon us in pieces, as thou hast claimed, or, thou bring Allah and the angels before us face to face; </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یا جیسا کہ تُو گمان کرتا ہے ہم پر آسمان کو ٹکڑوں کی صورت گِرا دے یا اللہ اور فرشتوں کو سامنے لے آئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یا جیسا کہ تیرا دعویٰ ہے تو ہم پر آسمان کے ٹکڑے گرائے۔ یا اللہ اور فرشتوں کو (ہمارے) آمنے سامنے لاکھڑا کرے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ou, comme tu l’as prétendu, que tu ne fasses tomber en morceaux les cieux sur nous, ou que tu n’amènes devant nous Allāh et les anges ;</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“O a menos que hagas que el cielo caiga sobre nosotros en pedazos, como has afirmado, o que traigas a Al-lah y a los ángeles cara a cara ante nosotros”;</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">oder [bis] du den Himmel über uns in Stücke einstürzen lässt, wie du es behauptest, oder Allah und die Engel vor unser Angesicht bringst;</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=17:93&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=17:93&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic94\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic94\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/17:94' style='text-decoration:underline'>17:94</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(94)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control94\"></i></button> <audio id=\"player94\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَوۡ یَکُوۡنَ لَکَ بَیۡتٌ مِّنۡ زُخۡرُفٍ اَوۡ تَرۡقٰی فِی السَّمَآءِ ؕ وَ لَنۡ نُّؤۡمِنَ لِرُقِیِّکَ حَتّٰی تُنَزِّلَ عَلَیۡنَا کِتٰبًا نَّقۡرَؤُہٗ ؕ قُلۡ سُبۡحَانَ رَبِّیۡ ہَلۡ کُنۡتُ اِلَّا بَشَرًا رَّسُوۡلًا ﴿٪۹۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Or thou have a house of gold or thou ascend up into heaven; and we will not believe in thy ascension until thou send down to us a book that we can read.’ Say, ‘Holy is my Lord! I am not but a man <em>sent as a</em> Messenger.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Or, thou have a house of gold or thou ascend up into heaven; and we will not believe in thy ascension until thou send down to us a Book that we can read.’ Say, ‘Holy is my Lord! I am but a mortal <i>sent as </i>a Messenger.’<sup class='ref'>[<a class='ref' data-id='ref_17_94_1652' href='#'>1652</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_17_94_1652'>1652</span></div> <div><a name='1652'></a><div class='reference' data-id='ref_17_94_1652' style='display:none'> <p><b>1652.</b> In answer to their impudent demands the disbelievers are told that these demands pertain either to God or to the Prophet. The demands of the first category are frivolous in character and God is above such frivolities. As for their demands pertaining to the Holy Prophet, they are incompatible with his limited powers as a human being and his mission as a Prophet of God. (<a href='javascript:void(0)' data-id='ref_17_94_1652' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یا تیرے لئے سونے کا کوئی گھر ہو یا تُو آسمان میں چڑھ جائے۔ مگر ہم تیرے چڑھنے پر بھی ہرگز ایمان نہیں لائیں گے یہاں تک کہ تُو ہم پر ایسی کتاب اتارے جسے ہم پڑھ سکیں۔ تُو کہہ دے کہ میرا ربّ (ان باتوں سے) پاک ہے (اور) میں تو ایک بشر رسول کے سوا کچھ نہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یا تیرا سونے کا کوئی گھر ہو‘ یا تو آسمان پر چڑھ جائے اور ہم تیرے (آسمان پر) چڑھ جانے پر بھی ایمان نہیں لائیں گے جب تک کہ تو (اوپر جاکر) ہم پر کوئی کتاب (نہ) اتارے جسے ہم (خود) پڑھیں تو (انہیں) کہہ (کہ) میرا رب (ایسی باتوں سے) پاک ہے۔ میں (تو) صرف بشر رسول ہوں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ou que tu n’aies une maison en or, ou que tu ne montes au ciel ; et nous ne croirons pas à ton ascension avant que tu ne nous aies fait descendre un livre que nous puissions lire. » Dis : « Saint est mon Seigneur ! Je ne suis qu’un homme <em>envoyé en tant que</em> Messager. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“O poseas una casa de oro o subas a los cielos; y no creeremos en tu ascensión hasta que no nos envíes un libro que podamos leer”. Diles: “¡Santo es mi Señor! No soy sino un hombre <em>enviado como</em> Mensajero”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">oder [bis] du ein Haus von Gold besitzest oder aufsteigst zum Himmel; und wir werden nicht an deinen Aufstieg glauben, bis du uns ein Buch hinabsendest, das wir lesen können.\" Sprich: \"Preis meinem Herrn! Bin ich denn mehr als ein Mensch, ein Gesandter?\"", "spanish": " Dicen: “Nunca creeremos en ti hasta que no nos hagas brotar un manantial de la tierra”;", "urdu": " اور انہوں نے (یہ بھی) کہا ہے (کہ) ہم ہرگز تیری (کوئی) بات نہیں مانیں گے جب تک (ایسا نہ ہو کہ) تو ہمارے لئے زمین سے کوئی چشمہ جاری کرے۔"}, {"arabic": " وَ مَا مَنَعَ النَّاسَ اَنۡ یُّؤۡمِنُوۡۤا اِذۡ جَآءَہُمُ الۡہُدٰۤی اِلَّاۤ اَنۡ قَالُوۡۤا اَبَعَثَ اللّٰہُ بَشَرًا رَّسُوۡلًا ﴿۹۵﴾", "english": " And nothing has prevented men from believing when the guidance came to them save that they said, ‘Has Allah sent a man as a Messenger?’", "french": " Et rien n’a empêché les hommes de croire, quand la direction leur est venue, sauf qu’ils ont dit : « Allāh a-t-Il envoyé un homme comme nous en tant que Messager ? »", "german": " Und nichts hat die Menschen abgehalten, zu glauben, da die Führung zu ihnen kam, als dass sie sprachen: \"Hat Allah einen Menschen als Gesandten geschickt?\"", "spanish": " Y nada ha impedido a los hombres creer cuando les ha llegado la uía, excepto que dijeron: “¿Ha enviado Al-lah a un hombre como Mensajero?”.", "urdu": " اور ان لوگوں کو اس ہدایت پر جو ان کے پاس آئی ہے ایمان لانے سے صرف اس بات نے روکا ہے کہ انہوں نے (اپنے دلوں میں) کہا (کہ) کیا اللہ نے ایک بشر کو رسول بنا کر بھیج دیا ہے۔"}, {"arabic": " قُلۡ لَّوۡ کَانَ فِی الۡاَرۡضِ مَلٰٓئِکَۃٌ یَّمۡشُوۡنَ مُطۡمَئِنِّیۡنَ لَنَزَّلۡنَا عَلَیۡہِمۡ مِّنَ السَّمَآءِ مَلَکًا رَّسُوۡلًا ﴿۹۶﴾", "english": " Say, ‘Had there been in the earth angels walking about in peace and quiet, We should have certainly sent down to them from heaven an angel as a Messenger.’", "french": " Dis : « S’il y avait eu sur terre des anges se promenant en paix et en tranquillité, Nous leur aurions certainement envoyé du ciel un ange en tant que Messager. »", "german": " Sprich: \"Wären auf Erden Engel gewesen, friedlich und in Ruhe wandelnde, Wir hätten ihnen gewiss einen Engel vom Himmel als Gesandten geschickt.\"", "spanish": " Diles: “Si hubiera en la tierra ángeles que anduvieran en paz y ranquilos, ciertamente les hubiéramos enviado un ángel del cielo como Mensajero”.", "urdu": " تو (انہیں) کہہ (کہ) اگر زمین پر فرشتے (بستے) ہوتے جو زمین پر اطمینان سے چلتے پھرتے تو (اس صورت میں) ہم ضرور ان پر آسمان سے کسی فرشتہ کو (ہی) رسول بنا کر اتارتے۔"}, {"arabic": " قُلۡ کَفٰی بِاللّٰہِ شَہِیۡدًۢا بَیۡنِیۡ وَ بَیۡنَکُمۡ ؕ اِنَّہٗ کَانَ بِعِبَادِہٖ خَبِیۡرًۢا بَصِیۡرًا ﴿۹۷﴾", "english": " Say, ‘Sufficient is Allah for a Witness between me and you; surely, He knows and sees His servants full well.’", "french": " Dis : « Allāh suffit comme Témoin entre moi et vous ; assurément Il est Très- Conscient et Clairvoyant concernant Ses serviteurs. »", "german": " Sprich: \"Allah genügt als Zeuge zwischen mir und euch; wahrlich, Er weiß und sieht alles an Seinen Dienern.\"", "spanish": " Diles: “Me basta con Al-lah como Testigo entre vosotros y yo; en verdad, Él ve y conoce perfectamente a Sus siervos”.", "urdu": " تو (انہیں) کہہ (کہ) میرے درمیان اور تمہارے درمیان گواہ کے طور پر اللہ ہی کافی ہے وہ اپنے بندوں کو جاننے والا (اور) دیکھنے والا ہے۔"}, {"arabic": " وَ مَنۡ یَّہۡدِ اللّٰہُ فَہُوَ الۡمُہۡتَدِ ۚ وَ مَنۡ یُّضۡلِلۡ فَلَنۡ تَجِدَ لَہُمۡ اَوۡلِیَآءَ مِنۡ دُوۡنِہٖ ؕ وَ نَحۡشُرُہُمۡ یَوۡمَ الۡقِیٰمَۃِ عَلٰی وُجُوۡہِہِمۡ عُمۡیًا وَّ بُکۡمًا وَّ صُمًّا ؕ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ کُلَّمَا خَبَتۡ زِدۡنٰہُمۡ سَعِیۡرًا ﴿۹۸﴾", "english": " And he whom Allah guides, is the only one rightly guided; but as for those whom He allows to perish, thou wilt find for them no helpers beside Him. And on the Day of Resurrection We shall gather them together on their faces, blind, dumb and deaf. Their abode will be Hell; every time it abates, We shall increase for them the flame.", "french": " Et seul celui qu’Allāh guide est le bien guidé ; mais en ce qui concerne ceux qu’Il laisse s’égarer, tu ne trouveras pour eux aucun aide à part Allāh Lui -Même . Et au Jour de la Résurrection, Nous les rassemblerons sur leur visage, aveugles, muets et sourds. Leur demeure sera l’Enfer ; chaque fois que la flamme s’apaisera, Nous l’attiserons pour eux.", "german": " Und wen Allah leitet, der ist der Rechtgeleitete; die aber, die Er zu Irrenden erklärt, für die wirst du keine Helfer finden außer Ihm. Und Wir werden sie versammeln am Tage der Auferstehung, auf ihren Angesichtern, blind, stumm und taub. Ihr Aufenthalt wird die Hölle sein; sooft sie erlischt, wollen Wir die Flamme für sie wieder anfachen.", "spanish": " Y a quien Al-lah guía es el único correctamente guiado; en cambio, para quienes permanecen perdidos a la vista de Al-lah, no encontrarás socorredor para ellos fuera de Él. Y en el Día de la Resurrección, los congregaremos sobre sus rostros, ciegos, mudos y sordos. Su morada será el Infierno; cada vez que se extinga, avivaremos para ellos la llama.", "urdu": " اور جسے اللہ ہدایت دے وہی ہدایت پر ہوتا ہے اور جسے وہ گمراہ کرے تو تو اس کے (یعنی اللہ کے) مقابل پر اس کا کوئی بھی مددگار نہیں پائے گا اور قیامت کے دن ہم انہیں ان کے مقاصد (اور نیتوں) کے مطابق اندھے اور گونگے اور بہرے ہونے کی حالت میں جمع کریں گے ان کا ٹھکانا جہنم ہوگا۔ جب بھی وہ (جہنم ذرا) ٹھنڈی ہوگی تو ان پر عذاب کو شدید کر دیا جائے گا جو (عذاب کہ) بھڑکنے والی آگ کا ہوگا۔"}, {"arabic": " ذٰلِکَ جَزَآؤُہُمۡ بِاَنَّہُمۡ کَفَرُوۡا بِاٰیٰتِنَا وَ قَالُوۡۤاءَ اِذَا کُنَّا عِظَامًا وَّ رُفَاتًاءَ اِنَّا لَمَبۡعُوۡثُوۡنَ خَلۡقًا جَدِیۡدًا ﴿۹۹﴾", "english": " That is their recompense, because they rejected Our Signs and said, ‘What! when we are reduced to bones and broken particles, shall we really be raised up as a new creation?’", "french": " C’est là leur récompense parce qu’ils rejetèrent Nos Signes et dirent : « Comment ! Quand nous serons réduits en ossements et en parcelles brisées, serons-nous réellement ressuscités en une nouvelle création ? »", "german": " Das ist ihr Lohn, weil sie Unsere Zeichen verwarfen und sprachen: \"Wie! wenn wir Gebeine und Staub geworden sind, sollen wir wirklich als eine neue Schöpfung auferweckt werden?\"", "spanish": " Ésa es su recompensa, por haber rechazado Nuestros Signos y haber dicho: “¡Cómo! Cuando quedemos reducidos a huesos y partículas rotas, ¿seremos realmente resucitados como una nueva criatura?", "urdu": " یہ (آک) ان (ہی کے اعمال) کی جزا ہوگی۔ کیونکہ انہوں نے ہمارے نشانوں کا انکار کیا اور کہا کہ کیا جب ہم (مرکر) ہڈیاں اور چورا چورا ہو جائیں گے (تو ہمیں ازسر نو زندہ کیا جائے گا اور) کیا واقعی ہمیں ایک نئی مخلوق کی صورت میں اٹھایا جائے گا۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّ اللّٰہَ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ قَادِرٌ عَلٰۤی اَنۡ یَّخۡلُقَ مِثۡلَہُمۡ وَ جَعَلَ لَہُمۡ اَجَلًا لَّا رَیۡبَ فِیۡہِ ؕ فَاَبَی الظّٰلِمُوۡنَ اِلَّا کُفُوۡرًا ﴿۱۰۰﴾", "english": " Have they not seen that Allah Who created the heavens and the earth has the power to create the like of them? And He has appointed for them a term; there is no doubt about it. But the wrongdoers would reject everything but disbelief.", "french": " N’ont-ils pas vu qu’Allāh, Qui a créé les cieux et la terre, est capable de créer leurs pareils ? Et Il leur a fixé un terme ; en cela il n’y a aucun doute. Mais les injustes refusent tout sauf la mécréance.", "german": " Haben sie nicht gesehen, dass Allah, Der die Himmel und die Erde erschuf, imstande ist, ihresgleichen zu schaffen? Und Er hat eine Frist für sie bestimmt, über die kein Zweifel ist. Allein die Frevler verwerfen alles, nur nicht den Unglauben.", "spanish": " ¿Acaso no ven que Al-lah, que creó los cielos y la tierra, tiene poder para crear semejantes a ellos? Él les ha fijado un plazo; sobre esto no hay duda alguna. Pero los inicuos lo rechazan todo excepto la incredulidad.", "urdu": " کیا وہ (ابھی تک) سمجھ نہیں سکے کہ وہ (ہستی) جس نے آسمانوں اور زمین کو پیدا کیا ہے اس بات پر بھی قادر ہے کہ وہ ان جیسے (اور لوگ) پیدا کرے اور اس میں کوئی شک نہیں کہ اس نے ان کے لئے ایک میعاد مقرر کر دی ہے پھر (بھی) ان ظالموں نے صرف ناشکری کی راہ اختیار کر لی ہے۔"}, {"arabic": " قُلۡ لَّوۡ اَنۡتُمۡ تَمۡلِکُوۡنَ خَزَآئِنَ رَحۡمَۃِ رَبِّیۡۤ اِذًا لَّاَمۡسَکۡتُمۡ خَشۡیَۃَ الۡاِنۡفَاقِ ؕ وَ کَانَ الۡاِنۡسَانُ قَتُوۡرًا ﴿۱۰۱﴾٪", "english": " Say, ‘Even if you possessed the treasures of the mercy of my Lord, you would surely hold them back for fear of spending, for man is niggardly.’", "french": " Dis : « Même si vous possédiez les trésors illimités de la miséricorde de mon Seigneur, vous les retiendriez assurément, de peur de dépenser, car l’homme est avare. »", "german": " Sprich: \"Besäßet ihr die Schätze der Barmherzigkeit meines Herrn, wahrlich, ihr würdet euch zurückhalten aus Furcht vor dem Ausgeben, denn der Mensch ist geizig.\"", "spanish": " Diles: “Aunque poseyerais los tesoros de la misericordia de mi Señor, ciertamente los guardaríais por temor a gastarlos, ya que el hombre es avariento”.", "urdu": " تو (اُنہیں) کہہ (کہ) اگر تم میرے رب کی رحمت کے (غیر متناہی) خزانوں کے (بھی) مالک ہوتے تو (بھی) تم (ان کے) خرچ ہو جانے کے ڈر سے (انہیں) روک ہی رکھتے اور انسان بڑا ہی کنجوس ہے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسٰی تِسۡعَ اٰیٰتٍۭ بَیِّنٰتٍ فَسۡـَٔلۡ بَنِیۡۤ اِسۡرَآءِیۡلَ اِذۡ جَآءَہُمۡ فَقَالَ لَہٗ فِرۡعَوۡنُ اِنِّیۡ لَاَظُنُّکَ یٰمُوۡسٰی مَسۡحُوۡرًا ﴿۱۰۲﴾", "english": " And of a truth We gave Moses nine manifest Signs. So ask then the children of Israel. When he came to them, Pharaoh said to him, ‘I do think thee, O Moses, to be a victim of deception.’", "french": " Et certainement, Nous avons donné à Moïse neuf Signes manifestes. Demande donc aux Enfants d’lsraël. Lorsqu’il est venu auprès d’eux, Pharaon lui dit : « Ô Moïse, je pense assurément que tu es ensorcelé. »", "german": " Wir hatten Moses neun offenbare Zeichen gegeben. Frage nur die Kinder Israels. Als er zu ihnen kam, sprach Pharao zu ihm: \"Ich halte dich, o Moses, zweifellos für ein Opfer der Täuschung.\"", "spanish": " En verdad dimos a Moisés nueve Signos manifiestos. Preguntad pues a los hijos de Israel. Cuando vino a ellos, el Faraón le dijo: “Creo, Oh Moisés, que eres víctima del engaño”.", "urdu": " اور ہم نے موسیٰ کو نو روشن نشان دئے چنانچہ تو بنی اسرائیل سے (ان حالات کو) پوچھ جب وہ (موسیٰ) ان (اہل مصر) کی طرف آیا تھا تو فرعون نے اس سے کہا تھا (کہ) اے موسیٰ! میں یقیناً تجھے فریب خوردہ سمجھتا ہوں۔"}, {"arabic": " قَالَ لَقَدۡ عَلِمۡتَ مَاۤ اَنۡزَلَ ہٰۤؤُلَآءِ اِلَّا رَبُّ السَّمٰوٰتِ وَ الۡاَرۡضِ بَصَآئِرَ ۚ وَ اِنِّیۡ لَاَظُنُّکَ یٰفِرۡعَوۡنُ مَثۡبُوۡرًا ﴿۱۰۳﴾", "english": " He said, ‘Thou knowest well that none has sent down these Signs but the Lord of the heavens and the earth as so many evidences; and I certainly think thee, O Pharaoh, to be a ruined man .’", "french": " Il dit : « Tu sais très bien que personne d’autre n’a envoyé ces Signes , sinon le Seigneur des cieux et de la terre, et ceci comme moyen pour vous ouvrir les yeux ; et je suis d’avis, ô Pharaon, que tu es un homme ruiné. »", "german": " Er sprach: \"Du weißt recht wohl, dass kein anderer diese (Zeichen) herabgesandt hat als der Herr der Himmel und der Erde, als Zeugnisse; und ich halte dich, o Pharao, zweifellos für ein Opfer des Verderbens.\"", "spanish": " Él respondió: “Tú sabes bien que nadie ha revelado estos Signos salvo el Señor de los cielos y la tierra para hacer te ver la luz; y en verdad pienso que tú, Oh Faraón, eres un hombre perdido”.", "urdu": " اس نے جواب دیا (کہ) تجھے یقیناً علم ہو چکا ہے کہ ان (نشانات) کو صرف آسمانوں اور زمین کے رب نے بصیرت بخشنے والا بنا کر اتارا ہے اور اے فرعون! میں تیری نسبت یقین رکھتا ہوں کہ تو (اپنے بدارادوں میں) ناکام و نامراد ہوگا۔"}, {"arabic": " فَاَرَادَ اَنۡ یَّسۡتَفِزَّہُمۡ مِّنَ الۡاَرۡضِ فَاَغۡرَقۡنٰہُ وَ مَنۡ مَّعَہٗ جَمِیۡعًا ﴿۱۰۴﴾ۙ", "english": " So he resolved to remove them from the land; but We drowned him and those who were with him, all together.", "french": " Pharaon résolut donc de les chasser du pays, mais Nous le noyâmes ainsi que ceux qui étaient avec lui, tous ensemble.", "german": " Da beschloss er, sie aus dem Lande zu treiben; doch Wir ertränkten ihn und die mit ihm waren, allesamt.", "spanish": " Así pues, decidió expulsarlos del país, pero Nosotros lo ahogamos, a él y a cuantos estaban con él, todos juntos.", "urdu": " اس پر اس نے ان کو (یعنی موسیٰ اور اس کی قوم کو) ملک سے نکال دینے کا ارادہ کرلیا۔ اس کا نتیجہ یہ ہوا کہ ہم نے اسے اور جو اس کے ساتھ تھے سب کو غرق کر دیا۔"}, {"arabic": " وَّ قُلۡنَا مِنۡۢ بَعۡدِہٖ لِبَنِیۡۤ اِسۡرَآءِیۡلَ اسۡکُنُوا الۡاَرۡضَ فَاِذَا جَآءَ وَعۡدُ الۡاٰخِرَۃِ جِئۡنَا بِکُمۡ لَفِیۡفًا ﴿۱۰۵﴾ؕ", "english": " And after him We said to the children of Israel, ‘Dwell ye in the land; and when the time of the promise of the latter days comes, We shall bring you together out of various peoples. ’", "french": " Et après lui, Nous avons dit aux Enfants d’Israël : « Demeurez dans le pays ; et quand viendra l’heure de la promesse des Derniers Jours, Nous vous rassemblerons encore une fois . »", "german": " Und nach ihm sprachen Wir zu den Kindern Israels: \"Wohnet in dem Lande; und wenn die Zeit der zweiten Verheißung kommt, dann werden Wir euch hinzubringen als eine Schar, gesammelt (aus den verschiedenen Völkern).\"", "spanish": " Y después de él, dijimos a los hijos de Israel: “Habitad la tierra; y cuando llegue la hora de la promesa de los últimos días, os reuniremos una vez más.", "urdu": " اور اس کے (ڈوب مرنے کے) بعد بنی اسرائیل کو ہم نے کہہ دیا (کہ) تم اس (موعود) ملک میں (جاکر آرام سے) رہو۔ پھر جب (مسلمانوں کے لئے) دوسری بار (عذاب) کا وعدہ (پورا ہونے کا وقت) آئے گا تو ہم تم (سب) کو جمع کرکے وہاں لے آئیں گے۔"}, {"arabic": " وَ بِالۡحَقِّ اَنۡزَلۡنٰہُ وَ بِالۡحَقِّ نَزَلَ ؕ وَ مَاۤ اَرۡسَلۡنٰکَ اِلَّا مُبَشِّرًا وَّ نَذِیۡرًا ﴿۱۰۶﴾ۘ", "english": " And in truth have We sent it down and with truth has it descended. And We have sent thee only as a bearer of good tidings and a Warner.", "french": " Et Nous l’avons transmis selon les exigences de la vérité et de la sagesse et il est descendu selon les exigences de la vérité et de la sagesse . Et Nous ne t’avons envoyé qu’en tant que Porteur de la bonne nouvelle et Avertisseur.", "german": " Und mit der Wahrheit haben Wir es hinabgesandt, und mit der Wahrheit kam es hernieder. Und dich entsandten Wir nur als Bringer froher Botschaft und Warner.", "spanish": " Pues con verdad lo hemos revelado y descendió con la verdad. Y sólo te hemos enviado como portador de la buena nueva, y como Amonestador.", "urdu": " اور اس قرآن کو ہم نے حق (وحکمت) کے ساتھ ہی اتارا ہے اور حق (وحکمت) کے ساتھ ہی یہ اترا ہے اور ہم نے تجھے صرف بشارت دینے والا اور (عذاب سے) آ گاہ کرنے والا بنا کر بھیجا ہے۔"}, {"arabic": " وَ قُرۡاٰنًا فَرَقۡنٰہُ لِتَقۡرَاَہٗ عَلَی النَّاسِ عَلٰی مُکۡثٍ وَّ نَزَّلۡنٰہُ تَنۡزِیۡلًا ﴿۱۰۷﴾", "english": " And the Qur’an We have revealed in pieces that thou mayest read it to mankind at intervals, and We have sent it down piecemeal.", "french": " Et Nous avons divisé le Coran en parties afin que tu puisses le lire à l’humanité à intervalles, et Nous l’avons fait descendre graduellement.", "german": " Und den Qur-ân haben Wir in Abschnitten offenbart, damit du ihn den Menschen stückweise vortragen mögest, und Wir sandten ihn nach und nach hinab.", "spanish": " Y dividimos al Corán en partes para que puedas leerlo a la humanidad a intervalos, y lo revelamos gradualmente.", "urdu": " اور ہم نے (اسے) قرآن بنایا ہے اور اس کے ٹکڑے ٹکڑے کیے ہیں (یعنی سورتیں بنائی ہیں) تا کہ تو اسے (سہولت اور) آہستگی کے ساتھ لوگوں کو پڑھ کر سنا سکے اور ہم نے اسے تھوڑا تھوڑا کرکے نازل کیا ہے۔"}, {"arabic": " قُلۡ اٰمِنُوۡا بِہٖۤ اَوۡ لَا تُؤۡمِنُوۡا ؕ اِنَّ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ مِنۡ قَبۡلِہٖۤ اِذَا یُتۡلٰی عَلَیۡہِمۡ یَخِرُّوۡنَ لِلۡاَذۡقَانِ سُجَّدًا ﴿۱۰۸﴾ۙ", "english": " Say, “Whether you believe therein or believe not, those to whom knowledge has been given before it, do fall down prostrate on their faces when it is recited to them,", "french": " Dis : « Que vous y croyiez ou que vous n’ y croyiez pas, ceux à qui le savoir a été donné avant ceci, tombent prosternés sur le visage lorsqu’il leur est récité,", "german": " Sprich: «Ob ihr an ihn glaubt oder nicht glaubt, wahrlich, jene, denen zuvor das Wissen gegeben ward, sie fallen, wenn er ihnen verlesen wird, anbetend auf ihr Angesicht nieder,", "spanish": " Diles: “Creáis o no en él, a quienes se les ha dado el conocimiento antes de él, caen postrados sobre sus rostros cuando se les recita”.", "urdu": " تو (انہیں) کہہ (کہ) تم اس پر ایمان لاٶ یا نہ لاٶ‘ جن لوگوں کو اس (کے نزول) سے پہلے (الہامی صحیفوں یا فطرت صحیحہ کے ذریعہ سے) علم دیا جا چکا ہے جب ان کے سامنے اسے پڑھا جاتا ہے تو وہ (اسے سن کر) کامل فرمانبرداری اختیار کرتے ہوئے ماتھوں کے بل گر جاتے ہیں۔"}, {"arabic": " وَّ یَقُوۡلُوۡنَ سُبۡحٰنَ رَبِّنَاۤ اِنۡ کَانَ وَعۡدُ رَبِّنَا لَمَفۡعُوۡلًا ﴿۱۰۹﴾", "english": " “And say, ‘Holy is our Lord. Surely, the promise of our Lord is bound to be fulfilled.’”", "french": " Et disent : « Saint est notre Seigneur ! Assurément, la promesse de notre Seigneur ne manquera pas d’être accomplie. »", "german": " und sprechen: \"Preis unserem Herrn! Siehe, unseres Herrn Verheißung wird sich wahrlich erfüllen.\"»", "spanish": " Y dicen: “Santo es nuestro Señor. En verdad, la promesa de nuestro Señor debe cumplirse”.", "urdu": " اور کہتے ہیں (کہ) ہمارا رب (ہر ایک عیب سے) پاک ہے اور (یہ کہ) ہمارے رب کا وعدہ ضرور پورا ہو کر رہنے والا ہے۔"}, {"arabic": " وَ یَخِرُّوۡنَ لِلۡاَذۡقَانِ یَبۡکُوۡنَ وَ یَزِیۡدُہُمۡ خُشُوۡعًا ﴿۱۱۰﴾ٛ", "english": " They fall down on their faces weeping, and it increases humility in them.", "french": " Ils tombent sur le visage en pleurant, et cela les accroît en humilité.", "german": " Und weinend fallen sie nieder auf ihr Angesicht, und es mehrt in ihnen die Demut.", "spanish": " Y caen de bruces llorando, y esto aumenta su humildad.", "urdu": " اور جب وہ ماتھے کے بل گر جاتے ہیں تو روتے جاتے ہیں اور (قرآن) ان کی فروتنی کو (اور بھی) بڑھاتا ہے۔"}, {"arabic": " قُلِ ادۡعُوا اللّٰہَ اَوِ ادۡعُوا الرَّحۡمٰنَ ؕ اَیًّامَّا تَدۡعُوۡا فَلَہُ الۡاَسۡمَآءُ الۡحُسۡنٰی ۚ وَ لَا تَجۡہَرۡ بِصَلَاتِکَ وَ لَا تُخَافِتۡ بِہَا وَ ابۡتَغِ بَیۡنَ ذٰلِکَ سَبِیۡلًا ﴿۱۱۱﴾", "english": " Say, ‘Call upon Allah or call upon Rahman; by whichever name you call Him , His are the most beautiful names.’ And utter not thy prayer aloud, nor utter it too low, but seek a way between.", "french": " Dis : « Invoquez Allāh ou invoquez Al-Raḥmān – le Miséricordieux ; par quelque nom que vous Lui adressiez des prières, les Siens sont les plus beaux noms. » Et ne prononce pas ta prière à haute voix, ni à voix trop basse, mais cherche une voie entre les deux.", "german": " Sprich: \"Rufet Allah an oder rufet Rahmân an – bei welchem (Namen) immer ihr (Ihn) rufet, Sein sind die schönsten Namen.\" Und sprich dein Gebet nicht zu laut, und flüstere es auch nicht zu leise, sondern suche einen Weg dazwischen.", "spanish": " Diles: “Invocad a Al-lah o invocad a Al-Rahman ; cualquiera que sea el nombre con el que Le oréis, los Suyos son los nombres más sublimes”. Y no pronuncies tu oración en voz alta, ni la musites demasiado bajo, más bien procura un tono intermedio.", "urdu": " تو (انہیں) کہہ (کہ) خواہ تم (خدا کو) اللہ (کہہ کر) پکارو یا رحمن (کہہ کر) جو (نام لے کر) بھی تم (اسے) پکارو پکار سکتے ہو کیونکہ تمام (بہتر سے بہتر) صفات اسی کی ہیں اور تو اپنے دعائیہ الفاظ اونچی آواز سے نہ کہا کر اور نہ انہیں (بہت) آہستہ کہا کر۔ بلکہ اس کے درمیان (درمیان) کوئی راہ اختیار (کیا) کر۔"}, {"arabic": " وَ قُلِ الۡحَمۡدُ لِلّٰہِ الَّذِیۡ لَمۡ یَتَّخِذۡ وَلَدًا وَّ لَمۡ یَکُنۡ لَّہٗ شَرِیۡکٌ فِی الۡمُلۡکِ وَ لَمۡ یَکُنۡ لَّہٗ وَلِیٌّ مِّنَ الذُّلِّ وَ کَبِّرۡہُ تَکۡبِیۡرًا ﴿۱۱۲﴾٪", "english": " And say, ‘All praise belongs to Allah Who has taken unto Himself no son, and Who has no partner in His Kingdom, nor has He anyone to help Him on account of weakness.’ And extol His glory with all glorification.", "french": " Et dis : « Toutes les louanges appartiennent à Allāh Qui n’a pas pris de fils, et Qui n’a aucun associé dans Sa Souveraineté, ni n’a-t-Il besoin de quelqu’un pour Lui venir en aide pour cause de faiblesse. » Et proclame Sa grandeur de toute force.", "german": " Sprich: \"Aller Preis gebührt Allah, Der Sich keinen Sohn zugesellt hat und niemanden neben Sich hat in der Herrschaft noch sonst einen Gehilfen aus Schwäche.\" Und preise Seine Herrlichkeit mit aller Verherrlichung.", "spanish": " Y di: “Toda alabanza corresponde a Al-lah, que no ha tomado hijo alguno para Sí, que no tiene socio alguno en Su Reino, ni tiene a nadie que Le ayude por debilidad”. Y ensalzad Su Gloria con toda alabanza.", "urdu": " اور (سب دنیا کو سنا سنا کر) کہہ (کہ) ہر تعریف کا مستحق اللہ ہی ہے‘ جو نہ تو اولاد رکھتا ہے اور نہ حکومت میں اس کا کوئی شریک ہے اور نہ اس کو عاجز پاکر کوئی (اور اس پر رحم کرکے) اس کا دوست بنتا ہے (بلکہ جو بھی اس کا دوست ہوتا ہے اس سے مدد لینے کے لئے ہوتا ہے) اس کی خوب (اچھی طرح) بڑائی بیان کر۔"}], "Surah": 17}