{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " الٓـمّٓ ۚ﴿۲﴾", "english": " Alif Lam Mim.", "french": " Alif Lām Mīm (Je suis Allāh, le Plus-Savant).", "german": " Alif Lâm Mîm.", "spanish": " Alif Lam Mim.", "urdu": " میں اللہ سب سے زیادہ جاننے والا ہوں۔"}, {"arabic": " تِلۡکَ اٰیٰتُ الۡکِتٰبِ الۡحَکِیۡمِ ۙ﴿۳﴾", "english": " These are verses of the Book of Wisdom,", "french": " Ceux-ci sont des versets du Livre de la Sagesse,", "german": " Dies sind die Verse des weisen Buches.", "spanish": " Éstos son versículos del Libro de la Sabiduría,", "urdu": " یہ (یعنی اس سورۃ کی آیات) اس کامل کتاب کی آیات ہیں جو بڑی حکمتوں والی ہے۔"}, {"arabic": " ہُدًی وَّ رَحۡمَۃً لِّلۡمُحۡسِنِیۡنَ ۙ﴿۴﴾", "english": " A guidance and a mercy for those who do good,", "french": " Une direction et une miséricorde pour ceux qui font le bien,", "german": " Eine Führung und eine Barmherzigkeit für jene, die Gutes tun,", "spanish": " Guía y misericordia para quie­nes hacen el bien,", "urdu": " (اور) اپنے فرائض کو صحیح طور پر ادا کرنے والوں کے لئے ہدایت اور رحمت کا موجب ہے۔"}, {"arabic": " الَّذِیۡنَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ یُؤۡتُوۡنَ الزَّکٰوۃَ وَ ہُمۡ بِالۡاٰخِرَۃِ ہُمۡ یُوۡقِنُوۡنَ ؕ﴿۵﴾", "english": " Those who observe Prayer and pay the Zakat and who have firm faith in the Hereafter.", "french": " Ceux qui observent la Prière et paient la Zakāt, et qui ont une foi ferme dans l’au-delà.", "german": " die das Gebet verrichten und die Zakât zahlen und die fest ans Jenseits glauben.", "spanish": " Quienes cumplen la Oración, pagan el Zakat y tienen una fe firme en el Más Allá.", "urdu": " وہ لوگ جو نماز کو (اس کی شرائط کے ساتھ) ادا کرتے ہیں اور (غریبوں اور مسکینوں کو) زکٰوۃ دیتے رہتے ہیں اور اُخروی زندگی پر یقین رکھتے ہیں۔"}, {"arabic": " اُولٰٓئِکَ عَلٰی ہُدًی مِّنۡ رَّبِّہِمۡ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۶﴾", "english": " It is they who follow guidance from their Lord, and it is they who shall prosper.", "french": " Ceux-là qui suivent la direction donnée par leur Seigneur, et ce sont eux qui prospéreront.", "german": " Sie sind es, die der Führung ihres Herrn folgen, und sie sind es, die Erfolg haben werden.", "spanish": " Son ellos quienes siguen la guía de su Señor, y quienes pros­perarán.", "urdu": " یہ لوگ اپنے رب کی طرف سے آنے والی ہدایت پر بھی مضبوطی سے قائم ہیں اور ایسے ہی لوگ (ہر میدان میں) کامیاب ہوں گے۔"}, {"arabic": " وَ مِنَ النَّاسِ مَنۡ یَّشۡتَرِیۡ لَہۡوَ الۡحَدِیۡثِ لِیُضِلَّ عَنۡ سَبِیۡلِ اللّٰہِ بِغَیۡرِ عِلۡمٍ ٭ۖ وَّ یَتَّخِذَہَا ہُزُوًا ؕ اُولٰٓئِکَ لَہُمۡ عَذَابٌ مُّہِیۡنٌ ﴿۷﴾", "english": " And of men is he who takes idle tales in exchange for guidance to lead men astray from the path of Allah, without knowledge, and to make fun of it. For such there will be humiliating punishment.", "french": " Et parmi les hommes il y a celui qui prend des propos oisifs en échange de la direction , afin d’égarer les gens hors du chemin d’Allāh, par leur ignorance, et de s’en moquer. Pour ceux-là, il y aura un châtiment humiliant.", "german": " Unter den Menschen gibt es einen, der eitle Geschichten erhandelt, um (die Leute) irrezuleiten, hinweg von Allahs Pfad, ohne Wissen, und um damit Spott zu treiben. Solcher harrt eine schmähliche Strafe.", "spanish": " Entre los hombres hay quien cambia la guía por historietas vanas para apartar a los hombres del camino de Al‑lah, sin conoci­miento, burlándose de él. Para él habrá un castigo ignominioso.", "urdu": " اور لوگوں میں سے بعض ایسے ہیں جو (اپنا روپیہ ضائع کرکے) کھیل تماشہ کی باتیں لیتے رہتے ہیں تاکہ بغیر علم کے لوگوں کو اللہ کے راستہ سے روکیں اور اس (یعنی اللہ کے راستہ) کو ہنسی کے قابل چیز بنا لیتے ہیں ان لوگوں کے لئے ذلت والا عذاب ہوگا۔"}, {"arabic": " وَ اِذَا تُتۡلٰی عَلَیۡہِ اٰیٰتُنَا وَلّٰی مُسۡتَکۡبِرًا کَاَنۡ لَّمۡ یَسۡمَعۡہَا کَاَنَّ فِیۡۤ اُذُنَیۡہِ وَقۡرًا ۚ فَبَشِّرۡہُ بِعَذَابٍ اَلِیۡمٍ ﴿۸﴾", "english": " And when Our Signs are recited to him, he turns proudly away, as though he heard them not, as if there were a heaviness in both his ears. So announce to him a painful punishment.", "french": " Et lorsque Nos Signes lui sont récités, il s’ en détourne avec dédain, comme s’il ne les avait pas entendus, comme s’il avait une lourdeur dans ses deux oreilles. Alors, annonce-lui un châtiment douloureux.", "german": " Und wenn ihm Unsere Zeichen vorgetragen werden, so kehrt er sich verächtlich ab, als hätte er sie nicht gehört, als wäre eine Schwerhörigkeit in seinen Ohren. So künde ihm eine schmerzliche Strafe an.", "spanish": " Y cuando Nuestros Signos se le recitan, se aparta orgullosamente, como si no los hubiera oído, como si existiera un peso en sus dos oídos. Anúnciale pues un castigo doloroso.", "urdu": " اور جب ایسے شخص کے سامنے ہماری آیتیں پڑھی جاتی ہیں تو وہ تکبر کرتے ہوئے پیٹھ پھیر لیتا ہے گویا کہ اس نے ان کو سنا ہی نہیں (وہ اس حد تک بے پروائی کرتا ہے) گویا اس کے کانوں میں بہرہ پن ہے پس تو اس کو ایک دردناک عذاب کی اہم خبر سنا۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَہُمۡ جَنّٰتُ النَّعِیۡمِ ۙ﴿۹﴾", "english": " Surely those who believe and do good works — they will have Gardens of Delight,", "french": " Sûrement, ceux qui croient et font de bonnes œuvres – ils auront les Jardins de la Félicité,", "german": " Die aber glauben und gute Werke tun, ihnen werden Gärten der Wonne,", "spanish": " En verdad, quienes creen y hacen buenas obras, tendrán Jar­dines de Placer.", "urdu": " یقیناً وہ لوگ جو ایمان لائے اور جنہوں نے اس کے مناسب حال عمل کیے ان کو نعمت والے باغات ملیں گے۔"}, {"arabic": " خٰلِدِیۡنَ فِیۡہَا ؕ وَعۡدَ اللّٰہِ حَقًّا ؕ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۱۰﴾", "english": " Wherein they will abide. Allah has made a true promise; and He is the Mighty, the Wise.", "french": " Où ils demeureront éternellement. C’est la vraie promesse d’Allāh ; et Il est le Puissant, le Sage.", "german": " darin sie weilen werden immerdar. Eine Verheißung Allahs in Wahrheit! Und Er ist der Allmächtige, der Allweise.", "spanish": " En los que morarán, Al‑lah ha realizado una promesa verdadera; Él es el Poderoso, el Sabio.", "urdu": " جن میں وہ رہتے چلے جائیں گے۔ یہ اللہ کا کیا ہوا پختہ وعدہ ہے اور وہ غالب (اور) بڑی حکمت والا ہے۔"}, {"arabic": " خَلَقَ السَّمٰوٰتِ بِغَیۡرِ عَمَدٍ تَرَوۡنَہَا وَ اَلۡقٰی فِی الۡاَرۡضِ رَوَاسِیَ اَنۡ تَمِیۡدَ بِکُمۡ وَ بَثَّ فِیۡہَا مِنۡ کُلِّ دَآبَّۃٍ ؕ وَ اَنۡزَلۡنَا مِنَ السَّمَآءِ مَآءً فَاَنۡۢبَتۡنَا فِیۡہَا مِنۡ کُلِّ زَوۡجٍ کَرِیۡمٍ ﴿۱۱﴾", "english": " He has created the heavens without any pillars that you can see, and He has placed in the earth firm mountains that it may not quake with you, and He has scattered therein all kinds of creatures; and We have sent down water from the clouds, and caused to grow therein every noble species.", "french": " Il a créé les cieux sans de tels piliers que vous puissiez voir ; et sur la terre, Il a placé des montagnes solidement ancrées, afin qu’elles vous fournissent de la nourriture, et Il y a répandu des animaux de toutes les espèces ; et Nous avons fait descendre sur la terre de l’eau, des nuages, et y avons fait croître toutes sortes de magnifiques couples de végétations .", "german": " Er hat die Himmel erschaffen ohne für euch sichtbare Stützen, und Er hat in der Erde feste Berge gegründet, damit sie nicht mit euch bebe, und hat allerlei Getier über sie verstreut. Und Wir senden Wasser aus den Wolken nieder und lassen jede edle Art auf ihr sprießen.", "spanish": " Ha creado los cielos sin so­porte alguno que podáis ver y ha puesto en la tierra montañas fir­mes para que no se muevan con vosotros, y ha esparcido en ellas toda clase de animales; Hemos enviado agua de las nubes y hecho crecer en ella todas las nobles es­pecies.", "urdu": " اس نے آسمانوں کو بغیر ستونوں کے پیدا کیا ہے۔ جیسا کہ تم دیکھتے ہو۔ اور زمین میں پہاڑ اس ڈر سے ڈال چھوڑے ہیں کہ وہ تمہارے سمیت شدید زلزلہ میں مبتلا نہ ہو جائے اور اس میں ہر قسم کے جانور پھیلائے اور بادلوں سے پانی اتارا ہے۔ پھر اس میں ہر قسم کے عمدہ جوڑے پیدا کیے ہیں۔"}, {"arabic": " ہٰذَا خَلۡقُ اللّٰہِ فَاَرُوۡنِیۡ مَاذَا خَلَقَ الَّذِیۡنَ مِنۡ دُوۡنِہٖ ؕ بَلِ الظّٰلِمُوۡنَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿٪۱۲﴾", "english": " This is the creation of Allah. Now show me what others beside Him have created. Nay, but the wrongdoers are in manifest error.", "french": " C’est cela la création d’Allāh. Maintenant montrez-moi ce que d’autres en dehors de Lui ont créé. Non, mais les injustes sont dans une erreur manifeste.", "german": " Dies ist Allahs Schöpfung. Zeigt mir nun, was andere, außer Ihm, geschaffen haben. Nein, die Frevler sind in offenkundigem Irrtum.", "spanish": " Ésta es la creación de Al‑lah. Mostradme ahora lo que han creado otros fuera de Él. No, pero los in­justos están en un error evidente.", "urdu": " یہ اللہ کی مخلوق ہے۔ پس تم مجھے دکھاٶ کہ اس کے سوا جن کو تم شریک قرار دیتے ہو۔ انہوں نے کیا پیدا کیا ہے (کچھ بھی نہیں) بلکہ حق یہ ہے کہ ظالم کھلی کھلی گمراہی میں ہیں۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا لُقۡمٰنَ الۡحِکۡمَۃَ اَنِ اشۡکُرۡ لِلّٰہِ ؕ وَ مَنۡ یَّشۡکُرۡ فَاِنَّمَا یَشۡکُرُ لِنَفۡسِہٖ ۚ وَ مَنۡ کَفَرَ فَاِنَّ اللّٰہَ غَنِیٌّ حَمِیۡدٌ ﴿۱۳﴾", "english": " And We bestowed wisdom on Luqman, saying , ‘Be grateful to Allah:’ and whoso is grateful, is grateful only for the good of his own soul. And whoso is ungrateful, then surely Allah is Self-Sufficient, Praiseworthy.", "french": " Et, en vérité, Nous donnâmes la sagesse à Luqmān, et dîmes : « Sois reconnaissant envers Allāh, » et quiconque est reconnaissant, est seulement reconnaissant pour le bien de sa propre âme. Et quiconque est ingrat, alors, assurément Allāh Se suffit à Lui-Même, et est Digne de louange.", "german": " Wir verliehen Luqmân Weisheit, auf dass er Allah dankbar sein möchte: denn wer da dankbar ist, der ist dankbar zum Besten seiner eigenen Seele. Ist aber einer undankbar, dann ist wahrlich Allah Sich Selbst genügend, preiswürdig.", "spanish": " Concedimos la sabi­duría a Luqman, diciéndole: “ Sé gradecido con Al‑lah”, pues quien es agradecido lo es únicamente por el bien de su propia alma. Mas quien sea desagradecido, sepa que Al‑lah es ciertamente Autosuficiente, Merece­dor de alabanza.", "urdu": " اور ہم نے لقمان کو حکمت دی تھی اور کہا تھا کہ اللہ کا شکر ادا کر۔ اور جو شخص بھی شکر کرتا ہے اس کے شکر کرنے کا فائدہ اسی کی جان کو پہنچتا ہے اور جو ناشکری کرتا ہے (اسے یاد رکھنا چاہیئے کہ) اللہ سب قسم کے شکروں سے بے نیاز ہے (اور) بڑی حمد والا ہے۔"}, {"arabic": " وَ اِذۡ قَالَ لُقۡمٰنُ لِابۡنِہٖ وَ ہُوَ یَعِظُہٗ یٰبُنَیَّ لَا تُشۡرِکۡ بِاللّٰہِ ؕؔ اِنَّ الشِّرۡکَ لَظُلۡمٌ عَظِیۡمٌ ﴿۱۴﴾", "english": " And remember when Luqman said to his son while exhorting him, ‘O my dear son! associate not partners with Allah. Surely, associating partners with God is a grievous wrong.’", "french": " Et souviens-toi quand Lûqman dit à son fils tandis qu’il lui donnait des conseils : « Ô mon cher fils, n’attribue pas d’associés à Allāh. Assurément, c’est une grande injustice que d’attribuer des associés à Allāh. »", "german": " Und (denke daran) da Luqmân zu seinem Sohn sprach, indem er ihn ermahnte: \"O mein lieber Sohn, setze Allah keine Götter zur Seite, denn Götzendienst ist fürwahr eine schwere Sünde.\"", "spanish": " Y acuérdate de cuando Luq­man, dijo a su hijo mientras le exhortaba: “¡Oh, mi querido hijo! no asocies partícipes con Al‑lah. En ver­dad, asociar partícipes a Dios es una grave iniquidad”.", "urdu": " اور (یاد کرو) جب لقمان نے اپنے بیٹے کو نصیحت کرتے ہوئے کہا اے میرے بیٹے! اللہ کا شریک کسی کو مت قرار دے شرک یقیناً بہت بڑا ظلم ہے۔"}, {"arabic": " وَ وَصَّیۡنَا الۡاِنۡسَانَ بِوَالِدَیۡہِ ۚ حَمَلَتۡہُ اُمُّہٗ وَہۡنًا عَلٰی وَہۡنٍ وَّ فِصٰلُہٗ فِیۡ عَامَیۡنِ اَنِ اشۡکُرۡ لِیۡ وَ لِوَالِدَیۡکَ ؕ اِلَیَّ الۡمَصِیۡرُ ﴿۱۵﴾", "english": " And We have enjoined on man concerning his parents — his mother bears him in weakness upon weakness, and his weaning takes two years — ‘Give thanks to Me and to thy parents. Unto Me is the final return.", "french": " Et Nous avons enjoint à l’homme au sujet de ses parents – sa mère le porte de faiblesse en faiblesse et son sevrage prend deux ans – « Sois reconnaissant envers Moi et envers tes parents. Auprès de Moi est la destination finale .", "german": " Und Wir haben dem Menschen für seine Eltern ans Herz gelegt – seine Mutter trug ihn in Schwäche über Schwäche, und seine Entwöhnung erfordert zwei Jahre –: \"Sei dankbar Mir und deinen Eltern. Zu Mir ist die Heimkehr.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=31:15&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=31:15&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic16\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic16\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/31:16' style='text-decoration:underline'>31:16</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(16)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control16\"></i></button> <audio id=\"player16\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِنۡ جَاہَدٰکَ عَلٰۤی اَنۡ تُشۡرِکَ بِیۡ مَا لَیۡسَ لَکَ بِہٖ عِلۡمٌ ۙ فَلَا تُطِعۡہُمَا وَ صَاحِبۡہُمَا فِی الدُّنۡیَا مَعۡرُوۡفًا ۫ وَّ اتَّبِعۡ سَبِیۡلَ مَنۡ اَنَابَ اِلَیَّ ۚ ثُمَّ اِلَیَّ مَرۡجِعُکُمۡ فَاُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۱۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And if they contend with thee to make thee set up equals with Me concerning which thou hast no knowledge, obey them not, but be a kind companion to them in <em>all</em> worldly affairs; and <I>in spiritual matters </I>follow the way of him who turns to Me. Then unto Me will be your return and I shall inform you of what you used to do.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And if they contend with thee to make thee set up equals with Me concerning which thou hast no knowledge, obey them not, but be a kind companion to them in worldly affairs,<sup class='ref'>[<a class='ref' data-id='ref_31_16_2307' href='#'>2307</a>]</sup> and <i>in spiritual matters </i>follow the way of him who turns to Me. Then unto Me will be your return and I shall inform you of what you used to do; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_31_16_2307'>2307</span></div> <div><a name='2307'></a><div class='reference' data-id='ref_31_16_2307' style='display:none'> <p><b>2307.</b> If man’s duty to parents appears to clash and conflict with his duty to God, his first loyalty is to his Creator. But in disregarding any of the wishes or commands of his parents which clash with his loyalty to God he must not be arrogant or insolent to them; but should continue to show uniform courtesy, love and kindness to them. (<a href='javascript:void(0)' data-id='ref_31_16_2307' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اگر وہ دونوں (بھی) تجھ سے جھگڑا کریں کہ تُو میرا شریک ٹھہرا جس کا تجھے کوئی علم نہیں تو ان دونوں کی اطاعت نہ کر۔ اور اُن دونوں کے ساتھ دنیا میں دستور کے مطابق رفاقت جاری رکھ اور اس کے رستے کی اِتّباع کر جو میری طرف جھکا۔ پھر میری طرف ہی تمہارا لوٹ کر آنا ہے پھر میں تمہیں اُس سے آگاہ کروں گا جو تم کرتے رہے ہو ۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اگر وہ دونوں تجھ سے بحث کریں کہ تو کسی کو میرا شریک مقرر کر جس کا تجھے کوئی علم نہیں تو ان دونوں کی بات مت مانیو۔ ہاں دنیوی معاملات میں ان کے ساتھ نیک تعلقات قائم رکھیٶ اور اس شخص کے پیچھے چلیو جو میری طرف جھکتا ہے اور تم سب کا لوٹنا میری طرف ہی ہوگا۔ اس وقت میں تم کو تمہارے عمل سے خبردار کروں گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et s’ils discutent avec toi pour te faire associer des égaux à Moi, ce dont tu n’as aucune connaissance, ne leur obéis pas. Mais sois un compagnon pour eux dans ce monde de façon convenable et suis la voie de celui qui se tourne vers Moi. Ensuite c’est auprès de Moi que sera votre retour, et Je vous informerai de ce que vous faisiez. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Mas si disputan contigo para que Me asocies lo que desconoces, no les obedezcas; muéstrate amable con ellos en <em>todos </em>los asuntos mun­danos, pero <em>en los espirituales </em>sigue el camino de quien vuelve a Mí. Más tarde <em>todos</em> volveréis a Mí y os informaré de lo que solíais hacer”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Doch wenn sie mit dir eifern, damit du Mir das zur Seite setzest, wovon du keine Kenntnis hast, dann gehorche ihnen nicht. In weltlichen Dingen aber verkehre mit ihnen auf geziemende Weise. Doch folge dem Weg dessen, der sich zu Mir wendet. Dann werdet ihr zu Mir zurückkehren, und Ich werde euch verkünden, was ihr getan.\"", "spanish": " Hemos dado recomendaciones al hombre sobre sus padres -su madre lo lleva pena tras pena, y tarda dos años en destetarlo- “Dame gracias a Mí y a tus padres. Hacia Mí es el retorno final;", "urdu": " اور ہم نے یہ کہتے ہوئے کہ میرا اور اپنے والدین کا شکریہ ادا کر‘ انسان کو اپنے والدین کے متعلق (احسان کرنے کا) تاکیدی حکم دیا تھا (اور) اس کی ماں نے اسے کمزوری کے (ایک دور کے) بعد کمزوری (کے دوسرے دور) میں اٹھایا تھا۔ اور اس کا دودھ چھڑانا دو سال کے عرصہ میں تھا (یاد رکھو کہ) میری ہی طرف (تجھ کو) لوٹ کر آنا ہوگا۔"}, {"arabic": " یٰبُنَیَّ اِنَّہَاۤ اِنۡ تَکُ مِثۡقَالَ حَبَّۃٍ مِّنۡ خَرۡدَلٍ فَتَکُنۡ فِیۡ صَخۡرَۃٍ اَوۡ فِی السَّمٰوٰتِ اَوۡ فِی الۡاَرۡضِ یَاۡتِ بِہَا اللّٰہُ ؕ اِنَّ اللّٰہَ لَطِیۡفٌ خَبِیۡرٌ ﴿۱۷﴾", "english": " ‘O my dear son! even though it be the weight of a grain of mustard seed, and even though it be in a rock, or in the heavens, or in the earth, Allah will surely bring it out; verily Allah is the Knower of all subtleties, All-Aware.", "french": " « Ô mon cher fils ! Quand même ce serait du poids d’une graine de moutarde et quand même ce serait dans un rocher, ou dans les cieux ou dans la terre, assurément Allāh le ramènera ; en vérité, Allāh connaît très bien toutes les subtilités, Il est Très-Conscient.", "german": " „O mein lieber Sohn, hätte es auch nur das Gewicht eines Senfkorns und wäre es in einem Felsen oder in den Himmeln oder in der Erde, Allah wird es gewisslich hervorbringen. Wahrlich, Allah ist Kenner des Feinsten, allwissend.", "spanish": " “¡Oh, mi querido hijo! aunque tuviese el peso de un gramo de mos­taza, y aunque estuviese en una roca, en los cielos o en la tierra, Al‑lah ciertamente lo sacaría a la luz. En verdad, Al‑lah es el Conocedor de todas las sutilezas, el Omnisciente;", "urdu": " (لقمان نے کہا کہ) اے میرے بیٹے بات یہ ہے کہ اگر ایک عمل رائی کے دانہ کے برابر بھی ہو پھر وہ (رائی کے برابر عمل کسی) پتھر میں یا آسمانوں میں یا زمین میں چھپا ہوا ہو تو اللہ اس کو ظاہر کر دے گا۔ اللہ باریک سے باریک راز کو پالینے والا اور بہت خبردار ہے۔"}, {"arabic": " یٰبُنَیَّ اَقِمِ الصَّلٰوۃَ وَ اۡمُرۡ بِالۡمَعۡرُوۡفِ وَ انۡہَ عَنِ الۡمُنۡکَرِ وَ اصۡبِرۡ عَلٰی مَاۤ اَصَابَکَ ؕ اِنَّ ذٰلِکَ مِنۡ عَزۡمِ الۡاُمُوۡرِ ﴿ۚ۱۸﴾", "english": " ‘O my dear son! observe Prayer, and enjoin good, and forbid evil, and endure patiently whatever may befall thee. Surely this is of those matters which require firm resolve.", "french": " Ô mon cher fils ! Observe la Prière, et enjoins le bien, et interdis le mal, et supporte avec patience tout ce qui pourra te survenir. Assurément, ceci est parmi ces choses découlant d'une ferme détermination.", "german": " O mein lieber Sohn, verrichte das Gebet und gebiete Gutes und verbiete Böses und ertrage geduldig, was dich auch treffen mag. Das ist fürwahr ein Merkmal einer festen Gemütsart.", "spanish": " “¡Oh, mi querido hijo! cumple la Oración, recomienda el bien y prohíbe el mal y resiste pacientemente lo que pueda sobrevenirte. En verdad, éstos son los asuntos que exigen una firme resolución.", "urdu": " اے میرے بیٹے! نماز کو (تمام شرائط سے) قائم رکھ۔ اور معروف باتوں کا حکم دیتا رہ اور ناپسندیدہ باتوں سے روکتا رہ اور جو (تنگی ترشی) تجھے پہنچے اس پر صبر سے کام لے یہ بات یقیناً نہایت ہی ہمت والے کاموں میں سے ہے۔"}, {"arabic": " وَ لَا تُصَعِّرۡ خَدَّکَ لِلنَّاسِ وَ لَا تَمۡشِ فِی الۡاَرۡضِ مَرَحًا ؕ اِنَّ اللّٰہَ لَا یُحِبُّ کُلَّ مُخۡتَالٍ فَخُوۡرٍ ﴿ۚ۱۹﴾", "english": " ‘And turn not thy cheek away from men in pride nor walk in the earth haughtily; Surely, Allah loves not any arrogant boaster.", "french": " Et ne détourne pas ton visage des hommes avec orgueil et ne marche pas non plus hautainement sur la terre ; assurément Allāh n'aime point tout arrogant vaniteux. »", "german": " Und weise deine Wange nicht verächtlich den Menschen und wandle nicht hochmütig auf Erden; denn Allah liebt keine eingebildeten Prahler.", "spanish": " “No hinches tus mejillas con orgullo, ni andes por la tierra con insolencia; en verdad Al‑lah no ama a quien se comporta con arrogancia y jactancia.", "urdu": " اور اپنے گال لوگوں کے سامنے (غصہ سے) مت پھلا۔ اور زمین میں تکبر سے مت چل۔ اللہ یقیناً ہر شیخی کرنے والے اور فخر کرنے والے سے پیار نہیں کرتا۔"}, {"arabic": " وَ اقۡصِدۡ فِیۡ مَشۡیِکَ وَ اغۡضُضۡ مِنۡ صَوۡتِکَ ؕ اِنَّ اَنۡکَرَ الۡاَصۡوَاتِ لَصَوۡتُ الۡحَمِیۡرِ ﴿٪۲۰﴾", "english": " ‘And walk thou at a moderate pace, and lower thy voice; verily, the most disagreeable of voices is the voice of the ass.’", "french": " Et marche à allure modérée, et baisse ta voix ; en vérité, la plus désagréable des voix est celle de l’âne. »", "german": "", "spanish": " “Anda con paso moderado y baja la voz; en verdad, la voz más desagradable de todas es la voz de los asnos”.", "urdu": " اور اپنی رفتار میں میانہ روی اختیار کر اور اپنی آواز کو دھیما رکھا کر (کیونکہ) آوازوں میں سے سب سے زیادہ ناپسندیدہ آواز گدھے کی آواز ہے (جو بہت اونچی ہوتی ہے) ۔"}, {"arabic": " اَلَمۡ تَرَوۡا اَنَّ اللّٰہَ سَخَّرَ لَکُمۡ مَّا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ وَ اَسۡبَغَ عَلَیۡکُمۡ نِعَمَہٗ ظَاہِرَۃً وَّ بَاطِنَۃً ؕ وَ مِنَ النَّاسِ مَنۡ یُّجَادِلُ فِی اللّٰہِ بِغَیۡرِ عِلۡمٍ وَّ لَا ہُدًی وَّ لَا کِتٰبٍ مُّنِیۡرٍ ﴿۲۱﴾", "english": " Have you not seen that Allah has pressed for you into service whatever is in the heavens and whatever is in the earth, and has completed His favours on you, both externally and internally? And among men there are some who dispute concerning Allah, without knowledge or guidance or an illuminating Book.", "french": " N’avez-vous pas vu qu’Allāh vous a assujetti tout ce qui est dans les cieux et tout ce qui est sur la terre, et a complété Ses faveurs sur vous, tant extérieurement qu'intérieurement ! Et parmi les hommes il y en a qui discutent au sujet d’Allāh, sans connaissance, ni direction, ni Livre éclairant.", "german": " Habt ihr nicht gesehen, dass Allah euch alles dienstbar gemacht hat, was in den Himmeln und was auf der Erde ist, und Seine Wohltaten reichlich über euch ergossen hat, äußerlich wie innerlich? Und doch gibt es unter den Menschen so manchen, der über Allah streitet, ohne Kenntnis und ohne Führung und ohne ein erleuchtendes Buch.", "spanish": " ¿No habéis visto que Al‑lah ha sometido a vuestro servicio todo lo que hay en los cielos y todo lo que hay en la tierra, y os ha dado Sus favores, tanto exterior como interior­mente? Entre los hombres los hay que disputan en relación con Al‑lah, sin conocimiento ni guía y sin un Libro lúcido.", "urdu": " کیا تم (لوگوں) نے نہیں دیکھا کہ اللہ نے جو کچھ آسمانوں میں ہے اور زمین میں ہے تمہاری خدمت میں لگایا ہوا ہے اور تم پر اپنی نعمتیں خواہ ظاہری ہوں یا باطنی پانی کی طرح بہادی ہیں اور لوگوں میں سے بعض ایسے ہیں جو بغیر علم اور بغیر ہدایت اور بغیر کسی روشن کتاب کی دلیل کے اللہ کے بارہ میں بحث کرتے ہیں۔"}, {"arabic": " وَ اِذَا قِیۡلَ لَہُمُ اتَّبِعُوۡا مَاۤ اَنۡزَلَ اللّٰہُ قَالُوۡا بَلۡ نَتَّبِعُ مَا وَجَدۡنَا عَلَیۡہِ اٰبَآءَنَا ؕ اَوَ لَوۡ کَانَ الشَّیۡطٰنُ یَدۡعُوۡہُمۡ اِلٰی عَذَابِ السَّعِیۡرِ ﴿۲۲﴾", "english": " And when it is said to them, ‘Follow that which Allah has revealed,’ they say, ‘Nay, we shall follow that which we found our fathers following.’ What! even though Satan was inviting them to the punishment of the burning fire?", "french": " Et lorsqu’il leur est dit : « Suivez ce qu’Allāh a révélé, » ils répondent : « Non, nous suivrons ce que nous avons trouvé nos pères en train de suivre. » Comment ! Même si Satan les invitait vers le châtiment de la Fournaise ?", "german": " Und wenn zu ihnen gesprochen wird: \"Folget dem, was Allah herniedergesandt hat\", dann sagen sie: \"Nein, wir wollen dem folgen, wobei wir unsere Väter vorfanden.\" Wie! selbst wenn der Satan sie zu der Strafe des brennenden Feuers lädt?", "spanish": " Mas cuando se les dice: “Seguid lo que Al‑lah ha revelado”, responden: “¡No! seguiremos lo que vimos que seguían nuestros pa­dres”. ¡Cómo! ¿aunque Satanás les estuviera invitando al castigo del fuego ardiente?", "urdu": " اور جب انہیں کہا جاتا ہے کہ جو کچھ اللہ نے اتارا ہے اس کی اتباع کرو۔ تو کہتے ہیں‘ نہیں! ہم تو اس کی اتباع کریں گے جس پر ہم نے اپنے باپ دادوں کو پایا ہے۔ کیا اگر شیطان (ان کے باپ دادوں کے ذریعہ سے) ان کو دوزخ کے عذاب کی طرف بلا رہا ہو (پھر بھی وہ ایسا کریں گے) ۔"}, {"arabic": " وَ مَنۡ یُّسۡلِمۡ وَجۡہَہٗۤ اِلَی اللّٰہِ وَ ہُوَ مُحۡسِنٌ فَقَدِ اسۡتَمۡسَکَ بِالۡعُرۡوَۃِ الۡوُثۡقٰی ؕ وَ اِلَی اللّٰہِ عَاقِبَۃُ الۡاُمُوۡرِ ﴿۲۳﴾", "english": " And he who submits himself completely to Allah, and is a doer of good, he has surely grasped a strong handle. And with Allah rests the end of all affairs.", "french": " Et celui qui se soumet complètement à Allāh, et qui accomplit de bonnes œuvres, il a sûrement saisi une poignée solide. Et c’est avec Allāh que repose la fin de toutes les affaires.", "german": " Wer aber sein Antlitz auf Allah richtet und Gutes tut, der hat fürwahr die festeste Handhabe ergriffen. Und bei Allah ruht das Ende aller Dinge.", "spanish": " Quien se somete totalmente a Al-lah, y hace el bien, en verdad se ha aferrado a un sólido amarre. Pues en Al-lah está el fin de todos los asuntos.", "urdu": " اور جو شخص اپنی توجہ کو اللہ کی طرف پھیر دیتا ہے اور وہ اپنے عمل میں بھی پورا محتاط ہے تو وہ ایسا ہے کہ (گویا) اس نے ایک مضبوط کڑے کو پکڑ لیا ہے اور اللہ کی طرف ہی تمام کاموں کا انجام پھرتا ہے۔"}, {"arabic": " وَ مَنۡ کَفَرَ فَلَا یَحۡزُنۡکَ کُفۡرُہٗ ؕ اِلَیۡنَا مَرۡجِعُہُمۡ فَنُنَبِّئُہُمۡ بِمَا عَمِلُوۡا ؕ اِنَّ اللّٰہَ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۲۴﴾", "english": " And as for him who disbelieves, let not his disbelief grieve thee. Unto Us is their return and We shall tell them what they did; surely Allah knows full well what is in the breasts.", "french": " Et quant à celui qui ne croit pas, que sa mécréance ne t’afflige pas. C’est à Nous qu’ils retourneront, et Nous leur informerons de ce qu’ils ont fait ; assurément Allāh sait très bien ce qui est dans les poitrines.", "german": " Und jener, der ungläubig ist, lass seinen Unglauben dich nicht bekümmern. Zu Uns wird ihre Heimkehr sein, dann werden Wir ihnen verkünden, was sie getan; denn Allah weiß recht wohl, was in den Herzen ist.", "spanish": " En cuanto a quien no cree, no dejes que su incredulidad te angustie. A Nosotros será su retorno y les diremos lo que hicieron; en verdad, Al‑lah conoce perfectamente lo que hay en los corazones.", "urdu": " اور جو لوگ کفر کریں ان کا کفر تجھے غمگین نہ کرے۔ ان کو آخر ہماری طرف ہی لوٹنا پڑے گا۔ پھر ہم ان کو ان کے اعمال کی حقیقت سے خبردار کریں گے۔ اللہ یقیناً سینہ کے اندر کی سب باتوں کو جانتا ہے۔"}, {"arabic": " نُمَتِّعُہُمۡ قَلِیۡلًا ثُمَّ نَضۡطَرُّہُمۡ اِلٰی عَذَابٍ غَلِیۡظٍ ﴿۲۵﴾", "english": " We shall let them enjoy themselves a little; then We shall drive them to a severe torment.", "french": " Nous leur permettrons de jouir des bénéfices temporaires pour peu de temps ; ensuite Nous les pousserons vers un châtiment terrible.", "german": " Wir werden sie eine kleine Weile sich ergötzen lassen; dann aber werden Wir sie zu strenger Strafe treiben.", "spanish": " Los dejaremos disfrutar un poco; después los conduciremos a un severo tormento.", "urdu": " ہم ان کو کچھ عرصہ تک دنیوی فائدہ پہنچائیں گے۔ پھر ہم ان کو مجبور کرکے بڑے سخت عذاب کی طرف لے جائیں گے۔"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ مَّنۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ لَیَقُوۡلُنَّ اللّٰہُ ؕ قُلِ الۡحَمۡدُ لِلّٰہِ ؕ بَلۡ اَکۡثَرُہُمۡ لَا یَعۡلَمُوۡنَ ﴿۲۶﴾", "english": " And if thou ask them, ‘Who created the heavens and the earth?’, they will surely answer, ‘Allah.’ Say, ‘All praise belongs to Allah.’ But most of them know not.", "french": " Et si tu leur demandes : « Qui a créé les cieux et la terre ? » ils répondront assurément : « Allāh. » Dis : « Toutes les louanges appartiennent à Allāh. » Mais la plupart d’entre eux ne savent pas.", "german": " Und wenn du sie fragst: \"Wer schuf die Himmel und die Erde?\" – dann werden sie gewiss antworten: \"Allah\". Sprich: \"Aller Preis gebührt Allah.\" Jedoch die meisten von ihnen wissen es nicht.", "spanish": " Y si les preguntas: “¿Quién creó los cielos y la tierra?”, respon­derán ciertamente: “Al‑lah”. Di­les: “Toda alabanza corresponde a Al‑lah”. Sin embargo, la mayoría de ellos lo desconocen.", "urdu": " اور اگر تو ان سے پوچھے کہ آسمانوں اور زمین کو کس نے پیدا کیا ہے تو وہ ضرور کہیں گے اللہ نے۔ تو اُن سے کہہ (ٹھیک ہے) سب تعریف اللہ ہی کی ہے مگر ان (منکروں) میں سے اکثر یہ بات نہیں جانتے۔"}, {"arabic": " لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ اِنَّ اللّٰہَ ہُوَ الۡغَنِیُّ الۡحَمِیۡدُ ﴿۲۷﴾", "english": " To Allah belongs whatever is in the heavens and the earth. Verily, Allah is Self-Sufficient, Praiseworthy.", "french": " A Allāh appartient tout ce qui est dans les cieux et sur la terre. En vérité, Allāh est Celui Qui Se suffit à Lui-Même, le Digne de louange", "german": " Allahs ist, was in den Himmeln und auf Erden ist. Wahrlich, Allah ist der Sich Selbst Genügende, der Preiswürdige.", "spanish": " A Al‑lah pertenece cuanto hay en los cielos y en la tierra. En verdad, Al‑lah es Auto‑Suficiente, Merecedor de alabanza.", "urdu": " آسمانوں اور زمین میں جو کچھ ہے اللہ ہی کا ہے۔ اللہ ہی یقیناً وہ (ذات) ہے جو (ہر عبادت اور تعریف سے) بے نیاز ہے (مگر ساتھ ہی) وہ سب تعریفوں کا بھی مستحق ہے۔"}, {"arabic": " وَ لَوۡ اَنَّ مَا فِی الۡاَرۡضِ مِنۡ شَجَرَۃٍ اَقۡلَامٌ وَّ الۡبَحۡرُ یَمُدُّہٗ مِنۡۢ بَعۡدِہٖ سَبۡعَۃُ اَبۡحُرٍ مَّا نَفِدَتۡ کَلِمٰتُ اللّٰہِ ؕ اِنَّ اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿۲۸﴾", "english": " And if all the trees that are in the earth were pens, and the ocean were ink , with seven oceans swelling it thereafter, the words of Allah would not be exhausted. Surely, Allah is Mighty, Wise.", "french": " Et si tous les arbres qui se trouvent sur la terre étaient des plumes, et l’océan était de l’encre , renforcé de sept autres océans par la suite, les paroles d’Allāh ne seraient pas épuisées. Assurément, Allāh est Puissant, Sage.", "german": " Und wenn alle Bäume, die auf der Erde sind, Federn wären, und der Ozean (Tinte), und sieben Ozeane würden nachträglich ihm zugefügt, selbst dann könnten Allahs Zeichen nicht erschöpft werden. Wahrlich, Allah ist allmächtig, allweise.", "spanish": " Si todos los árboles que hay en la tierra fuesen plumas; y el mar, con la ayuda de otros siete mares fuese tinta, no podrían agotarse las palabras de Al‑lah. En verdad,", "urdu": " اور اگر زمین میں جتنے درخت ہیں ان کی قلمیں بن جائیں اور سمندر سیاہی سے بھرا ہوا ہو۔ اس طرح کہ سات اور سیاہی کے سمندر اس میں ملا دئے جائیں تو بھی اللہ کے نشان ختم نہیں ہوں گے۔ اللہ یقیناً غالب (اور) بڑی حکمتوں والا ہے۔"}, {"arabic": " مَا خَلۡقُکُمۡ وَ لَا بَعۡثُکُمۡ اِلَّا کَنَفۡسٍ وَّاحِدَۃٍ ؕ اِنَّ اللّٰہَ سَمِیۡعٌۢ بَصِیۡرٌ ﴿۲۹﴾", "english": " Your creation and your resurrection are only like the creation and resurrection of a single soul. Verily Allah is All-Hearing, All-Seeing.", "french": " Votre création et votre résurrection ne sont que comme la création et la résurrection d’ un seul être. En vérité Allāh entend tout et voit tout.", "german": " Eure Erschaffung und eure Auferweckung sind nur die eines einzigen Wesens. Wahrlich, Allah ist allhörend, allsehend.", "spanish": " Vuestra creación y vuestra resurrección son únicamente como la creación y la resurrección de un solo ser. En verdad, Al‑lah es Quien todo lo oye, Todo lo ve.", "urdu": " تم سب کی پیدائش اور تمہارا زندہ کرکے اٹھایا جانا صرف ایک شخص کی پیدائش کی طرح ہے اللہ یقیناً بہت سننے والا (اور) بہت دیکھنے والا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اَنَّ اللّٰہَ یُوۡلِجُ الَّیۡلَ فِی النَّہَارِ وَ یُوۡلِجُ النَّہَارَ فِی الَّیۡلِ وَ سَخَّرَ الشَّمۡسَ وَ الۡقَمَرَ ۫ کُلٌّ یَّجۡرِیۡۤ اِلٰۤی اَجَلٍ مُّسَمًّی وَّ اَنَّ اللّٰہَ بِمَا تَعۡمَلُوۡنَ خَبِیۡرٌ ﴿۳۰﴾", "english": " Hast thou not seen that Allah makes the night pass into the day, and makes the day pass into the night, and He has pressed the sun and the moon into service; each pursuing its course till an appointed term, and that Allah is well aware of what you do?", "french": " N’as-tu pas vu qu’Allāh fait pénétrer la nuit dans le jour, et fait pénétrer le jour dans la nuit, et qu’Il a assujetti le soleil et la lune, chacun poursuivant son cours jusqu’à un terme désigné, et qu’Allāh est très conscient de ce que vous faites ?", "german": " Hast du denn nicht gesehen, dass Allah die Nacht in den Tag übergehen lässt und den Tag übergehen lässt in die Nacht und dass Er die Sonne und den Mond dienstbar gemacht, so dass jedes seine Bahn läuft zu einem bestimmten Ziel, und dass Allah wohl kundig ist dessen, was ihr tut?", "spanish": " ¿No has visto que Al‑lah hace que la noche se convierta en día, y hace que el día se convierta en noche, y que ha puesto en servicio el sol y la luna, cada uno de los cuales sigue su rumbo hasta el plazo fijado; y que Al‑lah conoce perfectamente lo que hacéis?", "urdu": " کیا تو نے دیکھا نہیں کہ اللہ رات کو دن میں داخل کر دیتا ہے اور دن کو رات میں داخل کر دیتا ہے اور سورج اور چاند کو اس نے خدمت پر لگا چھوڑا ہے۔ ان میں سے ہر ایک مدت مقررہ تک کے لئے چلتا چلا جاتا ہے اور اللہ تمہارے اعمال سے اچھی طرح واقف ہے۔"}, {"arabic": " ذٰلِکَ بِاَنَّ اللّٰہَ ہُوَ الۡحَقُّ وَ اَنَّ مَا یَدۡعُوۡنَ مِنۡ دُوۡنِہِ الۡبَاطِلُ ۙ وَ اَنَّ اللّٰہَ ہُوَ الۡعَلِیُّ الۡکَبِیۡرُ ﴿٪۳۱﴾", "english": " That is because it is Allah alone Who is the True God , and whatever they call upon beside Him is falsehood, and because it is Allah alone Who is the Most High, the Incomparably Great.", "french": " La raison en est qu’Allāh Seul est le Vrai Dieu , et que tout ce qu’ils invoquent en dehors de Lui n’est que mensonge, et parce que c’est Allāh Seul Qui est le Très-Haut, l’Incomparablement Grand.", "german": " Dies, weil Allah allein die Wahrheit ist – und was sie sonst außer Ihm anrufen, ist Falsches – und weil Allah, Er, der Erhabene ist, der Große.", "spanish": " Esto es porque sólo Al‑lah es el Dios Verdadero, y todo lo que ellos invocan fuera de Él es falsedad, y porque sólo Al‑lah es el Excelso, el Incomparablemente Grande.", "urdu": " یہ سب کچھ اس لئے ہو رہا ہے کہ اللہ کی ذات سچی اور قائم رہنے والی ہے اور اس لئے کہ جن کو وہ لوگ اس کے سوا پکارتے ہیں وہ جھوٹے اور فنا ہونے والے ہیں اور اللہ یقیناً بہت بلند اور وسیع شان والا ہے۔"}, {"arabic": " اَلَمۡ تَرَ اَنَّ الۡفُلۡکَ تَجۡرِیۡ فِی الۡبَحۡرِ بِنِعۡمَتِ اللّٰہِ لِیُرِیَکُمۡ مِّنۡ اٰیٰتِہٖ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّکُلِّ صَبَّارٍ شَکُوۡرٍ ﴿۳۲﴾", "english": " Dost thou not see that the ships sail on the sea by the favour of Allah, that He may show you of His Signs? Therein surely are Signs for everyone who is patient and grateful.", "french": " Ne vois-tu pas que les navires voguent sur la mer par la grâce d’Allāh, afin qu’Il vous montre de Ses Signes ? Il y a assurément en cela des Signes pour quiconque est endurant et reconnaissant.", "german": " Hast du denn nicht gesehen, dass die Schiffe über das Meer hinsegeln mit Allahs Gaben, auf dass Er euch von Seinen Zeichen zeige? Hierin sind wahrlich Zeichen für jeden Standhaften, Dankbaren.", "spanish": " ¿No ves acaso que los buques navegan por el mar por la gracia de Al‑lah, para que os muestre Sus Signos? En ello hay ciertamente Señales para todo el que sea paciente y agradecido.", "urdu": " کیا تو نے دیکھا نہیں کہ کشتیاں اللہ کی نعمت کے ساتھ سمندر میں چلتی ہیں تا کہ وہ تم کو اپنے نشانات دکھائے۔ اس میں ہر بڑے صابر اور ہر بڑے شکر گذار بندے کے لئے بہت سے نشان ہیں۔"}, {"arabic": " وَ اِذَا غَشِیَہُمۡ مَّوۡجٌ کَالظُّلَلِ دَعَوُا اللّٰہَ مُخۡلِصِیۡنَ لَہُ الدِّیۡنَ ۬ۚ فَلَمَّا نَجّٰہُمۡ اِلَی الۡبَرِّ فَمِنۡہُمۡ مُّقۡتَصِدٌ ؕ وَ مَا یَجۡحَدُ بِاٰیٰتِنَاۤ اِلَّا کُلُّ خَتَّارٍ کَفُوۡرٍ ﴿۳۳﴾", "english": " And when waves engulf them like so many coverings, they call upon Allah, being sincere to Him in faith; but when He brings them safe to land, then some of them take the right course. And none denies Our Signs save every perfidous and ungrateful person.", "french": " Et lorsque les vagues les enveloppent comme autant de couvertures, ils invoquent Allāh, étant sincères dans leur foi en Lui ; mais lorsqu’Il les ramène sains et saufs à terre, alors certains d’entre eux suivent le droit chemin. Et personne ne nie Nos Signes sauf les perfides et les ingrats endurcis.", "german": " Und wenn Wogen sie bedecken gleich Hüllen, dann rufen sie Allah an, in lauterem Gehorsam gegen Ihn; doch rettet Er sie dann ans Land, so folgen (nur) einige von ihnen der rechten Bahn. Und niemand leugnet Unsere Zeichen, außer allen Treulosen, Undankbaren.", "spanish": " Cuando las olas los cubren como mantos espesos , invocan a Al‑lah, con sinceridad en Él en la fe; pero cuando Él los lleva seguros a tierra firme, entonces algunos de ellos siguen el camino recto. Mas nadie niega Nuestros Signos salvo las personas pérfidas y desagradecidas.", "urdu": " اور جب انہیں کوئی موج سایہ کی طرح ڈھانک لیتی ہے تو وہ عبادت کو صرف اللہ کے لئے مخصوص کرتے ہوئے اس کو پکارتے ہیں۔ پھر جب وہ انہیں خشکی کی طرف نجات دے دیتا ہے تو ان میں سے کچھ لوگ میانہ روی پر قائم رہتے ہیں (اور کچھ پھر وہی ظلم اور شرک کرنے لگ جاتے ہیں) اور ہماری آیتوں کا انکار صرف بدعہد اور ناشکرا ہی کرتا ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّاسُ اتَّقُوۡا رَبَّکُمۡ وَ اخۡشَوۡا یَوۡمًا لَّا یَجۡزِیۡ وَالِدٌ عَنۡ وَّلَدِہٖ ۫ وَ لَا مَوۡلُوۡدٌ ہُوَ جَازٍ عَنۡ وَّالِدِہٖ شَیۡئًا ؕ اِنَّ وَعۡدَ اللّٰہِ حَقٌّ فَلَا تَغُرَّنَّکُمُ الۡحَیٰوۃُ الدُّنۡیَا ٝ وَ لَا یَغُرَّنَّکُمۡ بِاللّٰہِ الۡغَرُوۡرُ ﴿۳۴﴾", "english": " O men, seek protection with your Lord and fear the day when the father will not be of any avail to his son, nor will the son at all be of any avail to his father. Allah’s promise is surely true. So let not worldly life beguile you, nor let the Deceiver deceive you concerning Allah.", "french": " Ô hommes, cherchez protection auprès de votre Seigneur, et craignez le jour où le père ne sera d’aucun secours à son fils, ni le fils d’aucun secours à son père. La promesse d’Allāh est assurément vraie. Aussi, ne laissez pas la vie de ce monde vous séduire, et ne laissez pas non plus le Trompeur vous tromper concernant Allāh.", "german": " O ihr Menschen, fürchtet euren Herrn und fürchtet den Tag, da der Vater nicht Buße leisten wird für seinen Sohn, noch wird der Sohn im geringsten Buße leisten können für seinen Vater. Allahs Verheißung ist wahr. Das Leben dieser Welt soll euch nicht täuschen, noch soll der Verführer euch täuschen über Allah.", "spanish": " Oh, humanos, buscad la pro­tección junto a vuestro Señor y temed el día en que el padre no pueda hacer nada por su hijo ni el hijo pueda hacer nada por su padre. La promesa de Al‑lah es en verdad cierta. No dejéis pues que la vida mundana os seduzca y que el Engañador os en­gañe respecto a Al‑lah.", "urdu": " اے لوگو! اپنے رب کا تقویٰ اختیار کرو اور اس دن سے ڈرو جس دن کوئی باپ بھی اپنے بیٹے کے کام نہ آسکے گا اور نہ کوئی بیٹا اپنے باپ کے کام آسکے گا۔ اللہ کا وعدہ ضرور پورا ہو کر رہتا ہے۔ پس دنیا کی زندگی تم کو دھوکا میں نہ ڈال دے اور نہ دھوکا دینے والا شیطان تم کو اللہ کے بارے میں دھوکا میں ڈالے۔"}, {"arabic": " اِنَّ اللّٰہَ عِنۡدَہٗ عِلۡمُ السَّاعَۃِ ۚ وَ یُنَزِّلُ الۡغَیۡثَ ۚ وَ یَعۡلَمُ مَا فِی الۡاَرۡحَامِ ؕ وَ مَا تَدۡرِیۡ نَفۡسٌ مَّاذَا تَکۡسِبُ غَدًا ؕ وَ مَا تَدۡرِیۡ نَفۡسٌۢ بِاَیِّ اَرۡضٍ تَمُوۡتُ ؕ اِنَّ اللّٰہَ عَلِیۡمٌ خَبِیۡرٌ ﴿٪۳۵﴾", "english": " Verily, with Allah alone is the knowledge of the Hour. And He sends down the rain, and He knows what is in the wombs. And no soul knows what it will earn tomorrow, and no soul knows in what land it will die. Surely, Allah is All-Knowing, All-Aware.", "french": " En vérité, Allāh Seul possède la connaissance de l’Heure. Et Il envoie la pluie, et Il sait ce qui est dans les matrices. Et aucune âme ne sait ce qu’elle acquerra demain, et aucune âme ne sait sur quelle terre elle mourra. Assurément, Allāh est Omniscient, Très-Conscient.", "german": " Wahrlich, bei Allah allein ist die Kenntnis der \"Stunde\". Er sendet den Regen nieder, und Er weiß, was in den Mutterschößen ist. Niemand weiß, was er sich morgen eintragen wird, und niemand weiß, in welchem Lande er sterben wird. Wahrlich, Allah ist allwissend, allkundig.", "spanish": " En verdad, sólo Al‑lah posee el conocimiento de la Hora. Él envía la lluvia y sabe lo que hay en los vientres. Nadie sabe lo que ganará mañana ni en qué lugar morirá. En verdad, Al‑lah es el Omnisciente, el Enterado de todo.", "urdu": " قیامت (یا کسی قوم کے آخری فیصلہ) کا علم اللہ ہی کو ہے اور وہی بارش نازل کرتا ہے اور رحموں میں جو کچھ ہے اسے جانتا ہے اور کوئی شخص نہیں جانتا کہ کل وہ کیا عمل کرے گا اور نہ کوئی شخص جانتا ہے کہ وہ کس زمین میں مرے گا۔ اللہ ہی یقیناً جاننے والا (اور) خبر رکھنے والا ہے۔"}], "Surah": 31}