{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " قُلۡ اُوۡحِیَ اِلَیَّ اَنَّہُ اسۡتَمَعَ نَفَرٌ مِّنَ الۡجِنِّ فَقَالُوۡۤا اِنَّا سَمِعۡنَا قُرۡاٰنًا عَجَبًا ۙ﴿۲﴾", "english": " Say, “It has been revealed to me that a company of the Jinn listened, and they said: ‘Truly we have heard a Qur’an that is wonderful,", "french": " Dis : « Il m’a été révélé qu’un groupe de djinns écoutèrent avec attention, ensuite ils dirent : 'En vérité, nous avons entendu un Coran qui est merveilleux,", "german": "", "spanish": " Diles; “Me ha sido revelado que un grupo de los Yinn escuchó y dijeron: “en verdad, hemos oído un Corán que es maravilloso”.", "urdu": " تو کہہ دے مجھے وحی کی گئی ہے کہ یقیناً جنوں کے ایک گروہ نے (قرآن) سنا سو (جب وہ اپنی قوم کی طرف لوٹ کر گئے تو) انہوں نے اپنی قوم سے کہا کہ ہم نے ایک عجیب قرآن سنا ہے ۔"}, {"arabic": " یَّہۡدِیۡۤ اِلَی الرُّشۡدِ فَاٰمَنَّا بِہٖ ؕ وَ لَنۡ نُّشۡرِکَ بِرَبِّنَاۤ اَحَدًا ۙ﴿۳﴾", "english": " ‘It guides to the right way; so we have believed in it, and we will not associate any one with our Lord.", "french": " Il guide vers la droiture ; alors nous y avons cru, et nous n’associerons personne à notre Seigneur.", "german": " der zur Rechtschaffenheit leitet; so haben wir an ihn geglaubt, und wir werden unserem Herrn nie jemanden zur Seite stellen.", "spanish": " “Guía al camino recto; por lo que hemos creído en él y no asociaremos a nadie con nuestro Señor”.", "urdu": " وہ ہدایت کی طرف لے جاتا ہے جس کے نتیجہ میں ہم اس پر ایمان لے آئے ہیں اور ہم آئندہ کبھی اپنے رب کا کسی کو شریک نہیں قرار دیں گے۔"}, {"arabic": " وَّ اَنَّہٗ تَعٰلٰی جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَۃً وَّ لَا وَلَدًا ۙ﴿۴﴾", "english": " ‘And we believe that the majesty of our Lord is exalted. He has taken neither wife nor son unto Himself.", "french": " Et nous croyons que la majesté de notre Seigneur est fort exaltée. Il ne S’est pris ni épouse ni fils.", "german": " Und die Majestät unseres Herrn ist hoch erhaben. Er hat Sich weder Gattin noch Sohn zugesellt.", "spanish": " “Y creemos que la majestad de nuestro Señor es elevada. Él no ha tomado esposa ni ha tenido hijos”.", "urdu": " اور حق یہ ہے کہ ہمارا رب بہت بلند شان والا ہے اور نہ اس نے کبھی کوئی بیوی بنائی ہے اور نہ بیٹا بنایا ہے۔"}, {"arabic": " وَّ اَنَّہٗ کَانَ یَقُوۡلُ سَفِیۡہُنَا عَلَی اللّٰہِ شَطَطًا ۙ﴿۵﴾", "english": " ‘And it is true that the foolish amongst us used to utter extravagant lies concerning Allah.", "french": " Et c’est vrai qu’un imbécile parmi nous proférait des mensonges outranciers sur Allāh.", "german": " Und die Toren unter uns pflegten abscheuliche Lügen wider Allah zu äußern.", "spanish": " “Y es cierto que el insensato de entre nosotros solía proferir mentiras extravagantes sobre Al-lah”.", "urdu": " اور یہ بھی حقیقت ہے کہ ہم میں سے بیوقوف لوگ اللہ کے متعلق ناواجب باتیں کہا کرتے تھے۔"}, {"arabic": " وَّ اَنَّا ظَنَنَّاۤ اَنۡ لَّنۡ تَقُوۡلَ الۡاِنۡسُ وَ الۡجِنُّ عَلَی اللّٰہِ کَذِبًا ۙ﴿۶﴾", "english": " ‘And we thought that men and Jinn would never speak a lie concerning Allah.", "french": " Et nous avions pensé que les hommes et les djinns ne proféreraient jamais de mensonge sur Allāh.", "german": " Und wir hatten angenommen, weder Menschen noch Jinn würden je eine Lüge über Allah sprechen.", "spanish": " “Y pensamos que los hombres y los Yinn nunca dirían mentiras respecto a Al-lah”.", "urdu": " اور ہم اس خیال پر تھے کہ انسان اور جن اللہ کے متعلق تو جھوٹ نہیں بول سکتے۔"}, {"arabic": " وَّ اَنَّہٗ کَانَ رِجَالٌ مِّنَ الۡاِنۡسِ یَعُوۡذُوۡنَ بِرِجَالٍ مِّنَ الۡجِنِّ فَزَادُوۡہُمۡ رَہَقًا ۙ﴿۷﴾", "english": " ‘And indeed some men from among the common folk used to seek the protection of some men from among the Jinn, and they thus increased the latter in their pride;", "french": " Et en vérité, il y avait des hommes parmi les gens ordinaires qui cherchaient la protection de certains hommes parmi ceux considérés comme des grands, et ils ont ainsi fait ces derniers persister davantage dans leurs mauvaises actions et leur imbécillité,", "german": " Und freilich pflegten einige Leute unter den gewöhnlichen Menschen bei einigen Leuten unter den Jinn Schutz zu suchen, so dass sie (letztere) in ihrer Bosheit bestärkten;", "spanish": " “Y en verdad, algunos hombres de entre el pueblo llano solían buscar a protección de algunos hombres pertenecientes a los Yinn, y así aumentaron el orgullo de estos últimos”;", "urdu": " اور پھر یہ بھی حقیقت ہے کہ انسانوں میں سے کچھ لوگ ایسے تھے جو جنوں میں سے کچھ افراد کی پناہ مانگا کرتے تھے سو اس کا نتیجہ یہ ہوا (کہ انسانوں کے جنوں کی پناہ مانگنے نے) جنوں کو تکبر میں اور بھی بڑھا دیا۔"}, {"arabic": " وَّ اَنَّہُمۡ ظَنُّوۡا کَمَا ظَنَنۡتُمۡ اَنۡ لَّنۡ یَّبۡعَثَ اللّٰہُ اَحَدًا ۙ﴿۸﴾", "english": " ‘And indeed they thought, even as you think, that Allah would never raise any Messenger .", "french": " Et, en vérité, ils pensaient, tout comme vous le pensez, qu’Allāh ne susciterait jamais quelqu’un en tant que Messager .", "german": " und freilich dachten sie, ebenso wie ihr denket, Allah würde nie einen (Propheten) erwecken.", "spanish": " “Y ciertamente pensaron, al igual que pensáis vosotros, que Al-lah nunca suscitaría a ningún Mensajero”.", "urdu": " اور یقیناً وہ بھی یہی گمان کیا کرتے تھے جیسا کہ تم گمان کرتے ہو کہ اللہ (تعالیٰ) آئندہ کبھی کسی کو بنا کرمبعوث نہیں کرے گا۔"}, {"arabic": " وَّ اَنَّا لَمَسۡنَا السَّمَآءَ فَوَجَدۡنٰہَا مُلِئَتۡ حَرَسًا شَدِیۡدًا وَّ شُہُبًا ۙ﴿۹﴾", "english": " ‘And we sought to reach heaven, but we found it filled with strong guards and shooting stars.", "french": " Et, en vérité, nous avons cherché à atteindre le ciel, mais nous l’avons trouvé rempli de gardes solides et de flammes de feu,", "german": " Und wir suchten den Himmel, doch wir fanden ihn mit starken Wächtern und schießenden Sternen erfüllt.", "spanish": " “E intentamos llegar al cielo, pero lo encontramos lleno de fuertes guardianes y estrellas brillantes”.", "urdu": " اور ہم نے آسمان کو چھوا (یعنی آسمانی علوم حاصل کرنے کی کوشش کی) مگر ہم نے اس کو مضبوط پہرہ داروں اور شہاب ثاقب سے بھرا ہوا پایا۔"}, {"arabic": " وَّ اَنَّا کُنَّا نَقۡعُدُ مِنۡہَا مَقَاعِدَ لِلسَّمۡعِ ؕ فَمَنۡ یَّسۡتَمِعِ الۡاٰنَ یَجِدۡ لَہٗ شِہَابًا رَّصَدًا ۙ﴿۱۰﴾", "english": " ‘And we used to sit on some of its seats to listen. But whoso listens now, finds a shooting star in ambush for him.", "french": " Et, en vérité, nous avions l’habitude de nous asseoir dans ses endroits propices à écouter. Mais quiconque écoute maintenant, trouve une flamme de feu en embuscade pour lui.", "german": " Und wir pflegten auf einigen seiner Sitze zu sitzen, um zu lauschen. Wer aber jetzt lauscht, der findet einen schießenden Stern für sich auf der Lauer.", "spanish": " “Y solíamos sentarnos en algunos de sus asientos a escuchar. Pero quien escucha ahora encuentra una estrella flamígera que lo acecha”.", "urdu": " اور ہم اس میں (آسمانی باتیں) سننے کے لئے (پہلے) بیٹھا کرتے تھے لیکن اب جو کوئی (آسمانی باتیں) سننے کی کوشش کرتا ہے تو وہ ایک (مہلک) شعلہ زن ستارے کو اپنی گھات میں پاتا ہے۔"}, {"arabic": " وَّ اَنَّا لَا نَدۡرِیۡۤ اَشَرٌّ اُرِیۡدَ بِمَنۡ فِی الۡاَرۡضِ اَمۡ اَرَادَ بِہِمۡ رَبُّہُمۡ رَشَدًا ﴿ۙ۱۱﴾", "english": " ‘And we know not whether evil is intended for those who are in the earth or whether their Lord intends something good for them.", "french": " Nous ne savons pas si le mal est destiné à ceux qui sont sur la terre, ou si leur Seigneur Se propose de bien les guider.", "german": " Wir wissen nicht, ob Böses für die beabsichtigt ist, die auf Erden sind, oder ob ihr Herr Gutes für sie im Sinne hat.", "spanish": " “Y no sabemos si la desgracia es el destino de los que están en la tierra o si su Señor piensa guiarlos por el camino recto”.", "urdu": " اور ہم نہیں جانتے کہ اس آنے والے کے ذریعہ سے زمین میں بسنے والے لوگوں کے لئے کسی عذاب کا فیصلہ کیا گیا ہے یا ان کے لئے ان کے رب نے ہدایت دینے کا فیصلہ کیا ہے۔"}, {"arabic": " وَّ اَنَّا مِنَّا الصّٰلِحُوۡنَ وَ مِنَّا دُوۡنَ ذٰلِکَ ؕ کُنَّا طَرَآئِقَ قِدَدًا ﴿ۙ۱۲﴾", "english": " ‘And some of us are righteous and some of us are otherwise; and we are sects holding different views.", "french": " Et certains d’entre nous sont pieux, et certains d’entre nous ne le sont pas ; et nous nous trouvons divisés en sectes, ayant des opinions divergentes.", "german": " Manche unter uns sind solche, die recht handeln, und manche unter uns sind weit davon entfernt; wir sind Sekten, die verschiedene Wege gehen.", "spanish": " “Algunos de nosotros somos justos y otros no lo somos; y hemos seguido caminos diferentes”.", "urdu": " اور ہم میں سے کچھ نیک لوگ بھی ہیں اور کچھ اس کے خلاف بھی ہیں ہم مختلف راستوں پر جا رہے تھے۔"}, {"arabic": " وَّ اَنَّا ظَنَنَّاۤ اَنۡ لَّنۡ نُّعۡجِزَ اللّٰہَ فِی الۡاَرۡضِ وَ لَنۡ نُّعۡجِزَہٗ ہَرَبًا ﴿ۙ۱۳﴾", "english": " ‘And we know that we cannot frustrate the plan of Allah in the earth, nor can we escape Him by flight.", "french": " Et nous savons que nous ne pouvons faire échouer les desseins d’ Allāh sur la terre et que nous ne pouvons Le tenir en échec en nous enfuyant ;", "german": " Und wir wissen, dass wir auf keine Weise Allah auf Erden zuschanden machen können, noch können wir Ihm durch Flucht entrinnen.", "spanish": " “Mas sabemos que no podemos frustrar el plan de Al-lah en la tierra, ni escapar de Él huyendo”.", "urdu": " اور ہم یقین رکھتے تھے کہ ہم دنیا میں اللہ کو ناکام نہیں بنا سکتے اور نہ ہم اسے بھاگ دوڑ کر ناکام بنا سکتے ہیں۔"}, {"arabic": " وَّ اَنَّا لَمَّا سَمِعۡنَا الۡہُدٰۤی اٰمَنَّا بِہٖ ؕ فَمَنۡ یُّؤۡمِنۡۢ بِرَبِّہٖ فَلَا یَخَافُ بَخۡسًا وَّ لَا رَہَقًا ﴿ۙ۱۴﴾", "english": " ‘And when we heard the call to guidance, we believed in it. And he who believes in his Lord has no fear of loss or injustice.", "french": " Et lorsque nous avons entendu l’appel à la direction, nous y avons cru. Et celui qui croit en son Seigneur ne craint aucune perte ni aucun tort.", "german": " Als wir von der Führung vernahmen, da glaubten wir an sie. Und wer an seinen Herrn glaubt, der fürchtet weder Einbuße noch Unrecht.", "spanish": " “Y cuando oímos la llamada a la guía, creímos en ella. Pues quien cree en su señor no tiene miedo ni a la pérdida ni a la injusticia”.", "urdu": " اور ہم نے تو جب ہدایت کا کلمہ سنا اس پر ایمان لے آئے اور جو شخص اپنے رب پر ایمان لاتا ہے تو نہ کسی نقصان سے ڈرتا ہے اور نہ کسی ظلم سے ڈرتا ہے۔"}, {"arabic": " وَّ اَنَّا مِنَّا الۡمُسۡلِمُوۡنَ وَ مِنَّا الۡقٰسِطُوۡنَ ؕ فَمَنۡ اَسۡلَمَ فَاُولٰٓئِکَ تَحَرَّوۡا رَشَدًا ﴿۱۵﴾", "english": " ‘And some of us submit to God and some of us have deviated from the right course .’” And those who submit to God — it is these who seek the right course.", "french": " Et certains d’entre nous se soumettent à Allāh , et certains d’entre nous sont injustes.' « Et ceux qui se soumettent à Allāh – ceux-là qui cherchent la bonne voie,", "german": "", "spanish": " “Algunos de nosotros nos sometemos a Dios y otros somos inicuos”. Mas quienes se someten a Dios son los que buscan el camino recto.", "urdu": " اور ہم میں سے کچھ فرمانبردار ہیں اور کچھ ظالم بھی ہیں اور جو کوئی فرمانبردار بنتا ہے‘ وہی ہدایت کا طالب ہوتا ہے۔"}, {"arabic": " وَ اَمَّا الۡقٰسِطُوۡنَ فَکَانُوۡا لِجَہَنَّمَ حَطَبًا ﴿ۙ۱۶﴾", "english": " And as for those who deviate from the right course , they are the fuel of Hell.", "french": " Et quant aux injustes, ils sont le combustible de l’Enfer.", "german": " Die aber vom rechten Wege abweichen, sie werden Brennstoff der Hölle sein.", "spanish": " En cuanto a quienes se desvían del camino recto, son el combustible del Infierno.", "urdu": " اور جو ظلم کرتے ہیں وہی جہنم کا ایندھن بنتے ہیں۔"}, {"arabic": " وَّ اَنۡ لَّوِ اسۡتَقَامُوۡا عَلَی الطَّرِیۡقَۃِ لَاَسۡقَیۡنٰہُمۡ مَّآءً غَدَقًا ﴿ۙ۱۷﴾", "english": " And if they keep to the right path, We shall certainly provide them with abundant water to drink,", "french": " Et s’ils se maintiennent sur le droit chemin, Nous leur donnerons certainement de l’eau à boire en abondance,", "german": " Wenn sie den (rechten) Pfad einhalten, dann werden Wir ihnen Wasser zu trinken geben in Fülle,", "spanish": " Mas si se mantienen en el camino recto, ciertamente les proporcionaremos agua abundante para beber,", "urdu": " اور (اے پیغمبر! میں نے فیصلہ کر چھوڑا تھا کہ) اگر یہ (کفار مکہ) ہمارے بتائے ہوئے طریق پر قائم ہو جاتے تو ہم ان کو بافراغت پانی پلاتے۔"}, {"arabic": " لِّنَفۡتِنَہُمۡ فِیۡہِ ؕ وَ مَنۡ یُّعۡرِضۡ عَنۡ ذِکۡرِ رَبِّہٖ یَسۡلُکۡہُ عَذَابًا صَعَدًا ﴿ۙ۱۸﴾", "english": " That We may try them thereby. And whoso turns away from the remembrance of his Lord — He will push him into an overwhelmingly severe punishment.", "french": " Pour que Nous les éprouvions par là. Et quiconque se détourne du souvenir de son Seigneur – Il le poussera dans un châtiment sans cesse croissant.", "german": " um sie dadurch zu prüfen. Wer sich dann abwendet von der Ermahnung seines Herrn – Er wird ihn in eine zunehmende Strafe stoßen.", "spanish": " A fin de probarles con ella. Mas a quien se aparta del recuerdo de su Señor, Él lo empujará al más terrible castigo.", "urdu": " تا کہ اس کے ذریعہ سے ان کی آزمائش کریں اور جو شخص بھی اپنے رب کے ذکر سے اعراض کرتا ہے وہ (خدا) اس کو ایسے عذاب کے رستہ پر چلاتا ہے جو بڑھتا ہی جاتا ہے (اور انہوں نے وہی طریقہ اختیار کیا ہے)"}, {"arabic": " وَّ اَنَّ الۡمَسٰجِدَ لِلّٰہِ فَلَا تَدۡعُوۡا مَعَ اللّٰہِ اَحَدًا ﴿ۙ۱۹﴾", "english": " And all places of worship belong to Allah; so call not on any one beside Allah.", "french": " Et, en vérité, tous les lieux d’adoration appartiennent à Allāh ; n’invoquez donc personne en dehors d’Allāh.", "german": " Alle Stätten der Anbetung sind Allahs; so rufet niemanden an neben Allah.", "spanish": " Todos los lugares de adoración pertenecen a Al-lah; no invoquéis, pues a nadie, aparte de Al-lah.", "urdu": " اور ہم نے یہ بھی فیصلہ کیا تھا کہ مساجد ہمیشہ اللہ ہی کی ملکیت قرار دی جائیں پس اے لوگو! تم ان میں اس کے سوا کسی کو مت پکارو۔"}, {"arabic": " وَّ اَنَّہٗ لَمَّا قَامَ عَبۡدُ اللّٰہِ یَدۡعُوۡہُ کَادُوۡا یَکُوۡنُوۡنَ عَلَیۡہِ لِبَدًا ﴿ؕ٪۲۰﴾", "english": " And when the Servant of Allah stands up praying to Him, they crowd upon him, well nigh suffocating him.", "french": " Et lorsque le Serviteur d’Allāh se tient debout L’adorant, ils se ruent sur lui, l’étouffant presque.", "german": " Und wenn ein Diener Allahs aufsteht, zu Ihm zu beten, dann umdrängen sie ihn, dass sie ihn fast erdrücken.", "spanish": " Y cuando el Siervo de Al-lah se levanta para orarle, se amontonan junto a él, a punto casi de asfixiarlo.", "urdu": " اور ہمیں نظر آرہا ہے کہ جب اللہ کا بندہ (محمد صلی اللہ علیہ وسلم) اسے پکارنے کے لئے کھڑا ہوتا ہے تو یہ (مکہ والے) اس کے اوپر جھپٹ کر آگرتے ہیں۔"}, {"arabic": " قُلۡ اِنَّمَاۤ اَدۡعُوۡا رَبِّیۡ وَ لَاۤ اُشۡرِکُ بِہٖۤ اَحَدًا ﴿۲۱﴾", "english": " Say, ‘I pray to my Lord only, and I associate no one with Him.’", "french": " Dis : « J’invoque mon Seigneur seulement, et je ne Lui associe personne. »", "german": " Sprich: \"Ich rufe einzig meinen Herrn an, und ich stelle Ihm niemanden zur Seite.\"", "spanish": " Diles: “Sólo invoco a mi Señor, y no Le asocio a nadie”.", "urdu": " تو کہہ دے کہ میں تو صرف اپنے رب کو بلاتا ہوں اور کسی کو اس کا شریک مقرر نہیں کرتا۔"}, {"arabic": " قُلۡ اِنِّیۡ لَاۤ اَمۡلِکُ لَکُمۡ ضَرًّا وَّ لَا رَشَدًا ﴿۲۲﴾", "english": " Say, ‘I have no power to do you either harm or good.’", "french": " Dis : « En vérité je n’ai aucun pouvoir de vous faire du mal ou du bien.’’", "german": " Sprich: \"Ich habe nicht die Macht, euch Schaden zuzufügen oder Nutzen.\"", "spanish": " Diles: “No tengo poder para haceros nada malo ni nada bueno”.", "urdu": " اور یہ بھی کہہ دے کہ تم کو کسی قسم کا ضرر پہنچانے یا ہدایت دینے کی مجھ میں طاقت نہیں۔"}, {"arabic": " قُلۡ اِنِّیۡ لَنۡ یُّجِیۡرَنِیۡ مِنَ اللّٰہِ اَحَدٌ ۬ۙ وَّ لَنۡ اَجِدَ مِنۡ دُوۡنِہٖ مُلۡتَحَدًا ﴿ۙ۲۳﴾", "english": " Say, ‘Surely none can protect me against Allah, nor can I find any place of refuge beside Him.", "french": " Dis : « Assurément, nul ne peut me protéger contre Allāh, et je ne puis non plus trouver de refuge en dehors de Lui.", "german": " Sprich: \"Fürwahr, keiner kann mich vor Allah beschützen, noch kann ich eine Zuflucht finden außer Ihm.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=72:23&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=72:23&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic24\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic24\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/72:24' style='text-decoration:underline'>72:24</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(24)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control24\"></i></button> <audio id=\"player24\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِلَّا بَلٰغًا مِّنَ اللّٰہِ وَ رِسٰلٰتِہٖ ؕ وَ مَنۡ یَّعۡصِ اللّٰہَ وَ رَسُوۡلَہٗ فَاِنَّ لَہٗ نَارَ جَہَنَّمَ خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ﴿ؕ۲۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘<em>My responsibility is </em>only to convey <em>the revelation </em>from Allah, and His Messages.’ And for those who disobey Allah and His Messenger there is the fire of Hell, wherein they will abide for a long, long period.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘<i>My responsibility is </i>only to convey <i>what is revealed to me </i>from Allah and His Messages.’ And those who disobey Allah and His Messenger, surely, for them is the fire of Hell, wherein they will abide for a long period.<sup class='ref'>[<a class='ref' data-id='ref_72_24_3146' href='#'>3146</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_72_24_3146'>3146</span></div> <div><a name='3146'></a><div class='reference' data-id='ref_72_24_3146' style='display:none'> <p><b>3146.</b> The difference between <i>Amad </i>and <i>Abad </i>is that whereas the former word means time limited in duration, the latter means time everlasting (Lane). (<a href='javascript:void(0)' data-id='ref_72_24_3146' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">مگر اللہ کی طرف سے تبلیغ کرتے ہوئے اور اس کے پیغامات پہنچاتے ہوئے۔ اور جو اللہ کی اور اس کے رسول کی نافرمانی کرے گا تو یقیناً اس کے لئے جہنم کی آگ ہوگی، وہ لمبے عرصہ تک اس میں رہنے والے ہوں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">میرا کام تو صرف یہ ہے کہ اللہ کی بات اور اس کا پیغام پہنچادوں‘ اور جو لوگ اللہ اور اس کے رسول کی بات نہیں مانتے ان کو دوزخ ملتی ہے‘ وہ اس میں دیر تک رہتے چلے جائیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Sauf <em>je peux</em> transmettre <em>la révélation qui vient</em> de la part d’Allāh, ainsi que Ses Messages. » Et pour ceux qui désobéissent à Allāh et à Son Messager, il y a le Feu de l’Enfer, dans lequel ils demeureront longtemps.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>“Mi responsabilidad es</em> sólo la de transmitir <em>la revelación</em> de Al-lah y Sus Mensajes”. Mas para quienes desobedecen a Al-lah y a Su Mensajero, está el fuego del Infierno, en donde morarán durante un larguísimo período.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">(Mein Amt ist) nur die Übermittlung (der Offenbarung) von Allah und Seiner Botschaften.\" Und die sich Allah widersetzen und Seinem Gesandten, für die ist das Feuer der Hölle, darin sie bleiben sollen auf lange Zeit.", "spanish": " Diles: “En verdad, nadie puede protegerme contra Al-lah, ni puedo encontrar lugar alguno de refugio fuera de Él”.", "urdu": " (بلکہ یہ بھی) کہہ دے (کہ اگر اللہ مجھ پر عذاب نازل کرے تو) مجھے اللہ کے عذاب سے بچانے والا کوئی نہیں اور اس کو چھوڑ کر میں کوئی ٹھکانا نہیں پاتا۔"}, {"arabic": " حَتّٰۤی اِذَا رَاَوۡا مَا یُوۡعَدُوۡنَ فَسَیَعۡلَمُوۡنَ مَنۡ اَضۡعَفُ نَاصِرًا وَّ اَقَلُّ عَدَدًا ﴿۲۵﴾", "english": " They will continue to disbelieve until they see that which they are promised, and soon they will know who is weaker in helpers and fewer in numbers.", "french": " Ils persisteront à ne pas croire jusqu’à ce qu’ils voient ce qui leur est promis, et bientôt ils sauront qui sont les plus faibles en alliés et les moindres en nombres.", "german": " Wenn sie dann das sehen werden, was ihnen angedroht ward, so werden sie erfahren, wer schwächer ist an Helfern und geringer an Zahl.", "spanish": " Ellos continuarán en la incredulidad hasta que vean aquello que se les prometió, y pronto sabrán quién es más débil en ayudantes y menor en número.", "urdu": " ہاں! جب وہ موعود عذاب کو دیکھ لیں گے تو جان لیں گے (کہ ان کا اور محمد رسول اللہ صلی اللہ علیہ وسلم کا مقابلہ مدنظر رکھتے ہوئے) مددگار کے لحاظ سے کون کمزور ہے‘ اور تعداد کے لحاظ سے کون تھوڑا ہے۔"}, {"arabic": " قُلۡ اِنۡ اَدۡرِیۡۤ اَقَرِیۡبٌ مَّا تُوۡعَدُوۡنَ اَمۡ یَجۡعَلُ لَہٗ رَبِّیۡۤ اَمَدًا ﴿۲۶﴾", "english": " Say, ‘I know not whether that which you are promised is nigh or whether my Lord has fixed for it a distant term.’", "french": " Dis : « Je ne sais pas si ce qui vous est promis est proche, ou si mon Seigneur a fixé pour cela un terme éloigné. »", "german": " Sprich: \"Ich weiß nicht, ob das, was euch angedroht ward, nahe ist, oder ob mein Herr eine lange Frist dafür angesetzt hat.\"", "spanish": " Diles: “No sé si lo que se os ha prometido está cerca o si mi Señor ha fijado para ello un plazo lejano”.", "urdu": " تو کہہ دے کہ میں نہیں جانتا کہ تمہاری موعودہ گھڑی قریب ہے یا اللہ اس کے لئے کوئی لمبی مدت مقرر کرے گا۔"}, {"arabic": " عٰلِمُ الۡغَیۡبِ فَلَا یُظۡہِرُ عَلٰی غَیۡبِہٖۤ اَحَدًا ﴿ۙ۲۷﴾", "english": " He is the Knower of the unseen; and He reveals not His secrets to any one,", "french": " Il est le Connaisseur de l’invisible ; et Il n’accorde à personne la prédominance sur Son domaine de l’ invisible,", "german": " Kenner des Verborgenen – Er enthüllt keinem Seine Geheimnisse,", "spanish": " Él es el Conocedor de lo invisible; y a nadie concede autoridad sobre su dominio de lo invisible,", "urdu": " غیب کا جاننے والا وہی ہے اور وہ اپنے غیب پر کسی کو غالب نہیں کرتا۔"}, {"arabic": " اِلَّا مَنِ ارۡتَضٰی مِنۡ رَّسُوۡلٍ فَاِنَّہٗ یَسۡلُکُ مِنۡۢ بَیۡنِ یَدَیۡہِ وَ مِنۡ خَلۡفِہٖ رَصَدًا ﴿ۙ۲۸﴾", "english": " Except to him whom He chooses, namely a Messenger of His . And then He causes an escort of guarding angels to go before him and behind him,", "french": " Sauf à celui qu’Il choisit en tant que Son Messager. Et Il le fait précéder et suivre d’une escorte d’anges,", "german": " außer allein dem, den Er erwählt, nämlich einem Gesandten. Und dann lässt Er eine Schutzwache vor ihm schreiten und hinter ihm,", "spanish": " Excepto a quien elige como Mensajero Suyo . Y una escolta de ángeles marchan por delante y detrás de él,", "urdu": " سوائے ایسے رسول کے جس کو وہ اس کام کے لئے پسند کر لیتا ہے اور اس رسول کی یہ شان ہے کہ اس کے آگے بھی اور اس کے پیچھے بھی محافظ فرشتوں کی گارد چلتی ہے۔"}, {"arabic": " لِّیَعۡلَمَ اَنۡ قَدۡ اَبۡلَغُوۡا رِسٰلٰتِ رَبِّہِمۡ وَ اَحَاطَ بِمَا لَدَیۡہِمۡ وَ اَحۡصٰی کُلَّ شَیۡءٍ عَدَدًا ﴿٪۲۹﴾", "english": " That He may know that they (His Messengers) have delivered the Messages of their Lord. And He encompasses all that is with them and He keeps count of all things.", "french": " Afin qu’Il sache que Ses Messagers ont transmis les Messages de leur Seigneur. Et Il embrasse tout ce qui est avec eux et Il tient le compte de toutes choses.", "german": " damit Er wisse, dass sie (Seine Gesandten) die Botschaften ihres Herrn verkündet haben. Er umfasst alles, was bei ihnen ist, und Er führt Buch über alle Dinge.", "spanish": " Para que sepa que ellos (Sus Mensajeros) han entregado los Mensajes de su Señor. Y Él abarca todo lo que está con ellos y lleva la cuenta de todas las cosas.", "urdu": " تا کہ اللہ جان لے کہ ان رسولوں نے اپنے رب کے پیغام کو لوگوں تک پہنچا دیا ہے اور وہ جو کچھ ان کے پاس ہے اس کو احاطہ میں رکھتا ہے اور ہر چیز کو گن رکھتا ہے۔"}], "Surah": 72}