{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " حٰمٓ ۚ﴿۲﴾", "english": " Ha Mim.", "french": " Ḥā Mīm (le Très-Louable, le Seigneur de l’Honneur).", "german": " Hâ Mîm.", "spanish": " Ha Mim.", "urdu": " حمید اور مجید (خد اکی صفات اس سورۃ میں بیان کی گئی ہیں)"}, {"arabic": " تَنۡزِیۡلٌ مِّنَ الرَّحۡمٰنِ الرَّحِیۡمِ ۚ﴿۳﴾", "english": " This is a revelation from the Gracious, the Merciful.", "french": " Le Coran est une révélation du Gracieux, du Miséricordieux.", "german": " Eine Offenbarung von dem Gnädigen, dem Barmherzigen.", "spanish": " Ésta es una revelación del Clemente, el Misericordioso.", "urdu": " یہ قرآن بے انتہا رحم کرنے والے اور بار بار کرم کرنے والے (خدا) کی طرف سے نازل ہوا ہے۔"}, {"arabic": " کِتٰبٌ فُصِّلَتۡ اٰیٰتُہٗ قُرۡاٰنًا عَرَبِیًّا لِّقَوۡمٍ یَّعۡلَمُوۡنَ ۙ﴿۴﴾", "english": " A Book, the verses of which have been expounded in detail — the Qur’an in clear, eloquent language — for a people who have knowledge,", "french": " Un Livre dont les versets ont été expliqués clairement – très souvent lu, en arabe - dans une langue claire et éloquente – pour un peuple qui possède de la connaissance.", "german": " Ein Buch, dessen Verse klar gemacht worden sind – es wird viel gelesen; es ist in fehlerloser Sprache – für Leute, die Wissen besitzen.", "spanish": " Un Libro, cuyos versículos han sido expuestos con detalle – recitados a menudo y creados manifiestamente claros- para un pueblo que tiene conocimiento.", "urdu": " (اور) ایسی کتاب ہے جس کی آیات خوب تفصیل کے ساتھ بیان کی گئی ہیں اور جو (کتاب) خوب پڑھی جائے گی اور (وہ ایسی زبان میں ہے جو) اپنا مطلب آپ کھول کر بیان کرتی ہے مگر (یہ کتاب) انہی کو فائدہ دیتی ہے جو (روحانی) علم رکھتے ہیں۔"}, {"arabic": " بَشِیۡرًا وَّ نَذِیۡرًا ۚ فَاَعۡرَضَ اَکۡثَرُہُمۡ فَہُمۡ لَا یَسۡمَعُوۡنَ ﴿۵﴾", "english": " A bringer of glad tidings and a warner. But most of them turn away and they hear not.", "french": " Porteur de la bonne nouvelle et Avertisseur. Mais la plupart d’entre eux s’ en détournent et n’écoutent pas.", "german": " Bringer froher Botschaft und Warner. Doch die meisten von ihnen kehren sich ab, so dass sie nicht hören.", "spanish": " Heraldo de la buena nueva y amonestador. Pero la mayoría de ellos se apartan y no lo escuchan.", "urdu": " (نیکوں کو) خوشخبری دینے والی اور (بدوں کو) ہوشیار کرنے والی ہے۔ پھر (بھی) ان میں سے اکثر نے اعراض کیا اور وہ اس کے سننے کو بھی تیار نہیں۔"}, {"arabic": " وَ قَالُوۡا قُلُوۡبُنَا فِیۡۤ اَکِنَّۃٍ مِّمَّا تَدۡعُوۡنَاۤ اِلَیۡہِ وَ فِیۡۤ اٰذَانِنَا وَقۡرٌ وَّ مِنۡۢ بَیۡنِنَا وَ بَیۡنِکَ حِجَابٌ فَاعۡمَلۡ اِنَّنَا عٰمِلُوۡنَ ؓ﴿۶﴾", "english": " And they say: ‘Our hearts are under covers and are protected against that to which thou callest us, and in our ears there is a deafness, and between us and thee there is a screen. So carry on thy work; we too are working.’", "french": " Et ils disent : « Notre cœur est sous des voiles et à l’abri de ce vers quoi tu nous appelles, et dans nos oreilles il y a une surdité, et entre nous et toi est un voile. Poursuis donc ton travail ; nous aussi , nous œuvrons. »", "german": " Sie sprechen: \"Unsere Herzen sind verhüllt gegen das, wozu du uns berufst, und in unseren Ohren ist Taubheit, und zwischen uns und dir ist ein Vorhang. So handle, auch wir handeln.\"", "spanish": " Y dicen: “Nuestros corazones están cubiertos y protegidos contra aquello a lo que nos invocas, en nuestros oídos hay sordera, y ntre tú y nosotros hay un velo. Continúa pues tu trabajo; nosotros también estamos trabajando”.", "urdu": " اور کہتے ہیں جس چیز کی طرف تم ہمیں بلاتے ہو اس کے ماننے سے ہمارے دل پردوں میں ہیں (یعنی وہ ہمارے دلوں پر اثر نہیں کر سکتی) اور ہمارے کانوں میں بہرا پن ہے (جس کی وجہ سے ہم تمہاری بات سن ہی نہیں سکتے) اور ہمارے اور تمہارے درمیان ایک پردہ ہے۔ پس تو (اپنے عقیدہ کے مطابق) کام کر‘ ہم (اپنے عقیدہ کے مطابق) کام کریں گے۔"}, {"arabic": " قُلۡ اِنَّمَاۤ اَنَا بَشَرٌ مِّثۡلُکُمۡ یُوۡحٰۤی اِلَیَّ اَنَّمَاۤ اِلٰـہُکُمۡ اِلٰہٌ وَّاحِدٌ فَاسۡتَقِیۡمُوۡۤا اِلَیۡہِ وَ اسۡتَغۡفِرُوۡہُ ؕ وَ وَیۡلٌ لِّلۡمُشۡرِکِیۡنَ ۙ﴿۷﴾", "english": " Say, ‘I am only a man like you. It is revealed to me that your God is One God; so go ye straight to Him without deviating , and ask forgiveness of Him.’ And woe to the idolaters,", "french": " Dis : « Je ne suis qu’un homme comme vous. Il m’est révélé que votre Dieu est un Dieu Unique ; allez donc droit vers Lui, et demandez-Lui pardon. » Et malheur aux associateurs,", "german": " Sprich: \"Ich bin nur ein Mensch wie ihr. Mir ward offenbart, dass euer Gott ein Einiger Gott ist; so seiet aufrichtig gegen Ihn und bittet Ihn um Verzeihung.\" Und wehe den Götzendienern,", "spanish": " Diles: “Sólo soy un hombre como vosotros. Se me ha revelado que uestro Dios es el Dios Único. Tomad el camino recto hacia Él sin desviaros y pedidle perdón”. ¡Ay de los idólatras!", "urdu": " تو کہہ دے‘ میں بھی تمہاری طرح کا ایک آدمی ہوں‘ میری طرف وحی کی جاتی ہے کہ تمہارا صرف ایک خدا ہے۔ پس اس کا خیال کرکے استقلال دکھاٶ۔ اور اس سے استغفار کرتے رہو (کہ پاٶں نہ پھسل جائے) اور (یاد رکھو کہ) مشرکوں کے لئے عذاب (مقدر) ہے۔"}, {"arabic": " الَّذِیۡنَ لَا یُؤۡتُوۡنَ الزَّکٰوۃَ وَ ہُمۡ بِالۡاٰخِرَۃِ ہُمۡ کٰفِرُوۡنَ ﴿۸﴾", "english": " Who give not the Zakat, and they it is who deny the Hereafter.", "french": " Qui ne donnent pas la Zakāt et ce sont eux qui refusent de croire à l’au-delà.", "german": " die nicht die Zakât entrichten und die das Jenseits leugnen.", "spanish": " Que no dan el Zakat y son los que niegan el Más Allá.", "urdu": " وہ مشرک جو نہ زکٰوۃ دیتے ہیں اور نہ آخرت پر ایمان لاتے ہیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَہُمۡ اَجۡرٌ غَیۡرُ مَمۡنُوۡنٍ ٪﴿۹﴾", "english": " As to those who believe and do good works, they will surely have a reward that will never end.", "french": " Quant à ceux qui croient et font de bonnes œuvres, ils auront assurément une récompense qui ne sera jamais interrompue.", "german": " Die aber glauben und gute Werke tun, die werden einen nimmer endenden Lohn erhalten.", "spanish": " En cuanto a quienes creen y practican buenas obras, ciertamente tendrán una recompensa que no terminará nunca.", "urdu": " یقیناً وہ (لوگ) جو ایمان بھی لائے اور اس کے مطابق انہوں نے عمل بھی کیے‘ ان کے لئے ایک نہ ختم ہونے والا اجر (مقدر) ہے۔"}, {"arabic": " قُلۡ اَئِنَّکُمۡ لَتَکۡفُرُوۡنَ بِالَّذِیۡ خَلَقَ الۡاَرۡضَ فِیۡ یَوۡمَیۡنِ وَ تَجۡعَلُوۡنَ لَہٗۤ اَنۡدَادًا ؕ ذٰلِکَ رَبُّ الۡعٰلَمِیۡنَ ۚ﴿۱۰﴾", "english": " Say: ‘Do you really disbelieve in Him Who created the earth in two days? And do you set up equals to Him?’ That is the Lord of the worlds.", "french": " Dis : « Refusez-vous réellement de croire en Celui Qui a créé la terre en deux périodes ? Et Lui donnez-vous des égaux ? » C’est Lui le Seigneur des mondes.", "german": " Sprich: \"Leugnet ihr Den wirklich, Der die Erde schuf in zwei Zeiten? Und dichtet ihr Ihm Nebengötter an?\" Er nur ist der Herr der Welten.", "spanish": " Diles: “¿Realmente no creéis en Aquel que creó la tierra en dos períodos? ¿Y colocáis a otros iguales a Él?”. Ése es el Señor de los mundos.", "urdu": " تو کہہ دے‘ کیا تم اس خدا کا انکار کرتے ہو‘ جس نے زمین کو دو دور میں پیدا کیا ہے‘ اور اس کے شریک مقرر کرتے ہو۔ یہ (خدا تو) سب جہانوں کا رب ہے۔"}, {"arabic": " وَ جَعَلَ فِیۡہَا رَوَاسِیَ مِنۡ فَوۡقِہَا وَ بٰرَکَ فِیۡہَا وَ قَدَّرَ فِیۡہَاۤ اَقۡوَاتَہَا فِیۡۤ اَرۡبَعَۃِ اَیَّامٍ ؕ سَوَآءً لِّلسَّآئِلِیۡنَ ﴿۱۱﴾", "english": " He placed therein firm mountains rising above its surface , and blessed it with abundance , and provided therein its foods in proper measure in four days — alike for all seekers.", "french": " Il y a placé des montagnes solidement ancrées s'élevant au-dessus d'elle, et les a bénies et a minutieusement équilibré ses provisions en quatre périodes – également disponibles pour tous ceux qui en recherchent.", "german": " Er gründete in ihr feste Berge, die sie überragen, und legte Überfluss in sie und ordnete auf ihr in richtigem Verhältnis ihre Nahrung in vier Zeiten – gleichmäßig für die Suchenden.", "spanish": " Él estableció en ella montañas firmes que se levantan sobre su superficie y dispuso bendiciones en ella y equilibró inuciosamente sus medios de sustento en cuatro etapas, iguales para todos los que buscan.", "urdu": " اور اس نے زمین میں اس کے اوپر پہاڑ بنائے ہیں اور اس میں بڑی برکت رکھی ہے اور اس میں رہنے والوں کے کھانے پینے کے لئے ہر چیز کو اندازہ کے مطابق بنا دیا ہے یہ سب کچھ چار دور میں کیا ہے۔ یہ بات سب پوچھنے والوں کے لئے برابر ہے۔"}, {"arabic": " ثُمَّ اسۡتَوٰۤی اِلَی السَّمَآءِ وَ ہِیَ دُخَانٌ فَقَالَ لَہَا وَ لِلۡاَرۡضِ ائۡتِیَا طَوۡعًا اَوۡ کَرۡہًا ؕ قَالَتَاۤ اَتَیۡنَا طَآئِعِیۡنَ ﴿۱۲﴾", "english": " Then He turned to the heaven while it was something like smoke, and said to it and to the earth: ‘Come ye both of you, willingly or unwillingly.’ They said, ‘We come willingly.’", "french": " Ensuite Il Se tourna vers le ciel alors qu’il était une sorte de fumée, et Il lui dit ainsi qu’à la terre : « Venez tous les deux, bon gré mal gré. » Tous deux dirent : « Nous venons de bon gré. »", "german": " Dann wandte Er Sich zum Himmel, welcher noch Nebel war, und sprach zu ihm und zu der Erde: \"Kommt ihr beide, willig oder widerwillig.\" Sie sprachen: \"Wir kommen willig.\"", "spanish": " Luego se dirigió al Cielo mientras era algo similar al humo, y dijo a él y a la tierra: “Venid vosotros dos, voluntaria o involuntariamente”. Dijeron: “Vamos voluntariamente”.", "urdu": " پھر آسمان کی طرف متوجہ ہوا۔ اور وہ محض ایک کہر کی طرح تھا۔ اور اس نے اس سے اور زمین سے کہا دونوں اپنی مرضی سے یا مجبور ہو کر میری فرمانبرداری کے لئے آجاٶ۔ ان دونوں نے کہا ہم فرمانبردار ہو کر آگئے ہیں۔"}, {"arabic": " فَقَضٰہُنَّ سَبۡعَ سَمٰوَاتٍ فِیۡ یَوۡمَیۡنِ وَ اَوۡحٰی فِیۡ کُلِّ سَمَآءٍ اَمۡرَہَا ؕ وَ زَیَّنَّا السَّمَآءَ الدُّنۡیَا بِمَصَابِیۡحَ ٭ۖ وَ حِفۡظًا ؕ ذٰلِکَ تَقۡدِیۡرُ الۡعَزِیۡزِ الۡعَلِیۡمِ ﴿۱۳﴾", "english": " So He completed them into seven heavens in two days, and He revealed to each heaven its function. And We adorned the lowest heaven with lamps for light and for protection. That is the decree of the Mighty, the All-Knowing.", "french": " Il les repartit en sept cieux en deux périodes, et à chaque ciel Il révéla sa fonction. Et Nous avons orné le ciel le plus bas de lampes, pour la lumière et l’avons pourvu de son moyen de protection. C’est là le décret du Puissant, de l’Omniscient.", "german": " So vollendete Er sie als sieben Himmel in zwei Zeiten, und in jedem Himmel wies Er seine Aufgabe an. Und Wir schmückten den untersten Himmel mit Leuchten, und als Schutz. Das ist der Ratschluss des Allmächtigen, des Allwissenden.", "spanish": " Así Él los perfeccionó en siete cielos en dos períodos y reveló a ada cielo en su función. Y adornamos el cielo inferior con lámparas para dar luz y protección. Así es el decreto del Poderoso, el Omnisciente.", "urdu": " پھر اُن کو سات آسمانوں کی صورت میں دو دور میں بنایا اور ہر آسمان میں جو کچھ ہونا تھا اس کی طاقت اس میں ودیعت کر دی اور ہم نے نچلے آسمان کو روشنیوں کے ساتھ خوبصورت بنایا اور (علاوہ خوبصورت بنانے کے) حفاظت کے لئے بھی (اس میں سامان پیدا کیا) (اور) یہ غالب (اور) جاننے والے خدا کی تقدیر ہے۔"}, {"arabic": " فَاِنۡ اَعۡرَضُوۡا فَقُلۡ اَنۡذَرۡتُکُمۡ صٰعِقَۃً مِّثۡلَ صٰعِقَۃِ عَادٍ وَّ ثَمُوۡدَ ﴿ؕ۱۴﴾", "english": " But if they turn away, then say: ‘I warn you of a destructive punishment like the punishment which overtook ‘Ad and Thamud.’", "french": " Mais s’ils se détournent, alors dis : « Je vous ai déjà avertis d’un châtiment destructeur , comme le châtiment qui surprit les ‘Ād et les Thamūd.", "german": " Doch wenn sie sich abkehren, so sprich: \"Ich habe euch gewarnt vor einem Unheil, gleich dem Unheil, das die ´Âd und die Thamûd (erreichte).\"", "spanish": " Pero si se apartan, diles entonces: “Os advierto de un castigo destructor como el castigo que cayó sobre Ad y Zamud”.", "urdu": " پھر اگر وہ اعراض کریں تو ان سے کہہ دے کہ میں نے تم کو اس عذاب سے جو عاد اور ثمود کا سا عذاب ہے ہوشیار کر دیا ہے۔"}, {"arabic": " اِذۡ جَآءَتۡہُمُ الرُّسُلُ مِنۡۢ بَیۡنِ اَیۡدِیۡہِمۡ وَ مِنۡ خَلۡفِہِمۡ اَلَّا تَعۡبُدُوۡۤا اِلَّا اللّٰہَ ؕ قَالُوۡا لَوۡ شَآءَ رَبُّنَا لَاَنۡزَلَ مَلٰٓئِکَۃً فَاِنَّا بِمَاۤ اُرۡسِلۡتُمۡ بِہٖ کٰفِرُوۡنَ ﴿۱۵﴾", "english": " When their Messengers came to them from before them and behind them, saying : ‘Worship none but Allah,’ they said: ‘If our Lord had so willed, He would have certainly sent down angels. So we do disbelieve in that with which you have been sent.’", "french": " Lorsque leurs Messagers vinrent à eux du début à la fin, leur disant : « Adorez seulement Allāh, » ils dirent : « Si Notre Seigneur l’avait voulu, Il aurait certainement fait descendre des anges. Nous refusons donc de croire en ce avec quoi vous avez été envoyés. »", "german": " Da ihre Gesandten zu ihnen kamen von vorn und von hinten (und sprachen): \"Dienet keinem denn Allah\", da sprachen sie: \"Hätte unser Herr es gewollt, Er würde zweifellos Engel herabgesandt haben. So lehnen wir das ab, womit ihr gesandt worden seid.\"", "spanish": " Cuando sus Mensajeros llegaron a ellos por delante y por detrás, diciendo: “No adoréis a nadie sino a Al-lah”, dijeron: Si nuestro Señor así lo hubiese querido, habría enviado ciertamente ángeles. No creemos pues en aquello con lo que has sido enviado”.", "urdu": " یعنی جب اُن کے پاس اُن کے آگے سے بھی اور اُن کے پیچھے سے بھی رسول آئے (یعنی قومی زندگی کے دوران میں متواتر رسول آئے) یہ کہتے ہوئے کہ اللہ کے سوا کسی کی عبادت نہ کرو‘ تو انہوں نے ان کو جواب دیا کہ اگر ہمارا رب چاہتا تو ہم پر خود فرشتے نازل کر دیتا۔ پس ہم اس تعلیم کا جس کے ساتھ تم کو بھیجا گیا ہے انکار کرتے ہیں۔"}, {"arabic": " فَاَمَّا عَادٌ فَاسۡتَکۡبَرُوۡا فِی الۡاَرۡضِ بِغَیۡرِ الۡحَقِّ وَ قَالُوۡا مَنۡ اَشَدُّ مِنَّا قُوَّۃً ؕ اَوَ لَمۡ یَرَوۡا اَنَّ اللّٰہَ الَّذِیۡ خَلَقَہُمۡ ہُوَ اَشَدُّ مِنۡہُمۡ قُوَّۃً ؕ وَ کَانُوۡا بِاٰیٰتِنَا یَجۡحَدُوۡنَ ﴿۱۶﴾", "english": " As for ‘Ad, they behaved arrogantly in the earth without any justification and said, ‘Who is mightier than we in power?’ Do they not see that Allah, Who created them, is mightier than they in power? Still they continued to deny Our Signs.", "french": " Quant aux ‘Ād, ils se comportèrent avec arrogance sur la terre sans justification, et dirent : « Qui est plus fort que nous ? » Ne voient-ils pas qu’Allāh, Qui les a créés, est plus fort qu’eux ? Mais ils continuèrent à nier Nos Signes.", "german": " Was nun die ´Âd anlangt, so betrugen sie sich hoffärtig auf Erden ohne Recht und sprachen: \"Wer ist stärker als wir an Macht?\" Konnten sie denn nicht sehen, dass Allah, Der sie erschuf, stärker an Macht war als sie? Jedoch sie fuhren fort, Unsere Zeichen zu leugnen.", "spanish": " En cuanto a Ad, se comportaron con arrogancia en la tierra sin justificación alguna y dijeron: “¿quién es más fuerte que nosotros en poder?”. Acaso no ven que Al-lah, que los creó, es más fuerte que ellos en poderío? Y sin embargo continúan negando Nuestros Signos.", "urdu": " اور عاد کی قوم نے زمین میں بغیر کسی حق کے تکبر سے کام لیا اور کہا‘ ہم سے زیادہ قوت میں کون ہے کیا انہوں نے دیکھا نہیں کہ جس خدا نے ان کو پیدا کیا ہے۔ وہ ان سے زیادہ طاقتور ہے اور وہ ہماری آیتوں کا بضد انکار کرتے تھے۔"}, {"arabic": " فَاَرۡسَلۡنَا عَلَیۡہِمۡ رِیۡحًا صَرۡصَرًا فِیۡۤ اَیَّامٍ نَّحِسَاتٍ لِّنُذِیۡقَہُمۡ عَذَابَ الۡخِزۡیِ فِی الۡحَیٰوۃِ الدُّنۡیَا ؕ وَ لَعَذَابُ الۡاٰخِرَۃِ اَخۡزٰی وَ ہُمۡ لَا یُنۡصَرُوۡنَ ﴿۱۷﴾", "english": " So We sent upon them a furious wind for several ominous days, that We might make them taste the punishment of humiliation in this life. And the punishment of the Hereafter will surely be more humiliating, and they will not be helped.", "french": " Nous envoyâmes donc contre eux un vent violent pendant plusieurs jours néfastes, afin de leur faire goûter le châtiment de l’ignominie dans cette vie. Et le châtiment de l’au-delà sera sûrement plus ignominieux, et ils ne seront pas secourus.", "german": " Darum sandten Wir gegen sie einen rasenden Wind durch mehrere unheilvolle Tage, auf dass Wir sie die Strafe der Schmach in diesem Leben kosten ließen. Und die Strafe des Jenseits wird gewiss noch schmählicher sein, und es wird ihnen nicht geholfen werden.", "spanish": " Por ello les enviamos un furioso vendaval durante varios días nefastos, para hacerles probar el castigo de la humillación en esta vida. Mas el castigo del Más Allá ciertamente será más humillante y no recibirán ayuda.", "urdu": " پس ہم نے ان پر ایک ایسی ہوا بھیجی جو بڑی تیز تھی اور منحوس دنوں میں آئی تھی تاکہ ہم انہیں اس دنیا میں رسوائی کا عذاب چکھائیں اور اخروی زندگی کا عذاب اس سے بھی بڑھ کر رسوائی کا ہے اور (وہاں) ان کی کسی رنگ میں مدد نہ کی جائے گی۔"}, {"arabic": " وَ اَمَّا ثَمُوۡدُ فَہَدَیۡنٰہُمۡ فَاسۡتَحَبُّوا الۡعَمٰی عَلَی الۡہُدٰی فَاَخَذَتۡہُمۡ صٰعِقَۃُ الۡعَذَابِ الۡہُوۡنِ بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿ۚ۱۸﴾", "english": " And as for Thamud, We gave them guidance, but they preferred blindness to guidance, so the calamity of a humiliating punishment seized them, on account of what they had earned.", "french": " Et quant aux Thamūd. Nous leur donnâmes la direction, mais ils préférèrent l’aveuglement à la direction ; c’est pourquoi la calamité d’un châtiment humiliant les saisit, pour ce qu’ils avaient acquis,", "german": " Und was die Thamûd anlangt, so wissen Wir ihnen den Weg, sie aber zogen die Blindheit dem rechten Weg vor, drum erfasste sie das Unheil einer erniedrigenden Strafe um dessentwillen, was sie begangen.", "spanish": " En cuanto a Zamud, les proporcionamos la guía, pero prefirieron la ceguera a la guía, por lo que la desgracia de un castigo humillante cayó sobre ellos, en razón de lo que ha­bían merecido.", "urdu": " اور ثمود (کا یہ حال تھا کہ) ہم نے اُن کو ہدایت کا راستہ دکھایا تھا لیکن انہوں نے گمراہی کو ہدایت پر ترجیح دی۔ پس اُن کو ایک رسوائی کے عذاب نے اُن کے اعمال کی وجہ سے آگھیرا۔"}, {"arabic": " وَ نَجَّیۡنَا الَّذِیۡنَ اٰمَنُوۡا وَ کَانُوۡا یَتَّقُوۡنَ ﴿٪۱۹﴾", "english": " And We saved those who believed and acted righteously.", "french": " Et Nous sauvâmes ceux qui croyaient et agissaient avec piété.", "german": " Und Wir erretteten jene, die glaubten und Gerechtigkeit wirkten.", "spanish": " Mas salvamos a quienes creyeron y actuaron rectamente.", "urdu": " اور جو متقی تھے اور مومن تھے ان کو ہم نے نجات دے دی۔"}, {"arabic": " وَ یَوۡمَ یُحۡشَرُ اَعۡدَآءُ اللّٰہِ اِلَی النَّارِ فَہُمۡ یُوۡزَعُوۡنَ ﴿۲۰﴾", "english": " And on the day when the enemies of Allah will be gathered together and driven to the Fire, they will be goaded on.", "french": " Et le jour où les ennemis d’Allāh seront rassemblés et conduits vers le Feu, répartis en groupes.", "german": " Und an dem Tage, da die Feinde Allahs zum Feuer versammelt werden allesamt, da werden sie in Gruppen geteilt werden,", "spanish": " El día en el que los enemigos de Al-lah sean reunidos en masa y conducidos al Fuego, se les hará marchar en orden.", "urdu": " اور جس دن اللہ کے دشمن (یعنی کافر) زندہ کرکے آگ کی طرف لے جائے جائیں گے پھر ان کو مختلف درجوں میں تقسیم کر دیا جائے گا۔"}, {"arabic": " حَتّٰۤی اِذَا مَا جَآءُوۡہَا شَہِدَ عَلَیۡہِمۡ سَمۡعُہُمۡ وَ اَبۡصَارُہُمۡ وَ جُلُوۡدُہُمۡ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۲۱﴾", "english": " Till, when they reach it, their ears and their eyes and their skins will bear witness against them as to what they had been doing.", "french": " Jusqu’à ce que, quand ils y parviennent, leurs oreilles et leurs yeux et leurs peaux porteront témoignage contre eux pour ce qu’ils ont fait.", "german": " bis dass, wenn sie es erreichen, ihre Ohren und ihre Augen und ihre Haut Zeugnis gegen sie abgeben werden von dem, was sie zu tun pflegten.", "spanish": " Hasta que, cuando lleguen a él, sus oídos, sus ojos y su piel, sean testigos contra ellos por lo que estuvieron cometiendo.", "urdu": " یہاں تک کہ جب وہ دوزخ کے پاس پہنچ جائیں گے ان کے کان اور ان کی آنکھیں اور ان کے چمڑے ان کے عمل کی وجہ سے ان کے خلاف گواہی دیں گے۔"}, {"arabic": " وَ قَالُوۡا لِجُلُوۡدِہِمۡ لِمَ شَہِدۡتُّمۡ عَلَیۡنَا ؕ قَالُوۡۤا اَنۡطَقَنَا اللّٰہُ الَّذِیۡۤ اَنۡطَقَ کُلَّ شَیۡءٍ وَّ ہُوَ خَلَقَکُمۡ اَوَّلَ مَرَّۃٍ وَّ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۲۲﴾", "english": " And they will say to their skins: ‘Why bear ye witness against us?’ They will say: ‘Allah has made us to speak as He has made everything else to speak. And He it is Who created you the first time, and unto Him have you been brought back.", "french": " Et ils diront à leurs peaux : « Pourquoi témoignez-vous contre nous ? » Elles diront « Allāh nous a fait parler, Lui Qui a fait parler toute chose. Et c’est Lui Qui vous a créés la première fois, et c’est vers Lui que vous avez été ramenés.", "german": " Und sie werden zu ihrer Haut sprechen: \"Warum zeugst du wider uns?\" Sie wird sprechen: \"Allah hat mir Rede verliehen – Er, Der einem jeden Ding Rede verleiht. Und Er ist es, Der euch erstmals erschuf, und zu Ihm seid ihr zurückgebracht.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=41:22&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=41:22&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic23\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic23\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/41:23' style='text-decoration:underline'>41:23</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(23)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control23\"></i></button> <audio id=\"player23\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَا کُنۡتُمۡ تَسۡتَتِرُوۡنَ اَنۡ یَّشۡہَدَ عَلَیۡکُمۡ سَمۡعُکُمۡ وَ لَاۤ اَبۡصَارُکُمۡ وَ لَا جُلُوۡدُکُمۡ وَ لٰکِنۡ ظَنَنۡتُمۡ اَنَّ اللّٰہَ لَا یَعۡلَمُ کَثِیۡرًا مِّمَّا تَعۡمَلُوۡنَ ﴿۲۳﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And you did not fear <I>while committing sins </I>that your ears and your eyes and your skins would bear witness against you, nay, you thought that <em>even </em>Allah did not know much of what you used to do.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And you did not apprehend, <i>while committing sins</i>, that your ears and your eyes and your skins would bear witness against you; nay, you thought that <i>even </i>Allah did not know much of what you used to do. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور تم (اِس سے) چُھپ نہیں سکتے تھے کہ تمہارے خلاف تمہاری سماعت گواہی دے اور نہ تمہاری نظریں (گواہی دیں) اور نہ تمہاری جلدیں۔ لیکن تم یہ گمان کر بیٹھے تھے کہ اللہ کو تمہارے بہت سے اعمال کا علم ہی نہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور تم اپنے عیب اس خوف سے نہیں چھپایا کرتے تھے کہ کہیں تمہارے کان اور تمہاری آنکھیں اور تمہارے چمڑے تمہارے خلاف گواہی نہ دے دیں (بلکہ دوسرے لوگوں کی انگشت نمائی کے ڈر سے ایسا کرتے تھے) بلکہ تم کو یقین تھا‘ کہ اللہ کو تو بہت سی تمہاری باتوں کا علم ہی نہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et vous ne pouviez vous cacher <em>du fait</em> que vos oreilles et vos yeux et vos peaux témoignent contre vous, mais vous pensiez que <em>même</em> Allāh ne savait pas grand’chose de ce que vous faisiez.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“No temisteis, mientras <em>cometíais pecados</em> que vuestros oídos, vuestros ojos y vuestras pieles fuesen testigos contra vosotros; no, pensabais que<em> incluso</em> Al-lah desconocía gran parte de lo que solíais hacer.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und ihr pflegtet (eure Sünden) nicht so zu verbergen, dass eure Ohren und eure Augen und eure Haut nicht Zeugnis ablegten wider euch; vielmehr wähntet ihr, Allah wusste nicht vieles von dem was ihr zu tun pflegtet.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=41:23&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=41:23&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic24\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic24\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/41:24' style='text-decoration:underline'>41:24</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(24)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control24\"></i></button> <audio id=\"player24\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ ذٰلِکُمۡ ظَنُّکُمُ الَّذِیۡ ظَنَنۡتُمۡ بِرَبِّکُمۡ اَرۡدٰٮکُمۡ فَاَصۡبَحۡتُمۡ مِّنَ الۡخٰسِرِیۡنَ ﴿۲۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And that thought of yours, which you entertained concerning your Lord, has ruined you. So <em>now </em>you have become of those who are lost.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And that thought of yours, which you entertained concerning your Lord,<sup class='ref'>[<a class='ref' data-id='ref_41_24_2630' href='#'>2630</a>]</sup> has ruined you. So <i>now </i>you have become of those who are lost.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_41_24_2630'>2630</span></div> <div><a name='2630'></a><div class='reference' data-id='ref_41_24_2630' style='display:none'> <p><b>2630.</b> In fact, all sins are the result of lack of a living faith in God. (<a href='javascript:void(0)' data-id='ref_41_24_2630' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور تمہارا وہ گمان جو تم اپنے ربّ کے متعلق کیا کرتے تھے اُس نے تمہیں ہلاک کردیا اور تم نقصان اٹھانے والوں میں سے ہوگئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور یہی وہ بدظنی تھی جو تم نے اپنے رب کے متعلق کی جس نے تم کو ہلاک کر دیا اور تم ہر طرح نقصان اٹھانے والوں میں سے ہو گئے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et cette pensée que vous entreteniez sur votre Seigneur a causé votre ruine. C’est ainsi que <em>maintenant</em> vous êtes de ceux qui sont perdants. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Mas ese pensamiento vuestro, que teníais respecto a vuestro Señor, os ha arruinado. Así pues, <em>ahora</em> sois de los que están perdidos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und das, was ihr wähntet von eurem Herrn, hat euch ins Verderben gefährt: so würdet ihr die Verlierenden.\"", "spanish": " Y dirán a sus pieles: ¿”Por qué presentáis testimonio contra nosotros?”. Dirán: “Al-lah nos ha hecho hablar como ha hecho que todas las demás cosas hablen. Pues Él es Quien os creó la primera vez y a Él habéis sido devueltos.", "urdu": " اور وہ اپنے چمڑوں سے کہیں گے تم نے ہمارے خلاف گواہی کیوں دی؟ اور ان کے چمڑے جواب میں کہیں گے‘ ہم سے اسی خدا نے کلام کروایا ہے جس نے ہر چیز سے کلام کروایا ہے اور اس نے تم کو پہلی دفعہ بھی پیدا کیا تھا اور پھر بھی تم اس کی طرف لوٹائے جاٶ گے۔"}, {"arabic": " فَاِنۡ یَّصۡبِرُوۡا فَالنَّارُ مَثۡوًی لَّہُمۡ ۚ وَ اِنۡ یَّسۡتَعۡتِبُوۡا فَمَا ہُمۡ مِّنَ الۡمُعۡتَبِیۡنَ ﴿۲۵﴾", "english": " Now if they can endure, the Fire is their abode; and if they ask for forgiveness, they are not of those whom forgiveness can be shown.", "french": " Maintenant , s’ils peuvent le supporter, le Feu est leur habitation ; et s’ils demandent audience, ils ne seront pas de ceux qui sont entendus.", "german": " Wenn sie nun auszuhalten wagen, so ist doch das Feuer ihre Wohnstatt; und wenn sie um Gnade bitten, so wird ihnen keine Gnade erwiesen werden.", "spanish": " Si ahora pueden resistir, El Fuego es su morada; y si buscan una audiencia, no serán de los escuchados.", "urdu": " پس اگر یہ لوگ صبر سے کام لیں تو آگ ان کا ٹھکانا ہے اور اگر یہ خدا کے حضور میں حاضر ہونا چاہیں تو ان کو خدا کے حضور میں حاضر ہونے کی اجازت نہیں دی جائے گی۔"}, {"arabic": " وَ قَیَّضۡنَا لَہُمۡ قُرَنَآءَ فَزَیَّنُوۡا لَہُمۡ مَّا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ وَ حَقَّ عَلَیۡہِمُ الۡقَوۡلُ فِیۡۤ اُمَمٍ قَدۡ خَلَتۡ مِنۡ قَبۡلِہِمۡ مِّنَ الۡجِنِّ وَ الۡاِنۡسِ ۚ اِنَّہُمۡ کَانُوۡا خٰسِرِیۡنَ ﴿٪۲۶﴾", "english": " And We had assigned for them companions who made to appear attractive to them what was before them and what was behind them; and the sentence became due against them along with the communities of Jinn and mankind that had gone before them. Surely, they were the losers.", "french": " Et Nous avions désigné pour eux des compagnons, qui firent paraître attrayant à leurs yeux ce qui s’était déjà passé et ce qui les attendait à l’avenir , et la sentence devint due contre eux de même que contre les communautés des djinns – des gens considérés comme grands – et des gens ordinaires qui sont passées avant eux. Assurément, c’étaient eux les perdants.", "german": " Wir hatten Gefährten für sie bestimmt, die ihnen als wohlgefällig erscheinen ließen, was vor ihnen war und was hinter ihnen war: und (so) ward der Spruch fällig gegen sie zusammen mit den Scharen der Jinn und der Menschen, die vor ihnen hingegangen waren, Gewiss, sie waren Verlorene.", "spanish": " Y les asignamos compañeros que hicieron que les pareciera atractivo lo que había pasado ante ellos y lo que tenían delante de sí; y el juicio se dictó contra ellos de igual manera que se dictó respecto a os pueblos que les precedieron, pertenecientes a los Yinn - hombres grandes- o a los hombres comunes. En verdad ellos fueron los perdedores.", "urdu": " اور ہم نے ان کے ساتھ کچھ ایسے ہم نشین لگا دئیے جنہوں نے ان کے اعمال کو خوبصورت کرکے دکھایا۔ اور اُن کے اوپر وہی حکم جاری ہو گیا جو جنوں اور انسانوں میں سے ان سے پہلے گذری ہوئی قوموں پر جاری ہوا تھا (یعنی یہ) کہ وہ گھاٹا پانے والوں میں سے ہو جائیں گے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا لَا تَسۡمَعُوۡا لِہٰذَا الۡقُرۡاٰنِ وَ الۡغَوۡا فِیۡہِ لَعَلَّکُمۡ تَغۡلِبُوۡنَ ﴿۲۷﴾", "english": " And those who disbelieve say: ‘Listen not to this Qur’an, but make noise during its recital that you may have the upper hand.’", "french": " Et les mécréants disent : « N’écoutez pas ce Coran, mais faites du bruit pendant sa récitation, afin que vous puissiez avoir le dessus. «", "german": " Und die Ungläubigen sprachen: \"Höret nicht auf diesen Qur-ân, sondern macht Lärm darein, damit ihr die Oberhand behaltet.\"", "spanish": " Los incrédulos dicen: “No escuchéis a este Corán; al contrario, haced ruido durante su recitación para que tengáis la ventaja”.", "urdu": " اور کفار نے کہا‘ اس قرآن کی تعلیم مت سنو اور اس کے سنانے کے وقت شور مچا دو۔ تا کہ اس طرح تم غالب آجاٶ۔"}, {"arabic": " فَلَنُذِیۡقَنَّ الَّذِیۡنَ کَفَرُوۡا عَذَابًا شَدِیۡدًا ۙ وَّ لَنَجۡزِیَنَّہُمۡ اَسۡوَاَ الَّذِیۡ کَانُوۡا یَعۡمَلُوۡنَ ﴿۲۸﴾", "english": " And most certainly We will make those who disbelieve taste a severe punishment, and, most certainly, We will requite them for the worst of their deeds.", "french": " Et très certainement Nous ferons goûter un châtiment rigoureux aux mécréants, et assurément Nous les paierons pour le pire de leurs œuvres.", "german": " Aber ganz gewiss werden Wir den Ungläubigen eine strenge Strafe zu kosten geben, und ganz gewiss werden Wir ihnen ihre schlimmsten Taten vergelten.", "spanish": " Haremos ciertamente que los incrédulos prueben un severo castigo y, con toda seguridad, les pagaremos por las peores de sus acciones.", "urdu": " سو اس کے نتیجہ میں ہم کفار کو ضرور سخت عذاب کا مزہ چکھائیں گے اور ان کے بدترین اعمال کی جزا ان کو دیں گے۔"}, {"arabic": " ذٰلِکَ جَزَآءُ اَعۡدَآءِ اللّٰہِ النَّارُ ۚ لَہُمۡ فِیۡہَا دَارُ الۡخُلۡدِ ؕ جَزَآءًۢ بِمَا کَانُوۡا بِاٰیٰتِنَا یَجۡحَدُوۡنَ ﴿۲۹﴾", "english": " That is the reward of the enemies of Allah — the Fire. For them there will be an abiding home therein as a requital because they used to deny Our Signs.", "french": " C’est là, la rétribution des ennemis d’Allāh : le Feu. Pour eux il y aura une demeure où ils resteront pendant longtemps : une rétribution parce qu’ils niaient Nos Signes.", "german": " Das ist der Lohn der Feinde Allahs: das Feuer, Darin wird ihnen auf lange Zeit eine Wohnstatt sein – eine Vergeltung dafür, dass sie Unsere Zeichen zu leugnen pflegten.", "spanish": " Ésa es la recompensa de los enemigos de Al-lah: el Fuego. Para ellos habrá en él un hogar duradero como retribución por haber negado Nuestros Signos.", "urdu": " (اور) اللہ کے دشمنوں کی جزا یہی ہے یعنی آگ‘ اس میں ایک لمبے عرصہ تک رہنے والا گھر ان کو ملے گا یہ جزا انہیں اس لئے ملے گی کہ وہ ہماری آیتوں کا بضد انکار کرتے تھے۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا رَبَّنَاۤ اَرِنَا الَّذَیۡنِ اَضَلّٰنَا مِنَ الۡجِنِّ وَ الۡاِنۡسِ نَجۡعَلۡہُمَا تَحۡتَ اَقۡدَامِنَا لِیَکُوۡنَا مِنَ الۡاَسۡفَلِیۡنَ ﴿۳۰﴾", "english": " And those who disbelieve will say, ‘Our Lord, show us those who led us astray from among both the Jinn and men, that we may put them under our feet so that both of them may become of the lowest.’", "french": " Et les mécréants diront : « Notre Seigneur, montre-nous ceux d’entre les djinns et les hommes qui nous ont égarés, afin que nous les piétinions tous sous nos pieds, pour qu’ils soient du nombre des plus humiliés. »", "german": " Und die Ungläubigen werden sagen: \"Unser Herr, zeige uns jene der Jinn und der Menschen, die uns irreführten, damit wir sie mit unseren Füßen treten, so dass sie zu den Niedrigsten gehören.\"", "spanish": " Los incrédulos dirán: “Señor nuestro, muéstranos a aquellos que nos extraviaron tanto de entre los Yinn como de entre los hombres, para que los pongamos bajo nuestros pies y ambos pasen a ser de los más viles”.", "urdu": " اور کفار کہیں گے کہ اے ہمارے رب! تو ہمیں جن و انس میں سے وہ لوگ دکھا جو ہمیں گمراہ کیا کرتے تھے۔ تا کہ ہم ان کو اپنے پیروں کے نیچے مسلیں اور اس کے نتیجہ میں وہ ذلیل ترین لوگ بن جائیں۔"}, {"arabic": " اِنَّ الَّذِیۡنَ قَالُوۡا رَبُّنَا اللّٰہُ ثُمَّ اسۡتَقَامُوۡا تَتَنَزَّلُ عَلَیۡہِمُ الۡمَلٰٓئِکَۃُ اَلَّا تَخَافُوۡا وَ لَا تَحۡزَنُوۡا وَ اَبۡشِرُوۡا بِالۡجَنَّۃِ الَّتِیۡ کُنۡتُمۡ تُوۡعَدُوۡنَ ﴿۳۱﴾", "english": " As for those who say, ‘Our Lord is Allah,’ and then remain steadfast, the angels descend on them, saying : ‘Fear ye not, nor grieve; and rejoice in the Garden that you were promised.", "french": " Quant à ceux qui disent : « Notre Seigneur est Allāh, » et qui ensuite restent constants, les anges descendent sur eux, en disant : « Ne craignez pas, et ne vous désolez pas ; mais réjouissez-vous de la rencontre du Jardin qui vous a été promis.", "german": " Die aber sprechen: \"Unser Herr ist Allah\", und dann standhaft bleiben – zu ihnen steigen die Engel nieder (und sprechen): \"Fürchtet euch nicht und seid nicht betrübt, sondern freuet euch des Paradieses, das euch verheißen ward.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=41:31&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=41:31&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic32\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic32\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/41:32' style='text-decoration:underline'>41:32</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(32)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control32\"></i></button> <audio id=\"player32\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">نَحۡنُ اَوۡلِیٰٓؤُکُمۡ فِی الۡحَیٰوۃِ الدُّنۡیَا وَ فِی الۡاٰخِرَۃِ ۚ وَ لَکُمۡ فِیۡہَا مَا تَشۡتَہِیۡۤ اَنۡفُسُکُمۡ وَ لَکُمۡ فِیۡہَا مَا تَدَّعُوۡنَ ﴿ؕ۳۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘We are your friends in this life and in the Hereafter. Therein you will have all that your souls will desire, and therein you will have all that you will ask for — </span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘We are your friends in this life and in the Hereafter. Therein <sup class='ref'>[<a class='ref' data-id='ref_41_32_a' href='#'>a</a>]</sup>you will have all that your souls will desire, and therein you will have all that you will ask for— <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_41_32_a'>a</span></div> <div><div class='reference' data-id='ref_41_32_a' style='display:none'> <p><b>a.</b> <a href='/quran/25:17' target=_blank>25:17</a>. (<a href='javascript:void(0)' data-id='ref_41_32_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">ہم اس دنیوی زندگی میں بھی تمہارے ساتھی ہیں اور آخرت میں بھی۔ اور اس میں تمہارے لئے وہ سب کچھ ہوگا جس کی تمہارے نفس خواہش کرتے ہیں اور اس میں تمہارے لئے وہ سب کچھ ہوگا جو تم طلب کرتے ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">ہم دنیا میں بھی تمہارے دوست ہیں اور آخرت میں بھی تمہارے دوست رہیں گے اور اس (جنت) میں جو کچھ تمہارے جی چاہیں گے تم کو ملے گا اور جو کچھ تم مانگو گے وہ بھی تم کو اس میں ملے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Nous sommes vos amis dans cette vie et dans l’au-delà. Vous y aurez tout ce que désirera votre âme, et vous y aurez tout ce que vous demanderez –</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>“</em>Somos vuestros amigos en esta vida y en el Más Allá. Allí poseeréis todo lo que deseen vuestras almas, y allí tendréis todo cuanto pidáis”,</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wir sind eure Freunde in diesem Leben und im Jenseits. In ihm werdet ihr alles haben, was eure Seelen begehren, und in ihm werdet ihr alles haben, wonach ihr verlangt –</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=41:32&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=41:32&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic33\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic33\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/41:33' style='text-decoration:underline'>41:33</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(33)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control33\"></i></button> <audio id=\"player33\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">نُزُلًا مِّنۡ غَفُوۡرٍ رَّحِیۡمٍ ﴿٪۳۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘An entertainment from the Most Forgiving, the Merciful.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> An entertainment from the Most Forgiving, Merciful <i>God</i>.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہ بہت بخشنے والے (اور) بار بار رحم کرنے والے کی طرف سے مہمانی کے طور پر ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یہ بخشنے والے (اور) بے انتہا کرم کرنے والے خدا کی طرف سے مہمانی کے طور پر ہوگا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Une réception de la part d’un Très-Pardonnant, <em>et</em> Miséricordieux. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>“</em>El agasajo del Sumo Indulgente, el Misericordioso”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">eine Gabe von einem Vergebungsreichen, Barmherzigen.\"", "spanish": " En cuanto a los que dicen: “Nuestro Señor es Al-lah” y permanecen después perseverantes, los ángeles descienden sobre ellos, diciéndoles : “No temáis ni os aflijáis; regocijaos en el Jardín que se os ha prometido”;", "urdu": " وہ لوگ جنہوں نے کہا کہ اللہ ہمارا رب ہے پھر مستقل مزاجی سے اس عقیدہ پر قائم ہو گئے‘ اُن پر فرشتے اتریں گے یہ کہتے ہوئے کہ ڈرو نہیں اور کسی پچھلی غلطی کا غم نہ کرو اور اس جنت کے ملنے سے خوش ہو جاٶ‘ جس کا تم سے وعدہ کیا گیا تھا۔"}, {"arabic": " وَ مَنۡ اَحۡسَنُ قَوۡلًا مِّمَّنۡ دَعَاۤ اِلَی اللّٰہِ وَ عَمِلَ صَالِحًا وَّ قَالَ اِنَّنِیۡ مِنَ الۡمُسۡلِمِیۡنَ ﴿۳۴﴾", "english": " And who is better in speech than he who invites men to Allah and does good works and says, ‘I am surely of those who submit?’", "french": " Et qui est meilleur en paroles que celui qui invite les gens à Allāh et fait de bonnes œuvres, et dit : « Assurément, je suis de ceux qui se soumettent » ?", "german": " Und wer ist besser in der Rede als einer, der zu Allah ruft und Gutes tut und spricht: \"Ich bin einer der Gottergebenen\"?", "spanish": " Mas ¿quién habla mejor que quien invita a los hombres a Al-lah, practica las buenas obras y dice: “Soy, en verdad, de quienes se someten?”.", "urdu": " اور اس سے زیادہ اچھی بات کس کی ہوگی جو کہ اللہ کی طرف لوگوں کو بلاتا ہے اور اپنے ایمان کے مطابق عمل کرتا ہے اور کہتا ہے کہ میں تو فرمانبرداروں میں سے ہوں۔"}, {"arabic": " وَ لَا تَسۡتَوِی الۡحَسَنَۃُ وَ لَا السَّیِّئَۃُ ؕ اِدۡفَعۡ بِالَّتِیۡ ہِیَ اَحۡسَنُ فَاِذَا الَّذِیۡ بَیۡنَکَ وَ بَیۡنَہٗ عَدَاوَۃٌ کَاَنَّہٗ وَلِیٌّ حَمِیۡمٌ ﴿۳۵﴾", "english": " And good and evil are not alike. Repel evil with that which is best. And lo, he between whom and thyself was enmity will become as though he were a warm friend.", "french": " Et le bien et le mal ne sont pas pareils. Repousse le mal par ce qui est le meilleur. Et voilà que celui entre lequel et toi-même il y avait de l’inimitié, devient comme s’il était un ami chaleureux.", "german": " Gut und Böse sind nicht gleich. Wehre (das Böse) mit dem ab, was das Beste ist. Und siehe, wenn Feindschaft zwischen dir und einem anderen war, so wird der wie ein warmherziger Freund werden.", "spanish": " Pues el bien y el mal no son equiparables. Rechaza el mal con lo que es mejor y observa como aquel entre cuya persona y tú existía la enemistad, se vuelve como si fuera un amigo entrañable.", "urdu": " اور نیکی اور بدی برابر نہیں ہو سکتی۔ اور تو برائی کا جواب نہایت نیک سلوک سے دے اس کا نتیجہ یہ ہوگا کہ وہ شخص کہ اس کے اور تیرے درمیان عداوت پائی جاتی ہے‘ وہ تیرے حسن سلوک کو دیکھ کر ایک گرم جوش دوست بن جائے گا۔"}, {"arabic": " وَ مَا یُلَقّٰہَاۤ اِلَّا الَّذِیۡنَ صَبَرُوۡا ۚ وَ مَا یُلَقّٰہَاۤ اِلَّا ذُوۡحَظٍّ عَظِیۡمٍ ﴿۳۶﴾", "english": " But none is granted it save those who are steadfast; and none is granted it save those who possess a large share of good.", "french": " Mais cela n’est accordé qu’à ceux qui sont endurants ; et cela n’est accordé qu’à ceux qui possèdent une très grande mesure de bonté .", "german": " Aber dies wird nur denen gewährt, die standhaft sind; und keinem wird es gewährt als dem Besitzer großen Seelenadels.", "spanish": " Mas a nadie se le concede esto excepto a los perseverantes; y a adie se le concede esto salvo al que posee una parte importante de excelsitud.", "urdu": " اور (باوجود ظلموں کے سہنے کے) اس (قسم کے سلوک) کی توفیق صرف انہی کو ملتی ہے جو بڑے صبر کرنے والے ہیں اور یا پھر ان کو ملتی ہے جن کو (خدا کی طرف سے نیکی کا) ایک بہت بڑا حصہ ملا ہو۔"}, {"arabic": " وَ اِمَّا یَنۡزَغَنَّکَ مِنَ الشَّیۡطٰنِ نَزۡغٌ فَاسۡتَعِذۡ بِاللّٰہِ ؕ اِنَّہٗ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۳۷﴾", "english": " And if an incitement from Satan incite thee, then seek refuge in Allah. Surely He is the All-Hearing, the All-Knowing.", "french": " Et si une incitation de Satan t’incite, alors cherche refuge en Allāh. Assurément, Il est Celui Qui entend tout, l’Omniscient.", "german": " Und wenn dich ein Anreiz von Satan berührt, dann nimm deine Zuflucht bei Allah. Wahrlich, Er ist der Allhörende, der Allwissende.", "spanish": " Si te tienta alguna incitación de Satanás, busca refugio en Al-lah. En verdad, Él es el Quien todo lo oye, el Omnisciente.", "urdu": " اور اگر شیطان (یعنی حق سے دور ہستی) تجھے تکلیف پہنچائے تو (فوراً اس کا بدلہ لینے کے لئے تیار نہ ہو جایا کر بلکہ) اللہ سے پناہ مانگا کر (کہ وہ تجھے اس ادنیٰ درجہ کے خلق سے بچائے) اللہ یقیناً بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہِ الَّیۡلُ وَ النَّہَارُ وَ الشَّمۡسُ وَ الۡقَمَرُ ؕ لَا تَسۡجُدُوۡا لِلشَّمۡسِ وَ لَا لِلۡقَمَرِ وَ اسۡجُدُوۡا لِلّٰہِ الَّذِیۡ خَلَقَہُنَّ اِنۡ کُنۡتُمۡ اِیَّاہُ تَعۡبُدُوۡنَ ﴿۳۸﴾", "english": " And among His Signs are the night and the day and the sun and the moon. Prostrate not yourselves before the sun, nor before the moon, but prostrate yourselves before Allah, Who created them, if it is Him Whom you really worship.", "french": " Et parmi Ses Signes sont la nuit et le jour et le soleil et la lune. Ne vous prosternez pas devant le soleil, ni devant la lune ; mais prosternez-vous devant Allāh, Qui les a créés, si c’est Lui que vous adorez réellement.", "german": " Unter Seinen Zeichen sind die Nacht und der Tag und die Sonne und der Mond. Werfet euch nicht vor der Sonne anbetend nieder und auch nicht vor dem Mond, sondern werfet euch anbetend nieder vor Allah, Der sie erschuf, wenn Er es ist, Den ihr verehren möchtet.", "spanish": " Entre Sus signos están la noche y el día, y el sol y la luna. No os postréis ante el sol ni ante la luna, sino ante Al-lah, Quien los ha creado, si es a Él a Quien realmente adoráis.", "urdu": " اور اس کے نشانوں میں سے رات بھی ہے اور دن بھی اور سورج بھی ہے اور چاند بھی۔ نہ سورج کو سجدہ کرو نہ چاند کو۔ بلکہ صرف اللہ کو جس نے ان دونوں کو پیدا کیا ہے‘ سجدہ کرو اگر تم پکے موحد ہو۔"}, {"arabic": " فَاِنِ اسۡتَکۡبَرُوۡا فَالَّذِیۡنَ عِنۡدَ رَبِّکَ یُسَبِّحُوۡنَ لَہٗ بِالَّیۡلِ وَ النَّہَارِ وَ ہُمۡ لَا یَسۡـَٔمُوۡنَ ﴿ٛ۳۹﴾", "english": " But if they turn away with disdain they do it to their own detriment , while those who are with thy Lord glorify Him night and day, and they are never wearied.", "french": " Mais s’ils se montrent orgueilleux, alors qu’ils sachent que ceux qui sont auprès de ton Seigneur Le glorifient nuit et jour, et ils ne s’ en lassent jamais.", "german": " Wenn sie sich aber in Hochmut abwenden, so lobpreisen Ihn Nacht und Tag diejenigen, die deinem Herrn nahe sind, und sie werden niemals müde.", "spanish": " Pero si rehúsan con desdén, lo hacen en perjuicio propio, mientras que los que están con tu Señor lo glorifican día y noche, sin cansarse nunca.", "urdu": " پھر اگر یہ لوگ تکبر کریں‘ تو یاد رکھ کہ وہ لوگ جو تیرے رب کے مقرب ہیں وہ رات اور دن اسی کی تسبیح کرتے ہیں اور وہ کبھی نہیں تھکتے۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖۤ اَنَّکَ تَرَی الۡاَرۡضَ خَاشِعَۃً فَاِذَاۤ اَنۡزَلۡنَا عَلَیۡہَا الۡمَآءَ اہۡتَزَّتۡ وَ رَبَتۡ ؕ اِنَّ الَّذِیۡۤ اَحۡیَاہَا لَمُحۡیِ الۡمَوۡتٰی ؕ اِنَّہٗ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۴۰﴾", "english": " And among His Signs is this : that thou seest the earth lying withered, but when We send down water on it, it stirs and swells with verdure . Surely, He Who quickened it can quicken the dead. Verily He has power over all things.", "french": " Et parmi Ses Signes est ceci : que tu vois la terre aride et desséchée mais quand Nous faisons descendre sur elle de l’eau, elle se remue et s’enfle de verdure . Assurément, Celui Qui l’a ranimée peut ranimer les morts. En vérité, Il a le pouvoir de faire tout ce qu’Il veut.", "german": " Und unter Seinen Zeichen ist dies: dass du die Erde leblos und verdorrt siehst, doch wenn Wir Wasser auf sie niedersenden, dann regt sie sich und schwillt. Er, Der sie belebte, wird auch die Toten sicherlich lebendig machen, denn Er vermag alles zu tun.", "spanish": " Entre Sus signos está éste: que ves la tierra reseca, pero cuando le enviamos agua, se agita e hincha con verdor. En verdad, Quien le infundió vida puede resucitar a los muertos. Ciertamente Él tiene poder sobre todas las cosas.", "urdu": " اور اس کے نشانوں میں سے (ایک نشان) یہ بھی ہے کہ تو زمین کو (بعض وقتوں میں) ویران دیکھتا ہے پھر جب ہم اس پر پانی اتارتے ہیں تو وہ ایک نئی زندگی پا لیتی ہے اور (سبزی کو) خوب بڑھاتی ہے۔ وہ (خدا) جس نے اس (زمین) کو زندہ کیا ہے وہ یقیناً مردوں کو بھی زندہ کرے گا۔ وہ ہر ایک چیز پر قادر ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یُلۡحِدُوۡنَ فِیۡۤ اٰیٰتِنَا لَا یَخۡفَوۡنَ عَلَیۡنَا ؕ اَفَمَنۡ یُّلۡقٰی فِی النَّارِ خَیۡرٌ اَمۡ مَّنۡ یَّاۡتِیۡۤ اٰمِنًا یَّوۡمَ الۡقِیٰمَۃِ ؕ اِعۡمَلُوۡا مَا شِئۡتُمۡ ۙ اِنَّہٗ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۴۱﴾", "english": " Surely, those who deviate from the right path with respect to Our Signs are not hidden from Us. Is he, then, who is cast into the Fire better or he who comes out safe on the Day of Resurrection? Do what you will. Surely He sees all that you do.", "french": " Assurément, ceux qui se montrent retors vis-à-vis de Nos Signes ne Nous sont pas cachés. Celui donc qui est jeté dans le Feu est-il meilleur, ou celui qui viendra sain et sauf le Jour de la Résurrection ? Faites ce que vous voudrez. Assurément, Il voit bien tout ce que vous faites.", "german": " Diejenigen, die Unsere Zeichen entstellen, sind Uns nicht verborgen. Ist etwa der, der ins Feuer geworfen wird, besser als jener, der sicher hervorgeht am Tage der Auferstehung? Tut, was ihr wollt, denn Er sieht alles, was ihr tut.", "spanish": " En verdad quienes disputan respecto a Nuestros Signos no están ocultos para Nosotros. ¿Acaso quien es arrojado al Fuego es mejor que quien sale a salvo en el Día de la Resurrección? Haced lo que queráis. Ciertamente Él ve todo lo que hacéis.", "urdu": " وہ لوگ جو ہماری آیات میں سے پیچ در پیچ غلط باتیں نکالتے رہتے ہیں وہ ہم سے مخفی نہیں۔ کیا وہ شخص جو دوزخ میں ڈالا جائے زیادہ اچھا ہے یا وہ جو قیامت کے دن امن کے ساتھ (ہمارے پاس) آئے۔ (اے لوگو) جو کچھ چاہو کرو۔ اللہ تمہارے اعمال کو اچھی طرح دیکھ رہا ہے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَفَرُوۡا بِالذِّکۡرِ لَمَّا جَآءَہُمۡ ۚ وَ اِنَّہٗ لَکِتٰبٌ عَزِیۡزٌ ﴿ۙ۴۲﴾", "english": " Those who disbelieve in the Reminder when it comes to them are the losers . And, truly, it is a mighty Book.", "french": " Ceux qui refusent de croire au Rappel lorsqu’il leur vient seront punis . Et en vérité, c’est un Livre puissant.", "german": " Diejenigen, die nicht an die Ermahnung glauben, wenn sie zu ihnen kommt (sind die Verlierenden). Und fürwahr, es ist ein ehrwürdiges Buch.", "spanish": " Quien no creen en el Recordatorio cuando les llega son los perdedores. Pues ciertamente es un Libro poderoso.", "urdu": " وہ لوگ جو کہ اس ذکر (یعنی قرآن) کا جب وہ ان کے پاس آیا انکار کرتے ہیں حالانکہ وہ ایک بڑی عزت والی کتاب ہے (وہ اپنی تباہی کا سامان اپنے ہاتھوں کر رہے ہیں) ۔"}, {"arabic": " لَّا یَاۡتِیۡہِ الۡبَاطِلُ مِنۡۢ بَیۡنِ یَدَیۡہِ وَ لَا مِنۡ خَلۡفِہٖ ؕ تَنۡزِیۡلٌ مِّنۡ حَکِیۡمٍ حَمِیۡدٍ ﴿۴۳﴾", "english": " Falsehood cannot approach it either from before or from behind it. It is a revelation from the Wise, the Praiseworthy.", "french": " Le mensonge ne peut s’en approcher ni par devant ni par derrière. C’est une révélation d’un Sage, Digne de louange.", "german": " Falschheit kann nicht daran herankommen, weder von vorn noch von hinten, Es ist eine Offenbarung von einem Allweisen, Preiswürdigen.", "spanish": " La falsedad no puede acercarse a él ni por delante ni por detrás. Es una revelación del Sabio, el Merecedor de alabanza.", "urdu": " باطل نہ اس کے آگے سے آسکتا ہے نہ اس کے پیچھے سے‘ بڑی حکمتوں والے اور بڑی تعریفوں والے خدا کی طرف سے وہ اترا ہے۔"}, {"arabic": " مَا یُقَالُ لَکَ اِلَّا مَا قَدۡ قِیۡلَ لِلرُّسُلِ مِنۡ قَبۡلِکَ ؕ اِنَّ رَبَّکَ لَذُوۡ مَغۡفِرَۃٍ وَّ ذُوۡ عِقَابٍ اَلِیۡمٍ ﴿۴۴﴾", "english": " Nothing is said to thee but what was said to the Messengers before thee. Thy Lord is indeed the Master of forgiveness; and also the Master of painful chastisement.", "french": " Rien ne t’est dit que ce qui a été dit aux Messagers qui t’ont devancé. Ton Seigneur est en vérité Maître du pardon, et aussi Maître d’un châtiment douloureux.", "german": " Nichts anderes wird dir gesagt, als was schon den Gesandten vor dir gesagt ward. Dein Herr ist fürwahr der Eigner der Verzeihung, aber auch der Eigner schmerzlicher Züchtigung.", "spanish": " No se te dice sino lo que se dijo a los Mensajeros que te recedieron. Tu Señor es en verdad el Señor del perdón; y es también el Señor del castigo doloroso.", "urdu": " تجھ سے صرف وہی باتیں کہی جاتی ہیں۔ جو تجھ سے پہلے رسولوں سے کہی گئی تھیں۔ تیرا رب بڑی بخشش والا ہے اور اس کا عذاب بھی دردناک ہوتا ہے۔"}, {"arabic": " وَ لَوۡ جَعَلۡنٰہُ قُرۡاٰنًا اَعۡجَمِیًّا لَّقَالُوۡا لَوۡ لَا فُصِّلَتۡ اٰیٰتُہٗ ؕ ءَؔاَعۡجَمِیٌّ وَّ عَرَبِیٌّ ؕ قُلۡ ہُوَ لِلَّذِیۡنَ اٰمَنُوۡا ہُدًی وَّ شِفَآءٌ ؕ وَ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ فِیۡۤ اٰذَانِہِمۡ وَقۡرٌ وَّ ہُوَ عَلَیۡہِمۡ عَمًی ؕ اُولٰٓئِکَ یُنَادَوۡنَ مِنۡ مَّکَانٍۭ بَعِیۡدٍ ﴿٪۴۵﴾", "english": " And if We had made it a Qur’an in a foreign tongue, they surely would have said, ‘Why have not its verses been made clear? What! a foreign tongue and an Arab?’ Say, ‘It is a guidance and a healing for those who believe.’ But as to those who believe not, there is a deafness in their ears, and it is blindness for them. They are, as it were , being called to from a far off place.", "french": " Et si Nous en avions fait un Coran dans une langue étrangère, ils auraient sûrement dit : « Pourquoi ses versets n’ont-ils pas été rendus clairs ? Comment ! une langue étrangère et un Prophète arabe ? » Dis : « C’est une direction et une guérison pour ceux qui croient. » Mais quant à ceux qui ne croient pas, il y a une surdité dans leurs oreilles, et ce Livre leur paraît obscur. Ceux-là sont, pour ainsi dire , appelés d’un endroit fort éloigné.", "german": " Hätten Wir es als einen Qur-ân in einer fremden Sprache gemacht, sie hätten gesagt: \"Warum sind seine Verse nicht klar gemacht worden? Wie! eine fremde Sprache und ein Araber!\" Sprich: \"Er ist eine Führung und eine Heilung für die Gläubigen.\" Doch diejenigen, die nicht glauben – in ihren Ohren ist Taubheit, und er bleibt ihnen unsichtbar. Sie sind (wie) von einem weit entfernten Ort angerufen.", "spanish": " Y si hubiésemos hecho un Corán en idioma extranjero, ciertamente habrían dicho: “¿Por qué sus versículos no han sido hechos con claridad? ¡Cómo! ¿Una escritura en lengua extranjera y un profeta árabe?”. Diles: “Es una guía y curación para los creyentes”. Mas en cuanto a quienes no creen, hay sordera en sus oídos y es ceguera para ellos. Es, por así decirlo, como si estuvieran siendo llamados desde un lugar muy lejano.", "urdu": " اگر ہم اس قرآن کو اعجمی بناتے (یعنی عربی زبان کے سوا کسی اور زبان میں اتارتے) تو وہ (مکے والے) کہہ سکتے تھے کہ اس کی آیتیں کھول کر کیوں نہیں بیان کی گئیں۔ کیا اعجمی زبان اور عربی نبی کوئی بھی مشابہت رکھتے ہیں؟ تو کہہ دے وہ مومنوں کے لئے ہدایت اور شفا رکھتا ہے (یعنی عربی میں اتارا گیا ہے اور مکہ کے لوگ اسے سمجھ سکتے ہیں) اور جو ایمان ہی نہیں لاتے ان کے کانوں میں تو بہرا پن ہے اور وہ (یعنی اس کی حقیقت) ان پر مخفی ہے وہ لوگ ایسے ہی ہیں جیسے کسی کو دور کی جگہ سے پکارا جائے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ فَاخۡتُلِفَ فِیۡہِ ؕ وَ لَوۡ لَا کَلِمَۃٌ سَبَقَتۡ مِنۡ رَّبِّکَ لَقُضِیَ بَیۡنَہُمۡ ؕ وَ اِنَّہُمۡ لَفِیۡ شَکٍّ مِّنۡہُ مُرِیۡبٍ ﴿۴۶﴾", "english": " And We did give Moses the Book, but differences were created concerning it; and had it not been for a word that had gone before from thy Lord, the matter would have been decided between them; and certainly they are in a disquieting doubt about it.", "french": " Et en fait Nous donnâmes le Livre à Moïse, mais des divergences ont été créées concernant cela ; et n’eût été une parole qui avait déjà été prononcée par ton Seigneur, l’affaire aurait été assurément jugée entre eux ; et en vérité, ils sont dans un doute inquiétant à propos de ce Coran .", "german": " Und Wir gaben auch Moses die Schrift, doch dann entstand Uneinigkeit über sie. Wäre nicht ein Wort von deinem Herrn zuvor ergangen, es wäre gewiss zwischen ihnen entschieden worden; aber wahrhaftig, sie sind in beunruhigendem Zweifel über ihn (den Qur-ân).", "spanish": " Dimos a Moisés el Libro, pero crearon diferencias respecto a él; y e no haber sido por una palabra que fue revelada antes por tu Señor, el asunto habría quedado decidido entre ellos; pues en verdad se encuentran en una duda inquietante respecto a él.", "urdu": " اور ہم نے موسیٰ کو بھی ایک اعلیٰ کتاب دی تھی اور اس کے بارہ میں بھی اختلاف کیا گیا تھا اور اگر ایک بات تیرے رب کی طرف سے پہلے گذر نہ چکی ہوتی تو ان لوگوں کا کبھی کا فیصلہ ہو چکا ہوتا۔ وہ اس (قرآن) کے بارے میں ایک ایسے شک میں پڑے ہوئے ہیں جو ان کے امن کو کاٹ دیتا ہے (یعنی انتہائی شکوک میں مبتلا رہتے ہیں اور اس پر غور نہیں کرتے) ۔"}, {"arabic": " مَنۡ عَمِلَ صَالِحًا فَلِنَفۡسِہٖ وَ مَنۡ اَسَآءَ فَعَلَیۡہَا ؕ وَ مَا رَبُّکَ بِظَلَّامٍ لِّلۡعَبِیۡدِ ﴿۴۷﴾", "english": " Whoso does right, it is for his own soul; and whoso does evil, it will only go against it. And thy Lord is not at all unjust to His servants.", "french": " Quiconque fait le bien, c’est pour sa propre âme ; et quiconque fait le mal, c’est uniquement contre elle. Et ton Seigneur n’est nullement injuste envers Ses serviteurs.", "german": " Wer das Rechte tut, es ist für seine eigene Seele; und wer Böses tut, es ist wider sie. Und dein Herr ist niemals ungerecht gegen die Diener.", "spanish": " Quien actúa rectamente, lo hace para su propia alma; y quien practica el mal, sólo actuará contra ella. Y tu Señor no es en absoluto injusto con Sus siervos.", "urdu": " جو شخص ایمان کے مطابق عمل کرے تو اس کا فائدہ اس کی اپنی جان کو پہنچتا ہے اور جو بداعمالی کرے اُس کا عذاب بھی اسی پر نازل ہوتا ہے اور تیرا رب اپنے بندوں پر کوئی ظلم نہیں کرتا۔"}, {"arabic": " اِلَیۡہِ یُرَدُّ عِلۡمُ السَّاعَۃِ ؕ وَ مَا تَخۡرُجُ مِنۡ ثَمَرٰتٍ مِّنۡ اَکۡمَامِہَا وَ مَا تَحۡمِلُ مِنۡ اُنۡثٰی وَ لَا تَضَعُ اِلَّا بِعِلۡمِہٖ ؕ وَ یَوۡمَ یُنَادِیۡہِمۡ اَیۡنَ شُرَکَآءِیۡ ۙ قَالُوۡۤا اٰذَنّٰکَ ۙ مَا مِنَّا مِنۡ شَہِیۡدٍ ﴿ۚ۴۸﴾", "english": " To Him alone is referred the knowledge of the Hour. And no fruits come forth from their spathes, nor does any female bear a child , nor does she give birth to it , but with His knowledge. And on the day when He will call unto them, saying , “Where are My ‘Partners’?” they will say, ‘We declare unto Thee, not one of us is a witness thereto .’", "french": " C’est à Lui Seul qu’appartient la connaissance réelle de l’Heure. Et aucun fruit ne sort de sa spathe, et aucune femelle ne conçoit ni n’accouche, sans qu’Il le sache. Et pensez au jour où Il les appellera, en disant : « Où se trouvent Mes ‘ soi-disant’ associés ? » ils répondront : « Nous Te déclarons que pas un d’entre nous n’ en est témoin. »", "german": " Ihm allein ist das Wissen um die \"Stunde\" vorbehalten. Keine Früchte kommen aus ihren Hüllen hervor, und kein Weib empfängt oder gebiert, wenn nicht mit Seinem Wissen. Und an dem Tage, da Er ihnen zurufen wird: \"Wo sind Meine Nebengötter?\", da werden sie sprechen: \"Wir gestehen Dir, keiner von uns ist Zeuge.\"", "spanish": " A Él sólo concierne el conocimiento de la Hora. Ningún fruto sale de su envoltura, ni hembra alguna concibe a un niño , ni lo da a luz, si no es con Su conocimiento. Y pensad en el día en que les convocará, diciéndoles: “¿Dónde están los partícipes que Me atribuís?” Responderán: “Te aseguramos que no hay nadie de nosotros que sea testigo de ello”.", "urdu": " قیامت کا علم اسی کی طرف لوٹایا جاتا ہے (یعنی قیامت کا کامل علم اسی کو حاصل ہے) اور گابھوں میں سے (بھی) کوئی پھل نہیں نکلتے اور عورتیں بھی اپنے پیٹ میں کچھ نہیں اٹھاتیں اور نہ جنتی ہیں مگر وہ اللہ کو معلوم ہوتا ہے جس دن وہ لوگوں کو پکارے گا اور کہے گا کہاں ہیں میرے شریک؟ وہ کہیں گے ہم نے تجھے کھول کر کہہ دیا ہے‘ کہ ہم میں سے کوئی اس بات کا گواہ نہیں۔"}, {"arabic": " وَ ضَلَّ عَنۡہُمۡ مَّا کَانُوۡا یَدۡعُوۡنَ مِنۡ قَبۡلُ وَ ظَنُّوۡا مَا لَہُمۡ مِّنۡ مَّحِیۡصٍ ﴿۴۹﴾", "english": " And all that they used to call upon before will be lost to them, and they will know for certain that they have no place of escape.", "french": " Et tout ce qu’ils invoquaient auparavant sera perdu pour eux, et ils réaliseront qu’ils n’ont aucune issue de secours.", "german": " Und alles, was sie zuvor anzurufen pflegten, wird sie im Stich lassen, und sie werden einsehen, dass sie keine Zuflucht haben.", "spanish": " Pues todo lo que solían invocar anteriormente desaparecerá para ellos, y se darán cuenta de que no tendrán escapatoria.", "urdu": " اور جن (معبودوں) کو وہ اس سے پہلے پکارتے تھے وہ ان سے کھوئے جائیں گے اور ان کو یقین ہو جائے گا کہ اب ان کے لئے کہیں بھاگ کر جانے کی جگہ نہیں۔"}, {"arabic": " لَا یَسۡـَٔمُ الۡاِنۡسَانُ مِنۡ دُعَآءِ الۡخَیۡرِ ۫ وَ اِنۡ مَّسَّہُ الشَّرُّ فَیَـُٔوۡسٌ قَنُوۡطٌ ﴿۵۰﴾", "english": " Man does not tire of praying for good; but if evil touch him, he despairs, and gives up all hope.", "french": " L’homme ne se lasse pas de prier pour le bien ; mais si le malheur le touche, il se désespère, et perd tout espoir.", "german": " Der Mensch wird nicht müde, Gutes zu erbitten; doch wenn ihn Übel berührt, dann verzweifelt er, wird hoffnungslos.", "spanish": " El hombre no se cansa de rogar por el bien; pero si el mal lo afecta, se desespera, y abandona toda esperanza.", "urdu": " انسان اچھی چیزوں کے مانگنے سے کبھی نہیں تھکتا۔ لیکن اگر اسے کبھی کوئی تکلیف پہنچ جائے تو (پہلی حالت کو بھول کر) مایوس ہو جاتا ہے۔"}, {"arabic": " وَ لَئِنۡ اَذَقۡنٰہُ رَحۡمَۃً مِّنَّا مِنۡۢ بَعۡدِ ضَرَّآءَ مَسَّتۡہُ لَیَقُوۡلَنَّ ہٰذَا لِیۡ ۙ وَ مَاۤ اَظُنُّ السَّاعَۃَ قَآئِمَۃً ۙ وَّ لَئِنۡ رُّجِعۡتُ اِلٰی رَبِّیۡۤ اِنَّ لِیۡ عِنۡدَہٗ لَلۡحُسۡنٰی ۚ فَلَنُنَبِّئَنَّ الَّذِیۡنَ کَفَرُوۡا بِمَا عَمِلُوۡا ۫ وَ لَنُذِیۡقَنَّہُمۡ مِّنۡ عَذَابٍ غَلِیۡظٍ ﴿۵۱﴾", "english": " And if We make him taste of mercy from Ourself, after some affliction that has befallen him, he will surely say, ‘This is my due; and I do not think the Hour will ever come. But if I am returned to my Lord, I shall surely have with Him the very best.’ Then We will surely tell the disbelievers all that they did, and We will certainly make them taste hard punishment.", "french": " Et si Nous lui faisons goûter une miséricorde de Notre part après qu’une affliction lui soit survenue, il dit assurément : « Ceci est mon dû ; et je ne pense pas que l’Heure viendra un jour . Mais si je suis ramené auprès de mon Seigneur, je trouverai assurément auprès de Lui ce qui est le plus excellent. » Alors, Nous dirons assurément aux mécréants tout ce qu’ils auront fait, et Nous leur ferons certainement goûter un châtiment terrible.", "german": " Und wenn Wir ihn Unsere Barmherzigkeit kosten lassen, nachdem ihn ein Leid betroffen hat, so sagt er sicherlich: \"Das gebührt mir; und ich glaube nicht, dass die \"Stunde\" kommen wird. Doch wenn ich zu meinem Herrn zurückgebracht werden sollte, dann würde ich gewiss das Beste bei Ihm finden.\" Aber Wir werden den Ungläubigen wahrlich alles ankündigen, was sie getan, und Wir werden sie sicherlich harte Strafe kosten lassen.", "spanish": " Mas si le hacemos probar Nuestra misericordia, después de haber sufrido alguna aflicción, dirá ciertamente: “Esto es lo que me corresponde; no creo que llegue nunca la Hora. Pero si soy devuelto a mi Señor, ciertamente tendré con Él lo mejor de todo”. Entonces contaremos a los incrédulos todo lo que hicieron, y en verdad les haremos probar un duro castigo.", "urdu": " اور اگر ہم اس کو دکھ پہنچنے کے بعد رحمت کا مزہ چکھائیں تو وہ کہتا ہے یہ تو میرا حق ہی ہے اور مجھے یقین ہے کہ قیامت نہیں آئے گی اور اگر مجھے میرے رب کی طرف لوٹایا بھی گیا تو اس کے پاس میرے لئے (اس دنیا سے) اعلیٰ انعامات موجود ہوں گے اور ہم کافروں کو ضرور ان کے اعمال کے متعلق خبر دیں گے اور ان کو ایک سخت عذاب چکھائیں گے۔"}, {"arabic": " وَ اِذَاۤ اَنۡعَمۡنَا عَلَی الۡاِنۡسَانِ اَعۡرَضَ وَ نَاٰ بِجَانِبِہٖ ۚ وَ اِذَا مَسَّہُ الشَّرُّ فَذُوۡ دُعَآءٍ عَرِیۡضٍ ﴿۵۲﴾", "english": " And when We bestow a favour on man, he goes away, turning aside; but when evil touches him, lo! he starts offering long prayers.", "french": " Et lorsque Nous accordons une faveur à l’homme, il l’ ignore et s’en détourne ; mais lorsque le malheur le touche, voilà qu’il se met à offrir de longues prières.", "german": " Wenn wir dem Menschen Gnade erweisen, dann kehrt er sich ab und geht seitwärts; doch wenn ihn Übel berührt, siehe, dann beginnt er lange, lange Gebete zu sprechen.", "spanish": " Cuando concedemos un favor al hombre, lo ignora y se aparta a un lado. Pero si el mal lo toca, ¡he ahí como se vuelve suplicante de largas plegarias!", "urdu": " اور جب ہم انسان پر انعام کرتے ہیں تو وہ منہ پھیر لیتا ہے اور ہم سے ایک طرف ہو جاتا ہے اور جب اسے کوئی تکلیف پہنچتی ہے تو بڑی لمبی لمبی دعائیں کرتا ہے۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ اِنۡ کَانَ مِنۡ عِنۡدِ اللّٰہِ ثُمَّ کَفَرۡتُمۡ بِہٖ مَنۡ اَضَلُّ مِمَّنۡ ہُوَ فِیۡ شِقَاقٍۭ بَعِیۡدٍ ﴿۵۳﴾", "english": " Say, ‘Tell me: if it is from Allah but you disbelieve in it — who is more astray than one who has drifted away from Allah ?’", "french": " Dis : « Dites-moi : si cela provient d’Allāh et que vous n’y croyez pas – qui est plus égaré que celui qui s’ est empêtré dans une hostilité extrême ? »", "german": " Sprich: \"Besinnt euch: Wenn es von Allah ist und ihr glaubt nicht daran – wer ist irrender als einer, der weit weg ist?\"", "spanish": " Diles: “Decidme: si procede de Al-lah pero no creéis en él...¿hay alguien más extraviado que quien se ha apartado de Al-lah?", "urdu": " تو ان سے کہہ دے مجھے بتاٶ تو سہی اگر یہ (قرآن) اللہ کی طرف سے ہو اور تم اس کا انکار کر دو۔ تو اس شخص سے جو حق سے بہت دور بھاگ جائے کون زیادہ گمراہ ہوگا؟"}, {"arabic": " سَنُرِیۡہِمۡ اٰیٰتِنَا فِی الۡاٰفَاقِ وَ فِیۡۤ اَنۡفُسِہِمۡ حَتّٰی یَتَبَیَّنَ لَہُمۡ اَنَّہُ الۡحَقُّ ؕ اَوَ لَمۡ یَکۡفِ بِرَبِّکَ اَنَّہٗ عَلٰی کُلِّ شَیۡءٍ شَہِیۡدٌ ﴿۵۴﴾", "english": " Soon We will show them Our Signs in all parts of the earth , and among their own people until it becomes manifest to them that it is the truth. Is it not enough that thy Lord is Witness over all things?", "french": " Bientôt Nous leur montrerons Nos Signes qui apparaîtront sur l’horizon et en eux-mêmes, jusqu’à ce qu’il leur devienne évident que c’est la vérité. Ne suffit-il pas que ton Seigneur soit Témoin de toutes choses ?", "german": " Bald werden Wir sie Unsere Zeichen sehen lassen überall auf Erden und an ihnen selbst, bis ihnen deutlich wird, dass es die Wahrheit ist. Genügt es denn nicht, dass dein Herr Zeuge ist über alle Dinge?", "spanish": " Pronto les mostraremos Nuestros signos en el horizonte y entre ellos mismos, hasta que les quede manifiesto que es la verdad. ¿No es suficiente que tu Señor sea testigo sobre todas las cosas?", "urdu": " ہم ان لوگوں کو تمام اطراف عالم میں بھی ضرور اپنے نشان دکھائیں گے اور خود ان کی جانوں (اور خاندانوں) میں بھی۔ یہاں تک کہ یہ (امر) ان کے لئے بالکل ظاہر ہو جائے گا کہ یہ (قرآن) حق ہے کیا تیرے رب کا ہر چیز پر نگران ہونا ان کے لئے کافی نہیں؟"}, {"arabic": " اَلَاۤ اِنَّہُمۡ فِیۡ مِرۡیَۃٍ مِّنۡ لِّقَآءِ رَبِّہِمۡ ؕ اَلَاۤ اِنَّہٗ بِکُلِّ شَیۡءٍ مُّحِیۡطٌ ﴿٪۵۵﴾", "english": " Aye, they are surely in doubt concerning the meeting with their Lord. Aye, He certainly encompasses all things.", "french": " Oui, ils sont sûrement dans le doute au sujet de la rencontre avec leur Seigneur. Ecoutez bien ! En vérité, Il cerne tout.", "german": " Höret! sie sind im Zweifel über die Begegnung mit ihrem Herrn. Siehe, Er umfasst alle Dinge.", "spanish": " Sí, ciertamente tienen dudas sobre la reunión con su Señor. Sí, Él ciertamente abarca todas las cosas.", "urdu": " خبردار! یہ لوگ اپنے رب کی ملاقات کے بارہ میں شبہ میں پڑے ہوئے ہیں کان کھول کر سنو! اللہ ہر چیز پر حاوی (اور اس کے تباہ کرنے پر قادر) ہے۔"}], "Surah": 41}