{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سَبَّحَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ۚ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۲﴾", "english": " Whatever is in the heavens and the earth glorifies Allah; and He is the Mighty, the Wise.", "french": " Tout ce qui est aux cieux et sur la terre glorifie Allāh ; et Il est le Puissant, le Sage.", "german": " Was in den Himmeln und was auf Erden ist, verkündet die Herrlichkeit Allahs, und Er ist der Allmächtige, der Allweise.", "spanish": " Cuanto hay en los cielos y en la tierra glorifica a Al-lah; pues Él es el Poderoso, el Sabio.", "urdu": " آسمانوں میں اور زمین میں جو کچھ ہے وہ خدا کی تسبیح کر رہا ہے‘ اور وہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " لَہٗ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ۚ یُحۡیٖ وَ یُمِیۡتُ ۚ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۳﴾", "english": " His is the kingdom of the heavens and the earth; He gives life and He causes death; and He has power over all things.", "french": " A Lui est le royaume des cieux et de la terre ; Il donne la vie et Il cause la mort ; et Il a le pouvoir de faire tout ce qu’Il veut.", "german": " Sein ist das Königreich der Himmel und der Erde. Er gibt Leben und Tod, und Er vermag alle Dinge zu tun.", "spanish": " Suyo es el reino de los cielos y la tierra; Él da la vida y causa la muerte; y Él tiene poder sobre todas las cosas.", "urdu": " آسمانوں اور زمین کی بادشاہت اسی کی ہے‘ وہ زندہ کرتا ہے‘ اور مارتا بھی ہے اور وہ ہر چیز پر قادر ہے۔"}, {"arabic": " ہُوَ الۡاَوَّلُ وَ الۡاٰخِرُ وَ الظَّاہِرُ وَ الۡبَاطِنُ ۚ وَ ہُوَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۴﴾", "english": " He is the First and the Last, and the Manifest and the Hidden, and He knows all things full well.", "french": " Il est le Premier et le Dernier, et le Manifeste et le Caché, et Il connaît toutes choses très bien.", "german": " Er ist der Erste und der Letzte, der Sichtbare und der Verborgene, und Er ist der Wisser aller Dinge.", "spanish": " Él es el Primero y el Último, el Manifiesto y el Oculto, y Él conoce muy bien todas las cosas.", "urdu": " وہ اول بھی ہے اور آخر بھی۔ اور ظاہر بھی ہے اور باطن بھی۔ اور وہ ہر چیز کو جانتا ہے۔"}, {"arabic": " ہُوَ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ فِیۡ سِتَّۃِ اَیَّامٍ ثُمَّ اسۡتَوٰی عَلَی الۡعَرۡشِ ؕ یَعۡلَمُ مَا یَلِجُ فِی الۡاَرۡضِ وَ مَا یَخۡرُجُ مِنۡہَا وَ مَا یَنۡزِلُ مِنَ السَّمَآءِ وَ مَا یَعۡرُجُ فِیۡہَا ؕ وَ ہُوَ مَعَکُمۡ اَیۡنَ مَا کُنۡتُمۡ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۵﴾", "english": " He it is Who created the heavens and the earth in six periods, then He settled Himself on the Throne. He knows what enters the earth and what comes out of it, and what comes down from heaven and what goes up into it. And He is with you wheresoever you may be. And Allah sees all that you do.", "french": " C’est Lui Qui a créé les cieux et la terre en six périodes, ensuite Il S’est établi sur le Trône. Il sait ce qui entre dans la terre, et ce qui en sort et ce qui descend du ciel, et ce qui y monte. Et Il est avec vous où que vous soyez. Et Allāh voit bien tout ce que vous faites.", "german": " Er ist es, Der die Himmel und die Erde erschuf in sechs Zeiten, dann setzte Er Sich auf den Thron. Er weiß, was in die Erde eingeht und was aus ihr hervorkommt, was vom Himmel niederkommt und was zu ihm aufsteigt. Und Er ist mit euch, wo immer ihr sein mögt. Und Allah sieht alles, was ihr tut.", "spanish": " Él es Quien creó los cielos y la tierra en seis períodos, y después se asentó en el Trono. Conoce lo que entra en la tierra y lo que sale de ella, así como lo que baja del cielo y sube a él. Él está con vosotros dondequiera que estéis, pues Al-lah ve todo lo que hacéis.", "urdu": " اسی نے آسمانوں اور زمین کو چھ وقتوں میں پیدا کیا ہے‘ پھر عرش پر مضبوطی سے قائم ہو گیا۔ وہ اسے بھی جانتا ہے جو زمین میں داخل ہوتا ہے۔ اور اسے بھی جو اس سے نکلتا ہے اور اسے بھی جو آسمان سے اترتا ہے اور اسے بھی جو اس کی طرف چڑھتا ہے اور تم جہاں بھی جاٶ وہ تمہارے ساتھ رہتا ہے اور اللہ تمہارے اعمال سے خوب واقف ہے۔"}, {"arabic": " لَہٗ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ اِلَی اللّٰہِ تُرۡجَعُ الۡاُمُوۡرُ ﴿۶﴾", "english": " His is the kingdom of the heavens and the earth; and to Allah are all affairs referred.", "french": " A Lui est le royaume des cieux et de la terre, et c’est à Allāh que seront ramenées toutes les affaires pour Sa décision .", "german": " Sein ist das Königreich der Himmel und der Erde; und zu Allah werden alle Dinge zurückgebracht.", "spanish": " Suyo es el reino de los cielos y la tierra; y a Al-lah se someten todos los asuntos.", "urdu": " (اور) آسمانوں کی بادشاہت بھی اسی کی ہے اور زمین کی بھی (اسی کی) اور اسی کی طرف تمام امور (فیصلہ کے لئے) لوٹائے جائیں گے۔"}, {"arabic": " یُوۡلِجُ الَّیۡلَ فِی النَّہَارِ وَ یُوۡلِجُ النَّہَارَ فِی الَّیۡلِ ؕ وَ ہُوَ عَلِیۡمٌۢ بِذَاتِ الصُّدُوۡرِ ﴿۷﴾", "english": " He causes the night to pass into the day and causes the day to pass into the night; and He knows full well all that is in the breasts.", "french": " Il fait pénétrer la nuit dans le jour, et Il fait pénétrer le jour dans la nuit ; et Il connaît très bien tout ce qui est dans les poitrines.", "german": " Er lässt die Nacht eintreten in den Tag und den Tag eintreten in die Nacht; und Er ist der Kenner all dessen, was in den Herzen ist.", "spanish": " Él hace que la noche se convierta en el día y que el día se convierta en la noche; y conoce muy bien todo lo que hay en los corazones.", "urdu": " وہ رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے۔ اور وہ دلوں کی باتوں کو خوب جانتا ہے۔"}, {"arabic": " اٰمِنُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ وَ اَنۡفِقُوۡا مِمَّا جَعَلَکُمۡ مُّسۡتَخۡلَفِیۡنَ فِیۡہِ ؕ فَالَّذِیۡنَ اٰمَنُوۡا مِنۡکُمۡ وَ اَنۡفَقُوۡا لَہُمۡ اَجۡرٌ کَبِیۡرٌ ﴿۸﴾", "english": " Believe in Allah and His Messenger, and spend in the way of Allah out of that to which He has made you heirs. And those of you who believe and spend will have a great reward.", "french": " Croyez en Allāh et en Son Messager, et dépensez dans la voie d’Allāh de ce dont Il vous a fait héritiers. Et ceux d’entre vous qui croient et qui dépensent, auront une grande récompense.", "german": " Glaubet an Allah und Seinen Gesandten und spendet von dem, wovon Er euch zu Erben gemacht hat. Und jenen unter euch, die glauben und spenden, wird großer Lohn.", "spanish": " Creed en Al-lah y en Su Mensajero, y emplead en la causa de Al-lah de aquello de lo que os hizo herederos. Pues aquellos de vosotros que crean y gasten, obtendrán una gran recompensa.", "urdu": " اے لوگو! اللہ اور اس کے رسول پر ایمان لاٶ‘ اور جن (جائیدادوں) کا (پہلی قوموں کے بعد) تم کو مالک بنایا ہے ان میں سے خرچ کرو۔ اور تم میں سے جو مومن ہیں اور خدا کی راہ میں خرچ کرتے رہتے ہیں ان کو بہت بڑا اجر ملے گا۔"}, {"arabic": " وَ مَا لَکُمۡ لَا تُؤۡمِنُوۡنَ بِاللّٰہِ ۚ وَ الرَّسُوۡلُ یَدۡعُوۡکُمۡ لِتُؤۡمِنُوۡا بِرَبِّکُمۡ وَ قَدۡ اَخَذَ مِیۡثَاقَکُمۡ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۹﴾", "english": " Why is it that you believe not in Allah, while the Messenger calls you to believe in your Lord, and He has already taken a covenant from you, if indeed you are believers?", "french": " Qu’avez-vous que vous ne croyez pas en Allāh, alors que le Messager vous appelle à croire en votre Seigneur, et qu’Il a déjà reçu un engagement de vous, si vraiment vous êtes croyants.", "german": " Was ist euch, dass ihr nicht an Allah glaubt, obwohl der Gesandte euch aufruft, an euren Herrn zu glauben, und Er hat bereits von euch ein Versprechen abgenommen, wenn ihr Gläubige seid?", "spanish": " ¿Por qué no creéis en Al-lah cuando el Mensajero os convoca a que creáis en vuestro Señor y ya ha aceptado vuestro pacto, si es que de verdad sois creyentes?", "urdu": " اور تمہیں کیا ہو گیا ہے کہ تم اللہ (اور رسول) پر ایمان نہیں لاتے اور (اللہ کا) رسول تم کو صرف اس لئے بلاتا ہے کہ تم اپنے رب پر ایمان لاٶ (اور) اگر تم مومن ہو تو خدا تم سے ایک وعدہ لے چکا ہے۔"}, {"arabic": " ہُوَ الَّذِیۡ یُنَزِّلُ عَلٰی عَبۡدِہٖۤ اٰیٰتٍۭ بَیِّنٰتٍ لِّیُخۡرِجَکُمۡ مِّنَ الظُّلُمٰتِ اِلَی النُّوۡرِ ؕ وَ اِنَّ اللّٰہَ بِکُمۡ لَرَءُوۡفٌ رَّحِیۡمٌ ﴿۱۰﴾", "english": " He it is Who sends down clear Signs to His servant, that He may bring you out of every kind of darkness into the light. And verily, Allah is Compassionate and Merciful to you.", "french": " C’est Lui Qui révèle des Signes manifestes à Son serviteur, pour qu’Il vous fasse sortir de toutes sortes de ténèbres pour vous amener vers la lumière. Et en vérité, Allāh est Compatissant et Miséricordieux envers vous.", "german": " Er ist es, Der deutliche Zeichen hinabsendet auf Seinen Diener, damit Er euch aus den Finsternissen ins Licht führe. Und fürwahr, Allah ist gegen euch gütig, barmherzig.", "spanish": " Él es Quien envía Signos evidentes a Su siervo, para que os saque de toda clase de tinieblas y os lleve a la luz; en verdad, Al-lah es Compasivo y Misericordioso con vosotros.", "urdu": " وہ (اللہ) ہی ہے جو اپنے بندے پر کھلے کھلے نشان نازل کرتا ہے جس کا نتیجہ یہ ہوتا ہے کہ وہ ان نشانات کے ذریعہ سے تم کو اندھیروں میں سے نکال کر نور کی طرف لے جاتا ہے اور اللہ یقیناً بہت شفقت سے کام لینے والا (اور) باربار کرم کرنے والا ہے۔"}, {"arabic": " وَ مَا لَکُمۡ اَلَّا تُنۡفِقُوۡا فِیۡ سَبِیۡلِ اللّٰہِ وَ لِلّٰہِ مِیۡرَاثُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ لَا یَسۡتَوِیۡ مِنۡکُمۡ مَّنۡ اَنۡفَقَ مِنۡ قَبۡلِ الۡفَتۡحِ وَ قٰتَلَ ؕ اُولٰٓئِکَ اَعۡظَمُ دَرَجَۃً مِّنَ الَّذِیۡنَ اَنۡفَقُوۡا مِنۡۢ بَعۡدُ وَ قٰتَلُوۡا ؕ وَ کُلًّا وَّعَدَ اللّٰہُ الۡحُسۡنٰی ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ خَبِیۡرٌ ﴿٪۱۱﴾", "english": " And why is it that you spend not in the way of Allah, while to Allah belongs the heritage of the heavens and the earth? Those of you who spent and fought before the Victory are not equal to those who did so later . They are greater in rank than those who spent and fought afterwards. And to all has Allah promised good. And Allah is Well-Aware of what you do.", "french": " Qu’avez-vous que vous ne dépensez pas dans la voie d’Allāh alors que c’est à Allāh qu’appartient l’héritage des cieux et de la terre ? Ceux d’entre vous qui ont dépensé et qui ont combattu avant la Victoire ne sont pas égaux. Ceux-là sont supérieurs en rang à ceux qui ont dépensé et qui ont combattu après. Et Allāh a promis à tous ce qui est meilleur comme récompense . Et Allāh est Très-Conscient de ce que vous faites.", "german": " Was ist euch, dass ihr nicht spendet in Allahs Sache, obwohl die Erbschaft der Himmel und der Erde Allah gehört? Die unter euch, die spendeten und kämpften vor dem Sieg, sind nicht gleich. Sie sind höher an Rang als jene, die erst nachher spendeten und kämpften. Allen aber verhieß Allah Gutes. Und Allah ist wohl kundig dessen, was ihr tut.", "spanish": " ¿Por qué no gastáis en la causa de Al-lah, si a Al-lah pertenece la herencia de los cielos y la tierra? Aquellos de vosotros que gastaron y ucharon antes de la Victoria no son iguales a los que lo hicieron más tarde. Ocupan una posición más alta que los que gastaron y lucharon después. Mas a todos Al-lah ha prometido bienes. Pues Al-lah conoce muy bien lo que hacéis.", "urdu": " اور تمہیں کیا ہو گیا ہے کہ تم اللہ کے راستہ میں خرچ نہیں کرتے حالانکہ آسمان اور زمین کی میراث اللہ ہی کی ہے اے مومنو! فتح سے پہلے جس نے خدا کی راہ میں خرچ کیا اور اس کی راہ میں جنگ کی وہ اس کے برابر نہیں ہو سکتا جس نے فتح کے بعد خرچ کیا اور فتح کے بعد جنگ کی۔ فتح سے پہلے خرچ کرنے والے اور جنگ کرنے والے درجہ میں بہت زیادہ ہیں اور اللہ نے دونوں قسم کے لوگوں سے نیکی کا وعدہ کیا ہے۔ اور اللہ تمہارے اعمال سے خوب اچھی طرح واقف ہے۔"}, {"arabic": " مَنۡ ذَا الَّذِیۡ یُقۡرِضُ اللّٰہَ قَرۡضًا حَسَنًا فَیُضٰعِفَہٗ لَہٗ وَ لَہٗۤ اَجۡرٌ کَرِیۡمٌ ﴿ۚ۱۲﴾", "english": " Who is he that will lend to Allah a goodly loan? So He will increase it manifold for him, and he will have a generous reward.", "french": " Quel est celui qui fera un bon prêt à Allāh ? Alors Il le multipliera pour lui et il aura une récompense généreuse.", "german": " Wer ist es, der Allah ein stattliches Darlehen geben will? Er wird es ihm um ein Vielfaches mehren, und ihm wird ein großzügiger Lohn.", "spanish": " ¿Quién hará a Al-lah un préstamo generoso? Él se lo aumentará muchas veces y tendrá una recompensa espléndida.", "urdu": " کیا کوئی ہے جو اللہ کو (اپنے مال کا) اچھا ٹکڑہ کاٹ کر دے تا کہ وہ اسے اس کے لئے بڑھائے۔ اور اس کے لئے ایک معزز بدلہ مقرر ہے۔"}, {"arabic": " یَوۡمَ تَرَی الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ یَسۡعٰی نُوۡرُہُمۡ بَیۡنَ اَیۡدِیۡہِمۡ وَ بِاَیۡمَانِہِمۡ بُشۡرٰٮکُمُ الۡیَوۡمَ جَنّٰتٌ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ ذٰلِکَ ہُوَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿ۚ۱۳﴾", "english": " And think of the day when thou wilt see the believing men and the believing women, their light running before them and on their right hands, and it will be said to them , ‘Glad tidings for you this day! Gardens through which streams flow, wherein you will abide. That is the supreme triumph.’", "french": " Pense au jour où tu verras les croyants et les croyantes, leur lumière jaillissant devant eux et à leur droite, et il leur sera dit : « Bonne nouvelle pour vous aujourd’hui ! Des jardins sous lesquels coulent des rivières, et dans lesquels vous demeurerez éternellement. C’est là le triomphe suprême. »", "german": " Und (gedenke) des Tages, da du die gläubigen Männer und die gläubigen Frauen sehen wirst, indes (die Strahlen) ihres Lichts vor ihnen und zu ihrer Rechten hervorbrechen: \"Frohe Botschaft euch heute! – Gärten, durch die Ströme fließen, darin ihr weilen werdet. Das ist die höchste Glückseligkeit.\"", "spanish": " Piensa en el día en que verás a los hombres creyentes y a las mujeres creyentes con su luz corriendo ante ellos y a su mano derecha, y se les dirá: “¡Hay buenas noticias en este día para vosotros! Unos Jardines por los que corren ríos, en los que habitaréis. Ése es el triunfo supremo”.", "urdu": " جس دن تو مومن مردوں اور مومن عورتوں کو دیکھے گا کہ ان کا نور ان کے سامنے بھی اور ان کے دائیں طرف بھی بھاگتا جائے گا (اور خدا اور اس کے فرشتے کہیں گے) آج تمہیں قسم قسم کے باغوں کی خوش خبری دی جاتی ہے (ایسے باغ) جن کے نیچے نہریں بہتی ہوں گی یہ (بشارت پانے والے) لوگ ان جنتوں میں رہتے چلے جائیں گے اور یہ بہت بڑی کامیابی ہے۔"}, {"arabic": " یَوۡمَ یَقُوۡلُ الۡمُنٰفِقُوۡنَ وَ الۡمُنٰفِقٰتُ لِلَّذِیۡنَ اٰمَنُوا انۡظُرُوۡنَا نَقۡتَبِسۡ مِنۡ نُّوۡرِکُمۡ ۚ قِیۡلَ ارۡجِعُوۡا وَرَآءَکُمۡ فَالۡتَمِسُوۡا نُوۡرًا ؕ فَضُرِبَ بَیۡنَہُمۡ بِسُوۡرٍ لَّہٗ بَابٌ ؕ بَاطِنُہٗ فِیۡہِ الرَّحۡمَۃُ وَ ظَاہِرُہٗ مِنۡ قِبَلِہِ الۡعَذَابُ ﴿ؕ۱۴﴾", "english": " On the day when the hypocritical men and the hypocritical women will say to those who believe, ‘Wait a while for us that we may take light from your light,’ it will be said to them , ‘Go ye back if you can , and seek for light.’ Then there will be set up between them a wall with a door in it. The inside of it will be all mercy and in front, outside it, will be torment.", "french": " Le jour où les hommes hypocrites et les femmes hypocrites diront à ceux qui croient, « Jetez un regard sur nous pour que nous prenions un peu de votre lumière, » il leur sera dit : « Retournez en arrière si vous le pouvez et cherchez de la lumière. » Ensuite il sera élevé entre eux une muraille avec une porte dedans. L’intérieur en sera toute miséricorde, et par devant à l’extérieur, sera le châtiment.", "german": " Am Tage, wenn die Heuchler und die Heuchlerinnen zu den Gläubigen sagen werden: \"Wartet auf uns! Wir wollen ein wenig von eurem Licht borgen\", da wird (zu ihnen) gesprochen werden: \"Kehret zurück und suchet (dort) Licht.\" Dann wird zwischen ihnen eine Mauer errichtet werden mit einem Tor darin. Ihre Innenseite wird Barmherzigkeit sein und ihre Außenseite Strafe.", "spanish": " En el día en que los hombres hipócritas y las mujeres hipócritas dirán a los creyentes: “Favorecednos para que nos alumbremos con vuestra luz”; se les dirá: “Volved si podéis , y buscad la luz”. Entonces se levantará ante ellos una muralla provista de una puerta. En su inte­rior estará toda la misericordia, y en frente, al exterior, el suplicio.", "urdu": " جس دن منافق مرد اور منافق عورتیں مومنوں سے کہیں گے کہ ذرا ہمارا بھی انتظار کرو ہم تمہارے نور سے روشنی حاصل کر لیں‘ اس وقت ان سے کہا جائے گا اپنے پیچھے کی طرف لوٹ جاٶ اور وہاں جاکر نور تلاش کرو۔ پھر (اللہ کی طرف سے) ان کے اور مومنوں کے درمیان ایک دیوار حائل کر دی جائے گی‘ جس میں ایک دروازہ ہوگا اس کے اندر رحمت کا نظارہ ہوگا اور اس کے باہر کی طرف سامنے عذاب نظر آرہا ہوگا۔"}, {"arabic": " یُنَادُوۡنَہُمۡ اَلَمۡ نَکُنۡ مَّعَکُمۡ ؕ قَالُوۡا بَلٰی وَ لٰکِنَّکُمۡ فَتَنۡتُمۡ اَنۡفُسَکُمۡ وَ تَرَبَّصۡتُمۡ وَ ارۡتَبۡتُمۡ وَ غَرَّتۡکُمُ الۡاَمَانِیُّ حَتّٰی جَآءَ اَمۡرُ اللّٰہِ وَ غَرَّکُمۡ بِاللّٰہِ الۡغَرُوۡرُ ﴿۱۵﴾", "english": " They will call out to them, saying , ‘Were we not with you?’ They will answer, ‘Yea, but you led yourselves into temptation and you hesitated and doubted and your vain desires deceived you till the decree of Allah came to pass. And the Deceiver deceived you in respect of Allah.", "french": " Ils leur crieront, « N’étions-nous pas avec vous ? » Ils répondront : « Si ! mais vous vous êtes laissés aller à la tentation et vous avez hésité et douté, et vos vains désirs vous ont trompés jusqu’à ce que vînt le décret d’Allāh. Et le Trompeur vous a trompés à l’égard d’Allāh.", "german": " Sie werden jenen (Gläubigen) zurufen: \"Waren wir nicht mit euch?\" Jene werden antworten: \"Doch, aber ihr versuchtet euch selber und wartetet und zweifeltet, und die eitlen Wünsche betörten euch, bis Allahs Befehl kam. Und der Betrüger belog euch über Allah.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=57:15&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=57:15&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic16\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic16\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/57:16' style='text-decoration:underline'>57:16</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(16)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control16\"></i></button> <audio id=\"player16\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَالۡیَوۡمَ لَا یُؤۡخَذُ مِنۡکُمۡ فِدۡیَۃٌ وَّ لَا مِنَ الَّذِیۡنَ کَفَرُوۡا ؕ مَاۡوٰٮکُمُ النَّارُ ؕ ہِیَ مَوۡلٰٮکُمۡ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۱۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘So this day no ransom shall be accepted from you, nor from those who disbelieved. Your final abode is the Fire; that is your friend; and a very evil destination it is.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘So this day no ransom shall be accepted from you, nor from those who disbelieved. Your final abode is the Fire; that is your comrade;<sup class='ref'>[<a class='ref' data-id='ref_57_16_2995' href='#'>2995</a>]</sup> and an evil destination it is.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_57_16_2995'>2995</span></div> <div><a name='2995'></a><div class='reference' data-id='ref_57_16_2995' style='display:none'> <p><b>2995.</b> The words, 'that is your comrade,' seem to have been used ironically. Or, they may mean that only the fire of Hell will purify them of the impurities and dross of sins committed by disbelievers in this life and will make them fit for spiritual progress and thus will be a \"friend\" to them. (<a href='javascript:void(0)' data-id='ref_57_16_2995' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس آج تم سے کوئی فدیہ نہیں لیا جائے گا اور نہ ہی ان لوگوں سے جنہوں نے کفر کیا۔ تمہارا ٹھکانا آگ ہے۔ یہ ہے تمہاری دوست اور کیا ہی برا ٹھکانا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پس آج کے دن (اے منافقو)! نہ تم سے اور نہ کافروں سے کوئی فدیہ قبول کیا جائے گا۔ تم سب کا ٹھکانا دوزخ ہے۔ وہی تمہاری دائمی تعلق والی چیز ہے اور وہ برا ٹھکانا ہے ۔</span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Alors aujourd’hui aucune rançon ne sera acceptée de vous, ni de ceux qui n’ont pas cru. Votre demeure <em>finale</em> est le Feu ; c’est là votre ami ; et quelle mauvaise destination ! »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Por tanto, en este día no se aceptará rescate alguno de vosotros ni de los incrédulos. Vuestra morada final será el Fuego; ése es vuestro amigo; ¡qué mal destino es!”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">So soll heute kein Lösegeld von euch angenommen werden, noch von den Ungläubigen. Euer Aufenthalt ist das Feuer; das ist euer Hort. Und eine schlimme Bestimmung ist es!\"", "spanish": " Ellos los invocarán, diciendo: “¿Acaso no estábamos con vosotros?”. Responderán: “Sí, pero os dejasteis llevar por la tentación, os demorasteis y dudasteis y vuestros vanos deseos os engañaron hasta que se cumplió el designio de Al-lah. Y el Engañador os confundió respecto a Al-lah.", "urdu": " وہ (منافق) مومنوں سے پکار کر کہیں گے‘ کیا ہم تمہارے ساتھ نہ تھے؟ وہ (یعنی مومن) جواب دیں گے‘ ہاں ہاں۔ لیکن تم نے اپنی جانوں کو خود عذاب میں ڈالا۔ اور تم (ہماری تباہی کا) انتظار کرتے رہے اور شکوک و شبہات سے کام لیتے رہے اور تمہاری آرزوئیں تمہیں اس وقت تک دھوکہ دیتی رہیں کہ اللہ کا فیصلہ آگیا اوراللہ کے (تمام کاموں کے) متعلق شیطان تمہیں دھوکہ دیتا رہا۔"}, {"arabic": " اَلَمۡ یَاۡنِ لِلَّذِیۡنَ اٰمَنُوۡۤا اَنۡ تَخۡشَعَ قُلُوۡبُہُمۡ لِذِکۡرِ اللّٰہِ وَ مَا نَزَلَ مِنَ الۡحَقِّ ۙ وَ لَا یَکُوۡنُوۡا کَالَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ مِنۡ قَبۡلُ فَطَالَ عَلَیۡہِمُ الۡاَمَدُ فَقَسَتۡ قُلُوۡبُہُمۡ ؕ وَ کَثِیۡرٌ مِّنۡہُمۡ فٰسِقُوۡنَ ﴿۱۷﴾", "english": " Has not the time arrived for those who believe that their hearts should feel humbled at the remembrance of Allah and at the truth which has come down to them , and that they should not become like those who were given the Book before them and the term was prolonged for them, but their hearts were hardened, and many of them are wicked?", "french": " Le moment n’est-il pas venu pour ceux qui croient, que leur cœur s’humilie au souvenir d’Allāh et à la vérité qui est descendue, et qu’ils ne deviennent pas pareils à ceux à qui le Livre avait été donné avant eux , et pour qui le terme avait été prolongé, mais leur cœur s’était endurci, et beaucoup d’entre eux devinrent des rebelles ?", "german": " Ist nicht für die Gläubigen die Zeit gekommen, dass ihre Herzen sich demütigen vor der Ermahnung Allahs und vor der Wahrheit, die herabkam, und dass sie nicht würden wie jene, denen zuvor die Schrift gegeben und deren Frist verlängert ward, doch ihre Herzen waren verstockt und viele von ihnen wurden ungehorsam?", "spanish": " ¿Acaso no ha llegado el momento para los creyentes de que sus corazones se sientan humildes ante el recuerdo de Al-lah y ante la verdad que les ha sido revelada, y de que no se vuelvan como aquellos a los que se entregó anteriormente el Libro y cuyo período fue prolongado, pero cuyos corazones quedaron endurecidos, siendo muchos de ellos malvados?", "urdu": " اب ہم مومنوں سے کہتے ہیں کہ کیا اب تک ان کے دل اللہ کے ذکر کے لئے اور اس کلام کے لئے جو حق (وحکمت) کے ساتھ اترا ہے جھکتے نہیں؟ اور (مومنوں کو) چاہیے کہ وہ ان لوگوں کی طرح نہ بنیں جن کو ان سے پہلے کتاب دی گئی تھی۔ لیکن (خدا کے فضل کے نزول کا) زمانہ ان کے لئے لمبا ہو گیا۔ جس کے نتیجہ میں ان کے دل سخت ہو گئے اور ان میں سے اکثر فاسق ہو گئے تھے۔"}, {"arabic": " اِعۡلَمُوۡۤا اَنَّ اللّٰہَ یُحۡیِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا ؕ قَدۡ بَیَّنَّا لَکُمُ الۡاٰیٰتِ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿۱۸﴾", "english": " Know that Allah is now quickening the earth after its death. We have made the Signs manifest to you, that you may understand.", "french": " Sachez donc qu’Allāh ranime la terre après sa mort. Nous avons rendu clairs les Signes pour vous, afin que vous compreniez.", "german": " Wisset, dass Allah die Erde belebt nach ihrem Tode. Wir haben euch die Zeichen klar gemacht, auf dass ihr begreifet.", "spanish": " Sabed que Al-lah da la vida a la tierra después de su muerte. Hemos hecho los Signos evidentes para vosotros, a fin de que entendáis.", "urdu": " یاد رکھو کہ اللہ زمین کو اس کی موت کے بعد زندہ کرتا ہے۔ ہم نے تمہارے لئے اپنے نشانات کھول کھول کر بیان کر دئیے ہیں تا کہ تم عقل سے کام لو۔"}, {"arabic": " اِنَّ الۡمُصَّدِّقِیۡنَ وَ الۡمُصَّدِّقٰتِ وَ اَقۡرَضُوا اللّٰہَ قَرۡضًا حَسَنًا یُّضٰعَفُ لَہُمۡ وَ لَہُمۡ اَجۡرٌ کَرِیۡمٌ ﴿۱۹﴾", "english": " As to the men that give alms, and the women that give alms, and those who lend to Allah a goodly loan — it will be increased manifold for them, and theirs will also be an honourable reward —", "french": " Quant aux hommes qui font l’aumône, et aux femmes qui font l’aumône, et ceux qui font un bon prêt à Allāh – il sera multiplié pour eux, et il y aura aussi pour eux une récompense honorable –", "german": " Fürwahr, die mildtätigen Männer und die mildtätigen Frauen und jene, die Allah ein stattliches Darlehen geben – es wird ihnen um ein Vielfaches gemehrt werden, und ihr Lohn wird ein würdiger sein.", "spanish": " En cuanto a los hombres que dan limosna, las mujeres que an limosna y los que entregan a Al-lah un préstamo generoso sepan que se les aumentará muchas veces y también será suya una magnífica recompensa,", "urdu": " یقیناً صدقہ دینے والے مرد اور صدقہ دینے والی عورتیں اور وہ لوگ جنہوں نے اللہ کے لئے اپنے مال میں سے ایک اچھا حصہ کاٹ کر الگ کر دیا ہے‘ ان کے مالوں کو ان کی خاطر بڑھایا جائے گا اور ان کو معزز بدلہ دیا جائے گا۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا بِاللّٰہِ وَ رُسُلِہٖۤ اُولٰٓئِکَ ہُمُ الصِّدِّیۡقُوۡنَ ٭ۖ وَ الشُّہَدَآءُ عِنۡدَ رَبِّہِمۡ ؕ لَہُمۡ اَجۡرُہُمۡ وَ نُوۡرُہُمۡ ؕ وَ الَّذِیۡنَ کَفَرُوۡا وَ کَذَّبُوۡا بِاٰیٰتِنَاۤ اُولٰٓئِکَ اَصۡحٰبُ الۡجَحِیۡمِ ﴿٪۲۰﴾", "english": " And those who believe in Allah and His Messengers and they are the Truthful and the Witnesses in the sight of their Lord, they will have their reward and their light. But as for those who disbelieve and reject Our Signs, these are the inmates of Hell.", "french": " Et ceux qui croient en Allāh et en Ses Messagers, ils sont les Véridiques et les Témoins de la vérité aux yeux de leur Seigneur ; ils auront leur récompense et leur lumière. Mais quant à ceux qui refusent de croire, et qui rejettent Nos Signes, ceux-là sont les habitants de l’Enfer.", "german": " Und die an Allah und Seine Gesandten glauben, das sind die Wahrhaftigen und die Blutzeugen vor ihrem Herrn; sie werden ihren Lohn und ihr Licht empfangen. Die aber ungläubig sind und Unsere Zeichen leugnen, das sind die Insassen der Hölle.", "spanish": " Y quienes crean en Al-lah y en Sus Mensajeros, y sean los justos y los Testigos a los ojos de su Señor, tendrán su recompensa y su luz. Mas aquellos que no crean y rechacen Nuestros Signos, serán los moradores del Infierno.", "urdu": " اور جو اللہ پر اور اس کے رسولوں پر ایمان لائے وہی اپنے رب کے نزدیک صدیق اور شہداء کا درجہ پانے والے ہیں ان کو ان کا پورا پورا اجر ملے گا اور اسی طرح ان کا نور ان کو ملے گا۔ اور وہ لوگ جنہوں نے کفر کیا۔ اور ہماری آیتوں کو جھٹلایا‘ وہ دوزخی ہونگے۔"}, {"arabic": " اِعۡلَمُوۡۤا اَنَّمَا الۡحَیٰوۃُ الدُّنۡیَا لَعِبٌ وَّ لَہۡوٌ وَّ زِیۡنَۃٌ وَّ تَفَاخُرٌۢ بَیۡنَکُمۡ وَ تَکَاثُرٌ فِی الۡاَمۡوَالِ وَ الۡاَوۡلَادِ ؕ کَمَثَلِ غَیۡثٍ اَعۡجَبَ الۡکُفَّارَ نَبَاتُہٗ ثُمَّ یَہِیۡجُ فَتَرٰٮہُ مُصۡفَرًّا ثُمَّ یَکُوۡنُ حُطَامًا ؕ وَ فِی الۡاٰخِرَۃِ عَذَابٌ شَدِیۡدٌ ۙ وَّ مَغۡفِرَۃٌ مِّنَ اللّٰہِ وَ رِضۡوَانٌ ؕ وَ مَا الۡحَیٰوۃُ الدُّنۡیَاۤ اِلَّا مَتَاعُ الۡغُرُوۡرِ ﴿۲۱﴾", "english": " Know that the life of this world is only a sport and a pastime, and an adornment, and a source of boasting among yourselves, and of rivalry in multiplying riches and children. This life is like the rain the vegetation produced whereby rejoices the tillers. Then it dries up and thou seest it turn yellow; then it becomes broken pieces of straw . And in the Hereafter there is severe punishment, and also forgiveness from Allah, and His pleasure. And the life of this world is nothing but temporary enjoyment of deceitful things.", "french": " Sachez donc que la vie de ce monde n’est qu’un jeu et un amusement, et un ornement, et une source de vantardise entre vous-mêmes, et de rivalité à multiplier richesses et enfants. Cette vie est pareille à de la pluie qui produit de la végétation qui fait réjouir les cultivateurs. Ensuite elle se dessèche, et tu la vois jaunir ; puis elle devient des particules de paille brisée. Et dans l’au-delà il y a un châtiment rigoureux, et aussi le pardon de la part d’Allāh, et Son plaisir. Et la vie de ce monde n’est qu’une jouissance temporaire trompeuse.", "german": " Wisset, dass das Leben in dieser Welt nur ein Spiel und ein Tand ist und ein Gepränge und Geprahle unter euch, und ein Wettrennen um Mehrung an Gut und Kindern. Es gleicht dem Regen (der Pflanzen hervorbringt), deren Wachstum den Bebauer erfreut. Dann verdorren sie, und du siehst sie vergilben; dann zerbröckeln sie in Staub. Und im Jenseits ist strenge Strafe und Vergebung und Wohlgefallen Allahs. Und das Leben in dieser Welt ist nur eine Sache der Täuschung.", "spanish": " Sabed que la vista de este mundo no es más que un juego y un pasatiempo, un ornato, una fuente de jactancia entre vosotros de rivalidad en la multiplicación de la riqueza y los hijos. Esta vida es como la lluvia: la vegetación que produce regocija a los labradores. Pero después se seca y la ves ponerse amarilla. Entonces se convierte en trozos rotos de paja. Mas en el Más Allá hay un severo castigo y también el perdón de Al-lah y Su agrado. Pues la vida de este mundo no es más que un gozo temporal engañoso de cosas ilusorias.", "urdu": " اے لوگو! جان لو کہ دنیا کی زندگی محض ایک کھیل ہے اور دل بہلاوا ہے اور زینت حاصل کرنے اور آپس میں فخر کرنے اور ایک دوسرے پر مال اور اولاد میں بڑائی جتانے کا ذریعہ ہے۔ اس کی حالت بادل سے پیدا ہونے والی کھیتی کی سی ہے جس کا اگنا زمیندار کو بہت پسند آتا ہے اور وہ خوب لہلہاتی ہے مگر آخر تو اس کو زرد حالت میں دیکھتا ہے پھر (اس کے بعد) وہ گلا ہوا چورا ہو جاتی ہے اور آخرت میں (ایسے دنیاداروں کے لئے) سخت عذاب مقرر ہے اور بعض کے لئے اللہ کی طرف سے مغفرت اور رضاء الٰہی مقرر ہے اور ورلی زندگی صرف ایک دھوکے کا فائدہ ہے۔"}, {"arabic": " سَابِقُوۡۤا اِلٰی مَغۡفِرَۃٍ مِّنۡ رَّبِّکُمۡ وَ جَنَّۃٍ عَرۡضُہَا کَعَرۡضِ السَّمَآءِ وَ الۡاَرۡضِ ۙ اُعِدَّتۡ لِلَّذِیۡنَ اٰمَنُوۡا بِاللّٰہِ وَ رُسُلِہٖ ؕ ذٰلِکَ فَضۡلُ اللّٰہِ یُؤۡتِیۡہِ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿۲۲﴾", "english": " Vie with one another in seeking forgiveness from your Lord and for a Garden the value whereof is equal to the value of the heaven and the earth; it has been prepared for those who believe in Allah and His Messenger. That is Allah’s grace; He bestows it upon whomsoever He pleases, and Allah is the Lord of immense grace.", "french": " Hâtez-vous à qui mieux mieux vers un pardon de votre Seigneur et un Jardin dont l’étendue équivaut à celle du ciel et de la terre et qui a été préparé pour ceux qui croient en Allāh et en Ses Messagers. C’est là la grâce d’Allāh ; Il l’accorde à qui Il veut, et Allāh est le Seigneur de la grâce immense.", "german": " Wetteifert denn miteinander um die Vergebung eures Herrn und den Garten, dessen Wert gleich dem Werte des Himmels und der Erde ist, bereitet denen, die an Allah und Seine Gesandten glauben. Das ist Allahs Huld; Er gewährt sie, wem Er will. Und Allah ist der Eigner großer Huld.", "spanish": " Rivalizad mutuamente en busca del perdón de vuestro Señor y de un paraíso cuya envergadura es igual a la extensión del cielo y de la tierra; ha sido preparado para quienes creen en Al-lah y en Su Mensajero. Ésa es la gracia de Al-lah; la concede a quien Le agrada, pues Al-lah es el Señor de la gracia inmensa.", "urdu": " (اے لوگو)! تم اپنے رب کی طرف سے آنے والی مغفرت اور ایسی جنت کی طرف تیزی سے بڑھو جس کی قیمت تمام آسمان اور زمین کی قیمت کے برابر ہے اور جو اللہ اور اس کے رسول پر ایمان لانے والوں کے لئے تجویز کی گئی ہے۔ یہ اللہ کا فضل ہے وہ جس کو پسند کرتا ہے دیتا ہے اور اللہ بڑے فضل والا ہے۔"}, {"arabic": " مَاۤ اَصَابَ مِنۡ مُّصِیۡبَۃٍ فِی الۡاَرۡضِ وَ لَا فِیۡۤ اَنۡفُسِکُمۡ اِلَّا فِیۡ کِتٰبٍ مِّنۡ قَبۡلِ اَنۡ نَّبۡرَاَہَا ؕ اِنَّ ذٰلِکَ عَلَی اللّٰہِ یَسِیۡرٌ ﴿ۚۖ۲۳﴾", "english": " There befalls not any calamity either in the earth or in your own persons, but it is recorded in a Book before We bring it into being — surely, that is easy for Allah —", "french": " Il ne survient aucun malheur ni sur la terre, ni en vos propres personnes, qui ne soit inscrit dans un Livre avant que Nous l’amenions en existence - assurément, cela est facile pour Allāh -", "german": " Es geschieht kein Unheil auf Erden oder an euch, das nicht in einem Buch wäre, bevor Wir es ins Dasein rufen – fürwahr, das ist Allah ein leichtes –,", "spanish": " No sucede desgracia alguna ni en la tierra ni en vuestras propias personas que no esté registrada en un Libro antes de que la originemos -en verdad, eso es fácil para Al-lah-.", "urdu": " زمین میں کوئی مصیبت نہیں آتی اور نہ تمہاری جانوں پر کوئی مصیبت آتی ہے۔ لیکن اس کے ظہور سے بھی پہلے ہم نے اسے مقرر کر دیا ہوتا ہے یہ بات اللہ کے لئے بالکل آسان ہے۔"}, {"arabic": " لِّکَیۡلَا تَاۡسَوۡا عَلٰی مَا فَاتَکُمۡ وَ لَا تَفۡرَحُوۡا بِمَاۤ اٰتٰٮکُمۡ ؕ وَ اللّٰہُ لَا یُحِبُّ کُلَّ مُخۡتَالٍ فَخُوۡرِ ۣ﴿ۙ۲۴﴾", "english": " That you may not grieve over what is lost to you nor exult because of that which He has given to you. And Allah loves not any selfconceited boaster,", "french": " Afin que vous ne vous désoliez pas de ce qui vous a échappé, et que vous n’exultiez pas non plus à cause de ce qu’Il vous a donné. Et Allāh n’aime pas les vantards infatués,", "german": " auf dass ihr euch nicht betrübet um das, was euch entging, noch euch überhebet über das, was Er euch gegeben hat. Und Allah liebt keinen der eingebildeten Prahler,", "spanish": " Para que no os aflijáis de lo que habéis perdido, ni os alegréis por lo que se os ha concedido. Pues Al-lah no ama a los engreídos jactanciosos,", "urdu": " تا کہ اپنی کوتاہی پر تم کو کوئی افسوس نہ ہو اور نہ اس پر تم خوش ہو جو اللہ تم کو دے اور اللہ ہر شیخی خورے اکڑ باز کو پسند نہیں کرتا۔"}, {"arabic": " الَّذِیۡنَ یَبۡخَلُوۡنَ وَ یَاۡمُرُوۡنَ النَّاسَ بِالۡبُخۡلِ ؕ وَ مَنۡ یَّتَوَلَّ فَاِنَّ اللّٰہَ ہُوَ الۡغَنِیُّ الۡحَمِیۡدُ ﴿۲۵﴾", "english": " Such as are niggardly and also enjoin upon men to be niggardly. And whoso turns his back, then surely Allah is Self-Sufficient, Worthy of all praise.", "french": " Qui sont avares et enjoignent aussi aux hommes d’être avares. Et quiconque tourne le dos, alors sûrement, Allāh est Celui Qui Se suffit à Lui-Même, le Digne de louange.", "german": " die geizig sind und die Menschen zum Geiz anhalten. Und wer da den Rücken wendet – siehe, Allah ist gewiss dann der Sich Selbst Genügende, der Preiswürdige.", "spanish": " Que son mezquinos y empujan también a los hombres a la mezquindad. Pues quien vuelva la espalda sepa que, en verdad, Al-lah es Autosuficiente, Merecedor de toda alabanza.", "urdu": " ایسے لوگ جو آپ بھی بخل سے کام لیتے ہیں اور دوسروں کو بھی بخل کی تعلیم دیتے ہیں اور جو شخص اس نصیحت سے منہ پھیر لے تو یاد رکھے کہ اللہ ہی حقیقی بے نیاز اور حقیقی تعریف کا مستحق ہے۔"}, {"arabic": " لَقَدۡ اَرۡسَلۡنَا رُسُلَنَا بِالۡبَیِّنٰتِ وَ اَنۡزَلۡنَا مَعَہُمُ الۡکِتٰبَ وَ الۡمِیۡزَانَ لِیَقُوۡمَ النَّاسُ بِالۡقِسۡطِ ۚ وَ اَنۡزَلۡنَا الۡحَدِیۡدَ فِیۡہِ بَاۡسٌ شَدِیۡدٌ وَّ مَنَافِعُ لِلنَّاسِ وَ لِیَعۡلَمَ اللّٰہُ مَنۡ یَّنۡصُرُہٗ وَ رُسُلَہٗ بِالۡغَیۡبِ ؕ اِنَّ اللّٰہَ قَوِیٌّ عَزِیۡزٌ ﴿٪۲۶﴾", "english": " Verily, We sent Our Messengers with manifest Signs and sent down with them the Book and the Balance that people may act with justice; and We sent down iron, wherein is material for violent warfare and many benefits for mankind, and that Allah may distinguish those who help Him and His Messengers without having seen Him . Surely, Allah is Powerful, Mighty.", "french": " En vérité, Nous envoyâmes Nos Messagers avec des Signes manifestes, et Nous envoyâmes avec eux le Livre et la Balance, afin que les gens puissent agir avec justice ; et Nous fîmes descendre pour vous le fer, dans lequel il y a le matériau pour la guerre violente, ainsi que beaucoup d’avantages pour l’humanité, et afin qu’Allāh puisse distinguer ceux qui L’aident et qui aident Ses Messagers bien qu’Il reste Invisible. Assurément, Allāh est Fort, Puissant,", "german": " Wahrlich, Wir schickten Unsere Gesandten mit klaren Beweisen und sandten mit ihnen das Buch und das Maß herab, auf dass die Menschen Gerechtigkeit üben möchten. Und Wir schufen das Eisen, worin (Kraft zu) gewaltigem Krieg wie auch zu (vielerlei anderen) Nutzen für die Menschheit ist, damit Allah die bezeichne, die Ihm und Seinen Gesandten beistehen, wenngleich ungesehen. Fürwahr, Allah ist stark, allmächtig.", "spanish": " Ciertamente enviamos a Nuestros Mensajeros con Signos evidentes, y enviamos con ellos el Libro y la Balanza para que los hombres actuaran on justicia; y os concedimos el hierro, que encierra material para la guerra violenta y muchos beneficios para la humanidad; y para que Al-lah distinga a quienes le ayudan a Él y a Sus Mensajeros, aunque Él permanezca invisible. Ciertamente, Al-lah es Poderoso, Potente.", "urdu": " ہم نے اپنے رسولوں کو کھلے نشانوں کے ساتھ بھیجا ہے اور ان کے ساتھ کتاب اور میزان بھی اتاری ہے تا کہ لوگ انصاف کیا کریں اور ہم نے لوہا بھی اتارا ہے جس میں سخت جنگ کا سامان ہے اور لوگوں کے لئے اور بھی کئی قسم کے نفعے ہیں اور یہ سب اس لئے پیدا کیا ہے کہ اللہ جان لے کہ اس کی اور اس کے رسولوں کی غیب کی حالت میں کون مدد کرتا ہے اور اللہ بڑی قوت والا (اور) غالب ہے۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا نُوۡحًا وَّ اِبۡرٰہِیۡمَ وَ جَعَلۡنَا فِیۡ ذُرِّیَّتِہِمَا النُّبُوَّۃَ وَ الۡکِتٰبَ فَمِنۡہُمۡ مُّہۡتَدٍ ۚ وَ کَثِیۡرٌ مِّنۡہُمۡ فٰسِقُوۡنَ ﴿۲۷﴾", "english": " And We did send Noah and Abraham, and We placed among their seed prophethood and the Book. So some of them followed the guidance, but many of them were rebellious.", "french": " Et en vérité, Nous avions aussi envoyé Noé et Abraham, et Nous avions établi le prophétat – nubuwwah - parmi leur progéniture et leur avions donné le Livre. Alors certains d’entre eux ont suivi la direction, mais beaucoup d’entre eux furent rebelles.", "german": " Wir entsandten ja auch Noah und Abraham und gaben ihren Nachkommen das Prophetentum und die Schrift. Einige unter ihnen waren auf dem rechten Weg, doch viele unter ihnen waren Empörer.", "spanish": " Y enviamos a Noé y Abraham y otorgamos a su progenie la profecía y el Libro. Algunos de ellos siguieron la guía, pero muchos fueron rebeldes.", "urdu": " اور ہم نے نوح اور ابراہیم کو بھی رسول بنا کر بھیجا تھا۔ اور ان کی ذریت سے نبوت اور کتاب کو مخصوص کر دیا تھا۔ پس بعض ان میں سے ہدایت پانے والے تھے اور بہت لوگ ان میں سے فاسق تھے۔"}, {"arabic": " ثُمَّ قَفَّیۡنَا عَلٰۤی اٰثَارِہِمۡ بِرُسُلِنَا وَ قَفَّیۡنَا بِعِیۡسَی ابۡنِ مَرۡیَمَ وَ اٰتَیۡنٰہُ الۡاِنۡجِیۡلَ ۬ۙ وَ جَعَلۡنَا فِیۡ قُلُوۡبِ الَّذِیۡنَ اتَّبَعُوۡہُ رَاۡفَۃً وَّ رَحۡمَۃً ؕ وَ رَہۡبَانِیَّۃَ ۣ ابۡتَدَعُوۡہَا مَا کَتَبۡنٰہَا عَلَیۡہِمۡ اِلَّا ابۡتِغَآءَ رِضۡوَانِ اللّٰہِ فَمَا رَعَوۡہَا حَقَّ رِعَایَتِہَا ۚ فَاٰتَیۡنَا الَّذِیۡنَ اٰمَنُوۡا مِنۡہُمۡ اَجۡرَہُمۡ ۚ وَ کَثِیۡرٌ مِّنۡہُمۡ فٰسِقُوۡنَ ﴿۲۸﴾", "english": " Then We caused Our Messengers to follow in their footsteps; and We caused Jesus, son of Mary, to follow them , and We gave him the Gospel. And We placed in the hearts of those who accepted him compassion and mercy. But monasticism which they invented for themselves — We did not prescribe it for them — for the seeking of Allah’s pleasure; but they did not observe it with due observance. Yet We gave those of them who believed their due reward, but many of them are rebellious.", "french": " Ensuite Nous avons fait marcher sur leurs pas Nos Messagers, et Nous avons fait que Jésus, fils de Marie, les suive, et Nous lui avons donné l’Evangile. Et Nous avons mis de la compassion et de la miséricorde dans le cœur de ceux qui le suivaient. Et le monachisme qu’ils inventèrent - Nous ne l’avions pas prescrit pour eux – seulement pour rechercher le plaisir d’Allāh ; mais ils ne l’observèrent pas dans l’esprit où c’était voulu. Néanmoins, Nous avons donné à ceux qui croyaient d’entre eux la récompense qui leur était due, mais beaucoup d’entre eux furent des rebelles.", "german": " Dann ließen Wir Unsere Gesandten ihren Spuren folgen; und Wir ließen Jesus, den Sohn der Maria, (ihnen) folgen, und Wir gaben ihm das Evangelium. Und in die Herzen derer, die ihm folgten, legten Wir Güte und Barmherzigkeit. Das Mönchstum jedoch, das sie sich erfanden – das schrieben Wir ihnen nicht vor – um das Trachten nach Allahs Wohlgefallen; doch sie befolgten es nicht auf richtige Art. Dennoch gaben Wir denen unter ihnen, die gläubig waren, ihren Lohn, aber viele unter ihnen waren ruchlos.", "spanish": " Entonces hicimos que Nuestros Mensajeros siguieran sus pasos; e hicimos que Jesús, hijo de María, los siguiera, entregándole el Evangelio. Y pusimos en los corazones de los que lo aceptaron, compasión y misericordia. Pero la vida monástica que innovaron no es lo que les prescribimos, sino que lo hicieron para buscar el favor de Al-lah; pero no la practicaron de acuerdo con su verdadero espíritu. Y sin embargo a quienes creyeron de entre ellos, les otorgamos su debida recompensa, aunque muchos de ellos son rebeldes.", "urdu": " پھر ہم نے ان کے (یعنی اولاد نوح و ابراہیم کے) بعد اپنے رسول ان کے نقش قدم پر چلا کر بھیجے اور عیسیٰ ابن مریم کو بھی ان کے نقش قدم پر چلایا اور اس کو انجیل بخشی۔ اور جو اس کے متبع ہوئے ہم نے ان کے دل میں رافت اور رحمت پیدا کی اور انہوں نے کنوارا رہنے کا طریق اختیار کیا‘ جسے انہوں نے خود اختیار کیا تھا۔ ہم نے یہ حکم ان پر فرض نہیں کیا تھا (گو) انہوں نے اللہ کی رضا حاصل کرنے کیلئے یہ طریق اختیار کیا تھا مگر اس کاپورا لحاظ نہ رکھا۔ پس ان میں سے جو مومن تھے ان کو ہم نے مناسب حال اجر بخشا اور ان میں سے بہت سے فاسق تھے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ وَ اٰمِنُوۡا بِرَسُوۡلِہٖ یُؤۡتِکُمۡ کِفۡلَیۡنِ مِنۡ رَّحۡمَتِہٖ وَ یَجۡعَلۡ لَّکُمۡ نُوۡرًا تَمۡشُوۡنَ بِہٖ وَ یَغۡفِرۡ لَکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿ۚۙ۲۹﴾", "english": " O ye who believe! fear Allah and believe in His Messenger; He will give you a double share of His mercy, and will provide for you a light wherein you will walk, and will grant you forgiveness — and verily Allah is Most Forgiving, Merciful —", "french": " Ô vous qui croyez ! Craignez Allāh et croyez en Son Messager ; Il vous donnera une double part de Sa miséricorde, et vous accordera une lumière dans laquelle vous marcherez, et Il vous pardonnera – et Allāh est Très-Pardonnant, Miséricordieux –", "german": " O die ihr glaubt, fürchtet Allah und glaubet an Seinen Gesandten! Er wird euch einen doppelten Anteil von Seiner Barmherzigkeit geben und wird euch ein Licht bereiten, darin ihr wandeln werdet, und wird euch verzeihen – und Allah ist allverzeihend, barmherzig –,", "spanish": " ¡Oh vosotros, los creyentes! Temed a Al-lah y creed en Su Mensajero; Él os dará una doble porción de Su misericordia y os proporcionará una luz con la que caminaréis, y os concederá el perdón –pues en verdad Al-lah es el Sumo Indulgente, el Misericordioso-.", "urdu": " اے ایمان والو! اللہ کا تقویٰ اختیار کرو اور اس کے رسول پر ایمان لاٶ۔ تب تم کو اللہ اپنی رحمت سے دوہرا حصہ دے گا اور تمہارے لئے نور مقرر کر دے گا جس کی مدد سے تم چلو گے اور تمہارے گناہ معاف کرے گا اور اللہ بڑا بخشنے والا (اور) بے انتہا کرم کرنے والا ہے۔"}, {"arabic": " لِّئَلَّا یَعۡلَمَ اَہۡلُ الۡکِتٰبِ اَلَّا یَقۡدِرُوۡنَ عَلٰی شَیۡءٍ مِّنۡ فَضۡلِ اللّٰہِ وَ اَنَّ الۡفَضۡلَ بِیَدِ اللّٰہِ یُؤۡتِیۡہِ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿٪۳۰﴾", "english": " That the People of the Book may not think that they (the Muslims) have no power to attain aught of the grace of Allah; whereas grace is entirely in the hands of Allah. He gives it to whomsoever He pleases. And Allah is the Master of immense grace.", "french": " Afin que les Gens du Livre ne pensent pas qu’eux– les Musulmans –ne méritent aucune part dans la grâce d’Allāh ; tandis que la grâce est entièrement entre les mains d’Allāh. Il l’accorde à qui Il veut. Et Allāh est le Maître de la grâce immense.", "german": " damit das Volk der Schrift nicht wähne, dass sie (die Muslime) nicht imstande sind, die Huld Allahs zu erlangen. Die Huld ist in Allahs Hand, auf dass Er sie verleihe, wem Er will. Und Allah ist der Eigner großer Huld.", "spanish": " Para que el Pueblo del Libro no piense que los musulmanes no erecen parte alguna en la gracia de Al-lah; cuando la gracia está totalmente en manos de Al-lah. Él la concede a quien Le agrada. Pues Al-lah es el Maestro de la gracia inmensa.", "urdu": " اور یہ ہم اس لئے کہتے ہیں تا کہ اہل کتاب یہ نہ سمجھیں کہ مسلمانوں کو اللہ کے فضل سے کچھ ملا ہی نہیں۔ بلکہ یہ سمجھیں کہ فضل اللہ کے ہاتھ میں ہے۔ جس کو چاہتا ہے دیتا ہے اور اللہ بڑے فضلوں والا ہے۔"}], "Surah": 57}