{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " قٓ ۟ۚ وَ الۡقُرۡاٰنِ الۡمَجِیۡدِ ۚ﴿۲﴾", "english": " Qaf. By the glorious Qur’an, thou art a Messenger of God .", "french": " Qāf (Le Détenteur du plein pouvoir). Par le Glorieux Coran que Nous présentons comme un témoin de ta véracité .", "german": " Qâf. Beim hocherhabenen Qur-ân!", "spanish": " Qaf. Presentamos al Glorioso Corán como testigo de tu verdad .", "urdu": " قادر خدا اس سورۃ کو اتارنے والا ہے۔ ہم اس بزرگی والے قرآن کو (اس سورۃ کی سچائی کی) شہادت کے طور پر پیش کرتے ہیں۔"}, {"arabic": " بَلۡ عَجِبُوۡۤا اَنۡ جَآءَہُمۡ مُّنۡذِرٌ مِّنۡہُمۡ فَقَالَ الۡکٰفِرُوۡنَ ہٰذَا شَیۡءٌ عَجِیۡبٌ ۚ﴿۳﴾", "english": " But they wonder that there has come to them a Warner from among themselves. And the disbelievers say, ‘This is a strange thing!", "french": " Mais ils s’étonnent que leur soit venu d’entre eux-mêmes un Avertisseur. Et les mécréants disent : « Ceci est une chose étrange ! »", "german": " Aber sie staunen, dass zu ihnen ein Warner gekommen ist aus ihrer Mitte. Und die Ungläubigen sprechen: \"Das ist eine wunderliche Sache.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=50:3&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=50:3&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic4\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic4\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/50:4' style='text-decoration:underline'>50:4</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(4)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control4\"></i></button> <audio id=\"player4\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ءَاِذَا مِتۡنَا وَ کُنَّا تُرَابًا ۚ ذٰلِکَ رَجۡعٌۢ بَعِیۡدٌ ﴿۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘What! when we are dead and have become dust, <I>shall we be raised to life again</I>? That is a return far <em>from possible</em>.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘What! when we are dead and have become dust, <i>shall we be raised up again</i>? <sup class='ref'>[<a class='ref' data-id='ref_50_4_b' href='#'>b</a>]</sup>That is a return far <i>from possible</i>.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_50_4_b'>b</span></div> <div><div class='reference' data-id='ref_50_4_b' style='display:none'> <p><b>b.</b> <a href='/quran/13:6' target=_blank>13:6</a>; <a href='/quran/23:37' target=_blank>23:37</a>. (<a href='javascript:void(0)' data-id='ref_50_4_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\"> کیا جب ہم مرجائیں گے اور مٹی ہوجائیں گے؟ وہ لَوٹنا ایک دُور کی بات ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا جب ہم مر جائیں گے اور مٹی ہو جائیں گے (تو پھر دوبارہ زندہ ہو جائیں گے) یہ لوٹنا تو (عقل سے) دور ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">« Quoi ! Quand nous serons morts, et que nous serons devenus poussière,<em>serons-nous ressuscités</em> ? C’est là un retour qui est bien loin <em>de la réalité</em>. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡Cómo! <em>¿Seremos de nuevo resucitados</em> cuando hayamos muerto nos hayamos convertido en polvo? Es un retorno muy lejos <em>de lo posible”.</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wie! wenn wir tot sind und zu Staub geworden (sollen wir wieder zum Leben erweckt werden)? Das ist eine Wiederkehr von weit her.\"", "spanish": " Se asombran de que les haya llegado un Amonestador de entre ellos. Y los incrédulos dicen: “¡Qué cosa más extraña!”.", "urdu": " مگر یہ لوگ تعجب کرتے ہیں کہ ان کے پاس انہی میں سے ڈرانے (اور ہوشیار کرنے) والا ایک شخص آیا ہے اور کافر کہتے ہیں‘ یہ عجیب سی چیز لگتی ہے۔"}, {"arabic": " قَدۡ عَلِمۡنَا مَا تَنۡقُصُ الۡاَرۡضُ مِنۡہُمۡ ۚ وَ عِنۡدَنَا کِتٰبٌ حَفِیۡظٌ ﴿۵﴾", "english": " We know how much the earth diminishes of them and with Us is a Book that preserves everything .", "french": " Nous savons par combien la terre les diminue, et auprès de Nous est un Livre qui préserve tout .", "german": " Wir wissen wohl, was die Erde von ihnen verzehrt, und bei Uns ist ein Buch, das alles aufbewahrt.", "spanish": " Sabemos lo que la tierra les arrebata, pues poseemos un Libro que lo preserva todo.", "urdu": " ہم کو خوب معلوم ہے وہ بھی جو زمین ان میں سے کم کرتی ہے (اور وہ بھی جو زیادہ کرتی ہے) اور ہمارے پاس ایسی کتاب ہے جو ہر چیز کو محفوظ رکھتی ہے۔"}, {"arabic": " بَلۡ کَذَّبُوۡا بِالۡحَقِّ لَمَّا جَآءَہُمۡ فَہُمۡ فِیۡۤ اَمۡرٍ مَّرِیۡجٍ ﴿۶﴾", "english": " Nay, they rejected the truth when it came to them, and so they are in a state of confusion.", "french": " Non , mais ils ont rejeté la vérité lorsqu’elle leur est venue, et maintenant ils sont dans un état de confusion.", "german": " Nein, sie verwarfen die Wahrheit, als sie zu ihnen kam, und nun sind sie in einem Zustand der Verwirrung.", "spanish": " ¡No!, rechazaron la verdad cuando les llegó, por lo que están en un estado de confusión.", "urdu": " بات یہ ہے کہ ان لوگوں نے حق کا انکار کر دیا جب وہ ان کے پاس آیا اس لئے وہ ایک ایسے خیال میں پڑے ہوئے ہیں جو کہ ملا جلا ہے (یعنی سچ اور جھوٹ ان کے خیالات میں مل گئے ہیں)"}, {"arabic": " اَفَلَمۡ یَنۡظُرُوۡۤا اِلَی السَّمَآءِ فَوۡقَہُمۡ کَیۡفَ بَنَیۡنٰہَا وَ زَیَّنّٰہَا وَ مَا لَہَا مِنۡ فُرُوۡجٍ ﴿۷﴾", "english": " Have they not looked at the sky above them, how We have made it and adorned it, and there are no flaws in it?", "french": " N’ont-ils pas regardé le ciel au-dessus d’eux, comme Nous l’avons érigé et orné, et il ne s’y trouve pas de défaut ?", "german": " Haben sie nicht zum Himmel über sich emporgeschaut, wie Wir ihn erbaut und geschmückt und wie makellos er ist?", "spanish": " ¿No han contemplado acaso el firmamento que está sobre ellos, cómo lo hicimos y lo adornamos, sin que hubiese grieta alguna en él?", "urdu": " کیا انہوں نے اپنے اوپر آسمان کو نہیں دیکھا کہ ہم نے اس کو کیسا بنایا ہے اور اسے زینت دی ہے اور اس میں کوئی شگاف نہیں ہے۔"}, {"arabic": " وَ الۡاَرۡضَ مَدَدۡنٰہَا وَ اَلۡقَیۡنَا فِیۡہَا رَوَاسِیَ وَ اَنۡۢبَتۡنَا فِیۡہَا مِنۡ کُلِّ زَوۡجٍۭ بَہِیۡجٍ ۙ﴿۸﴾", "english": " And the earth — We have spread it out, and placed therein firm mountains; and We have made to grow therein every kind of beautiful species,", "french": " Et la terre – Nous l’avons étendue, et Nous y avons mis des montagnes solidement ancrées, et Nous y avons fait croître toutes sortes de splendides couples de végétations ,", "german": " Und die Erde – Wir haben sie ausgebreitet und feste Berge darauf gesetzt; und Wir ließen auf ihr von jeglicher schönen Art Paare hervorsprießen,", "spanish": " Y a la tierra, la hemos dilatado y colocado en ella montañas firmes; y hemos hecho crecer en ella toda clase de bellas especies,", "urdu": " اور زمین کو ہم نے بچھایا ہے اور اس میں پہاڑ بنائے ہیں نیز ہم نے اس میں ہر قسم کے خوبصورت جوڑے بنائے ہیں۔"}, {"arabic": " تَبۡصِرَۃً وَّ ذِکۡرٰی لِکُلِّ عَبۡدٍ مُّنِیۡبٍ ﴿۹﴾", "english": " As a means of enlightenment and as a reminder to every servant that turns to God .", "french": " Comme moyen d’ illumination et comme un Rappel à tout serviteur qui se tourne vers Nous .", "german": " zur Aufklärung und Ermahnung für jeden Diener, der sich bekehrt.", "spanish": " Como medio de ilustración y recordatorio para cada siervo que vuelve a Dios.", "urdu": " ہماری طرف ہر جھکنے والے بندے کے لئے اس بات میں بصیرت اور نصیحت ہے۔"}, {"arabic": " وَ نَزَّلۡنَا مِنَ السَّمَآءِ مَآءً مُّبٰرَکًا فَاَنۡۢبَتۡنَا بِہٖ جَنّٰتٍ وَّ حَبَّ الۡحَصِیۡدِ ۙ﴿۱۰﴾", "english": " And We send down from the sky water which is full of blessings, and We produce therewith gardens and grain harvests,", "french": " Et Nous faisons descendre du ciel de l’eau, qui est pleine de bénédictions, et avec cela Nous produisons des jardins et des moissons de céréales,", "german": " Und vom Himmel senden Wir Wasser hernieder, das voll des Segens ist, und bringen damit Gärten hervor und Korn zum Ernten,", "spanish": " Hemos enviado el agua del cielo llena de bendiciones, produciendo con ella jardines y cosechas de grano,", "urdu": " اور ہم نے بادل سے برکت والا پانی اتارا ہے۔ پھر اس کے ذریعہ سے ہم باغ اگاتے ہیں اور کاٹی جانے والی کھیتی کے دانے بھی۔"}, {"arabic": " وَ النَّخۡلَ بٰسِقٰتٍ لَّہَا طَلۡعٌ نَّضِیۡدٌ ﴿ۙ۱۱﴾", "english": " And tall palm-trees, with spathes piled one above the other,", "french": " Et de hauts dattiers, avec des spathes empilées les unes au-dessus des autres,", "german": " und schlanke Palmen mit übereinander stehenden Fruchtknöpfen", "spanish": " Altas palmeras, con racimos apilados uno sobre otro,", "urdu": " اور لمبے لمبے کھجوروں کے درخت بھی (اگاتے ہیں) جن میں پھلوں کے خوشے لگتے ہیں جو خوب ایک دوسرے پر چڑھے ہوئے ہوتے ہیں۔"}, {"arabic": " رِّزۡقًا لِّلۡعِبَادِ ۙ وَ اَحۡیَیۡنَا بِہٖ بَلۡدَۃً مَّیۡتًا ؕ کَذٰلِکَ الۡخُرُوۡجُ ﴿۱۲﴾", "english": " As a provision for Our servants; and We quicken thereby a dead land. Even so shall be the Resurrection.", "french": " Comme nourriture pour Nos serviteurs et par là Nous ranimons une terre morte. Il en sera de même à la Résurrection.", "german": " als eine Versorgung für die Diener; und Wir beleben damit ein totes Land. Also wird die Auferstehung sein.", "spanish": " Como sustento para Nuestros siervos; pues de ese modo vivificamos una tierra muerta. Así será la Resurrección.", "urdu": " (ہم نے) بندوں کو رزق دینے کے لئے (ایسا کیا ہے) اور ہم اس (پانی) کے ذریعہ سے مردہ ملک کو زندہ کرتے ہیں۔ اسی طرح مرنے کے بعد نکلنا بھی ہوگا۔"}, {"arabic": " کَذَّبَتۡ قَبۡلَہُمۡ قَوۡمُ نُوۡحٍ وَّ اَصۡحٰبُ الرَّسِّ وَ ثَمُوۡدُ ﴿ۙ۱۳﴾", "english": " The people of Noah rejected the truth before them and so did the People of the Well, and Thamud,", "french": " Le peuple de Noé avant eux rejeta la vérité et de même le Peuple du Puits, et les Thamūd,", "german": " Schon vor ihnen leugneten das Volk Noahs und das Volk des Brunnens und die Thamûd,", "spanish": " El pueblo de Noé rechazó la verdad antes de ellos y también lo hizo el Pueblo del Pozo y los Zamud,", "urdu": " ان سے پہلے نوح کی قوم نے اور کنوئیں والوں نے اور ثمود نے‘"}, {"arabic": " وَ عَادٌ وَّ فِرۡعَوۡنُ وَ اِخۡوَانُ لُوۡطٍ ﴿ۙ۱۴﴾", "english": " And ‘Ad, and Pharaoh and the brethren of Lot,", "french": " Et les ‘Ād, et Pharaon et les frères de Lot,", "german": " und die ´Âd, und Pharao und die Brüder des Lot,", "spanish": " Igualmente Ad, el Faraón y los hermanos de Lot,", "urdu": " اور عاد نے اور فرعون نے اور لوط کے بھائیوں نے‘"}, {"arabic": " وَّ اَصۡحٰبُ الۡاَیۡکَۃِ وَ قَوۡمُ تُبَّعٍ ؕ کُلٌّ کَذَّبَ الرُّسُلَ فَحَقَّ وَعِیۡدِ ﴿۱۵﴾", "english": " And the Dwellers of the Wood, and the people of Tubba‘. All of them rejected the Messengers with the result that My threatened punishment befell them .", "french": " Et les habitants de la Forêt, et le peuple de Tubba’. Tous rejetèrent les Messagers et par conséquent Ma menace s’avéra vraie.", "german": " und die Waldbewohner und das Volk von Tubba. Alle diese verwarfen die Gesandten. Darum ward Meine Drohung wahr.", "spanish": " Los Habitantes del Bosque y el pueblo de Tubba. Todos ellos rechazaron a los Mensajeros con el resultado de que Mi castigo previamente advertido cayó sobre ellos.", "urdu": " اور جنگل کے رہنے والوں نے اور قوم تُبَّع (یعنی یمن کے لوگوں نے) ہمارے رسولوں کو جھٹلا دیا تھا۔ آخر میرے عذاب کا وعدہ پورا ہو کر رہا۔"}, {"arabic": " اَفَعَیِیۡنَا بِالۡخَلۡقِ الۡاَوَّلِ ؕ بَلۡ ہُمۡ فِیۡ لَبۡسٍ مِّنۡ خَلۡقٍ جَدِیۡدٍ ﴿٪۱۶﴾", "english": " Have We then become weary with the first creation? Nay, but they are in confusion about the new creation.", "french": " Nous sommes-Nous donc lassé de la première création ? Non , mais ils sont dans la confusion au sujet de la nouvelle création.", "german": " Sind Wir denn durch die erste Schöpfung ermüdet? Nein, aber sie sind in Unklarheit über die neue Schöpfung.", "spanish": " ¿Acaso Nos cansamos con la primera creación? No, pero están confundidos sobre la nueva creación.", "urdu": " کیا ہم پہلی پیدائش سے تھک گئے ہیں؟ (نہیں)! لیکن حقیقت یہ ہے کہ وہ دوسری پیدائش کے بارے میں شبہ میں پڑے ہوئے ہیں۔"}, {"arabic": " وَ لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ وَ نَعۡلَمُ مَا تُوَسۡوِسُ بِہٖ نَفۡسُہٗ ۚۖ وَ نَحۡنُ اَقۡرَبُ اِلَیۡہِ مِنۡ حَبۡلِ الۡوَرِیۡدِ ﴿۱۷﴾", "english": " And assuredly, We have created man and We know what his physical self whispers to him , and We are nearer to him than even his jugular vein.", "french": " Et assurément Nous avons créé l’homme, et Nous savons ce que son esprit lui murmure, et Nous sommes plus près de lui que même sa veine jugulaire.", "german": " Wahrlich, Wir erschufen den Menschen, und Wir wissen alles, was sein Fleisch ihm zuflüstert; denn Wir sind ihm näher als die Halsader.", "spanish": " Pues en verdad, hemos creado al hombre y sabemos lo que su ego le susurra, y estamos más cerca de él incluso que su vena yugular.", "urdu": " اور ہم نے انسان کو پیدا کیا ہے اور جو وسوسے اس کا نفس پیدا کرتا ہے اس سے خوب واقف ہیں اور ہم اس (انسان) سے اس کی رگ جان سے بھی زیادہ قریب ہیں۔"}, {"arabic": " اِذۡ یَتَلَقَّی الۡمُتَلَقِّیٰنِ عَنِ الۡیَمِیۡنِ وَ عَنِ الشِّمَالِ قَعِیۡدٌ ﴿۱۸﴾", "english": " When the two Recording angels record the deeds of men , one sitting on the right and the other on the left,", "french": " Quand les deux anges qui tiennent le registre, inscrivent toutes les actions des hommes l’un assis à droite et l’autre à gauche,", "german": " Wenn die zwei aufnehmenden (Engel) niederschreiben, zur Rechten sitzend und zur Linken,", "spanish": " Cuando los dos ángeles Registradores anoten las acciones de los hombres, uno sentado a la derecha y el otro a la izquierda,", "urdu": " جب کہ دائیں اور بائیں بیٹھے ہوئے دو گواہ اس کی تمام حرکات کو محفوظ کرتے جاتے ہیں۔"}, {"arabic": " مَا یَلۡفِظُ مِنۡ قَوۡلٍ اِلَّا لَدَیۡہِ رَقِیۡبٌ عَتِیۡدٌ ﴿۱۹﴾", "english": " He utters not a word but there is by him a guardian angel ready to record it .", "french": " Il ne prononce pas un mot sans qu’il n’y ait près de lui un ange gardien toujours prêt à l’inscrire .", "german": " kein Wort bringt er hervor, ohne dass neben ihm ein Wächter wäre, stets bereit (es aufzuzeichnen).", "spanish": " No musita una sola palabra, sin que haya junto a él un ángel de la guarda preparado para registrarla.", "urdu": " اور (انسان) کوئی بات نہیں کرے گا کہ اس کے پاس اس کا کوئی نگران یا محافظ نہ ہو۔"}, {"arabic": " وَ جَآءَتۡ سَکۡرَۃُ الۡمَوۡتِ بِالۡحَقِّ ؕ ذٰلِکَ مَا کُنۡتَ مِنۡہُ تَحِیۡدُ ﴿۲۰﴾", "english": " And the stupor of death certainly comes. ‘This is what thou wast trying to run from.’", "french": " Et certainement la stupeur de la mort viendra. « Voici ce que tu cherchais à fuir. »", "german": " Und die Trunkenheit des Todes wird sicherlich kommen: \"Das ist´s, dem du zu entrinnen suchtest.\"", "spanish": " Pues el estupor de la muerte llega ciertamente. “De esto es de lo que intentabas escapar”.", "urdu": " اور موت کی بیہوشی یقیناً آئے گی اور اس وقت ہم اس (یعنی غافل انسان) سے کہیں گے کہ یہ وہ حالت ہے جس سے تو بچنا چاہتا تھا۔"}, {"arabic": " وَ نُفِخَ فِی الصُّوۡرِ ؕ ذٰلِکَ یَوۡمُ الۡوَعِیۡدِ ﴿۲۱﴾", "english": " And the trumpet shall be blown: ‘This is the Day of Promise.’", "french": " Et l’on sonnera de la trompe : « Voici le Jour de la Promesse. »", "german": " Und es wird in die Posaune gestoßen werden: \"Dies ist der Tag der Drohung.\"", "spanish": " Sonará la trompeta: “Éste es el Día de la Promesa”.", "urdu": " اور بگل میں پھونکا جائے گا‘ یہ عذاب کے وعدے کا دن ہے۔"}, {"arabic": " وَ جَآءَتۡ کُلُّ نَفۡسٍ مَّعَہَا سَآئِقٌ وَّ شَہِیۡدٌ ﴿۲۲﴾", "english": " And every soul shall come forth and along with it there will be an angel to drive and an angel to bear witness.", "french": " Et chaque âme s’avancera ; et avec elle il y aura un ange pour pousser et un ange pour témoigner.", "german": " Und jede Seele wird kommen, mit ihr wird ein Treiber sein und ein Zeuge.", "spanish": " Cada alma se adelantará y junto con ella habrá un ángel para conducirla y un ángel para actuar de testigo.", "urdu": " اور ہر جان (اس حالت میں) آئے گی کہ اس کے ساتھ ایک ہانکنے والا بھی لگا ہوا ہوگا اور ایک گواہ بھی ہوگا۔"}, {"arabic": " لَقَدۡ کُنۡتَ فِیۡ غَفۡلَۃٍ مِّنۡ ہٰذَا فَکَشَفۡنَا عَنۡکَ غِطَآءَکَ فَبَصَرُکَ الۡیَوۡمَ حَدِیۡدٌ ﴿۲۳﴾", "english": " ‘Thou wast heedless of this; now We have removed from thee thy veil, and sharp is thy sight this day.’", "french": " »Tu en étais insouciant ; maintenant Nous t’avons ôté ton voile, et aujourd’hui ta vue est perçante. »", "german": " Du warst dessen achtlos; nun haben Wir deinen Schleier von dir genommen, und scharf ist dein Blick heute.", "spanish": " “Te hallabas descuidado respecto a esto; mas ahora te hemos retirado el velo, y tu vista es penetrante en este día”.", "urdu": " (اور ہم کہیں گے) تو اس (دن) سے غفلت میں پڑا ہوا تھا سو آخر ہم نے تیرا پردہ اٹھا دیا۔ اور آج کے دن تیری نظر بڑی تیز ہے (اور تو سب کچھ دیکھ رہا ہے)۔"}, {"arabic": " وَ قَالَ قَرِیۡنُہٗ ہٰذَا مَا لَدَیَّ عَتِیۡدٌ ﴿ؕ۲۴﴾", "english": " And his companion will say, ‘This is what I have of the record ready.", "french": " Et son compagnon dira : « Voici ce que j’ai, tout prêt, du registre de ses actes.", "german": " Und sein Gefährte wird sprechen: \"Hier, was ich (von dem Verzeichnis) bereit habe.\"", "spanish": " Su compañero dirá: “Esto es lo que he preparado del registro”.", "urdu": " اور اس کا ساتھی کہے گا کہ ذرا اسے بھی دیکھیئے جو میرے پاس تیار ہے (یعنی اس کا اعمال نامہ)۔"}, {"arabic": " اَلۡقِیَا فِیۡ جَہَنَّمَ کُلَّ کَفَّارٍ عَنِیۡدٍ ﴿ۙ۲۵﴾", "english": " ‘Cast ye twain into Hell every ungrateful enemy of truth ,", "french": " Vous deux, jetez dans l’Enfer tout ingrat endurci, grand ennemi de la vérité ,", "german": " „Werfet, ihr beide, in die Hölle einen jeden undankbaren Feind (der Wahrheit),", "spanish": " “Precipitad ambos al Infierno, a todo ingrato enemigo de la verdad”,", "urdu": " پھر ہم ان دونوں (یعنی ہانکنے والے اور گواہ) سے کہیں گے‘ ہر انکار کرنے والے حق کے دشمن نیکی سے روکنے والے‘ حد سے بڑھنے والے اور شبہات کرنے والے کو تم دونوں دوزخ میں ڈال دو۔"}, {"arabic": " مَّنَّاعٍ لِّلۡخَیۡرِ مُعۡتَدٍ مُّرِیۡبِ ۣ﴿ۙ۲۶﴾", "english": " ‘Hinderer of good, transgressor, doubter,", "french": " Empêcheur du bien, transgresseur, douteur,", "german": " den Behinderer des Guten, den Übertreter, den Zweifler,", "spanish": " “Que impide el bien, trasgresor, escéptico”,", "urdu": " پھر ہم ان دونوں (یعنی ہانکنے والے اور گواہ) سے کہیں گے‘ ہر انکار کرنے والے حق کے دشمن نیکی سے روکنے والے‘ حد سے بڑھنے والے اور شبہات کرنے والے کو تم دونوں دوزخ میں ڈال دو۔"}, {"arabic": " الَّذِیۡ جَعَلَ مَعَ اللّٰہِ اِلٰـہًا اٰخَرَ فَاَلۡقِیٰہُ فِی الۡعَذَابِ الشَّدِیۡدِ ﴿۲۷﴾", "english": " ‘Who sets up another God beside Allah. So do ye twain cast him into the dreadful torment.’", "french": " Qui invoque un autre dieu qu’Allāh. Jetez-le donc, vous deux, dans le dur supplice. »", "german": " der einen anderen Gott setzte neben Allah. Werfet denn, ihr beide, ihn in die schreckliche Pein!\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=50:27&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=50:27&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic28\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic28\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/50:28' style='text-decoration:underline'>50:28</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(28)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control28\"></i></button> <audio id=\"player28\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ قَرِیۡنُہٗ رَبَّنَا مَاۤ اَطۡغَیۡتُہٗ وَ لٰکِنۡ کَانَ فِیۡ ضَلٰلٍۭ بَعِیۡدٍ ﴿۲۸﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">His associate will say, ‘O our Lord, I did not cause him to rebel; but he <em>himself </em>was too far gone in error.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_50_28_b' href='#'>b</a>]</sup>His associate will say, ‘O our Lord, it was not I that caused him to rebel; but he <i>himself </i>was too far gone in error.’<sup class='ref'>[<a class='ref' data-id='ref_50_28_2810' href='#'>2810</a>]</sup> <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_50_28_b'>b</span><span class='collapsible plus' data-id='ref_50_28_2810'>2810</span></div> <div><div class='reference' data-id='ref_50_28_b' style='display:none'> <p><b>b.</b> <a href='/quran/14:23' target=_blank>14:23</a>. (<a href='javascript:void(0)' data-id='ref_50_28_b' class='ref'>close</a>)</p> </div> </div><div><a name='2810'></a><div class='reference' data-id='ref_50_28_2810' style='display:none'> <p><b>2810.</b> It is human nature that when an evil-doer is confronted with the evil consequences of his deeds, he seeks to shift his responsibility to others. It is this state of mind of the disbeliever which is depicted in this verse. He will hold Satan responsible for his own transgressions and sins. (<a href='javascript:void(0)' data-id='ref_50_28_2810' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس کے ساتھی نے کہا اے ہمارے ربّ! میں نے تو اسے سرکش نہیں کیا لیکن وہ خود ہی ایک دُور کی گمراہی میں مبتلا تھا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اور) اس کا ساتھی کہے گا۔ اے ہمارے رب! میں نے اس سے سرکشی نہیں کروائی بلکہ وہ خود ہی ایک پرلے درجہ کی گمراہی میں مبتلا تھا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Son associé dira : « Ô notre Seigneur, ce n’est pas moi qui l’ai fait se rebeller, mais il s’était allé bien loin dans l’égarement. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Su acompañante dirá: “Oh, Señor nuestro, no fui yo quien le hizo rebelarse; sino que <em>él mismo</em> llegó demasiado lejos en el error”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Sein Gefährte wird sprechen: \"O unser Herr, ich verführte ihn nicht zur Empörung, sondern er selbst ging zu weit in die Irre.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=50:28&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=50:28&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic29\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic29\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/50:29' style='text-decoration:underline'>50:29</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(29)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control29\"></i></button> <audio id=\"player29\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ لَا تَخۡتَصِمُوۡا لَدَیَّ وَ قَدۡ قَدَّمۡتُ اِلَیۡکُمۡ بِالۡوَعِیۡدِ ﴿۲۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\"><I> God </I>will say, ‘Quarrel not in My presence, I gave you the warning beforehand.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <i>Allah </i>will say, ‘Quarrel not in My presence; I gave you the warning beforehand,’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">وہ کہے گا میرے حضور جھگڑا نہ کرو۔ میں پہلے ہی تمہاری طرف انذار بھیج چکا ہوں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(اس پر خدا) فرمائے گا‘ میرے پاس جھگڑو نہیں‘ اور یاد رکھو کہ میں تمہاری طرف پہلے ہی عذاب کی خبر بھیج چکا ہوں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Allāh</em> dira : « Ne vous disputez pas en Ma présence, Je vous avais déjà envoyé l’avertissement.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\"><em>Dios</em> dirá: “No disputéis en Mi presencia, pues previamente os hice la advertencia”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er wird sprechen: \"Streitet nicht vor Mir, wo Ich euch die Warnung im voraus gesandt hatte.", "spanish": " “Que instaura a otro Dios en lugar de Al-lah. Así pues, arrojadle ambos al espantoso tormento”.", "urdu": " جو اللہ کے ساتھ دوسرے معبود بناتا تھا۔ سو تم آج اس کو سخت عذاب میں ڈال دو۔"}, {"arabic": " مَا یُبَدَّلُ الۡقَوۡلُ لَدَیَّ وَ مَاۤ اَنَا بِظَلَّامٍ لِّلۡعَبِیۡدِ ﴿٪۳۰﴾", "english": " ‘The sentence passed by Me cannot be changed, and I am not at all unjust to My servants.’", "french": " La parole ne peut être changée en Ma présence, et Je ne suis pas du tout injuste envers Mes serviteurs. »", "german": "", "spanish": " “La declaración no puede ser cambiada ante Mi presencia, y Yo no soy en absoluto injusto con Mis siervos”.", "urdu": " اور میرے حضور میں کوئی بات بدل کر نہیں پیش کی جا سکتی اور نہ میں اپنے بندوں پر کسی قسم کا ظلم کرنے والا ہوں۔"}, {"arabic": " یَوۡمَ نَقُوۡلُ لِجَہَنَّمَ ہَلِ امۡتَلَاۡتِ وَ تَقُوۡلُ ہَلۡ مِنۡ مَّزِیۡدٍ ﴿۳۱﴾", "english": " On that day We will say to Hell, ‘Art thou filled up?’, and it will answer, ‘Is there more?’", "french": " Ce jour-là, Nous dirons à l’Enfer : « Est-tu rempli ? » et il répondra : « Y en a-t-il encore ? »", "german": " An jenem Tage werden Wir zur Hölle sprechen: \"Bist du angefüllt?\", und sie wird antworten: \"Gibt es noch mehr?\"", "spanish": " En ese día diremos al Infierno: “¿Estás lleno?” y él responderá: “¿Hay más?”.", "urdu": " اس دن ہم جہنم سے کہیں گے‘ کیا تو بھر گئی؟ اور وہ کہے گی‘ کہ کیا کچھ اور بھی ہے؟"}, {"arabic": " وَ اُزۡلِفَتِ الۡجَنَّۃُ لِلۡمُتَّقِیۡنَ غَیۡرَ بَعِیۡدٍ ﴿۳۲﴾", "english": " And Heaven will be brought near to the righteous, no longer remote.", "french": " Et le Paradis sera rapproché des pieux ; il ne sera nullement loin d’eux .", "german": " Und das Paradies wird den Gerechten nahe gebracht werden, nicht länger fern.", "spanish": " Y el Cielo será acercado al justo, y no estará ya lejano,", "urdu": " اور اس دن جنت متقیوں کے ایسی قریب کر دی جائے گی کہ وہ اسے محسوس کرنے لگیں گے۔"}, {"arabic": " ہٰذَا مَا تُوۡعَدُوۡنَ لِکُلِّ اَوَّابٍ حَفِیۡظٍ ﴿ۚ۳۳﴾", "english": " ‘This is what was promised to you — to everyone who always turned to God and was watchful of his actions ,", "french": " « Voici ce qui vous a été promis – pour quiconque se tournait toujours vers Allāh, et qui était vigilant de ses actes ,", "german": " „Das ist´s, was euch verheißen ward – für jeden, der stets (Gott) zugewandt und wachsam war,", "spanish": " “Esto es lo que se os prometió: a quien ha vuelto siempre a Dios y vigilaba sus acciones.", "urdu": " اور کہا جائے گا کہ تم میں سے ہر جھکنے والے اور شریعت کی حفاظت کرنے والے سے اسی انعام کا وعدہ کیا گیا تھا۔"}, {"arabic": " مَنۡ خَشِیَ الرَّحۡمٰنَ بِالۡغَیۡبِ وَ جَآءَ بِقَلۡبٍ مُّنِیۡبِ ۣ﴿ۙ۳۴﴾", "english": " ‘Who feared the Gracious God in private and came to Him with a penitent heart.", "french": " Qui craignait le Dieu Gracieux en secret, et qui venait à Lui avec un cœur contrit.", "german": " der den Gnadenreichen fürchtete im geheimen und mit reuigem Herzen (zu Ihm) kam.", "spanish": " “Quien temía al Dios Clemente en privado y acudía a Él con corazón contrito”.", "urdu": " (یعنی اس سے) جو رحمن (خدا) سے پوشیدگی میں ڈرتا تھا اور جھکنے والے دل کے ساتھ اس کے پاس آیا تھا۔"}, {"arabic": " ادۡخُلُوۡہَا بِسَلٰمٍ ؕ ذٰلِکَ یَوۡمُ الۡخُلُوۡدِ ﴿۳۵﴾", "english": " ‘Enter ye therein in peace. This is the Day of Eternity.’", "french": " Entrez-y en paix. Voici le Jour de l’Eternité. «", "german": "", "spanish": " “Entrad allí en paz. Éste es el Día de la Eternidad”.", "urdu": " (ہم کہیں گے کہ) تم سب سلامتی کے ساتھ جنت میں داخل ہو جاٶ‘ یہ وہ برکت والا دن ہے جو کبھی ختم نہیں ہوگا۔"}, {"arabic": " لَہُمۡ مَّا یَشَآءُوۡنَ فِیۡہَا وَلَدَیۡنَا مَزِیۡدٌ ﴿۳۶﴾", "english": " They will have therein whatever they desire, and with Us is a good deal more.", "french": " Ils y auront tout ce qu’ils voudront, et auprès de Nous il y en a bien davantage.", "german": " Sie werden darin haben, was immer sie begehren, und bei Uns ist noch weit mehr.", "spanish": " Allí tendrán todo lo que deseen, pues con Nosotros hay mucho más.", "urdu": " وہ جو کچھ اس میں چاہیں گے سب ان کو ملے گا اور ہمارے پاس اس سے بھی زیادہ ان کو دینے کے لئے موجود ہے۔"}, {"arabic": " وَ کَمۡ اَہۡلَکۡنَا قَبۡلَہُمۡ مِّنۡ قَرۡنٍ ہُمۡ اَشَدُّ مِنۡہُمۡ بَطۡشًا فَنَقَّبُوۡا فِی الۡبِلَادِ ؕ ہَلۡ مِنۡ مَّحِیۡصٍ ﴿۳۷﴾", "english": " And how many a generation who were greater than they in power have We destroyed before them! But when the punishment came , they went about the lands. Was there any place of refuge for them ?", "french": " Et combien de générations qui étaient plus redoutables qu’eux avons-Nous anéanties avant eux ! Ils ont creusé des caves dans la terre. Y avaient-il un quelconque refuge pour eux ?", "german": " Doch wie so manche Völker haben Wir schon vor ihnen vertilgt, die stärker waren als sie an Macht! (Als die Strafe kam) suchten sie rings in den Landen. War da ein Zufluchtsort?", "spanish": " ¡A cuántas generaciones más poderosas hemos destruido antes de ellos! Pero cuando llegó el castigo, se esparcieron por la tierra. ¿Hubo acaso algún lugar de refugio para ellos?", "urdu": " اور ہم ان سے پہلے بہت سی قومیں ہلاک کر چکے ہیں وہ ان سے زیادہ گرفت کا مادہ رکھتی تھیں لیکن (جب عذاب آیا تو) انہوں نے ملک کے ہر گوشے میں اپنے بچاٶ کے لئے سرنگیں بچھا دیں مگر (ظاہر ہے کہ) خدا کے عذاب سے بچنے کی گنجائش کہاں ہو سکتی ہے۔"}, {"arabic": " اِنَّ فِیۡ ذٰلِکَ لَذِکۡرٰی لِمَنۡ کَانَ لَہٗ قَلۡبٌ اَوۡ اَلۡقَی السَّمۡعَ وَ ہُوَ شَہِیۡدٌ ﴿۳۸﴾", "english": " Therein, verily, is a reminder for him who has a heart, or who gives ear, and is attentive.", "french": " En vérité, il y a là un avertissement pour celui qui a un cœur, ou qui prête l’oreille, et qui est attentif.", "german": " Hierin ist wahrlich eine Ermahnung für den, der ein Herz hat oder der Gehör gibt und aufmerksam ist.", "spanish": " En esto hay, en verdad, un aviso para quien tiene corazón, presta oídos y está atento.", "urdu": " اس میں ہر شخص کے لئے جس کا سوچنے والا دل موجود ہے یا جو سننے کے لئے کان دھرتا اور غور بھی کرتا ہے نصیحت ہے۔"}, {"arabic": " وَ لَقَدۡ خَلَقۡنَا السَّمٰوٰتِ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَا فِیۡ سِتَّۃِ اَیَّامٍ ٭ۖ وَّ مَا مَسَّنَا مِنۡ لُّغُوۡبٍ ﴿۳۹﴾", "english": " And verily, We created the heavens and the earth and all that is between them in six periods, and no weariness touched Us.", "french": " Et en vérité, Nous avons créé les cieux et la terre, et tout ce qui est entre eux, en six périodes, et aucune lassitude ne Nous a touché.", "german": " Wahrlich, Wir erschufen die Himmel und die Erde und das, was zwischen beiden ist, in sechs Zeiten, und keine Ermüdung rührte Uns an.", "spanish": " Pues ciertamente creamos los cielos y la tierra y todo lo que hay entre ellos en seis períodos, y el cansancio no Nos afectó.", "urdu": " اور ہم نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے۔ ان سب کو چھ اوقات میں پیدا کیا اور ہم بالکل نہیں تھکے۔"}, {"arabic": " فَاصۡبِرۡ عَلٰی مَا یَقُوۡلُوۡنَ وَ سَبِّحۡ بِحَمۡدِ رَبِّکَ قَبۡلَ طُلُوۡعِ الشَّمۡسِ وَ قَبۡلَ الۡغُرُوۡبِ ﴿ۚ۴۰﴾", "english": " So bear with patience what they say, and glorify thy Lord with His praise, before the rising of the sun and before its setting;", "french": " Endure donc avec patience ce qu’ils disent, et glorifie ton Seigneur par Ses louanges, avant le lever du soleil et avant son coucher ;", "german": " Ertrage drum in Geduld, was sie sprechen, und verherrliche deinen Herrn mit Seiner Lobpreisung vor Aufgang der Sonne und vor dem Untergang;", "spanish": " Soporta, pues, con paciencia lo que dicen y glorifica a tu Señor on Sus alabanzas, antes de la salida del sol y antes de su ocaso;", "urdu": " پس جو کچھ وہ کہتے ہیں اس پر صبر کر اور سورج نکلنے سے پہلے اور ڈوبنے سے پہلے اپنے رب کی تسبیح کیا کر۔"}, {"arabic": " وَ مِنَ الَّیۡلِ فَسَبِّحۡہُ وَ اَدۡبَارَ السُّجُوۡدِ ﴿۴۱﴾", "english": " And in a part of the night also do thou glorify Him, and after prescribed prostrations.", "french": " Et rends-Lui gloire aussi pendant une partie de la nuit, et après les prosternations prescrites .", "german": " auch in einem Teile der Nacht lobpreise Ihn, und nach jedem Gebet.", "spanish": " Y glorifícalo también en una parte de la noche, así como después de las postraciones prescritas.", "urdu": " اور رات کے وقت بھی اس کی تسبیح کیا کر اور ہر عبادت کے آخر میں بھی (ایسا ہی کیا کر) ۔"}, {"arabic": " وَ اسۡتَمِعۡ یَوۡمَ یُنَادِ الۡمُنَادِ مِنۡ مَّکَانٍ قَرِیۡبٍ ﴿ۙ۴۲﴾", "english": " And listen! The day when the crier will cry from a place nearby,", "french": " Et écoute ! Le jour où un crieur lancera un appel d’un endroit tout proche,", "german": " Und höre zu! der Tag, wenn der Rufer rufen wird von naher Stätte,", "spanish": " ¡Y escucha! El día en que el convocador haga surgir la llamada desde lugares cercanos.", "urdu": " اور (اے نبی)! سن رکھ کہ ایک دن پکارنے والا قریب کی جگہ سے پکارے گا۔"}, {"arabic": " یَّوۡمَ یَسۡمَعُوۡنَ الصَّیۡحَۃَ بِالۡحَقِّ ؕ ذٰلِکَ یَوۡمُ الۡخُرُوۡجِ ﴿۴۳﴾", "english": " The day when they will hear the blast in truth; that will be the day of coming forth from the graves .", "french": " Le jour où ils entendront assurément l’explosion ; ce sera là le jour de la sortie des tombes .", "german": " der Tag, wenn sie in Wahrheit den Posaunenstoß hören werden, das wird der Tag des Hervorkommens (aus den Gräbern) sein.", "spanish": " El Día en que en verdad oigan el clamor; ese será el día de la salida de las tumbas .", "urdu": " جس دن کہ سب لوگ ایک پورا ہو کر رہنے والے عذاب کی آواز سنیں گے۔ یہ دن زندہ ہو کر نکلنے کا دن ہوگا۔"}, {"arabic": " اِنَّا نَحۡنُ نُحۡیٖ وَ نُمِیۡتُ وَ اِلَیۡنَا الۡمَصِیۡرُ ﴿ۙ۴۴﴾", "english": " Verily, it is We Who give life and cause death, and to Us is the final return.", "french": " En vérité, c’est Nous Qui donnons la vie et Qui causons la mort, et vers Nous est la destination,", "german": " Wahrlich, Wir Selbst geben Leben und Tod, und zu Uns ist die Heimkehr.", "spanish": " En verdad, somos Nosotros quienes damos la vida y causamos la muerte, y hacia Nosotros es el retorno final.", "urdu": " ہم ہی زندہ کرتے ہیں اور مارتے بھی ہیں اور ہماری طرف ہی لوٹ کر آنا ہے۔"}, {"arabic": " یَوۡمَ تَشَقَّقُ الۡاَرۡضُ عَنۡہُمۡ سِرَاعًا ؕ ذٰلِکَ حَشۡرٌ عَلَیۡنَا یَسِیۡرٌ ﴿۴۵﴾", "english": " On the day when the earth will cleave asunder from over them and they will come forth hastening — that will be a gathering together, quite easy for Us.", "french": " Le jour où la terre se fendra au-dessus d’eux, dû à la vitesse de son mouvement– ce sera là un rassemblement facile pour Nous.", "german": " An dem Tage, wenn sich die Erde ihretwegen spalten wird (und sie hervorgehen werden) in Hast – das wird ein Versammeln sein, ganz leicht für Uns.", "spanish": " En el día en que la tierra se rompa en pedazos por encima de ellos y salgan apresuradamente: ésa será la reunión de todos, muy fácil para Nosotros.", "urdu": " وہ دن کہ زمین ان کی شرارتوں کی وجہ سے پھٹ جائے گی (اسے یاد کر‘ اور) وہ اس سے جلدی جلدی نکلیں گے۔ یہ مردوں کا زندہ کر دینا ہم پر آسان ہے۔"}], "Surah": 50}