{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یٰۤاَیُّہَا الۡمُزَّمِّلُ ۙ﴿۲﴾", "english": " O thou who art bearing a heavy responsibility ,", "french": " Ô toi qui t’ es enveloppé dans ta robe !", "german": " O du Verhüllter!", "spanish": " Oh, tú, que te has envuelto en un manto,", "urdu": " اے چادر میں لپٹے ہوئے (خدا کی رحمت کا انتظار کرنے والے)"}, {"arabic": " قُمِ الَّیۡلَ اِلَّا قَلِیۡلًا ۙ﴿۳﴾", "english": " Stand up in Prayer at night except a small portion thereof —", "french": " Tiens-toi debout en Prière la nuit, à l’exception d’une petite partie –", "german": " Erhebe dich und verbringe die Nacht im Gebet, stehend, bis auf ein kleines –", "spanish": " Levántate en oración por la noche, salvo en una pequeña parte de la misma;", "urdu": " راتوں کو اٹھ اٹھ کے عبادت کر جس سے ہماری مراد یہ ہے کہ رات کا اکثر حصہ عبادت میں گذارا کر یعنی اس کا نصف یا نصف سے کچھ کم کردے۔"}, {"arabic": " نِّصۡفَہٗۤ اَوِ انۡقُصۡ مِنۡہُ قَلِیۡلًا ۙ﴿۴﴾", "english": " Half of it, or make it a little less than that", "french": " Sa moitié, ou réduis-en un petit peu,", "german": " die Hälfte davon, oder verringere es ein wenig,", "spanish": " La mitad, o quita un poco de ella,", "urdu": " راتوں کو اٹھ اٹھ کے عبادت کر جس سے ہماری مراد یہ ہے کہ رات کا اکثر حصہ عبادت میں گذارا کر یعنی اس کا نصف یا نصف سے کچھ کم کردے۔"}, {"arabic": " اَوۡ زِدۡ عَلَیۡہِ وَ رَتِّلِ الۡقُرۡاٰنَ تَرۡتِیۡلًا ؕ﴿۵﴾", "english": " Or make it a little more than that — and recite the Qur’an slowly and thoughtfully.", "french": " Ou ajoutes-y un petit peu – et récite le Coran lentement et clairement.", "german": " oder füge ein wenig hinzu – und sprich den Qur-ân langsam und besinnlich.", "spanish": " O auméntala un poco más de eso; y recita el Corán lenta y atentamente.", "urdu": " یا اس پر کچھ اور بڑھا دے۔ اور قرآن کو خوش الحانی سے پڑھا کر۔"}, {"arabic": " اِنَّا سَنُلۡقِیۡ عَلَیۡکَ قَوۡلًا ثَقِیۡلًا ﴿۶﴾", "english": " Verily, We are charging thee with a weighty Word.", "french": " En vérité, Nous allons te charger d’une lourde Parole.", "german": " Fürwahr, Wir legen dir da ein Wort auf, das gewichtig ist.", "spanish": " En verdad, te imponemos una Palabra de peso.", "urdu": " ہم تجھ پر ایک ایسا کلام اتارنے والے ہیں (جو ذمہ واری کے لحاظ سے) بڑا بوجھل ہے۔"}, {"arabic": " اِنَّ نَاشِئَۃَ الَّیۡلِ ہِیَ اَشَدُّ وَطۡاً وَّ اَقۡوَمُ قِیۡلًا ؕ﴿۷﴾", "english": " Verily, getting up at night is the most potent means of subduing the self and most effective in respect of words of prayer .", "french": " En vérité, se lever la nuit pour prier est le moyen le plus efficace pour maîtriser le moi , et le moyen pour rendre la parole plus ferme.", "german": " Wahrlich, die Nachtwache ist die beste Zeit zur Selbstzucht und zur Erreichung von Aufrichtigkeit im Wort.", "spanish": " En verdad, levantarse por la noche es el medio más poderoso para ometer el yo y el más efectivo respecto a las palabras de la oración.", "urdu": " رات کا اٹھنا نفس کو پیروں کے نیچے مسلنے میں سب سے کامیاب نسخہ ہے اور رات کے جاگنے والوں کو سچ کی بھی عادت پڑ جاتی ہے۔"}, {"arabic": " اِنَّ لَکَ فِی النَّہَارِ سَبۡحًا طَوِیۡلًا ؕ﴿۸﴾", "english": " Thou hast indeed, during the day, a long chain of engagements.", "french": " En vérité, tu as pendant la journée une longue série d’obligations.", "german": " Du hast ja gewiss während des Tages eine lange Beschäftigung.", "spanish": " En efecto, durante el día tienes una larga cadena de quehaceres.", "urdu": " تجھے دن کے وقت بہت سا کام ہوتا ہے۔"}, {"arabic": " وَ اذۡکُرِ اسۡمَ رَبِّکَ وَ تَبَتَّلۡ اِلَیۡہِ تَبۡتِیۡلًا ؕ﴿۹﴾", "english": " So remember the name of thy Lord, and devote thyself to Him with full devotion.", "french": " Aussi souviens-toi du nom de ton Seigneur, et dévoue-toi à Lui d’un dévouement total.", "german": " So gedenke des Namens deines Herrn und weihe dich Ihm ausschließlich.", "spanish": " Recuerda, pues, el nombre de tu Señor y dedícate a Él con plena devoción.", "urdu": " اور چاہیے کہ تو اپنے رب کی صفات کو یاد کیا کر اور اسی سے دل لگایا کر۔"}, {"arabic": " رَبُّ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ لَاۤ اِلٰہَ اِلَّا ہُوَ فَاتَّخِذۡہُ وَکِیۡلًا ﴿۱۰﴾", "english": " He is the Lord of the East and the West; there is no God but He; so take Him as thy Guardian.", "french": " Il est le Seigneur de l’Orient et de l’Occident ; il n’y a de dieu que Lui ; prends-Le donc pour ton Protecteur.", "german": " Herr des Ostens und des Westens – es gibt keinen Gott außer Ihm; drum nimm Ihn zum Beschützer.", "spanish": " Él es el Señor del Oriente y el Occidente; no hay otro Dios sino Él; tómalo, pues, como tu Guardián.", "urdu": " وہ مشرق کا بھی رب ہے اور مغرب کا بھی رب ہے۔ اس کے سوا کوئی معبود نہیں ہے۔ پس اسی کو اپنا کارساز بنا۔"}, {"arabic": " وَ اصۡبِرۡ عَلٰی مَا یَقُوۡلُوۡنَ وَ اہۡجُرۡہُمۡ ہَجۡرًا جَمِیۡلًا ﴿۱۱﴾", "english": " And bear patiently all that they say; and part with them in a decent manner.", "french": " Et endure avec patience tout ce qu’ils disent ; et quitte-les d’une manière convenable.", "german": " Und ertrage in Geduld alles, was sie reden; und scheide dich von ihnen in geziemender Art.", "spanish": " Soporta con paciencia todo lo que dicen; y aléjate de ellos con elegancia.", "urdu": " اور جو کچھ وہ (تیرے مخالف) کہتے ہیں اس پر صبر کر اور شریفانہ طور پر ان سے الگ ہو جا۔"}, {"arabic": " وَ ذَرۡنِیۡ وَ الۡمُکَذِّبِیۡنَ اُولِی النَّعۡمَۃِ وَ مَہِّلۡہُمۡ قَلِیۡلًا ﴿۱۲﴾", "english": " And leave Me alone with those who reject the truth , possessors of ease and plenty; and give them a little respite.", "french": " Et laisse-Moi Seul avec ceux qui rejettent la vérité , possesseurs de l’aisance et du confort ; et donne-leur un peu de répit.", "german": " Und lass Mich allein mit denen, die die Wahrheit verwerfen und in Üppigkeit und Behagen leben; und gewähre ihnen eine kleine Frist.", "spanish": " Y déjame sólo con quienes rechazan la verdad, poseedores de comodidades y confort; y dales un pequeño respiro.", "urdu": " اور نعمت والے (مالدار) منکروں کو اور مجھ کو اکیلا چھوڑ دے اور تو ان کو کچھ ڈھیل دے (اور ان کی جلد تباہی کی دعا نہ کیا کر میں خود ہی ان کو تباہ کر دوں گا)"}, {"arabic": " اِنَّ لَدَیۡنَاۤ اَنۡکَالًا وَّ جَحِیۡمًا ﴿ۙ۱۳﴾", "english": " Surely, with Us are heavy fetters and a raging fire,", "french": " Assurément, avec Nous il y a des chaînes lourdes et une Fournaise,", "german": " Bei Uns sind schwere Fesseln und ein rasendes Feuer", "spanish": " En verdad, a Nuestro lado están los grilletes pesados y un fuego devastador.", "urdu": " ہمارے پاس قسم قسم کی بیڑیاں اور جہنم ہے۔"}, {"arabic": " وَّ طَعَامًا ذَا غُصَّۃٍ وَّ عَذَابًا اَلِیۡمًا ﴿٭۱۴﴾", "english": " And food that chokes, and a painful punishment —", "french": " Et de la nourriture qui étouffe, et un châtiment douloureux –", "german": " und erstickende Speise und schmerzliche Strafe,", "spanish": " Un alimento que se atraganta y un castigo doloroso.", "urdu": " اور ایسا کھانا بھی ہے جو گلے میں پھنستا ہے اور دردناک عذاب بھی ہے۔"}, {"arabic": " یَوۡمَ تَرۡجُفُ الۡاَرۡضُ وَ الۡجِبَالُ وَ کَانَتِ الۡجِبَالُ کَثِیۡبًا مَّہِیۡلًا ﴿۱۵﴾", "english": " On the day when the earth and the mountains shall quake, and the mountains will become like crumbling sandhills.", "french": " Le jour où la terre et les montagnes trembleront, et où les montagnes deviendront comme des dunes qui s’effondrent.", "german": " am Tage, da die Erde und die Berge erbeben und die Berge Haufen von rinnendem Sand werden sollen.", "spanish": " En el día en que la tierra y las montañas se agitarán, y las montañas se convertirán en dunas de arena que se desmoronan.", "urdu": " جس دن زمین اور پہاڑ کانپیں گے اور پہاڑ ایسے ٹیلوں کی طرح ہو جائیں گے جو خود بخود پھسلے جاتے ہیں (اس دن وہ عذاب آئے گا)"}, {"arabic": " اِنَّاۤ اَرۡسَلۡنَاۤ اِلَیۡکُمۡ رَسُوۡلًا ۬ۙ شَاہِدًا عَلَیۡکُمۡ کَمَاۤ اَرۡسَلۡنَاۤ اِلٰی فِرۡعَوۡنَ رَسُوۡلًا ﴿ؕ۱۶﴾", "english": " Verily, We have sent to you a Messenger, who is a witness over you, even as We sent a Messenger to Pharaoh.", "french": " En vérité, Nous vous avons envoyé un Messager qui est un témoin sur vous, tout comme Nous avions envoyé un Messager à Pharaon ;", "german": " Wahrlich, Wir haben euch einen Gesandten geschickt, der ein Zeuge ist über euch, wie Wir zu Pharao einen Gesandten schickten.", "spanish": " En verdad, os hemos enviado a un Mensajero, que es testigo sobre vosotros, al igual que enviamos un Mensajero al Faraón.", "urdu": " اے لوگو! ہم نے تمہاری طرف ایک ایسا رسول بھیجا ہے جو تم پر نگران ہے اسی طرح جس طرح فرعون کی طرف رسول بھیجا تھا۔"}, {"arabic": " فَعَصٰی فِرۡعَوۡنُ الرَّسُوۡلَ فَاَخَذۡنٰہُ اَخۡذًا وَّبِیۡلًا ﴿۱۷﴾", "english": " But Pharaoh disobeyed the Messenger, so We seized him with a terrible seizing.", "french": " Mais Pharaon désobéit au Messager ; alors Nous l’avons saisi d’une étreinte terrible.", "german": " Doch Pharao widersetzte sich dem Gesandten, drum erfassten Wir ihn mit schrecklichem Griff.", "spanish": " Pero el Faraón desobedeció al Mensajero, por lo que caímos sobre Él con un terrible castigo.", "urdu": " پھر فرعون نے اس رسول کی نافرمانی کی تھی۔ اور ہم نے اس کو ایک وبال والے عذاب سے پکڑ لیاتھا۔"}, {"arabic": " فَکَیۡفَ تَتَّقُوۡنَ اِنۡ کَفَرۡتُمۡ یَوۡمًا یَّجۡعَلُ الۡوِلۡدَانَ شِیۡبَاۨ ﴿٭ۖ۱۸﴾", "english": " How will you then, if you disbelieve, guard yourselves against a day which will turn children greyheaded?", "french": " Comment donc, si vous êtes mécréants vous garderez-vous contre un jour qui fera grisonner les enfants ?", "german": " Wie wollt ihr euch, wenn ihr ungläubig seid, wohl schützen vor einem Tag, der Kinder greis macht?", "spanish": " ¿Cómo os protegeréis, pues, si no creéis, contra un día que hará que el cabello de los niños encanezca?", "urdu": " اور بتاٶ تو اگر تم نے اس دن کا انکار کیا۔ جو جوانوں کو بڈھا بنا دیتا ہے تو تم کس طرح (عذاب سے) محفوظ رہو گے۔"}, {"arabic": " السَّمَآءُ مُنۡفَطِرٌۢ بِہٖ ؕ کَانَ وَعۡدُہٗ مَفۡعُوۡلًا ﴿۱۹﴾", "english": " On that day the heaven will be rent asunder and His promise will be fulfilled.", "french": " Et qui fera que le ciel se fende en morceaux ; Sa promesse sera accomplie.", "german": " (Dem Tage) da der Himmel sich spalten wird! Seine Verheißung muss in Erfüllung gehen.", "spanish": " En ese día los cielos se dividirán en trozos y se cumplirá Su promesa.", "urdu": " آسمان خود ہی اس عذاب سے پھٹ جانے والا ہے۔ یہ اس (خدا) کا وعدہ ہے جو پورا ہو کر رہے گا۔"}, {"arabic": " اِنَّ ہٰذِہٖ تَذۡکِرَۃٌ ۚ فَمَنۡ شَآءَ اتَّخَذَ اِلٰی رَبِّہٖ سَبِیۡلًا ﴿٪۲۰﴾", "english": " This, surely, is a reminder. So let him, who will, take a way unto his Lord.", "french": " Ceci, assurément, est un Rappel. Alors, que celui qui le veut, prenne une voie vers son Seigneur.", "german": " Dies ist fürwahr eine Ermahnung. So nehme nun, wer da will, den Weg zu seinem Herrn.", "spanish": " Esto es, en verdad, un recordatorio. Así pues, que tome el camino que lleva a su Señor quien lo desee.", "urdu": " یہ (قرآن) ایک نصیحت ہے۔ پس جو چاہے اپنے رب کی طرف جانے والا راستہ اختیار کرلے۔"}], "Surah": 73}