{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِذَا السَّمَآءُ انۡفَطَرَتۡ ۙ﴿۲﴾", "english": " When the heaven is cleft asunder,", "french": " Quand le ciel sera fendu,", "german": " Wenn der Himmel sich spaltet,", "spanish": " Cuando el cielo se divida en pedazos,", "urdu": " جب آسمان پھٹ جائے گا۔"}, {"arabic": " وَ اِذَا الۡکَوَاکِبُ انۡتَثَرَتۡ ۙ﴿۳﴾", "english": " And when the stars are scattered,", "french": " Et quand les étoiles seront dispersées,", "german": " und wenn die Sterne zerstreut sind,", "spanish": " Cuando las estrellas se dispersen,", "urdu": " اور جب ستارے جھڑ جائیں گے۔"}, {"arabic": " وَ اِذَا الۡبِحَارُ فُجِّرَتۡ ﴿ۙ۴﴾", "english": " And when the rivers are made to flow forth into canals ,", "french": " Et quand les limites des mers seront rompues,", "german": " und wenn die Meere entströmen werden,", "spanish": " Cuando se haga fluir a los océanos en canales .", "urdu": " اور جب سمندر پھاڑ کر ملا دئے جائیں گے۔"}, {"arabic": " وَ اِذَا الۡقُبُوۡرُ بُعۡثِرَتۡ ۙ﴿۵﴾", "english": " And when the graves are laid open,", "french": " Et quand les tombes seront éventrées,", "german": " und wenn die Gräber aufgerissen sind,", "spanish": " Y cuando se abran las tum­bas,", "urdu": " اور جب قبریں اکھیڑ کر ادھر ادھر بکھیر دی جائیں گی۔"}, {"arabic": " عَلِمَتۡ نَفۡسٌ مَّا قَدَّمَتۡ وَ اَخَّرَتۡ ؕ﴿۶﴾", "english": " Each soul shall then know what it has sent forth and what it has held back.", "french": " Chaque âme saura alors ce qu’elle aura réalisé, et ce qu’elle aura négligé.", "german": " dann wird die Seele wissen, was sie getan und was sie unterlassen hat.", "spanish": " Toda alma sabrá entonces lo que ha enviado por delante y lo ue ha dejado detrás .", "urdu": " تب وہ بڑی (خطا کار) جان (جس کا یہاں ذکر ہے) جان لے گی کہ کیا (کچھ) اس نے آگے بھیجا ہے اور کیا (کچھ) پیچھے چھوڑا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الۡاِنۡسَانُ مَا غَرَّکَ بِرَبِّکَ الۡکَرِیۡمِ ۙ﴿۷﴾", "english": " O man, what has emboldened thee against thy Gracious Lord,", "french": " Ô homme, qu’est-ce qui t’a trompé au sujet de ton Seigneur, le Noble", "german": " O Mensch, was hat dich kühn gemacht gegen deinen gnadenvollen Herrn,", "spanish": " Oh, hombre, ¿qué te ha enva­lentonado contra tu Señor Clemente,", "urdu": " اے انسان! تجھے کس نے تیرے رب کریم کے بارے میں مغرور (اور دھوکہ خوردہ) بنا دیا ہے۔"}, {"arabic": " الَّذِیۡ خَلَقَکَ فَسَوّٰٮکَ فَعَدَلَکَ ۙ﴿۸﴾", "english": " Who created thee, then perfected thee, then proportioned thee aright?", "french": " Qui t’a créé, puis t’a rendu parfait, puis t’a façonné à proportion ?", "german": " Der dich erschuf und dann dich vollendete und gestaltete?", "spanish": " Quien te creó, y después te perfeccionó, haciéndote proporcio­nado en todo ?", "urdu": " (اس رب کے بارے میں) جس نے تجھے پیدا کیا پھر تجھے (یعنی تیری اندرونی قوتوں کو) درست کیا۔ پھر تجھے مناسب قوتیں بخشیں۔"}, {"arabic": " فِیۡۤ اَیِّ صُوۡرَۃٍ مَّا شَآءَ رَکَّبَکَ ؕ﴿۹﴾", "english": " In whatever form He pleased, He fashioned thee.", "french": " Dans quelque forme qu’Il a voulu, Il t’a façonné.", "german": " In der Form, die Ihm beliebte, hat Er dich gebildet.", "spanish": " En cuantas formas Le agradó, te modeló.", "urdu": " پھر جو صورت اس نے پسند کی‘ اس میں تجھے ڈھالا۔"}, {"arabic": " کَلَّا بَلۡ تُکَذِّبُوۡنَ بِالدِّیۡنِ ۙ﴿۱۰﴾", "english": " Nay, but you deny the Judgment.", "french": " Non, mais vous niez le Jugement.", "german": " Nein, ihr leugnet das Gericht.", "spanish": " ¡No!, mas negáis el Juicio.", "urdu": " ایسا ہرگز نہیں (جو تم خیال کرتے ہو) بلکہ تم تو جزا و سزا کو جھٹلاتے ہو۔"}, {"arabic": " وَ اِنَّ عَلَیۡکُمۡ لَحٰفِظِیۡنَ ﴿ۙ۱۱﴾", "english": " But there are guardians over you", "french": " Et, en vérité, il y a sur vous des gardiens,", "german": " Jedoch es sind fürwahr Wächter über euch,", "spanish": " Pero hay guardianes sobre vosotros.", "urdu": " اور یقیناً تم پر (تمہارے خدا کی طرف سے) نگران مقرر ہیں۔"}, {"arabic": " کِرَامًا کَاتِبِیۡنَ ﴿ۙ۱۲﴾", "english": " Honoured recorders,", "french": " Qui sont des enregistreurs honorés,", "german": " ehrwürdige Verzeichner,", "spanish": " Registradores ilustres,", "urdu": " (جو) شریف (اور) ہر بات کو لکھنے والے ہیں۔"}, {"arabic": " یَعۡلَمُوۡنَ مَا تَفۡعَلُوۡنَ ﴿۱۳﴾", "english": " Who know all that you do.", "french": " Qui savent tout ce que vous faites.", "german": " die wissen, was ihr tut.", "spanish": " Que saben todo lo que hacéis.", "urdu": " تم جو کچھ بھی کرتے ہو وہ اسے جانتے ہیں۔"}, {"arabic": " اِنَّ الۡاَبۡرَارَ لَفِیۡ نَعِیۡمٍ ﴿ۚ۱۴﴾", "english": " Verily, the virtuous will be in bliss;", "french": " En vérité, les vertueux seront dans la Félicité ;", "german": " Wahrlich, die Rechtschaffenen werden in der Wonne sein", "spanish": " En verdad, el virtuoso estará en la felicidad;", "urdu": " یقیناً نیکیوں میں بڑھ جانے والے لوگ (ہمیشہ) نعمت میں (رہتے) ہیں۔"}, {"arabic": " وَ اِنَّ الۡفُجَّارَ لَفِیۡ جَحِیۡمٍ ﴿ۚۖ۱۵﴾", "english": " And the wicked will be in Hell;", "french": " Et, en vérité, les impies seront en Enfer ;", "german": " und die Frevler in der Hölle.", "spanish": " Y el perverso estará en el Infierno;", "urdu": " اور بدکار لوگ یقیناً جہنم میں (رہتے) ہیں۔"}, {"arabic": " یَّصۡلَوۡنَہَا یَوۡمَ الدِّیۡنِ ﴿۱۶﴾", "english": " They will burn therein on the Day of Judgment;", "french": " Ils y brûleront le Jour du Jugement ;", "german": " Sie werden dort eingehen am Tage des Gerichts;", "spanish": " Allí se quemarán en el Día del Juicio;", "urdu": " وہ (خصوصیت کے ساتھ) اس میں جزا سزا کے دن داخل ہونگے۔"}, {"arabic": " وَ مَا ہُمۡ عَنۡہَا بِغَآئِبِیۡنَ ﴿ؕ۱۷﴾", "english": " And they will not be able to escape therefrom.", "french": " Et ils ne pourront ne pas y être présents.", "german": " und sie werden nicht imstande sein, daraus zu entrinnen.", "spanish": " Y no podrán escapar de él .", "urdu": " اور وہ کسی طرح بھی اس سے بچ کر غائب نہیں ہو سکتے۔"}, {"arabic": " وَ مَاۤ اَدۡرٰٮکَ مَا یَوۡمُ الدِّیۡنِ ﴿ۙ۱۸﴾", "english": " And what should make thee know what the Day of Judgment is!", "french": " Et qu’est-ce qui te ferait savoir ce qu’est le Jour du Jugement ?", "german": " Und was lehrt dich wissen, was der Tag des Gerichts ist?", "spanish": " ¿Qué te dará a conocer lo que es el Día del Juicio?", "urdu": " اور (اے مخاطب)! تجھے کس نے اس بات کا علم دیا ہے کہ جزا سزا کا وقت کیا ہے۔"}, {"arabic": " ثُمَّ مَاۤ اَدۡرٰٮکَ مَا یَوۡمُ الدِّیۡنِ ﴿ؕ۱۹﴾", "english": " Again, what should make thee know what the Day of Judgment is!", "french": " Encore une fois, qu’est-ce qui te ferait savoir ce qu’est le Jour du Jugement ?", "german": " Und wiederum, was lehrt dich wissen, was der Tag des Gerichts ist?", "spanish": " Una vez más, ¿qué te dará a conocer lo que es el Día del Juicio?", "urdu": " پھر (ہم تجھے کہتے ہیں کہ) تجھے کس نے علم دیا ہے کہ جزا سزا کا وقت کیا ہے۔"}, {"arabic": " یَوۡمَ لَا تَمۡلِکُ نَفۡسٌ لِّنَفۡسٍ شَیۡئًا ؕ وَ الۡاَمۡرُ یَوۡمَئِذٍ لِّلّٰہِ ﴿٪۲۰﴾", "english": " The day when a soul shall have no power to do aught for another soul! And the command on that day will be Allah’s.", "french": " Le jour où aucune âme ne pourra rien en faveur d'une autre âme ! Et le commandement, ce jour-là, appartiendra à Allāh Seul .", "german": " Der Tag, da keine Seele etwas für eine andere Seele zu tun vermag! Und der Befehl an jenem Tage ist Allahs.", "spanish": " ¡El día en que el alma no tendrá poder alguno para hacer nada por tra alma! Y el mandato, en ese día, pertenecerá a Al-lah.", "urdu": " (یہ وقت) اس دن (ہوگا) جس میں کوئی جان کسی جان کو فائدہ پہنچانے کے لئے کوئی اختیار نہ رکھے گی اور سب فیصلہ اس دن اللہ ہی کے ہاتھ میں ہوگا۔"}], "Surah": 82}