{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سَبَّحَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ۚ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۲﴾", "english": " Whatever is in the heavens and whatever is in the earth glorifies Allah; and He is the Mighty, the Wise.", "french": " Tout ce qui est dans les cieux et tout ce qui est sur la terre glorifient Allāh ; et Il est le Puissant, le Sage.", "german": " Was in den Himmeln und was auf Erden ist, preist Allah; und Er ist der Allmächtige, der Allweise.", "spanish": " Cuanto hay en los cielos y cuanto hay en la tierra glorifica a Al-lah; pues Él es el Poderoso, el Sabio.", "urdu": " آسمانوں اور زمین میں جو کچھ بھی ہے‘ اللہ کی تسبیح کر رہا ہے‘ اور وہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لِمَ تَقُوۡلُوۡنَ مَا لَا تَفۡعَلُوۡنَ ﴿۳﴾", "english": " O ye who believe! why do you say what you do not do?", "french": " Ô vous qui croyez ! pourquoi dites-vous ce que vous ne faites pas ?", "german": " O die ihr glaubt, warum sagt ihr, was ihr nicht tut?", "spanish": " ¡Oh vosotros, los creyentes! ¿Por qué decís lo que no hacéis?", "urdu": " اے مومنو! تم وہ باتیں کیوں کہتے ہو‘ جو کرتے نہیں۔"}, {"arabic": " کَبُرَ مَقۡتًا عِنۡدَ اللّٰہِ اَنۡ تَقُوۡلُوۡا مَا لَا تَفۡعَلُوۡنَ ﴿۴﴾", "english": " Most hateful is it in the sight of Allah that you say what you do not do.", "french": " C’est extrêmement odieux aux yeux d'Allāh que ce que vous dites vous ne le faites pas.", "german": " Höchst hassenswert ist es vor Allah, dass ihr sagt, was ihr nicht tut.", "spanish": " A la vista de Al-ah es sumamente odioso que digáis lo que no hacéis.", "urdu": " خدا کے نزدیک اس بات کا دعویٰ کرنا جو تم کرتے نہیں‘ بہت ناپسند ہے۔"}, {"arabic": " اِنَّ اللّٰہَ یُحِبُّ الَّذِیۡنَ یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِہٖ صَفًّا کَاَنَّہُمۡ بُنۡیَانٌ مَّرۡصُوۡصٌ ﴿۵﴾", "english": " Verily, Allah loves those who fight in His cause arrayed in solid ranks, as though they were a strong structure cemented with molten lead.", "french": " En vérité, Allāh aime ceux qui combattent pour Sa cause en rangs serrés , comme s’ils étaient une structure solide soudée au plomb.", "german": " Allah liebt diejenigen, die für Seine Sache kämpfen, (in Schlachtordnung) gereiht, als wären sie ein mit Blei gelöteter, festgefügter Bau.", "spanish": " En verdad, Al-lah ama a quienes combaten por Su causa dispuestos en filas apretadas, como si fuesen un sólida estructura cementada con plomo fundido.", "urdu": " اللہ تو ان لوگوں کو پسند کرتا ہے جو اس کے رستہ میں صف باندھ کر لڑتے ہیں گویا وہ ایک دیوار ہیں جس کی مضبوطی کے لئے اس پر سیسہ پگھلا کر ڈالا گیا ہو۔"}, {"arabic": " وَ اِذۡ قَالَ مُوۡسٰی لِقَوۡمِہٖ یٰقَوۡمِ لِمَ تُؤۡذُوۡنَنِیۡ وَ قَدۡ تَّعۡلَمُوۡنَ اَنِّیۡ رَسُوۡلُ اللّٰہِ اِلَیۡکُمۡ ؕ فَلَمَّا زَاغُوۡۤا اَزَاغَ اللّٰہُ قُلُوۡبَہُمۡ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الۡفٰسِقِیۡنَ ﴿۶﴾", "english": " And remember when Moses said to his people, ‘O my people, why do you vex and slander me and you know that I am Allah’s Messenger unto you?’ So when they deviated from the right course , Allah caused their hearts to deviate, for Allah guides not the rebellious people.", "french": " Et souvenez-vous quand Moïse dit à son peuple : « Ô mon peuple, pourquoi me maltraitez-vous, alors que vous savez que je suis pour vous le Messager d’Allāh ? » Alors, quand ils dévièrent du droit chemin , Allāh fit dévier leurs cœurs, car Allāh ne guide pas le peuple rebelle.", "german": " Und (gedenke der Zeit) da Moses zu seinem Volke sprach: \"O mein Volk, warum kränkt ihr mich, da ihr doch wisset, dass ich Allahs Gesandter an euch bin?\" Wie sie nun eine krumme Richtung nahmen, da ließ Allah ihre Herzen krumm werden, denn Allah weist nicht dem widerspenstigen Volk den Weg.", "spanish": " Acordaos de cuando Moisés dijo a su pueblo: “Oh, pueblo mío, ¿por qué me herís sabiendo que soy el Mensajero de Al-lah para vosotros?”. Así, cuando se desviaron del camino recto, Al-lah hizo que sus corazones se desviaran, pues Al-lah no guía a los hombres rebeldes.", "urdu": " اور (یاد کرو) جب موسیٰ نے اپنی قوم سے کہا‘ اے میری قوم! تم مجھے کیوں دکھ دیتے ہو‘ حالانکہ تم جانتے ہو کہ میں تمہاری طرف اللہ کی طرف سے رسول ہو کر آیا ہوں۔ مگر جب اس کے باوجود وہ لوگ سیدھے راستہ سے بھٹک گئے تو اللہ نے ان کے دلوں کو ٹیڑھا کر دیا اور اللہ اطاعت سے نکل جانے والوں کو کامیابی کا راستہ نہیں دکھاتا۔"}, {"arabic": " وَ اِذۡ قَالَ عِیۡسَی ابۡنُ مَرۡیَمَ یٰبَنِیۡۤ اِسۡرَآءِیۡلَ اِنِّیۡ رَسُوۡلُ اللّٰہِ اِلَیۡکُمۡ مُّصَدِّقًا لِّمَا بَیۡنَ یَدَیَّ مِنَ التَّوۡرٰٮۃِ وَ مُبَشِّرًۢا بِرَسُوۡلٍ یَّاۡتِیۡ مِنۡۢ بَعۡدِی اسۡمُہٗۤ اَحۡمَدُ ؕ فَلَمَّا جَآءَہُمۡ بِالۡبَیِّنٰتِ قَالُوۡا ہٰذَا سِحۡرٌ مُّبِیۡنٌ ﴿۷﴾", "english": " And remember when Jesus, son of Mary, said, ‘O children of Israel, surely I am Allah’s Messenger unto you, fulfilling that which is before me of the Torah, and giving glad tidings of a Messenger who will come after me. His name will be Ahmad.’ And when he came to them with clear proofs, they said, ‘This is clear enchantment.’", "french": " Et souvenez-vous quand Jésus, fils de Marie, dit : « Ô Enfants d’Israël, assurément je suis pour vous le Messager d’Allāh, accomplissant ce qui a été mentionné dans la Torah avant moi, et annonçant la bonne nouvelle d’un Messager qui viendra après moi. Son nom sera Ahmad. » Et lorsqu’il vint à eux avec des preuves évidentes, ils dirent : « Ceci est de la magie manifeste. »", "german": " Und (gedenke der Zeit) da Jesus, Sohn der Maria, sprach: \"O ihr Kinder Israels, ich bin Allahs Gesandter an euch, Erfüller dessen, was von der Thora vor mir ist, und Bringer der frohen Botschaft von einem Gesandten, der nach mir kommen wird. Sein Name wird Ahmad sein.\" Und als er zu ihnen kam mit deutlichen Zeichen, sprachen sie: \"Das ist offenkundiger Betrug.\"", "spanish": " Y acordaos de cuando Jesús, hijo de María, dijo: “Oh hijos de Israel, en verdad soy un Mensajero de Al-lah para vosotros, que cumple lo que se mencionaba en la Torah antes de mí y os da la buena nueva de un Mensajero que aparecerá después de mí. Su nombre será Ahmad”. Mas cuando llegó a ellos con pruebas evidentes, dijeron: “Es un encantamiento manifiesto”.", "urdu": " اور (یاد کرو) جب عیسیٰ ابن مریم نے اپنی قوم سے کہا کہ اے بنی اسرائیل! میں اللہ کی طرف سے تمہاری طرف رسول ہو کر آیا ہوں‘ جو (کلام) میرے آنے سے پہلے نازل ہو چکا ہے یعنی تورات‘ اس کی پیشگوئیوں کو میں پورا کرتا ہوں اور ایک ایسے رسول کی بھی خبر دیتا ہوں جو میرے بعد آئے گا جس کا نام احمد ہوگا۔ پھر جب وہ رسول دلائل لیکر آگیا‘ تو انہوں نے کہا یہ تو کھلا کھلا فریب ہے۔"}, {"arabic": " وَ مَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ الۡکَذِبَ وَ ہُوَ یُدۡعٰۤی اِلَی الۡاِسۡلَامِ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿۸﴾", "english": " But who could do greater wrong than one who forges the lie against Allah while he is called to Islam? Allah guides not the wrongdoing people.", "french": " Mais qui peut être plus injuste que celui qui invente un mensonge contre Allāh, alors qu’il est appelé à l’Islam ? Allāh ne guide pas le peuple qui agit injustement.", "german": " Wer aber könnte ärgeren Frevel begehen, als wer wider Allah die Lüge erdichtet, und er selbst zum Islam aufgefordert wird? Allah weist nicht dem Volk der Frevler den Weg.", "spanish": " Y ¿Quién comete una iniquidad mayor que quien forja una mentira contra Al-lah cuando es invitado al Islam? Al-lah no guía a los hombres injustos.", "urdu": " اور اس سے زیادہ ظالم کون ہوسکتا ہے‘ جو اللہ پر جھوٹ باندھے حالانکہ وہ اسلام کی طرف بلایا جاتا ہے۔ اور اللہ ظالموں کو کبھی ہدایت نہیں دیتا۔"}, {"arabic": " یُرِیۡدُوۡنَ لِیُطۡفِـُٔوۡا نُوۡرَ اللّٰہِ بِاَفۡوَاہِہِمۡ وَ اللّٰہُ مُتِمُّ نُوۡرِہٖ وَ لَوۡ کَرِہَ الۡکٰفِرُوۡنَ ﴿۹﴾", "english": " They desire to extinguish the light of Allah with the breath of their mouths, but Allah will perfect His light, even if the disbelievers hate it .", "french": " Ils désirent éteindre la lumière d’Allāh par le souffle de leurs bouches, mais Allāh rendra parfaite Sa lumière, même si les mécréants le haïssent.", "german": " Sie möchten Allahs Licht auslöschen mit ihren Mündern, doch Allah wird Sein Licht vollkommen machen, auch wenn die Ungläubigen es hassen.", "spanish": " Desean apagar la luz de Al-lah con el aliento de sus bocas, pero Al-lah perfeccionará Su luz, aunque los incrédulos la odien.", "urdu": " وہ چاہتے ہیں کہ اپنے مونہوں سے اللہ کے نور کو بجھا دیں‘ اور اللہ اپنے نور کو پورا کرکے چھوڑے گا خواہ کافر (لوگ) کتنا ہی ناپسند کریں۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَرۡسَلَ رَسُوۡلَہٗ بِالۡہُدٰی وَ دِیۡنِ الۡحَقِّ لِیُظۡہِرَہٗ عَلَی الدِّیۡنِ کُلِّہٖ وَ لَوۡ کَرِہَ الۡمُشۡرِکُوۡنَ ٪﴿۱۰﴾", "english": " He it is Who has sent His Messenger with the guidance and the Religion of truth, that He may cause it to prevail over all religions, even if those who associate partners with God hate it .", "french": " C’est Lui Qui a envoyé Son Messager avec la direction et la Religion de la Vérité, afin de la faire prévaloir sur toutes les autres religions, même si ceux qui attribuent des associés à Allāh le haïssent.", "german": " Er ist es, Der Seinen Gesandten geschickt hat mit der Führung und der Religion der Wahrheit, auf dass Er sie obsiegen lasse über alle Religionen, auch wenn die Götzendiener es hassen.", "spanish": " Él es Quien envió a Su Mensajero con la guía y la Religión de la erdad, para hacer que prevaleciera sobre todas las religiones, aunque lo odien quienes asocian dioses a Dios.", "urdu": " وہ خدا ہی ہے جس نے اپنے رسول کو ہدایت کے ساتھ اور سچا دین دیکر بھیجا ہے تا کہ اس کو تمام دینوں پر غالب کرے۔ خواہ مشرک کتنا ہی ناپسند کریں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا ہَلۡ اَدُلُّکُمۡ عَلٰی تِجَارَۃٍ تُنۡجِیۡکُمۡ مِّنۡ عَذَابٍ اَلِیۡمٍ ﴿۱۱﴾", "english": " O ye who believe! shall I point out to you a bargain that will save you from a painful punishment?", "french": " Ô vous qui croyez ! Vous indiquerai-Je un marché qui vous sauvera d’un châtiment douloureux ?", "german": " O die ihr glaubt, soll Ich euch einen Handel ansagen, der euch vor qualvoller Strafe retten wird?", "spanish": " ¡Oh vosotros, los creyentes! ¿Queréis que os señale un acuerdo que os librará de un castigo doloroso?", "urdu": " اے مومنو! کیا میں تمہیں ایک ایسی تجارت کی خبر دوں‘ جو تم کو دردناک عذاب سے بچالے گی۔"}, {"arabic": " تُؤۡمِنُوۡنَ بِاللّٰہِ وَ رَسُوۡلِہٖ وَ تُجَاہِدُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ بِاَمۡوَالِکُمۡ وَ اَنۡفُسِکُمۡ ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿ۙ۱۲﴾", "english": " That you believe in Allah and His Messenger, and strive in the cause of Allah with your wealth and your persons. That is better for you, if you did but know.", "french": " Que vous croyiez en Allāh et en Son Messager, et luttiez pour la cause d’Allāh avec vos biens et vos personnes. Cela vaut mieux pour vous, si seulement vous saviez.", "german": " Ihr sollt an Allah glauben und an Seinen Gesandten und sollt streiten für Allahs Sache mit eurem Gut und eurem Blut. Das ist besser für euch, wenn ihr es nur wüsstet.", "spanish": " Que creáis en Al-lah y en Su Mensajero y os esforcéis en la causa de Al-lah con vuestras riquezas y vuestras personas. Esto es lo mejor para vosotros, si acaso supierais.", "urdu": " (۔وہ تجارت یہ ہے کہ) تم اللہ اور اس کے رسول پر ایمان لاٶ‘ اور اللہ کے رستہ میں اپنے مالوں اور اپنی جانوں سے جہاد کرو۔ اگر تم جانو تو یہ تمہارے لئے بہتر ہے۔"}, {"arabic": " یَغۡفِرۡ لَکُمۡ ذُنُوۡبَکُمۡ وَ یُدۡخِلۡکُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ وَ مَسٰکِنَ طَیِّبَۃً فِیۡ جَنّٰتِ عَدۡنٍ ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿ۙ۱۳﴾", "english": " He will forgive you your sins, and make you enter the Gardens through which streams flow, and pure and pleasant dwellings in Gardens of Eternity. That is the supreme triumph.", "french": " Il vous pardonnera vos péchés, et vous fera entrer dans des Jardins sous lesquels coulent des ruisseaux, et dans des habitations pures et agréables situées dans les Jardins d’Eternité. C’est là le triomphe suprême.", "german": " Er wird euch eure Sünden vergeben und euch in Gärten führen, durch die Ströme fließen, und in entzückende Wohnungen in den Gärten der Ewigkeit. Das ist die höchste Glückseligkeit.", "spanish": " Él perdonará vuestros pecados y os hará entrar en los Jardines por los que corren ríos, y en moradas puras y agradables en Jardines de Eternidad. Ése es el triunfo supremo.", "urdu": " (۔تمہارے ایسا کرنے پر) وہ تمہارے گناہوں کو معاف کرے گا اور تم کو ان جنتوں میں داخل کرے گا جن کے نیچے نہریں بہتی ہیں اور ہمیشہ رہنے والی جنتوں کے پاک مکانوں میں (تم کو رکھے گا) یہ بڑی کامیابی ہے (جو وہ تم کو دے گا)"}, {"arabic": " وَ اُخۡرٰی تُحِبُّوۡنَہَا ؕ نَصۡرٌ مِّنَ اللّٰہِ وَ فَتۡحٌ قَرِیۡبٌ ؕ وَ بَشِّرِ الۡمُؤۡمِنِیۡنَ ﴿۱۴﴾", "english": " And He will bestow another favour which you love: help from Allah and a near victory. So give glad tidings to the believers.", "french": " Et Il vous accordera une autre faveur que vous aimez : le secours provenant d’Allāh et une victoire proche. Annonce donc la bonne nouvelle aux croyants.", "german": " Und (Er wird) noch eine andere (Huld bescheren), die ihr liebt: Hilfe von Allah und nahen Sieg. So künde frohe Botschaft den Gläubigen.", "spanish": " Él concederá otra gracia que anheláis: la ayuda de Al-lah y una victoria cercana. Dad, pues, la buena nueva a los creyentes.", "urdu": " اس کے علاوہ ایک اور چیز بھی ہے جس کو تم بہت چاہتے ہو وہ اللہ کی تائید ہے‘ اور ایک جلدی حاصل ہونے والی فتح ہے اور مومنوں کو بشارت دے (کہ ان کو ایک اور جلد حاصل ہونے والی فتح بھی ملے گی)"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا کُوۡنُوۡۤا اَنۡصَارَ اللّٰہِ کَمَا قَالَ عِیۡسَی ابۡنُ مَرۡیَمَ لِلۡحَوَارِیّٖنَ مَنۡ اَنۡصَارِیۡۤ اِلَی اللّٰہِ ؕ قَالَ الۡحَوَارِیُّوۡنَ نَحۡنُ اَنۡصَارُ اللّٰہِ فَاٰمَنَتۡ طَّآئِفَۃٌ مِّنۡۢ بَنِیۡۤ اِسۡرَآءِیۡلَ وَ کَفَرَتۡ طَّآئِفَۃٌ ۚ فَاَیَّدۡنَا الَّذِیۡنَ اٰمَنُوۡا عَلٰی عَدُوِّہِمۡ فَاَصۡبَحُوۡا ظٰہِرِیۡنَ ﴿٪۱۵﴾", "english": " O ye who believe! be helpers of Allah, as said Jesus, son of Mary, to his disciples, ‘Who are my helpers in the cause of Allah.’ The disciples said, ‘We are helpers of Allah.’ So a party of the children of Israel believed, while a party disbelieved. Then We gave power to those who believed against their enemy, and they became victorious.", "french": " Ô vous qui croyez ! soyez les aides dans la cause d’Allāh, comme disait Jésus, fils de Marie, à ses disciples : « Qui sont mes aides pour la cause d’ Allāh ? » Les disciples dirent : « Nous sommes les aides d’Allāh. » Alors un groupe des Enfants d’Israël crut, alors qu’un autre groupe refusa de croire. Puis, Nous aidâmes ceux qui crurent contre leur ennemi, et ils devinrent victorieux.", "german": " O die ihr glaubt, seid Allahs Helfer, wie Jesus, Sohn der Maria, zu den Jüngern sprach: \"Wer sind meine Helfer für Allah?\" Die Jünger sprachen: \"Wir sind Allahs Helfer.\" So glaubte ein Teil von den Kindern Israels, während ein Teil ungläubig blieb. Da verliehen Wir denen, die glaubten, Stärke gegen ihren Feind, und sie wurden siegreich.", "spanish": " ¡Oh vosotros, los creyentes! Sed ayudantes en la causa de Al-lah, tal como dijo Jesús, hijo de María, a sus discípulos: “¿Quiénes son mis ayudantes en la causa de Al-lah?”. Los iscípulos dijeron: “Nosotros somos los ayudantes en la causa de Al-lah”. Luego un grupo de los hijos de Israel creyó, mientras que otro grupo no creyó. Entonces ayudamos a los que creyeron contra su enemigo y salieron victoriosos.", "urdu": " اے مومنو! تم اللہ (کے دین) کے مددگار بن جاٶ جیسا کہ عیسیٰ ابن مریم نے جب حواریوں سے کہا کہ خدا کے (قریب لے جانے والے) کاموں میں میرا کون مددگار ہے۔ تو وہ بولے کہ ہم اللہ کے (دین کے) مددگار ہیں۔ پس بنی اسرائیل کا ایک گروہ تو ایمان لے آیا‘ اور ایک گروہ نے انکار کر دیا۔ جس پر ہم نے مومنوں کی ان کے دشمنوں کے خلاف مدد کی اور مومن غالب آگئے۔"}], "Surah": 61}