{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh. Ie Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " الٓـمّٓ ۚ﴿۲﴾", "english": " Alif Lam Mim.", "french": " Alif Lām Mīm (Je suis Allāh, le Plus-Savant).", "german": " Alif Lâm Mîm.", "spanish": " Alif Lam Mim.", "urdu": " میں اللہ سب سے زیادہ جاننے والا ہوں۔"}, {"arabic": " غُلِبَتِ الرُّوۡمُ ۙ﴿۳﴾", "english": " The Romans have been defeated,", "french": " Les Romains ont été vaincus.", "german": " Besiegt sind die Römer", "spanish": " Los romanos han sido ven­cidos,", "urdu": " رومی لوگ (یعنی قیصر کے ساتھی) قریب کی زمین میں مغلوب ہوگئے"}, {"arabic": " فِیۡۤ اَدۡنَی الۡاَرۡضِ وَ ہُمۡ مِّنۡۢ بَعۡدِ غَلَبِہِمۡ سَیَغۡلِبُوۡنَ ۙ﴿۴﴾", "english": " In the land nearby, and they, after their defeat, will be victorious.", "french": " Sur la terre voisine, et, après leur défaite, ils seront victorieux", "german": " in dem Land nahebei, doch nach ihrer Niederlage werden sie siegreich sein", "spanish": " En el país vecino, y, des­pués de su derrota, serán victoriosos", "urdu": " قریب کی زمین میں مغلوب ہوگئے اور وہ اپنے مغلوب ہونے کے بعد چند سال میں دوبارہ غالب آجائیں گے۔"}, {"arabic": " فِیۡ بِضۡعِ سِنِیۡنَ ۬ؕ لِلّٰہِ الۡاَمۡرُ مِنۡ قَبۡلُ وَ مِنۡۢ بَعۡدُ ؕ وَ یَوۡمَئِذٍ یَّفۡرَحُ الۡمُؤۡمِنُوۡنَ ۙ﴿۵﴾", "english": " In a few years — Allah’s is the command before and after that — and on that day the believers will rejoice,", "french": " Dans quelques années – à Allāh est le commandement, avant et après cela – et ce jour-là les croyants se réjouiront", "german": " in wenigen Jahren – Allahs ist die Herrschaft vorher und nachher –, und an jenem Tage werden die Gläubigen frohlocken", "spanish": " En pocos años -de Al‑lah es el decreto antes y después de eso- ­ y en ese día los creyentes se regocijarán,", "urdu": " چند سال میں دوبارہ غالب آجائیں گے۔ اس واقعہ سے پہلے بھی اللہ کی حکومت ہوگی اور بعد میں بھی (اس کی حکومت ہوگی) اور اس دن مومن اللہ کی مدد سے بہت خوش ہوں گے۔"}, {"arabic": " بِنَصۡرِ اللّٰہِ ؕ یَنۡصُرُ مَنۡ یَّشَآءُ ؕ وَ ہُوَ الۡعَزِیۡزُ الرَّحِیۡمُ ۙ﴿۶﴾", "english": " With the help of Allah. He helps whom He pleases; and He is the Mighty, the Merciful.", "french": " De l’aide d’Allāh. Il aide qui Il veut, et Il est le Puissant, le Miséricordieux.", "german": " mit Allahs Hilfe. Er hilft, wem Er will; und Er ist der Allmächtige, der Barmherzige.", "spanish": " Con la ayuda de Al‑lah. Él ayuda a quien Le place; pues Él es el Poderoso, el Misericordioso.", "urdu": " اللہ جسے پسند کرتا ہے اس کی مدد کرتا ہے اور وہ غالب (اور) باربار کرم کرنے والا ہے۔"}, {"arabic": " وَعۡدَ اللّٰہِ ؕ لَا یُخۡلِفُ اللّٰہُ وَعۡدَہٗ وَ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یَعۡلَمُوۡنَ ﴿۷﴾", "english": " Allah has made this promise. Allah breaks not His promise, but most men know not.", "french": " Ceci est la promesse d’Allāh. Allāh ne manque pas à Sa promesse, mais la plupart des gens ne savent pas.", "german": " Die Verheißung Allahs – Allah bricht Seine Verheißung nicht –, allein die meisten Menschen wissen es nicht.", "spanish": " Al‑lah ha hecho esta prome­sa. Al‑lah no rompe Su promesa, pero la mayoría de los hombres no lo saben.", "urdu": " اللہ کے وعدہ (کو خوب یاد رکھو) (اور) اللہ اپنے وعدوں کو جھوٹا نہیں کرتا۔ مگر اکثر لوگ اس بات کو سمجھتے نہیں۔"}, {"arabic": " یَعۡلَمُوۡنَ ظَاہِرًا مِّنَ الۡحَیٰوۃِ الدُّنۡیَا ۚۖ وَ ہُمۡ عَنِ الۡاٰخِرَۃِ ہُمۡ غٰفِلُوۡنَ ﴿۸﴾", "english": " They know only the outer aspect of the life of this world, and of the Hereafter they are utterly unmindful.", "french": " Ils ont une connaissance superficielle de ce monde, et quant à l’au-delà, ils en sont complètement oublieux.", "german": " Sie kennen nur die Außenseite des Lebens in dieser Welt, des Jenseits aber sind sie gänzlich achtlos.", "spanish": " Sólo conocen el aspecto ex­terior de la vida de este mundo, y descuidan totalmente el Más Allá.", "urdu": " وہ لوگ ورلی زندگی کے ظاہر (یعنی اس کی شان و شوکت) کو تو خوب سمجھتے ہیں‘ لیکن اُخروی زندگی سے بالکل ناواقف ہیں۔"}, {"arabic": " اَوَ لَمۡ یَتَفَکَّرُوۡا فِیۡۤ اَنۡفُسِہِمۡ ۟ مَا خَلَقَ اللّٰہُ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَاۤ اِلَّا بِالۡحَقِّ وَ اَجَلٍ مُّسَمًّی ؕ وَ اِنَّ کَثِیۡرًا مِّنَ النَّاسِ بِلِقَآیِٔ رَبِّہِمۡ لَکٰفِرُوۡنَ ﴿۹﴾", "english": " Do they not reflect in their own minds? Allah has not created the heavens and the earth and all that is between the two but in accordance with the requirements of wisdom and for a fixed term. But many among men believe not in the meeting of their Lord.", "french": " Ne réfléchissent-ils pas dans leur propre esprit ? Allāh n’a créé les cieux et la terre, et tout ce qui se trouve entre les deux, qu’en toute vérité pour un terme fixé. Mais certainement beaucoup de gens ne croient pas en la rencontre avec leur Seigneur.", "german": " Haben sie denn nicht nachgedacht in ihrem Innern? Allah hat die Himmel und die Erde und was zwischen den beiden ist nur in Weisheit geschaffen und auf eine bestimmte Frist. Doch wahrlich, viele unter den Menschen glauben nicht an die Begegnung mit ihrem Herrn.", "spanish": " ¿No reflexionan con sus pro­pias mentes? Al‑lah no ha creado los cielos y la tierra y todo lo que hay entre ambos sino de acuerdo con los requisitos de la sabiduría y por un plazo fijo. Pero muchos de entre los hombres no creen en la reunión con su Señor.", "urdu": " کیا انہوں نے اپنے دل میں کبھی یہ غور نہیں کیا کہ آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے‘ خدا نے کسی حکمت کے مطابق اور ایک وقت مقررہ کے لئے پیدا کیا ہے۔ لیکن لوگوں میں سے اکثر اپنے رب کی ملاقات سے منکر ہیں۔"}, {"arabic": " اَوَ لَمۡ یَسِیۡرُوۡا فِی الۡاَرۡضِ فَیَنۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ ؕ کَانُوۡۤا اَشَدَّ مِنۡہُمۡ قُوَّۃً وَّ اَثَارُوا الۡاَرۡضَ وَ عَمَرُوۡہَاۤ اَکۡثَرَ مِمَّا عَمَرُوۡہَا وَ جَآءَتۡہُمۡ رُسُلُہُمۡ بِالۡبَیِّنٰتِ ؕ فَمَا کَانَ اللّٰہُ لِیَظۡلِمَہُمۡ وَ لٰکِنۡ کَانُوۡۤا اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ؕ﴿۱۰﴾", "english": " Have they not travelled in the earth so that they might see how evil was the end of those who were before them? They were stronger than these in power, and they tilled the soil and populated it more and better than these have populated it. And their Messengers came to them with manifest Signs. And Allah would not wrong them, but they wronged their own souls.", "french": " N’ont-ils pas parcouru la terre pour voir combien mauvaise fut la fin de ceux qui les ont devancés ? Ils étaient plus forts que ceux-ci, et ils cultivaient la terre et la peuplaient plus et mieux que ceux-ci ne l’ont peuplée. Et leurs Messagers vinrent à eux avec des Signes manifestes. Et Allāh ne voulait pas leur faire du tort, mais ils ont fait du tort à leur propre âme.", "german": " Sind sie denn nicht auf der Erde umhergereist, so dass sie sehen konnten, wie das Ende derer war, die vor ihnen waren? Jene waren stärker als sie an Kraft, und sie bebauten das Land und bevölkerten es mehr, als diese es bevölkert haben. Und ihre Gesandten kamen zu ihnen mit offenkundigen Zeichen. Und Allah wollte ihnen kein Unrecht antun, sondern sich selbst haben sie Unrecht getan.", "spanish": " ¿Acaso no han viajado por la tierra para poder ver qué malo fue el fin de los que les antecedieron? Fue­ron más uertes que éstos en poder, araron la tierra y la poblaron más y mejor de lo que la han poblado éstos. Y sus Mensajeros llegaron a ellos con Signos manifiestos. Mas Al‑lah no les perjudicó, sino que ellos mismos perjudicaron sus propias almas.", "urdu": " کیا وہ زمین میں نہیں پھرے اور یہ نہیں دیکھا کہ جو ان سے پہلے لوگ تھے ان کا انجام کیا ہوا تھا؟ وہ ان سے زیادہ طاقتور تھے اور انہوں نے زمین کو خوب اکھیڑا (یعنی ہل چلایا) تھا اور اسے اس سے زیادہ آباد کیا تھا جو انہوں نے کیا ہے اور ان کے رسول ان کے پاس دلائل لے کر آئے تھے کیونکہ اللہ کی شان کے مطابق نہ تھا کہ ان پر ظلم کرتا۔ بلکہ وہ لوگ خود اپنی جانوں پر ظلم کر رہے تھے۔"}, {"arabic": " ثُمَّ کَانَ عَاقِبَۃَ الَّذِیۡنَ اَسَآءُوا السُّوۡٓاٰۤی اَنۡ کَذَّبُوۡا بِاٰیٰتِ اللّٰہِ وَ کَانُوۡا بِہَا یَسۡتَہۡزِءُوۡنَ ﴿٪۱۱﴾", "english": " Then evil was the end of those who did evil, because they rejected the Signs of Allah, and mocked at them.", "french": " Alors, mauvaise fut la fin de ceux qui commirent de mauvaises actions, parce qu’ils rejetèrent les Signes d’Allāh, et s’en moquèrent.", "german": " Übel war alsdann das Ende derer, die Übles taten, da sie die Zeichen Allahs verwarfen und über sie zu spotten pflegten.", "spanish": " Malo fue después el final de los que hicieron el mal, porque re­chazaron los Signos de Al‑lah y se mofaron de ellos.", "urdu": " پھر اُن لوگوں کا جنہوں نے برے کام کیے تھے۔ اللہ کی آیات کا انکار کرنے کی وجہ سے برا ہی انجام ہوا۔ اور وہ اللہ کی آیات سے ہنسی کیا کرتے تھے۔"}, {"arabic": " اَللّٰہُ یَبۡدَؤُا الۡخَلۡقَ ثُمَّ یُعِیۡدُہٗ ثُمَّ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۱۲﴾", "english": " Allah originates creation; then He repeats it; then to Him shall you be brought back.", "french": " Allāh commence la création ; puis Il la répète ; ensuite c’est à Lui que vous serez ramenés.", "german": " Allah bringt die Schöpfung hervor; dann lässt Er sie wiederkehren; zu Ihm dann werdet ihr zurückgebracht werden.", "spanish": " Al‑lah origina la creación; y después la repite; más tarde, a Él seréis devueltos.", "urdu": " اللہ پیدائش عالم کو شروع بھی کرتا ہے اور پھر اس سلسلہ کو دہراتا بھی جاتا ہے پھر تم سب اس کی طرف لوٹا کر لے جائے جاٶ گے۔"}, {"arabic": " وَ یَوۡمَ تَقُوۡمُ السَّاعَۃُ یُبۡلِسُ الۡمُجۡرِمُوۡنَ ﴿۱۳﴾", "english": " And on the day when the Hour will arrive the guilty shall be in despair.", "french": " Et le jour où arrivera l’Heure, les coupables seront saisis de désespoir.", "german": " Und an dem Tage, da die \"Stunde\" herankommt, werden die Schuldigen von Verzweiflung übermannt werden.", "spanish": " Y en el día en que llegue la Hora, los culpables se hundirán en la desesperación.", "urdu": " اور جس دن قیامت برپا ہوگی‘ مجرم مایوس ہو جائیں گے۔"}, {"arabic": " وَ لَمۡ یَکُنۡ لَّہُمۡ مِّنۡ شُرَکَآئِہِمۡ شُفَعٰٓؤُا وَ کَانُوۡا بِشُرَکَآئِہِمۡ کٰفِرِیۡنَ ﴿۱۴﴾", "english": " And they shall have no intercessors from among them whom they associate with God ; and they will deny those whom they associate with Him.", "french": " Et ils n’auront pas d’intercesseurs d’entre leurs soi-disant associés qu’ils attribuent à Allāh ; et eux-mêmes ils renieront leurs associés fabriqués.", "german": " Denn keiner von ihren Göttern wird ihnen Fürsprecher sein; und sie werden ihre Götter verleugnen.", "spanish": " Y no tendrán intercesores de entre quienes asocian a Dios; éstos ne­garán a aquellos que le asocian a Él.", "urdu": " اور جن کو وہ خدا کا شریک بناتے تھے ان میں سے کوئی ان کا شفیع نہ بنے گا اور وہ اپنے (بنائے ہوئے) شرکا کا انکار کر دیں گے۔"}, {"arabic": " وَ یَوۡمَ تَقُوۡمُ السَّاعَۃُ یَوۡمَئِذٍ یَّتَفَرَّقُوۡنَ ﴿۱۵﴾", "english": " And on the day when the Hour will arrive — on that day will they become separated from one another .", "french": " Et le jour où arrivera l’Heure, ce jour-là ils se sépareront les uns des autres.", "german": " Und an dem Tage, da die \"Stunde\" herankommt, an jenem Tage sollen sie voneinander getrennt werden.", "spanish": " Y en el día en que llegue la Hora: en ese día quedarán sepa­rados unos de los otros.", "urdu": " اور جس دن قیامت برپا ہوگی اس دن سب (مشرک) الگ الگ ہو جائیں گے۔"}, {"arabic": " فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فَہُمۡ فِیۡ رَوۡضَۃٍ یُّحۡبَرُوۡنَ ﴿۱۶﴾", "english": " Then those who believed and did good works will be honoured and made happy in a garden.", "french": " Quant à ceux qui croyaient et faisaient de bonnes œuvres, ils se réjouiront dans un jardin.", "german": " Was nun die betrifft, die glaubten und gute Werke übten, so werden sie in einem Garten glücklich gemacht werden.", "spanish": " Entonces, quienes creyeron e hicieron buenas obras serán honra­dos y hechos felices en un jardín.", "urdu": " پھر وہ لوگ جو ایمان لائے اور جنہوں نے اپنے اپنے ایمان کے مطابق عمل بھی کیا انہیں عالی شان باغ میں خوشی پہنچائی جائے گی۔"}, {"arabic": " وَ اَمَّا الَّذِیۡنَ کَفَرُوۡا وَ کَذَّبُوۡا بِاٰیٰتِنَا وَ لِقَآیِٔ الۡاٰخِرَۃِ فَاُولٰٓئِکَ فِی الۡعَذَابِ مُحۡضَرُوۡنَ ﴿۱۷﴾", "english": " But as for those who disbelieved and rejected Our Signs and the meeting of the Hereafter, these will be brought forth in punishment.", "french": " Mais quant à ceux qui ne croyaient pas et qui traitaient Nos Signes de mensonges et aussi la rencontre de l’au-delà, ceux-là seront livrés au châtiment.", "german": " Jene aber, die ungläubig waren und Unsere Zeichen und die Begegnung im Jenseits leugneten, diese sollen zur Strafe herbeigebracht werden.", "spanish": " Mientras que aquellos que no creyeron y rechazaron Nuestros Sig­nos y la reunión del Más Allá, serán entregados al castigo.", "urdu": " اور وہ (لوگ) جنہوں نے کفر کیا اور ہماری آیتوں کا اور اُخروی زندگی کے حاصل ہونے کا انکار کیا عذاب کے سامنے حاضر کیے جائیں گے۔"}, {"arabic": " فَسُبۡحٰنَ اللّٰہِ حِیۡنَ تُمۡسُوۡنَ وَ حِیۡنَ تُصۡبِحُوۡنَ ﴿۱۸﴾", "english": " So glorify Allah when you enter the evening and when you enter the morning —", "french": " Et Allāh demeure Pur à tout moment et aussi quand vous entrez dans le soir, et quand vous entrez dans le matin–", "german": " Preis sei denn Allah, wenn ihr den Abend antretet und wenn ihr den Morgen antretet –", "spanish": " Glorificad pues a Al‑lah cuando entréis en el anochecer y cuando entréis en el amanecer,", "urdu": " پس اللہ کی تسبیح کرو۔ جب تم شام کے وقت میں داخل ہو یا صبح کے وقت میں داخل ہو۔"}, {"arabic": " وَ لَہُ الۡحَمۡدُ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ وَ عَشِیًّا وَّ حِیۡنَ تُظۡہِرُوۡنَ ﴿۱۹﴾", "english": " And to Him belongs all praise in the heavens and the earth — and glorify Him in the afternoon and when you enter upon the time of the decline of the sun.", "french": " Et à Lui appartiennent toutes les louanges dans les cieux et sur la terre – dans l’après-midi aussi et aussi quand vous entamez la période du déclin du soleil.", "german": " denn Ihm gebührt aller Preis in den Himmeln und auf Erden – und am Nachmittag und wenn ihr das Sinken der Sonne seht.", "spanish": " Pues a Él corresponde toda alabanza en los cielos y la tierra; y glorificarle por la tarde, y cuan­do entréis en el momento del ocaso del sol.", "urdu": " اور آسمانوں اور زمین میں اسی کی تعریف ہے اور بعد دوپہر بھی اس کی تسبیح کرو اور اسی طرح (عین) دوپہر کے وقت بھی۔"}, {"arabic": " یُخۡرِجُ الۡحَیَّ مِنَ الۡمَیِّتِ وَ یُخۡرِجُ الۡمَیِّتَ مِنَ الۡحَیِّ وَ یُحۡیِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا ؕ وَ کَذٰلِکَ تُخۡرَجُوۡنَ ﴿٪۲۰﴾", "english": " He brings forth the living from the dead, and He brings forth the dead from the living; and He gives life to the earth after its death. And in like manner shall you be brought forth.", "french": " Il fait sortir le vivant du mort, et Il fait sortir le mort du vivant, et Il ranime la terre après sa mort. Et c’est ainsi que l'on vous fera sortir.", "german": " Er lässt das Lebendige hervorgehen aus dem Toten und lässt das Tote hervorgehen aus dem Lebendigen; Er belebt die Erde nach ihrem Tode, und in gleicher Weise sollt ihr wieder hervorgebracht werden.", "spanish": " Él extrae lo vivo de lo muerto, y Él extrae lo muerto de lo vivo; Él da la vida a la tierra después de su muerte. Y de la misma manera vosotros seréis resucitados.", "urdu": " وہ زندہ کو مردہ سے نکالتا ہے اور مردہ کو زندہ سے نکالتا ہے اور زمین کو اس کے مر جانے کے بعد زندہ کرتا ہے۔ اور اسی طرح تم بھی نکالے جاٶ گے۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖۤ اَنۡ خَلَقَکُمۡ مِّنۡ تُرَابٍ ثُمَّ اِذَاۤ اَنۡتُمۡ بَشَرٌ تَنۡتَشِرُوۡنَ ﴿۲۱﴾", "english": " And one of His Signs is this , that He created you from dust; then, behold, you are men who move about on the face of the earth .", "french": " Et un de Ses Signes est ceci , qu’Il vous a créés de poussière ; puis voilà que vous êtes des humains qui se dispersent partout sur la terre.", "german": " Und unter Seinen Zeichen ist dies, dass Er euch aus Erde erschuf, alsdann, siehe, seid ihr Menschen, die sich (weithin) verbreiten.", "spanish": " Y uno de Sus Signos es éste: que os ha creado del olvo; luego, ¡mirad! sois hombres que os disemi­náis por la faz de la tierra.", "urdu": " اور اس کے نشانات میں سے (ایک) یہ (نشان) بھی ہے کہ اس نے تم کو مٹی سے پیدا کیا۔ پھر اس پیدائش کے نتیجہ میں تم بشر بن جاتے اور (تمام زمین میں) پھیل جاتے ہو۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖۤ اَنۡ خَلَقَ لَکُمۡ مِّنۡ اَنۡفُسِکُمۡ اَزۡوَاجًا لِّتَسۡکُنُوۡۤا اِلَیۡہَا وَ جَعَلَ بَیۡنَکُمۡ مَّوَدَّۃً وَّ رَحۡمَۃً ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّتَفَکَّرُوۡنَ ﴿۲۲﴾", "english": " And one of His Signs is this , that He has created wives for you from among yourselves that you may find peace of mind in them, and He has put love and tenderness between you. In that surely are Signs for a people who reflect.", "french": " Et un de Ses Signes est ceci , qu’Il a créé vos chères moitiés de votre propre espèce, afin qu’en elles vous puissiez trouver de la tranquillité d’esprit, et Il a mis entre vous de l'amour et de la tendresse. Assurément, il y a là des Signes pour un peuple qui réfléchit.", "german": " Und unter Seinen Zeichen ist dies, dass Er Gattinnen für euch schuf aus euch selber, auf dass ihr Frieden in ihnen fändet, und Er hat Liebe und Zärtlichkeit zwischen euch gesetzt. Hierin sind wahrlich Zeichen für ein Volk, das nachdenkt.", "spanish": " Y uno de Sus Signos es éste: Que os ha creado esposas de entre vosotros mismos para que encontréis la paz del espíritu en ellas, y ha puesto amor y ternura entre ambos. En eso hay, cierta­mente, Signos para los hombres que reflexionan.", "urdu": " اور اس کے نشانوں میں سے (ایک) یہ (نشان) بھی ہے کہ اس نے تمہاری ہی جنس میں سے تمہارے لئے جوڑے بنائے ہیں تاکہ تم ان کی طرف (مائل ہو کر) تسکین حاصل کرو۔ اور تمہارے درمیان پیار اور رحم کا رشتہ پیدا کیا ہے اس میں فکر کرنے والی قوم کے لئے بڑے نشان ہیں۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖ خَلۡقُ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ اخۡتِلَافُ اَلۡسِنَتِکُمۡ وَ اَلۡوَانِکُمۡ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّلۡعٰلِمِیۡنَ ﴿۲۳﴾", "english": " And among His Signs is the creation of the heavens and the earth, and the diversity of your tongues and colours. In that surely are Signs for those who possess knowledge.", "french": " Et parmi Ses Signes est la création des cieux et de la terre, et la diversité de vos langues et de vos teints. Assurément, il y a là des Signes pour ceux qui possèdent de la connaissance.", "german": " Und unter Seinen Zeichen ist die Schöpfung der Himmel und der Erde und die Verschiedenheit eurer Sprachen und Farben. Hierin sind wahrlich Zeichen für die Wissenden.", "spanish": " Y entre Sus Signos está la creación de los cielos y la tierra, y la diversidad de vuestras lenguas y colores. Ahí hay ciertamente Signos para quienes poseen conocimien­to,", "urdu": " اور اس کے نشانات میں سے آسمانوں اور زمین کا پیدا کرنا اور تمہاری زبانوں اور تمہارے رنگوں کا اختلاف بھی ہے اس میں تمام جاننے والوں کے لئے بڑے نشان ہیں۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖ مَنَامُکُمۡ بِالَّیۡلِ وَ النَّہَارِ وَ ابۡتِغَآؤُکُمۡ مِّنۡ فَضۡلِہٖ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّسۡمَعُوۡنَ ﴿۲۴﴾", "english": " And among His Signs is your sleep by night and day, and your seeking of His bounty. In that surely are Signs for a people who hear.", "french": " Et parmi Ses Signes est votre sommeil pendant la nuit et le jour, et votre recherche de Sa munificence. Assurément, il y a là des Signes pour un peuple qui veut entendre.", "german": " Und unter Seinen Zeichen ist euer Schlafen bei Nacht und Tag und euer Trachten nach Seiner Gnadenfülle. Hierin sind wahrlich Zeichen für ein Volk, das hört.", "spanish": " Y entre Sus Signos está vues­tro sueño, de noche y de día, y vuestra búsqueda de Su magnanimidad. Ahí hay ciertamente Signos para un pue­blo que escucha.", "urdu": " اور اس کے نشانوں میں سے رات کے وقت اور دن کے وقت تمہارا سونا اور اس کے فضل کے حاصل کرنے کے لئے محنت کرنا بھی ہے۔ اس میں سننے والی قوم کے لئے بڑے نشان ہیں۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖ یُرِیۡکُمُ الۡبَرۡقَ خَوۡفًا وَّ طَمَعًا وَّ یُنَزِّلُ مِنَ السَّمَآءِ مَآءً فَیُحۡیٖ بِہِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّعۡقِلُوۡنَ ﴿۲۵﴾", "english": " And one of His Signs is this , that He shows you the lightning as a source of fear and hope, and He sends down water from the sky, and quickens therewith the earth after its death. In that surely are Signs for a people who understand.", "french": " Et un de Ses Signes est ceci , qu’Il vous montre l’éclair pour susciter de la crainte et de l’espoir, et qu’Il fait descendre de l’eau du ciel et ranime la terre avec après sa mort. Assurément, il y a là des Signes pour un peuple qui raisonne.", "german": " Und unter Seinen Zeichen ist dies, dass Er euch den Blitz zeigt zu Furcht und Hoffen und Wasser vom Himmel herniedersendet und damit die Erde belebt nach ihrem Tode. Hierin sind wahrlich Zeichen für ein Volk, das versteht.", "spanish": " Y uno de Sus Signos es éste: Que os muestra el relámpago como fuente de temor y esperanza, y envía agua desde el cielo y con ella vivifica la tierra después de su muerte. Ahí hay con seguridad Sig­nos para un pueblo que entiende.", "urdu": " اور اس کے نشانوں میں سے یہ بھی ہے کہ وہ تم کو بجلی‘ خوف اور طمع پیدا کرنے کے لئے دکھاتا ہے اور بادل سے پانی اتارتا ہے۔ پھر اس کے ذریعہ سے زمین کو اس کے مرجانے کے بعد زندہ کرتا ہے۔ اس میں عقل والے لوگوں کے لئے بڑے نشان ہیں۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖۤ اَنۡ تَقُوۡمَ السَّمَآءُ وَ الۡاَرۡضُ بِاَمۡرِہٖ ؕ ثُمَّ اِذَا دَعَاکُمۡ دَعۡوَۃً ٭ۖ مِّنَ الۡاَرۡضِ ٭ۖ اِذَاۤ اَنۡتُمۡ تَخۡرُجُوۡنَ ﴿۲۶﴾", "english": " And among His Signs is this , that the heaven and the earth stand firm by His command. Then when He calls you by a call coming from the earth, behold, you will come forth.", "french": " Et parmi Ses Signes est ceci , que les cieux et la terre sont maintenus par Son commandement. Ensuite lorsqu’Il vous appelle d’un appel provenant de la terre, voilà que vous surgirez.", "german": " Und unter Seinen Zeichen ist dies, dass Himmel und Erde fest stehen auf Sein Geheiß. Alsdann, wenn Er euch ruft, mit einem Ruf aus der Erde, siehe, dann werdet ihr hervorgehen.", "spanish": " Y entre Sus Signos está éste: Que los cielos y la tierra permanecen firmes por Su orden. Después, cuando Os convoque con una lla­mada procedente de la tierra, he ahí que emergeréis.", "urdu": " اور اس کے نشانوں میں سے آسمانوں اور زمین کا اس کے حکم سے کھڑا رہنا بھی ہے۔ پھر (اس کا یہ نشان بھی ظاہر ہوگا کہ) جب وہ تم کو زمین سے نکلنے کے لئے ایک آواز دے گا تو اچانک تم زمین سے نکلنے لگو گے۔"}, {"arabic": " وَ لَہٗ مَنۡ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ کُلٌّ لَّہٗ قٰنِتُوۡنَ ﴿۲۷﴾", "english": " And to Him belongs whosoever is in the heavens and the earth. All are obedient to Him.", "french": " Et à Lui appartient quiconque est dans les cieux et sur la terre. Tous Lui sont obéissants.", "german": " Sein ist, wer in den Himmeln und auf der Erde ist. Alle sind Ihm gehorsam.", "spanish": " Y a Él pertenece todo lo que hay en los cielos y en la tierra. Todos Le obedecen.", "urdu": " اور آسمانوں اور زمین میں (بسنے والے) تمام وجود اس کے فرمانبردار ہیں۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ یَبۡدَؤُا الۡخَلۡقَ ثُمَّ یُعِیۡدُہٗ وَ ہُوَ اَہۡوَنُ عَلَیۡہِ ؕ وَ لَہُ الۡمَثَلُ الۡاَعۡلٰی فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ۚ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿٪۲۸﴾", "english": " And He it is Who originates the creation, then repeats it, and it is most easy for Him. His is the most exalted state in the heavens and the earth; and He is the Mighty, the Wise.", "french": " Et c’est Lui Qui commence la création, puis la répète, et cela Lui est facile. A Lui appartient la plus sublime similitude dans les cieux et sur la terre ; et Il est le Puissant, le Sage.", "german": " Und Er ist es, Der die Schöpfung hervorbringt, dann wiederholt Er sie, und dies ist Ihm noch leichter. Sein ist das schönste Gleichnis in den Himmeln und auf der Erde; und Er ist der Allmächtige, der Allweise.", "spanish": " Él es el origen de la creación, después la repite: es algo suma­mente fácil para Él. Suyo es el ejem­plo más sublime en los cielos y en la tierra; pues Él es el Poderoso, el Sabio.", "urdu": " اور وہ پیدائش (عالم) کو شروع بھی کرتا ہے اور پھر اس کو باربار دہراتا رہتا ہے اور یہ امر اس کے لئے بہت آسان ہے اور آسمانوں اور زمین میں اسی کی شان سب سے بالا ہے اور وہ غالب (اور) بڑی حکمت والا ہے۔"}, {"arabic": " ضَرَبَ لَکُمۡ مَّثَلًا مِّنۡ اَنۡفُسِکُمۡ ؕ ہَلۡ لَّکُمۡ مِّنۡ مَّا مَلَکَتۡ اَیۡمَانُکُمۡ مِّنۡ شُرَکَآءَ فِیۡ مَا رَزَقۡنٰکُمۡ فَاَنۡتُمۡ فِیۡہِ سَوَآءٌ تَخَافُوۡنَہُمۡ کَخِیۡفَتِکُمۡ اَنۡفُسَکُمۡ ؕ کَذٰلِکَ نُفَصِّلُ الۡاٰیٰتِ لِقَوۡمٍ یَّعۡقِلُوۡنَ ﴿۲۹﴾", "english": " He sets forth for you a parable concerning yourselves. Have you, among those whom your right hands possess, partners in what We have provided for you so that you become equal sharers therein and fear them as you fear each other? Thus do We explain the Signs to a people who understand.", "french": " Il vous propose une parabole vous concernant vous-mêmes. Auriez-vous, parmi vos esclaves, des associés, dans la provision que Nous vous avons accordée, de sorte qu' eux et vous vous deveniez des partenaires égaux à cet égard, à tel point que vous les craigniez comme vous vous craignez les uns les autres ? C’est ainsi que Nous expliquons clairement les Signes à un peuple qui comprend.", "german": " Er setzt euch ein Gleichnis von euch selber. Habt ihr unter denen, die eure Rechte besitzt, Teilhaber an dem, was Wir euch gaben? Seid ihr darin also gleich (und) fürchtet ihr sie, wie ihr einander fürchtet? Also machen Wir die Zeichen klar für ein Volk, das versteht.", "spanish": " Él os propone una parábola relativa a vosotros mismos. ¿Acaso habéis hecho que vuestros esclavos se conviertan en socios de lo que os hemos proporcionado y tengan igual participación, de tal forma que habéis comenzado a temerles como os teméis mutuamente? Así explica­mos los Signos a un pueblo que entiende.", "urdu": " اس نے تمہارے سمجھانے کے لئے تمہاری ہی جنس کی ایک حالت بیان کی ہے (جو یہ ہے کہ) جن لوگوں کے تمہارے دائیں ہاتھ مالک ہوتے ہیں۔ کیا ان میں سے کوئی اس (مال) میں جو ہم نے تم کو دیا ہے تمہارا برابر کا شریک بھی ہوتا ہے اس طرح کہ تم سب (مالک و غلام) اس (مال و دولت) میں برابر ہو جاتے ہو اور ان (غلاموں) سے اس طرح ڈرتے ہو جس طرح تم اپنے آپ سے ڈرتے ہو اسی طرح ہم عقل والی قوم کے لئے نشان کھول کھول کر بیان کرتے ہیں۔"}, {"arabic": " بَلِ اتَّبَعَ الَّذِیۡنَ ظَلَمُوۡۤا اَہۡوَآءَہُمۡ بِغَیۡرِ عِلۡمٍ ۚ فَمَنۡ یَّہۡدِیۡ مَنۡ اَضَلَّ اللّٰہُ ؕ وَ مَا لَہُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿۳۰﴾", "english": " Nay, but those who are unjust follow their own low desires without any knowledge. Then who can guide him whom Allah has adjudged as lost? There will be no helpers for them.", "french": " Non, mais ceux qui sont injustes, suivent leurs propres passions sans savoir. Et qui peut guider celui qu’Allāh a jugé comme égaré ? Il n’y aura pas d’aides pour eux.", "german": " Die Ungerechten aber folgen ihren bösen Gelüsten ohne Einsicht. Und wer kann den leiten, den Allah zum Irrenden erklärt? Für solche wird es keine Helfer geben.", "spanish": " No, pero quienes son injustos siguen sus propios bajos deseos sin conocimiento alguno. Entonces, ¿quién puede guiar a quien Al‑lah ha juzgado como extraviado? No habrá quien les ayude.", "urdu": " بلکہ (حقیقت یہ ہے کہ) ظالم لوگ بغیر علم کے اپنی خواہشات کے پیچھے چل پڑے ہیں اور جس کو اللہ گمراہ کرے اسے کون ہدایت دے سکتا ہے (اور) ان (لوگوں) کا کوئی مددگار نہیں ہوگا۔"}, {"arabic": " فَاَقِمۡ وَجۡہَکَ لِلدِّیۡنِ حَنِیۡفًا ؕ فِطۡرَتَ اللّٰہِ الَّتِیۡ فَطَرَ النَّاسَ عَلَیۡہَا ؕ لَا تَبۡدِیۡلَ لِخَلۡقِ اللّٰہِ ؕ ذٰلِکَ الدِّیۡنُ الۡقَیِّمُ ٭ۙ وَ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یَعۡلَمُوۡنَ ﴿٭ۙ۳۱﴾", "english": " So set thy face to the service of religion as one devoted to God . And follow the nature made by Allah — the nature in which He has created mankind. There is no altering the creation of Allah. That is the right religion. But most men know not.", "french": " Alors dévoue toute ton attention à la religion, toujours incliné vers la vérité . Et suis la nature d’Allāh – la nature selon laquelle Il a façonné les hommes. Il ne peut y avoir de changement dans la création d’Allāh. C’est là la religion droite qui aide les autres à être droite s . Mais la plupart des hommes ne savent pas.", "german": " So richte dein Antlitz auf den Glauben wie ein Aufrechter (und folge) der Natur, die Allah geschaffen, der Natur, mit welcher Allah die Menschen erschaffen hat. Es gibt kein Ändern an Allahs Schöpfung. Das ist der beständige Glaube. Allein die meisten Menschen wissen es nicht. –", "spanish": " Dirige pues tu rostro al servicio de la religión, siempre inclinado a la verdad : y sigue la naturaleza de Al-lah, según la cual ha modelado la humanidad. No hay alteración alguna en la creación de Al‑lah. Ésta es ciertamente la religión firme y justa que ayuda a los demás a ser justos. Aunque la mayoría de los hombres no lo saben.", "urdu": " پس تو اپنی ساری توجہ دین کے لئے مخصوص کر دے ایسی صورت میں کہ تجھ میں کوئی کجی نہ ہو (تو) اللہ کی (پیدا کی ہوئی) فطرت کو اختیار کر (وہ فطرت) جس پر اللہ نے لوگوں کو پیدا کیا ہے۔ اللہ کی پیدائش میں کوئی تبدیلی نہیں ہو سکتی۔ یہی قائم رہنے والا دین ہے لیکن اکثر لوگ جانتے نہیں۔"}, {"arabic": " مُنِیۡبِیۡنَ اِلَیۡہِ وَ اتَّقُوۡہُ وَ اَقِیۡمُوا الصَّلٰوۃَ وَ لَا تَکُوۡنُوۡا مِنَ الۡمُشۡرِکِیۡنَ ﴿ۙ۳۲﴾", "english": " Set your face to God , turning to Him in repentance , and fear Him, and observe Prayer, and be not of those who associate partners with God —", "french": " Tournez votre visage vers Allāh , vous tournant vers Lui avec repentir , et craignez-Le, et observez la Prière, et ne soyez pas du nombre des associateurs –", "german": " Zu Ihm euch wendend, und fürchtet Ihn und verrichtet das Gebet und seid nicht unter den Götzendienern,", "spanish": " Levantad vuestro rostro hacia Dios, volviendo a Él con arrepenti­miento, temedle y cumplid la Ora­ción, y no seáis de aquellos que asocian partícipes a Dios", "urdu": " (پس) تم سب اس (خدا) کی طرف جھکتے ہوئے دین فطرت اختیار کرو۔ اور اس کا تقویٰ اختیار کرو اور نماز کو اس کی شرائط کے ساتھ ادا کرو اور مشرکوں میں سے مت بنو۔"}, {"arabic": " مِنَ الَّذِیۡنَ فَرَّقُوۡا دِیۡنَہُمۡ وَ کَانُوۡا شِیَعًا ؕ کُلُّ حِزۡبٍۭ بِمَا لَدَیۡہِمۡ فَرِحُوۡنَ ﴿۳۳﴾", "english": " Of those who split up their religion and have become divided into sects; every party rejoicing in what they have.", "french": " De ceux qui scindent leur religion, et sont maintenant divisés en sectes – chaque secte se réjouissant de ce qu’elle a.", "german": " unter denen, die ihren Glauben spalten und in Parteien zerfallen, und jede Partei freut sich über das, was sie selbst besitzt.", "spanish": " De aquellos que fragmentan su religión y quedan divididos en sectas; ale­grándose cada grupo con lo que tienen.", "urdu": " یعنی ان (مشرک) لوگوں میں سے جنہوں نے اپنے دین کو پراگندہ کر دیا۔ اور (دین کو ٹکڑے ٹکڑے کرکے) مختلف فرقوں میں بٹ گئے اور ہر گروہ اس خیال سے خوش ہے کہ جو ٹکڑا ہم نے لیا ہے وہی بہتر ہے۔"}, {"arabic": " وَ اِذَا مَسَّ النَّاسَ ضُرٌّ دَعَوۡا رَبَّہُمۡ مُّنِیۡبِیۡنَ اِلَیۡہِ ثُمَّ اِذَاۤ اَذَاقَہُمۡ مِّنۡہُ رَحۡمَۃً اِذَا فَرِیۡقٌ مِّنۡہُمۡ بِرَبِّہِمۡ یُشۡرِکُوۡنَ ﴿ۙ۳۴﴾", "english": " And when an affliction befalls men, they cry unto their Lord, turning to Him in repentance ; then, when He has made them taste of mercy from Him, lo! a section of them associate partners with their Lord,", "french": " Et lorsqu’un malheur survient aux hommes, ils invoquent leur Seigneur, se tournant vers Lui avec repentir ; ensuite, lorsqu’Il leur fait goûter de Sa miséricorde, voilà qu’une partie d’entre eux se met à attribuer des associés à leur Seigneur,", "german": " Und wenn eine Drangsal die Menschen befällt, dann rufen sie zu ihrem Herrn, sich reuig zu Ihm wendend; hernach aber, wenn Er sie Seine Barmherzigkeit kosten lässt, siehe, dann stellen einige von ihnen ihrem Herrn Götter zur Seite,", "spanish": " Cuando una aflicción cae so­bre los hombres, invocan a su Señor, dirigiéndose a Él con arrepenti­miento; pero luego, cuando les favo­rece para que gusten de Su miseri­cordia, ¡Ay! un grupo de ellos asocian partícipes a su Señor,", "urdu": " اور جب انسانوں کو کوئی تکلیف پہنچے تو وہ اپنے رب کو اسی کی طرف جھکتے ہوئے پکارتے ہیں پھر جب اس کی طرف سے انہیں کوئی رحمت پہنچتی ہے تو ان میں سے ایک گروہ اپنے رب کے مدمقابل شریک بنانے لگ جاتا ہے۔"}, {"arabic": " لِیَکۡفُرُوۡا بِمَاۤ اٰتَیۡنٰہُمۡ ؕ فَتَمَتَّعُوۡا ٝ فَسَوۡفَ تَعۡلَمُوۡنَ ﴿۳۵﴾", "english": " So as to be ungrateful for what We have given them. So enjoy yourselves awhile , but soon you will come to know.", "french": " De sorte qu’ils nient ce que Nous leur avons accordé. Jouissez donc pour un temps, mais bientôt vous allez savoir.", "german": " um das zu verleugnen, was Wir ihnen gegeben. Ergötzet euch denn eine Weile, bald jedoch werdet ihr es erfahren!", "spanish": " De modo que son desagrade­cidos con lo que les hemos dado. Regocijaos pues durante algún tiempo, porque muy pronto llegaréis a conocer.", "urdu": " جس کا نتیجہ یہ ہوتا ہے کہ جو کچھ ہم نے ان کو دیا ہے وہ عملاً اس کا انکار کرنے لگ جاتے ہیں (تب ان سے کہا جاتا ہے۔ دنیا سے) جو کچھ فائدہ اٹھانا ہے اٹھا لو۔ کیونکہ تم جلد ہی اپنا انجام دیکھ لو گے۔"}, {"arabic": " اَمۡ اَنۡزَلۡنَا عَلَیۡہِمۡ سُلۡطٰنًا فَہُوَ یَتَکَلَّمُ بِمَا کَانُوۡا بِہٖ یُشۡرِکُوۡنَ ﴿۳۶﴾", "english": " Have We sent down to them any authority which speaks in favour of what they associate with Him?", "french": " Leur avons-Nous envoyé une autorité quelconque qui parle en faveur de ce qu’ils Lui associent ?", "german": " Haben Wir ihnen etwa Ermächtigung niedergesandt, die für das spräche, was sie Ihm zur Seite stellen?", "spanish": " ¿Les he concedido autor­idad alguna que hable a favor de lo que Le asocian?", "urdu": " کیا ہم نے ان کے لئے کوئی (شرک کی) دلیل اتاری ہے جو ان سے وہ باتیں کہتی ہے جو شرک کے متعلق وہ بیان کرتے ہیں۔"}, {"arabic": " وَ اِذَاۤ اَذَقۡنَا النَّاسَ رَحۡمَۃً فَرِحُوۡا بِہَا ؕ وَ اِنۡ تُصِبۡہُمۡ سَیِّئَۃٌۢ بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ اِذَا ہُمۡ یَقۡنَطُوۡنَ ﴿۳۷﴾", "english": " And when We make mankind taste of mercy, they rejoice therein; but if an evil befall them because of that which their own hands have sent on, behold! they are in despair.", "french": " Et lorsque Nous faisons les hommes goûter de Notre miséricorde, ils s’en réjouissent ; mais quand un malheur leur survient par suite de ce qu’ils ont acquis de leurs propres mains, voilà qu’ils désespèrent.", "german": " Und wenn Wir die Menschen Barmherzigkeit kosten lassen, freuen sie sich ihrer; doch wenn sie ein Übel befällt um dessentwillen, was ihre eigenen Hände vorausgesandt, siehe, dann verzweifeln sie.", "spanish": " Y cuando favorecemos a la hu­manidad con el sabor de la isericordia, se regocijan; pero cuando les acaece el mal por lo que ellos mismos han ganado con sus manos, he ahí que empiezan a desesperarse.", "urdu": " جب ہم لوگوں سے رحم کا سلوک کرتے ہیں تو وہ اس سے خوش ہو جاتے ہیں اور اگر انہیں اپنے سابقہ اعمال کی وجہ سے کوئی تکلیف پہنچے تو وہ اچانک مایوس ہو جاتے ہیں۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّ اللّٰہَ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ وَ یَقۡدِرُ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۳۸﴾", "english": " Have they not seen that Allah enlarges the provision to whomsoever He pleases, and straitens it to whomsoever He pleases ? In that truly are Signs for a people who believe.", "french": " N’ont-ils pas vu qu’Allāh élargit les moyens de qui Il veut, et les réduit pour qui Il veut. En vérité il y a là des Signes pour un peuple qui croit.", "german": " Haben sie nicht gesehen, dass Allah die Mittel zum Unterhalt weitet und beschränkt, wem Er will? Hierin sind wahrlich Zeichen für ein Volk, das glaubt.", "spanish": " ¿No han visto acaso que Al‑lah amplía la provisión a quien Le place, y la estrecha a quien desea? Aquí hay realmente Signos para los hombres que creen.", "urdu": " کیا انہوں نے نہیں دیکھا کہ اللہ جس کے لئے پسند کرتا ہے رزق فراخ کر دیتا ہے اور جس کے لئے پسند کرتا ہے رزق تنگ کر دیتا ہے اس میں ایمان لانے والے لوگوں کے لئے بہت سے نشانات ہیں۔"}, {"arabic": " فَاٰتِ ذَاالۡقُرۡبٰی حَقَّہٗ وَ الۡمِسۡکِیۡنَ وَ ابۡنَ‌السَّبِیۡلِ ؕ ذٰلِکَ خَیۡرٌ لِّلَّذِیۡنَ یُرِیۡدُوۡنَ وَجۡہَ اللّٰہِ ۫ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۳۹﴾", "english": " So give to the kinsman his due, and to the needy, and to the wayfarer. That is best for those who seek the favour of Allah, and it is they who will prosper.", "french": " Alors donne au proche parent ce qui lui est dû, et au nécessiteux et au voyageur. Cela vaut mieux pour ceux qui recherchent le plaisir d’Allāh, et ceux-là qui prospéreront.", "german": " So gib dem Verwandten, was ihm zukommt, wie auch dem Bedürftigen und dem Wanderer. Das ist das Beste für die, die nach Allahs Antlitz verlangen, und sie sind die Erfolgreichen.", "spanish": " Dad pues al pariente lo que se le debe, y al necesitado y al viajero, Eso es lo mejor para los que buscan el favor de Al‑lah; y son ellos los que prosperarán.", "urdu": " پس چاہیے (کہ جب خدا رزق میں فراخی دے تو اے قرآن کے پڑھنے والے) قریبی‘ مسکین اور مسافر کو اس کا حق بخش۔ یہ بات بہت بہتر ہے ان لوگوں کے لئے جو اللہ کی رضا حاصل کرنا چاہتے ہیں اور وہی لوگ بامراد ہونے والے ہیں۔"}, {"arabic": " وَ مَاۤ اٰتَیۡتُمۡ مِّنۡ رِّبًا لِّیَرۡبُوَا۠ فِیۡۤ اَمۡوَالِ النَّاسِ فَلَا یَرۡبُوۡا عِنۡدَ اللّٰہِ ۚ وَ مَاۤ اٰتَیۡتُمۡ مِّنۡ زَکٰوۃٍ تُرِیۡدُوۡنَ وَجۡہَ اللّٰہِ فَاُولٰٓئِکَ ہُمُ الۡمُضۡعِفُوۡنَ ﴿۴۰﴾", "english": " Whatever you pay as interest that it may increase the wealth of the people, it does not increase in the sight of Allah; but whatever you give in Zakat seeking the favour of Allah — it is these who will increase their wealth manifold.", "french": " Tout ce que vous prêterez à intérêt pour augmenter la richesse des hommes, n’augmentera pas aux yeux d’Allāh, mais tout ce que vous donnerez en Zakât recherchant le plaisir d’Allāh – ce sont ceux-là qui feront multiplier leur richesse.", "german": " Was immer ihr auf Zinsen verleiht, damit es sich vermehre mit dem Gut der Menschen, es vermehrt sich nicht vor Allah; doch was ihr an Zakât gebt, indem ihr nach Allahs Antlitz verlangt – sie sind es, die vielfache Mehrung empfangen werden.", "spanish": " Lo que pagáis como inte­reses para que aumente la riqueza de los hombres, no la aumenta a la vista de Al‑lah; sin embargo, todo lo que dais en Zakat buscando el favor de Al‑lah, sabed que éstos es a quienes se aumentará muchas veces su riqueza.", "urdu": " اور جو روپیہ تم سود حاصل کرنے کے لئے دیتے ہو‘ تاکہ وہ لوگوں کے مالوں میں بڑھے تو وہ روپیہ اللہ کے حضور میں نہیں بڑھتا اور جو تم اللہ کی رضا حاصل کرنے کے لئے زکٰوۃ کے طور پر دیتے ہو تو یاد رکھو کہ اسی قسم کے لوگ خدا کے ہاں (روپیہ) بڑھا رہے ہیں۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ خَلَقَکُمۡ ثُمَّ رَزَقَکُمۡ ثُمَّ یُمِیۡتُکُمۡ ثُمَّ یُحۡیِیۡکُمۡ ؕ ہَلۡ مِنۡ شُرَکَآئِکُمۡ مَّنۡ یَّفۡعَلُ مِنۡ ذٰلِکُمۡ مِّنۡ شَیۡءٍ ؕ سُبۡحٰنَہٗ وَ تَعٰلٰی عَمَّا یُشۡرِکُوۡنَ ﴿٪۴۱﴾", "english": " It is Allah Who has created you, and then He has provided for you; then He will cause you to die, and then He will bring you to life. Is there any of your ‘partners’ who can do any of these things? Glorified be He and exalted above that which they associate with Him.", "french": " C’est Allāh Qui vous a créés, et ensuite Il a pourvu à vos besoins ; ensuite Il vous fera mourir, et ensuite Il vous ramènera à la vie. Y-a-t-il quelqu’un de vos 'associés' qui soit capable de faire l’une de ces choses ? Allāh est Pur et Exalté bien au-dessus de ce qu’ils Lui associent !", "german": " Allah ist es, Der euch erschaffen hat, und dann hat Er euch versorgt; dann wird Er euch sterben lassen, und dann wird Er euch wieder lebendig machen. Ist etwa unter euren Göttern einer, der etwas von diesem vollbringen könnte? Gepriesen sei Er und hoch erhaben über das, was sie anbeten!", "spanish": " Es Al‑lah Quien os ha creado, y os ha provisto de dones; después Él os hará morir y os devolverá de nuevo a la vida. ¿Hay alguno de vuestros “partícipes” que puedan ha­cer alguna de estas cosas? Glorifi­cado sea Él y exaltado por encima de lo que Le asocian.", "urdu": " اللہ وہ ہے جس نے تم کو پیدا کیا ہے پھر اس نے تم کو رزق دیا ہے۔ پھر وہ تمہیں مارے گا‘ پھر وہ تمہیں زندہ کرے گا۔ کیا تمہارے (تجویز کردہ) شرکا میں سے بھی کوئی ایسا ہے جو اس کام کا کوئی حصہ بھی کرتا ہو؟ وہ ان کے شرک سے پاک‘ اور بلند شان رکھنے والا ہے۔"}, {"arabic": " ظَہَرَ الۡفَسَادُ فِی الۡبَرِّ وَ الۡبَحۡرِ بِمَا کَسَبَتۡ اَیۡدِی النَّاسِ لِیُذِیۡقَہُمۡ بَعۡضَ الَّذِیۡ عَمِلُوۡا لَعَلَّہُمۡ یَرۡجِعُوۡنَ ﴿۴۲﴾", "english": " Corruption has appeared on land and sea because of what men’s hands have wrought, that He may make them taste the fruit of some of their doings, so that they may turn back from evil .", "french": " La corruption est apparue sur terre et sur mer par suite des œuvres qu’ont faites les mains des hommes, afin qu’Il puisse leur faire goûter les fruits de certaines de leurs actions, car il se peut qu’ils retournent vers Allāh .", "german": " Verderbnis ist gekommen über Land und Meer um dessentwillen, was die Hände der Menschen gewirkt, auf dass Er sie kosten lasse die (Früchte) so mancher ihrer Handlungen, damit sie umkehren.", "spanish": " La corrupción ha aparecido en la tierra y en el mar a causa de lo ue han forjado las manos de los hombres, para que Él les haga probar el fruto de algunas de sus acciones, y para que se aparten del mal.", "urdu": " (اس زمانہ میں) خشکی اور تری میں لوگوں کے کاموں کی وجہ سے فساد نمایاں ہو گیا ہے جس کا نتیجہ یہ ہوگا کہ خدا لوگوں کو ان کے عملوں کے کچھ حصے کی سزا (اس دنیا میں) دے گا۔ تاکہ وہ (اپنی نافرمانی سے) لوٹ آئیں۔"}, {"arabic": " قُلۡ سِیۡرُوۡا فِی الۡاَرۡضِ فَانۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الَّذِیۡنَ مِنۡ قَبۡلُ ؕ کَانَ اَکۡثَرُہُمۡ مُّشۡرِکِیۡنَ ﴿۴۳﴾", "english": " Say, ‘Travel in the earth and see how evil was the end of those before you ! Most of them were idolaters.’", "french": " Dis : « Parcourez la terre et voyez combien mauvaise fut la fin de ceux qui vous ont devancés. La plupart d’entre eux étaient des associateurs. »", "german": " Sprich: \"Reiset umher auf Erden und seht, wie das Ende derer zuvor war! Die meisten von ihnen waren Götzendiener.\"", "spanish": " Diles: “¡Viajad por la tierra y ved qué malo fue el fin de los que os precedieron! La mayoría de ellos fueron idólatras”.", "urdu": " تو کہہ دے‘ ملک میں پھرو۔ اور دیکھو کہ جو لوگ تم سے پہلے تھے ان کا کیا انجام ہوا تھا۔ ان میں سے اکثر مشرک تھے۔"}, {"arabic": " فَاَقِمۡ وَجۡہَکَ لِلدِّیۡنِ الۡقَیِّمِ مِنۡ قَبۡلِ اَنۡ یَّاۡتِیَ یَوۡمٌ لَّا مَرَدَّ لَہٗ مِنَ اللّٰہِ یَوۡمَئِذٍ یَّصَّدَّعُوۡنَ ﴿۴۴﴾", "english": " So set thy face to the service of the right religion before there comes the day from Allah for which there will be no averting. On that day mankind will split up into parts .", "french": " Dévoue donc toute ton attention à la religion droite qui aide les autres à être droites, avant que ne vienne d’Allāh le jour qu'on ne peut repousser. Ce jour-là ils se diviseront en groupes distincts les uns des autres.", "german": " Richte dein Antlitz auf den beständigen Glauben, bevor der Tag kommt, für den es keine Wehr gibt gegen Allah. An jenem Tage werden sie gespalten sein.", "spanish": " Levanta pues tu rostro hacia la religión justa que ayuda a los demás a ser justos, an­tes de que llegue el día de Al‑lah en el que no abrá escape. En ese día se dividirán en grupos, distintos entre si .", "urdu": " پس تو اپنی توجہ کو قائم رہنے والے دین کی طرف پھیر دے پیشتر اس کے کہ وہ دن آئے جس کو ٹلانے کے لئے اللہ کی طرف سے کوئی علاج نہیں اترا جس دن وہ (مومن اور کافر) ایک دوسرے سے الگ ہو جائیں گے۔"}, {"arabic": " مَنۡ کَفَرَ فَعَلَیۡہِ کُفۡرُہٗ ۚ وَ مَنۡ عَمِلَ صَالِحًا فَلِاَنۡفُسِہِمۡ یَمۡہَدُوۡنَ ﴿ۙ۴۵﴾", "english": " Those who disbelieve will bear the consequences of their disbelief; and those who do righteous deeds prepare good for themselves,", "french": " Celui qui refuse de croire subira les conséquences de sa mécréance ; et ceux qui font de bonnes œuvres préparent du bien pour leur propre âme –", "german": " Wer ungläubig ist: auf ihn sein Unglaube! Und wer Rechtes tut, der bereitet es sich selbst.", "spanish": " Los incrédulos sufrirán las consecuencias de su ncredulidad; y los que hagan buenas obras se pre­pararán el bien para ellos mismos,", "urdu": " جس نے کفر کیا اس پر اس کے کفر کا وبال پڑے گا۔ اور جس نے اپنے ایمان کے مطابق عمل کیا وہ اپنے ہی نفس کے فائدہ کے لئے تیاری کر رہا ہے۔"}, {"arabic": " لِیَجۡزِیَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ مِنۡ فَضۡلِہٖ ؕ اِنَّہٗ لَا یُحِبُّ الۡکٰفِرِیۡنَ ﴿۴۶﴾", "english": " That He, out of His bounty, may reward those who believe and do righteous deeds. Surely, He loves not the disbelievers.", "french": " Afin que, de Sa munificence, Il puisse récompenser ceux qui croient et font de bonnes œuvres. Assurément, Il n’aime pas les mécréants.", "german": " Dass Er lohnen möge aus Seiner Gnadenfülle denen, die glauben und das Rechte tun. Wahrlich, Er liebt nicht die Leugner.", "spanish": " Para que Él, de Su magnani­midad, recompense a los que creen y hacen buenas obras. En verdad, Él no ama a los incrédulos.", "urdu": " تاکہ خدا مومنوں اور اپنے ایمان کے مطابق عمل کرنے والوں کو اپنے فضل سے جزا دے وہ یقیناً منکروں سے محبت نہیں کرتا۔"}, {"arabic": " وَ مِنۡ اٰیٰتِہٖۤ اَنۡ یُّرۡسِلَ الرِّیَاحَ مُبَشِّرٰتٍ وَّ لِیُذِیۡقَکُمۡ مِّنۡ رَّحۡمَتِہٖ وَ لِتَجۡرِیَ الۡفُلۡکُ بِاَمۡرِہٖ وَ لِتَبۡتَغُوۡا مِنۡ فَضۡلِہٖ وَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۴۷﴾", "english": " And among His Signs is this , that He sends the winds as bearers of glad tidings and that He may make you taste of His mercy, and that the ships may sail at His command, and that you may seek of His bounty, and that you may be grateful.", "french": " Et parmi Ses Signes est ceci , qu’Il envoie les vents comme annonciateurs de bonnes nouvelles, et afin qu’Il vous fasse goûter de Sa miséricorde, et que les navires puissent voguer selon Son commandement, et que vous puissiez rechercher quelque munificence de Sa part, et que vous soyez reconnaissants.", "german": " Und unter Seinen Zeichen ist dies, dass Er die Winde entsendet mit froher Botschaft, auf dass Er euch von Seiner Barmherzigkeit kosten lasse, und dass die Schiffe segeln auf Sein Geheiß, und dass ihr nach Seiner Gnadenfülle trachtet, und dass ihr dankbar seiet.", "spanish": " Y entre Sus Signos está éste: Que envía los vientos como porta­dores de buena nueva, para ha­ceros probar el gusto de Su miseri­cordia, para que los buques zarpen bajo Su mando, podáis solicitar de Su generosidad y seáis agradecidos.", "urdu": " اور اس کے نشانوں میں سے ایک نشان ہواٶں کا بشارت دیتے ہوئے بھیجنا بھی ہے اور وہ اس لئے ایسا کرتا ہے کہ تا وہ تم کو اپنی رحمت (کا پھل) چکھائے۔ اور کشتیاں اس کے حکم سے چلیں اور تم اس کے فضل کو حاصل کرو اور تم شکر گذار بنو۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا مِنۡ قَبۡلِکَ رُسُلًا اِلٰی قَوۡمِہِمۡ فَجَآءُوۡہُمۡ بِالۡبَیِّنٰتِ فَانۡتَقَمۡنَا مِنَ الَّذِیۡنَ اَجۡرَمُوۡا ؕ وَ کَانَ حَقًّا عَلَیۡنَا نَصۡرُ الۡمُؤۡمِنِیۡنَ ﴿۴۸﴾", "english": " And surely We sent Messengers before thee to their own people, and they brought them clear Signs. Then We punished those who were guilty. And it was certainly due from Us to help the believers.", "french": " Et assurément, avant toi Nous avons envoyé des Messagers à leurs propres peuples. Et ils leur ont apporté des signes clairs. Ensuite Nous avons châtié sans ménagement ceux qui étaient coupables. Et il Nous incombait certainement de venir en aide aux croyants.", "german": " Wir schickten schon Gesandte vor dir zu ihrem eigenen Volk. Sie brachten ihnen klare Beweise. Dann straften Wir die Schuldigen; und es oblag Uns, den Gläubigen zu helfen.", "spanish": " En verdad enviamos Mensa­jeros antes de ti a sus propios pue­blos, y les llevaron Signos claros. Después castigamos rotundamente a los culpables. Y ciertamente era obli­gación Nuestra ayudar a los cre­yentes.", "urdu": " اور ہم نے تجھ سے پہلے کئی رسول ان کی قوموں کی طرف بھیجے تھے پس وہ ان کے پاس کھلے کھلے نشان لے کر آئے اور ہم نے مجرموں سے مناسب بدلہ لیا‘ اور مومنوں کی مدد کرنا ہمارا فرض ہے۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ یُرۡسِلُ الرِّیٰحَ فَتُثِیۡرُ سَحَابًا فَیَبۡسُطُہٗ فِی السَّمَآءِ کَیۡفَ یَشَآءُ وَ یَجۡعَلُہٗ کِسَفًا فَتَرَی الۡوَدۡقَ یَخۡرُجُ مِنۡ خِلٰلِہٖ ۚ فَاِذَاۤ اَصَابَ بِہٖ مَنۡ یَّشَآءُ مِنۡ عِبَادِہٖۤ اِذَا ہُمۡ یَسۡتَبۡشِرُوۡنَ ﴿ۚ۴۹﴾", "english": " It is Allah Who sends the winds so that they raise a cloud. Then He spreads it in the sky as He pleases and places it layer upon layer and thou seest the rain issuing forth from its midst. And when He causes it to fall on whom He pleases of His servants, behold! they rejoice;", "french": " C’est Allāh Qui envoie les vents de sorte qu’ils soulèvent un nuage. Ensuite Il le répand dans le ciel comme Il le veut, ensuite, Il le transforme en différents morceaux, et tu vois la pluie sortir de son milieu. Et lorsqu’Il la fait tomber sur qui Il veut de Ses serviteurs, voilà qu’ils s’ en réjouissent ;", "german": " Allah ist es, Der die Winde entsendet, so dass sie eine Wolke hochtreiben. Dann breitet Er sie am Himmel aus, wie Er will, und häuft sie auf, Schicht auf Schicht, und du siehst den Regen hervorbrechen aus ihrer Mitte. Und wenn Er ihn fallen lässt auf wen Er will von Seinen Dienern, siehe, dann jauchzen sie,", "spanish": " Es Al‑lah Quien envía los vientos para que levanten la nube. Después la extiende por el cielo como Le place y la coloca capa sobre capa y ves la lluvia que sale de en medio de ella. Y cuando la hace caer sobre quienes Le agradan de Sus siervos, mirad cómo se regocijan;", "urdu": " اللہ وہ ہے جو ہواٶں کو بھیجتا ہے‘ پھر وہ ہوائیں بادل کی شکل میں بخارات اٹھاتی ہیں۔ پھر وہ اس کو جس طرح چاہتا ہے آسمان میں پھیلا دیتا ہے اور وہ اسے ٹکڑے ٹکڑے کر دیتا ہے اور تو بارش کو دیکھتا ہے کہ اس (بادل) میں سے ٹپکتی ہے پھر جب خدا اس بادل کو اپنے بندوں میں سے جس تک پسند کرے پہنچا دیتا ہے تو اچانک وہ خوش ہو جاتے ہیں۔"}, {"arabic": " وَ اِنۡ کَانُوۡا مِنۡ قَبۡلِ اَنۡ یُّنَزَّلَ عَلَیۡہِمۡ مِّنۡ قَبۡلِہٖ لَمُبۡلِسِیۡنَ ﴿۵۰﴾", "english": " Though before that — before it was sent down upon them — they were in despair.", "french": " Quoique, auparavant – avant qu’on ne l’ait fait descendre sur eux – ils étaient au désespoir.", "german": " wiewohl sie zuvor, ehe er auf sie niedergesandt ward, in Verzweiflung waren.", "spanish": " Aunque antes de eso, antes incluso de que fuese enviada sobre ellos, estaban desesperados.", "urdu": " گو وہ اس (بارش) کے نازل ہونے سے پہلے بالکل ناامید ہوگئے تھے۔"}, {"arabic": " فَانۡظُرۡ اِلٰۤی اٰثٰرِ رَحۡمَتِ اللّٰہِ کَیۡفَ یُحۡیِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا ؕ اِنَّ ذٰلِکَ لَمُحۡیِ الۡمَوۡتٰی ۚ وَ ہُوَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۵۱﴾", "english": " Look, therefore, at the marks of Allah’s mercy: how He quickens the earth after its death. Verily, the same God will quicken the dead; for He has power over all things.", "french": " Considère, donc, les effets de la miséricorde d’Allāh ; comment Il ranime la terre après sa mort. En vérité, c’est Lui-Même Qui ranimera les morts ; car Il a le pouvoir de faire tout ce qu’Il veut.", "german": " Drum schau hin auf die Spuren von Allahs Barmherzigkeit: wie Er die Erde belebt nach ihrem Tode. Wahrlich, derselbe (Gott) wird auch die Toten beleben; denn Er vermag alle Dinge zu tun.", "spanish": " Mira, pues, las señales de la misericordia de Al‑lah: cómo ivi­fica la tierra después de su muerte. En verdad, el mismo Dios resucitará a los muertos; pues Él tiene poder sobre todas las cosas.", "urdu": " پس (اے مخاطب) اللہ کی رحمت کے نشانوں کو دیکھ کہ وہ کس طرح زمین کے مر جانے کے بعد اس کو زندہ کرتا ہے۔ یہی خدا ہے جو قیامت کے دن) مردوں کو زندہ کرے گا اور وہ ہر چیز پر قادر ہے۔"}, {"arabic": " وَ لَئِنۡ اَرۡسَلۡنَا رِیۡحًا فَرَاَوۡہُ مُصۡفَرًّا لَّظَلُّوۡا مِنۡۢ بَعۡدِہٖ یَکۡفُرُوۡنَ ﴿۵۲﴾", "english": " And if We sent a wind and they saw it (their harvest) turn yellow, they would certainly, thereafter, begin to deny Our favours .", "french": " Et si Nous envoyions un vent sur leur végétation , et qu’ils la voyaient jaunir, ils nieraient certainement par la suite toutes Nos faveurs.", "german": " Und wenn Wir einen Wind entsendeten und sie sähen (ihre Ernte) vergilben, so würden sie gewisslich danach undankbar sein.", "spanish": " Mas si enviásemos un viento y vieran cómo (sus cosechas) se ponen marillas, empezarían cierta­mente a negar Nuestros fa­vores a continuación .", "urdu": " اور اگر ہم ہوا چلائیں اور یہ لوگ اس (یعنی کھیتی) کو زرد زرد دیکھیں‘ تو اس نظارہ کے بعد (بجائے نصیحت حاصل کرنے کے) ناشکر گذار بن جائیں گے۔"}, {"arabic": " فَاِنَّکَ لَا تُسۡمِعُ الۡمَوۡتٰی وَ لَا تُسۡمِعُ الصُّمَّ الدُّعَآءَ اِذَا وَلَّوۡا مُدۡبِرِیۡنَ ﴿۵۳﴾", "english": " And thou canst not make the dead to hear, nor canst thou make the deaf to hear the call, when they turn away showing their backs.", "french": " Et tu ne peux pas faire entendre les morts, et tu ne peux pas non plus faire entendre l’appel aux sourds, lorsqu’ils tournent le dos et se retirent.", "german": " Und du kannst die Toten nicht hörend machen, noch kannst du die Tauben den Ruf hören machen, wenn sie den Rücken kehren,", "spanish": " Mas no puedes hacer que los muertos oigan, ni puedes hacer que los sordos oigan la llamada, cuando se dan la vuelta mostrando sus es­paldas;", "urdu": " (پس تو ان کو ایسا کرنے دے) کیونکہ نہ تو تو مردوں کو سنا سکتا ہے اور نہ بہروں کو اس وقت (اپنی) آواز سنا سکتا ہے جب وہ پیٹھ پھیر کر لوٹ جائیں۔"}, {"arabic": " وَ مَاۤ اَنۡتَ بِہٰدِ الۡعُمۡیِ عَنۡ ضَلٰلَتِہِمۡ ؕ اِنۡ تُسۡمِعُ اِلَّا مَنۡ یُّؤۡمِنُ بِاٰیٰتِنَا فَہُمۡ مُّسۡلِمُوۡنَ ﴿٪۵۴﴾", "english": " Nor canst thou guide the blind out of their error. Thou canst make only those to hear who would believe in Our Signs and they submit.", "french": " Et tu ne peux pas non plus guider les aveugles hors de leur erreur. Tu ne peux faire entendre que ceux qui voudront croire en Nos signes ; c’est eux les soumis.", "german": " noch kannst du die Blinden aus ihrem Irrtum leiten. Nur die wirst du hörend machen, die an Unsere Zeichen glauben und sich ergeben.", "spanish": " Ni puedes sacar al ciego de su error. Sólo puedes hacer que oigan quienes crean en Nuestros Signos y se sometan.", "urdu": " اور نہ تو اندھوں کو ان کی گمراہی سے ہٹا کر سیدھے راستہ پر لا سکتا ہے تو صرف انہی کو سنا سکتا ہے جو ہماری آیتوں پر ایمان لاتے ہیں اور وہ فرمانبردار بن جاتے ہیں۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ خَلَقَکُمۡ مِّنۡ ضُؔعۡفٍ ثُمَّ جَعَلَ مِنۡۢ بَعۡدِ ضُؔعۡفٍ قُوَّۃً ثُمَّ جَعَلَ مِنۡۢ بَعۡدِ قُوَّۃٍ ضُؔعۡفًا وَّ شَیۡبَۃً ؕ یَخۡلُقُ مَا یَشَآءُ ۚ وَ ہُوَ الۡعَلِیۡمُ الۡقَدِیۡرُ ﴿۵۵﴾", "english": " It is Allah Who created you in a state of weakness, and after weakness gave strength; then, after strength, caused weakness and old age. He creates what He pleases. He is the All-knowing, the All-Powerful.", "french": " C’est Allāh Qui vous a créés dans un état de faiblesse, et après la faiblesse, Il vous a donné de la vigueur. Ensuite, après la vigueur, Il causa la faiblesse et la vieillesse. Il crée ce qu’Il veut. Il est l’Omniscient, le Tout-Puissant.", "german": " Allah ist es, Der euch in Schwäche erschaffen hat, und nach der Schwäche gab Er Stärke. Dann wiederum, nach der Stärke, gab Er Schwäche und graues Haar. Er schafft, was Er will. Und Er ist der Allwissende, der Allmächtige.", "spanish": " Es Al‑lah Quien os creó en estado de debilidad y, después de la debilidad, os dio la fuerza; más tarde, tras la fuerza, provocó la debi­lidad y la vejez. Él crea lo que Le place. Él es el Omnisciente, el Todo­poderoso.", "urdu": " اللہ وہی ہے جس نے تم کو اس حالت میں پیدا کیا کہ تمہارے اندر کمزوری پائی جاتی تھی۔ پھر کمزوری کے بعد تم کو قوت بخشی پھر قوت کے بعد ضعف اور بڑھاپا دیا۔ وہ جس چیز کو چاہتا ہے پیدا کرتا ہے اور وہ بڑے علم والا (اور) قدرت والا ہے۔"}, {"arabic": " وَ یَوۡمَ تَقُوۡمُ السَّاعَۃُ یُقۡسِمُ الۡمُجۡرِمُوۡنَ ۬ۙ مَا لَبِثُوۡا غَیۡرَ سَاعَۃٍ ؕ کَذٰلِکَ کَانُوۡا یُؤۡفَکُوۡنَ ﴿۵۶﴾", "english": " And on the day when the Hour shall arrive the guilty will swear that they tarried not save an hour — thus were they turned away from the right path .", "french": " Et le jour où l’Heure arrivera, les coupables jureront qu’ils ne sont restés qu’une heure – ainsi furent-ils détournés du droit chemin.", "german": " Und an dem Tage, da die \"Stunde\" herankommt, werden die Missetäter schwören, dass sie nicht länger als eine Stunde gesäumt – so haben sie sich immer getäuscht.", "spanish": " Y en el día en que llegue la Hora los culpables jurarán que no han ermanecido sino una hora: así fueron apartados del camino recto.", "urdu": " اور جس دن مقررہ گھڑی آجائے گی مجرم قسمیں کھائیں گے کہ وہ ایک چھوٹے وقفہ کے سوا (دنیا میں) نہیں رہے۔ وہ اسی طرح بہکی بہکی باتیں بناتے ہیں۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ وَ الۡاِیۡمَانَ لَقَدۡ لَبِثۡتُمۡ فِیۡ کِتٰبِ اللّٰہِ اِلٰی یَوۡمِ الۡبَعۡثِ ۫ فَہٰذَا یَوۡمُ الۡبَعۡثِ وَ لٰکِنَّکُمۡ کُنۡتُمۡ لَا تَعۡلَمُوۡنَ ﴿۵۷﴾", "english": " But those who are given knowledge and faith will say, ‘You have indeed tarried according to the Book of Allah, till the Day of Resurrection. And this is the Day of Resurrection, but you did not care to know.’", "french": " Mais ceux à qui la connaissance et la foi sont données, diront : « D’après le Livre d’Allāh, vous êtes assurément restés jusqu’au Jour de la Résurrection. Et voici le Jour de la Résurrection, mais vous ne vouliez pas le savoir. »", "german": " Doch die, denen Kenntnis und Glauben verliehen ward, werden sprechen: \"Ihr habt fürwahr, gemäß dem Buche Allahs, bis zum Tage des Wiederaufstieges gesäumt. Und das ist der Tag des Wiederaufstieges, allein ihr wolltet es nicht wissen.\"", "spanish": " Pero quienes poseen el cono­cimiento y la fe, dirán: “En verdad, habéis permanecido, según el Libro de Al‑lah, hasta el Día de la Re­surrección. Y éste es el Día de la Resurrección, aunque no os preocupasteis de conocerlo”.", "urdu": " اور وہ لوگ جن کو علم اور ایمان دیا گیا ہے کہیں گے تم اللہ کے حساب میں اس دن تک ٹھہرے ہو جو تمہارے پھر ابھرنے کے لئے مقرر تھا اور (یاد رکھو کہ) یہی پھر ابھرنے کا دن ہے۔ لیکن تم جانتے نہیں۔"}, {"arabic": " فَیَوۡمَئِذٍ لَّا یَنۡفَعُ الَّذِیۡنَ ظَلَمُوۡا مَعۡذِرَتُہُمۡ وَ لَا ہُمۡ یُسۡتَعۡتَبُوۡنَ ﴿۵۸﴾", "english": " So on that day their excuses will not avail the wrongdoers; nor will they be allowed to make amends.", "french": " Ainsi ce Jour-là leurs excuses ne seront d’aucune utilité aux injustes ; et ils n’auront pas non plus accès à Son seuil.", "german": " So werden denn an jenem Tage ihre Ausreden den Frevlern nichts fruchten, noch werden sie Gunst finden.", "spanish": " Así, en aquel día sus excusas no servirán de nada a los injustos; ni se les permitirá acceder a Su umbral.", "urdu": " پس آج ظالموں کو ان کا کوئی عذر نفع نہیں دے گا اور نہ انہیں معاف کرکے ڈیوڑھی تک آنے کا موقع دیا جائے گا۔"}, {"arabic": " وَ لَقَدۡ ضَرَبۡنَا لِلنَّاسِ فِیۡ ہٰذَا الۡقُرۡاٰنِ مِنۡ کُلِّ مَثَلٍ ؕ وَ لَئِنۡ جِئۡتَہُمۡ بِاٰیَۃٍ لَّیَقُوۡلَنَّ الَّذِیۡنَ کَفَرُوۡۤا اِنۡ اَنۡتُمۡ اِلَّا مُبۡطِلُوۡنَ ﴿۵۹﴾", "english": " And truly, We have set forth for men in this Qur’an every kind of parable; and indeed, if thou bring them a Sign, those who disbelieve will surely say, ‘You are but liars.’", "french": " Et, en vérité, dans ce Coran, Nous avons exposé pour les hommes des paraboles de toutes sortes, et, en vérité, si tu leur apportes un Signe, ceux qui ne croient pas diront sans doute : « Vous n’êtes que des menteurs. »", "german": " Wahrlich, Wir haben den Menschen in diesem Qur-ân alle Art Gleichnis aufgestellt; aber wenn du ihnen ein Zeichen bringst, dann werden jene, die ungläubig sind, sicherlich sagen: \"Ihr seid nur Lügner.\"", "spanish": " Y en verdad, en este Corán hemos propuesto a los hombres todo tipo de parábolas; y ciertamente si les trajeras un Signo, los incrédulos dirían con seguridad: “No sois más que mentirosos”.", "urdu": " اور ہم نے لوگوں کی خاطر اس قرآن میں ہر قسم کی حقیقتیں کھول کھول کر بیان کر دی ہیں اور اگر تو ان کے پاس کوئی نشان لائے تو کافر ضرور کہیں گے کہ تم لوگ تو صرف جھوٹی باتیں پیش کرنے والے ہو۔"}, {"arabic": " کَذٰلِکَ یَطۡبَعُ اللّٰہُ عَلٰی قُلُوۡبِ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ ﴿۶۰﴾", "english": " Thus does Allah seal the hearts of those who have no knowledge.", "french": " C’est ainsi qu’Allāh scelle le cœur de ceux qui ne savent pas.", "german": " Also versiegelt Allah die Herzen derer, die unwissend sind.", "spanish": " Así sella Al-lah los corazones de los que carecen de conocimiento.", "urdu": " اسی طرح اللہ بے علم لوگوں کے دلوں پر مہر لگا دیتا ہے۔"}], "Surah": 30}