{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " الٓـمّٓ ۚ﴿۲﴾", "english": " Alif Lam Mim.", "french": " Alif Lām Mīm (Je suis Allāh, le Plus-Savant).", "german": " Alif Lâm Mîm.", "spanish": " Alif Lam Mim.", "urdu": " میں اللہ ہوں جو سب سے زیادہ جانتا ہوں۔"}, {"arabic": " تَنۡزِیۡلُ الۡکِتٰبِ لَا رَیۡبَ فِیۡہِ مِنۡ رَّبِّ الۡعٰلَمِیۡنَ ؕ﴿۳﴾", "english": " The revelation of the Book — there is no doubt about it — is from the Lord of the worlds.", "french": " La révélation du Livre – il n’y a aucun doute là-dessus – est du Seigneur des mondes.", "german": " Die Offenbarung des Buches ist vom Herrn der Welten, daran ist kein Zweifel.", "spanish": " La revelación del Libro ‑no hay duda al respecto ‑ procede del Señor de los mundos.", "urdu": " اس کتاب کا(جس کی یہ ایک سورۃ ہے) رب العالمین کی طرف سے اتارا جانا ایک یقینی بات ہے‘ جس میں کوئی شبہ نہیں۔"}, {"arabic": " اَمۡ یَقُوۡلُوۡنَ افۡتَرٰٮہُ ۚ بَلۡ ہُوَ الۡحَقُّ مِنۡ رَّبِّکَ لِتُنۡذِرَ قَوۡمًا مَّاۤ اَتٰہُمۡ مِّنۡ نَّذِیۡرٍ مِّنۡ قَبۡلِکَ لَعَلَّہُمۡ یَہۡتَدُوۡنَ ﴿۴﴾", "english": " Do they say, ‘He has forged it?’ Nay, it is the truth from thy Lord, that thou mayest warn a people to whom no Warner has come before thee, that haply they may follow guidance.", "french": " Disent-ils : « Il l’a fabriqué ! » ? Non, c’est la vérité de la part de ton Seigneur, afin que tu puisses avertir un peuple à qui aucun Avertisseur n’est venu avant toi, et pour que, possiblement, ils suivent la bonne voie.", "german": " Sagen sie: \"Er hat es erdichtet?\" Nein, es ist die Wahrheit von deinem Herrn, auf dass du ein Volk warnen mögest, zu dem vor dir kein Warner gekommen ist, damit sie dem rechten Weg folgen mögen.", "spanish": " ¿Acaso dicen: “Él lo ha inven­tado?”. No, es la verdad de tu Señor, para que adviertas al pueblo al que no ha llegado ningún Amonestador antes de Ti, para que tal vez sigan la guía.", "urdu": " کیا وہ لوگ کہتے ہیں کہ اس شخص (یعنی محمد رسول اللہ صلی اللہ علیہ وسلم) نے اس کو اپنے پاس سے بنا لیا ہے۔ ایسا نہیں بلکہ یہ کتاب تیرے رب کی طرف سے نازل ہونے والی (اور قائم رہنے والی) کتاب ہے۔ تا کہ تو اس قوم کو ہشیار کرے جن کے پاس تجھ سے پہلے کوئی رسول نہیں آیا تا کہ وہ ہدایت پائیں۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَا فِیۡ سِتَّۃِ اَیَّامٍ ثُمَّ اسۡتَوٰی عَلَی الۡعَرۡشِ ؕ مَا لَکُمۡ مِّنۡ دُوۡنِہٖ مِنۡ وَّلِیٍّ وَّ لَا شَفِیۡعٍ ؕ اَفَلَا تَتَذَکَّرُوۡنَ ﴿۵﴾", "english": " Allah it is Who created the heavens and the earth, and that which is between them, in six periods; then He settled on the Throne. You have no helper or intercessor beside Him. Will you not then reflect?", "french": " C’est Allāh Qui a crée les cieux et la terre et ce qui est entre eux, en six périodes ; ensuite Il S’est établi sur le Trône. Vous n’avez aucun ami sûr ni d’intercesseur en dehors de Lui. Ne voulez-vous donc pas réfléchir ?", "german": " Allah ist es, Der die Himmel und die Erde und alles, was zwischen den beiden ist, in sechs Zeiten schuf; dann setzte Er Sich auf den Thron. Ihr habt weder einen wahren Freund noch Fürsprecher außer Ihm. Wollt ihr denn nicht ermahnt sein?", "spanish": " Al‑lah es Quien creó los cielos y la tierra y lo que hay entre ellos, en seis períodos; luego se estableció en el Trono. No tenéis ayuda ni intercesor fuera de Él. ¿Acaso no reflexionaréis?", "urdu": " اللہ وہ ہے جس نے آسمانوں اور زمین کو اور جو کچھ ان دونوں کے درمیان ہے‘ اس سب کو چھ وقتوں میں پیدا کیا۔ اس کے بعد وہ عرش حکومت پر مضبوطی سے قائم ہو گیا‘ تمہارا اس (خدا) کے سوا نہ کوئی حقیقی دوست ہے‘ نہ سفارشی کیا تم نصیحت حاصل نہیں کرتے۔"}, {"arabic": " یُدَبِّرُ الۡاَمۡرَ مِنَ السَّمَآءِ اِلَی الۡاَرۡضِ ثُمَّ یَعۡرُجُ اِلَیۡہِ فِیۡ یَوۡمٍ کَانَ مِقۡدَارُہٗۤ اَلۡفَ سَنَۃٍ مِّمَّا تَعُدُّوۡنَ ﴿۶﴾", "english": " He will plan the Divine Ordinance from the heaven unto the earth, then shall it go up to Him in a day the duration of which is a thousand years according to what you reckon.", "french": " Il planifie Son Ordonnance du ciel pour être exécutée sur la terre, puis après avoir complété le cycle elle montera jusqu’à Lui dans un jour, dont la durée est de mille ans selon votre façon de compter.", "german": " Er wird den Ratschluss vom Himmel zur Erde lenken, dann wird er wieder zu Ihm emporsteigen in einem Tage, dessen Länge tausend Jahre ist nach eurer Zeitrechnung.", "spanish": " Él dispone Sus Órdenes desde el Cielo para su ejecución en la tierra y , una vez completado el círculo, vuelve a subir a Él en un día cuya duración, según vuestros cálculos, es de mil años.", "urdu": " وہ آسمان سے زمین تک اپنے حکم کو اپنی تدبیر کے مطابق قائم کرے گا۔ پھر وہ اس کی طرف ایک ایسے وقت میں جس کی مقدار ایسے ہزار سال کی ہے جس کے مطابق تم دنیا میں گنتی کرتے ہو چڑھنا شروع کرے گا۔"}, {"arabic": " ذٰلِکَ عٰلِمُ الۡغَیۡبِ وَ الشَّہَادَۃِ الۡعَزِیۡزُ الرَّحِیۡمُ ۙ﴿۷﴾", "english": " Such is the Knower of the unseen and the seen, the Mighty, the Merciful,", "french": " Tel est Celui Qui connaît l’invisible et le visible, le Puissant, le Miséricordieux,", "german": " Das ist der Kenner des Verborgenen und des Sichtbaren, der Allmächtige, der Barmherzige,", "spanish": " Así es el Conocedor de lo in­visible y de lo visible, el Poderoso, el Misericordioso;", "urdu": " یہ غیب اور حاضر کا جاننے والا (خدا) ہے جو غالب (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " الَّذِیۡۤ اَحۡسَنَ کُلَّ شَیۡءٍ خَلَقَہٗ وَ بَدَاَ خَلۡقَ الۡاِنۡسَانِ مِنۡ طِیۡنٍ ۚ﴿۸﴾", "english": " Who has made perfect everything He has created. And He began the creation of man from clay.", "french": " Qui a bien fait tout ce qu’Il a créé. Et Il a commencé la création de l’homme à partir de l’argile.", "german": " Der alles vollkommen gemacht hat, was Er schuf. Und Er begann die Schöpfung des Menschen aus Ton.", "spanish": " Quien ha hecho perfecto lo que ha creado. Él inició la creación del hombre de barro;", "urdu": " جس نے جو کچھ بھی پیدا کیا ہے اعلیٰ طاقتوں سے پیدا کیا ہے اور انسان کو گیلی مٹی سے پیدا کیا ہے۔"}, {"arabic": " ثُمَّ جَعَلَ نَسۡلَہٗ مِنۡ سُلٰلَۃٍ مِّنۡ مَّآءٍ مَّہِیۡنٍ ۚ﴿۹﴾", "english": " Then He made his progeny from an extract of an insignificant fluid.", "french": " Ensuite Il a fait sa progéniture d’un extrait d’un fluide qui paraît insignifiant.", "german": " Dann bildete Er seine Nachkommenschaft aus dem Auszug einer verächtlichen Flüssigkeit.", "spanish": " Luego creó su progenie a partir de un extracto de un líquido insig­nificante;", "urdu": " پھر اس کی نسل کو ایک حقیر سیال چیز کے خلاصہ (یعنی نطفہ) سے پیدا کیا ہے۔"}, {"arabic": " ثُمَّ سَوّٰٮہُ وَ نَفَخَ فِیۡہِ مِنۡ رُّوۡحِہٖ وَ جَعَلَ لَکُمُ السَّمۡعَ وَ الۡاَبۡصَارَ وَ الۡاَفۡـِٕدَۃَ ؕ قَلِیۡلًا مَّا تَشۡکُرُوۡنَ ﴿۱۰﴾", "english": " Then He fashioned him and breathed into him of His spirit. And He has given you ears, and eyes, and hearts. But little thanks do you give!", "french": " Ensuite Il harmonisa ses formes et lui insuffla de Son esprit. Et Il vous a donné des oreilles, et des yeux, et des cœurs. Mais vous êtes peu reconnaissants !", "german": " Dann formte Er ihn und hauchte ihm von Seinem Geiste ein. Und Er hat euch Ohren und Augen und Herzen gegeben. Aber wenig Dank wisst ihr!", "spanish": " Más tarde lo equilibró y le insufló Su espíritu. Os dio la audición, los ojos y los corazones. ¡Pero qué poco se lo agra­decéis!", "urdu": " پھر اس کو مکمل طاقتیں دیں اور اس میں اپنی طرف سے روح ڈالی اور تمہارے لئے کان‘ اور آنکھ‘ اور دل بنائے۔ مگر تم بالکل شکر نہیں کرتے۔"}, {"arabic": " وَ قَالُوۡۤا ءَ اِذَا ضَلَلۡنَا فِی الۡاَرۡضِ ءَ اِنَّا لَفِیۡ خَلۡقٍ جَدِیۡدٍ ۬ؕ بَلۡ ہُمۡ بِلِقَآیِٔ رَبِّہِمۡ کٰفِرُوۡنَ ﴿۱۱﴾", "english": " And they say, ‘What! when we are lost in the earth, shall we then become a new creation?’ Nay, but they are disbelievers in the meeting of their Lord.", "french": " Et ils disent : « Comment ! Quand nous sommes perdus dans la terre, deviendrons-nous alors réellement une nouvelle création ? » Mais pire ils ne croient pas à la rencontre avec leur Seigneur.", "german": " Und sie sprechen: \"Wie! wenn wir in der Erde verloren sind, sollen wir dann in neuer Schöpfung sein?\" Nein, vielmehr glauben sie an die Begegnung mit ihrem Herrn nicht.", "spanish": " Ellos dicen: “¡Cómo! cuando estemos perdidos en la tierra, ¿vamos acaso a convertirnos en una nueva creación?”. No, no son mas que incré­dulos en la reunión con su Señor.", "urdu": " اور وہ کہتے ہیں کہ کیا جب ہم زمین میں کھوئے جائیں گے تو ہمیں ایک نئی مخلوق کی شکل میں کھڑا کر دیا جائے گا (یہ لوگ اس نئی پیدائش کے منکر نہیں) بلکہ اپنے رب کی ملاقات کے منکر ہیں۔"}, {"arabic": " قُلۡ یَتَوَفّٰٮکُمۡ مَّلَکُ الۡمَوۡتِ الَّذِیۡ وُکِّلَ بِکُمۡ ثُمَّ اِلٰی رَبِّکُمۡ تُرۡجَعُوۡنَ ﴿٪۱۲﴾", "english": " Say, ‘The angel of death that has been put in charge of you will cause you to die; then to your Lord will you be brought back.’", "french": " Dis : « L’ange de la mort qui est chargé de vous, vous fera mourir ; ensuite c’est à votre Seigneur que vous serez ramenés. »", "german": " Sprich: \"Der Engel des Todes, der über euch eingesetzt ward, wird eure Seelen hinnehmen; zu eurem Herrn dann werdet ihr zurückgebracht.\"", "spanish": " Diles: “El ángel de la muerte encargado de vosotros os hará morir; más tarde seréis devuel­tos a vuestro Señor”.", "urdu": " تو کہہ کہ وہ موت کا فرشتہ جو تم پر مقرر کیا گیا ہے‘ ضرور تمہاری روح قبض کرے گا۔ پھر تم اپنے رب کی طرف لوٹائے جاٶ گے۔"}, {"arabic": " وَ لَوۡ تَرٰۤی اِذِ الۡمُجۡرِمُوۡنَ نَاکِسُوۡا رُءُوۡسِہِمۡ عِنۡدَ رَبِّہِمۡ ؕ رَبَّنَاۤ اَبۡصَرۡنَا وَ سَمِعۡنَا فَارۡجِعۡنَا نَعۡمَلۡ صَالِحًا اِنَّا مُوۡقِنُوۡنَ ﴿۱۳﴾", "english": " If only thou couldst see when the guilty will hang down their heads before their Lord, and say , ‘Our Lord, we have seen and we have heard, so send us back that we may do good works; for now we are convinced.’", "french": " Si seulement tu pouvais voir quand les coupables baisseront la tête devant leur Seigneur, et diront : « Notre Seigneur, nous avons vu et nous avons entendu, renvoie-nous donc afin que nous puissions faire de bonnes œuvres ; car maintenant nous sommes convaincus. »", "german": " Könntest du nur sehen, wie die Schuldigen ihre Köpfe hängen lassen werden vor ihrem Herrn: \"Unser Herr, nun haben wir gesehen und gehört, so sende uns zurück, dass wir Gutes tun; denn nun sind wir gewiss.\"", "spanish": " Ojalá pudieras ver a los cul­pables, con sus cabezas inclinadas ante su Señor y diciendo : “Señor Nuestro, hemos visto y hemos ído, devuélvenos, pues, para que podamos hacer buenas obras; pues ahora es­tamos convencidos”.", "urdu": " اور اگر تجھے وہ حالت معلوم ہو جائے جب کہ مجرم اپنے رب کے سامنے اپنا سر ڈالے کھڑے ہوں گے اور کہہ رہے ہوں گے اے ہمارے رب! ہم نے (جو کچھ تو نے کہا تھا) دیکھ لیا اور سن لیا۔ پس اب تو ہمیں واپس لوٹا دے تا کہ تیرے حکم کے مطابق عمل کریں۔ ہم اب تیری بات پر پوری طرح یقین کر چکے ہیں۔"}, {"arabic": " وَ لَوۡ شِئۡنَا لَاٰتَیۡنَا کُلَّ نَفۡسٍ ہُدٰٮہَا وَ لٰکِنۡ حَقَّ الۡقَوۡلُ مِنِّیۡ لَاَمۡلَـَٔنَّ جَہَنَّمَ مِنَ الۡجِنَّۃِ وَ النَّاسِ اَجۡمَعِیۡنَ ﴿۱۴﴾", "english": " And if We had enforced Our will, We could have given every soul its guidance, but the word from Me has come true: ‘I will fill Hell with Jinn and men all together.’", "french": " Et si Nous l’avions voulu, Nous aurions pu donner à chaque âme sa direction, mais Ma parole à l’égard des méchants devait être réalisée : « Certainement, Je remplirai l’Enfer de djinns et d’hommes tous ensemble. »", "german": " Und hätten Wir gewollt, Wir hätten jedem seinen Weg zeigen können; jedoch Mein Wort ist wahr geworden: \"Füllen will Ich die Hölle mit Jinn und Menschen allzumal.\"", "spanish": " Mas si hubiésemos impuesto Nuestra voluntad, podríamos haber ado a cada alma su guía, pero Mi obra, en relación con los malvados, había de cumplirse: “Llenaré el infier­no con Yinn y hombres, todos juntos”.", "urdu": " اور اگر ہم چاہتے تو ہر شخص کو اس کے مناسب حال ہدایت دیتے۔ لیکن میری بات پوری ہوگئی کہ میں ضرور جہنم کو جنوں اور انسانوں سے پر کروں گا۔"}, {"arabic": " فَذُوۡقُوۡا بِمَا نَسِیۡتُمۡ لِقَآءَ یَوۡمِکُمۡ ہٰذَا ۚ اِنَّا نَسِیۡنٰکُمۡ وَ ذُوۡقُوۡا عَذَابَ الۡخُلۡدِ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۱۵﴾", "english": " So taste ye the punishment of your deeds for you forgot the meeting of this day of yours. We too have forgotten you. And taste ye the lasting punishment because of that which you used to do.", "french": " Aussi goûtez le châtiment de vos œuvres , car vous aviez oublié la rencontre de votre jour que voici. Nous aussi , Nous vous avons oubliés. Et goûtez le châtiment durable pour ce que vous faisiez.", "german": " So kostet (die Strafe), denn ihr vergaßt das Eintreffen dieses eures Tages. (Auch) Wir haben euch vergessen. Kostet denn die langdauernde Strafe um dessentwillen, was ihr zu tun pflegtet.", "spanish": " Probad pues el castigo de vuestras obras por haber olvidado la comparecencia de este día vuestro. Nosotros también os hemos olvi­dado. Probad, pues, el castigo dura­dero por lo que solíais hacer.", "urdu": " پس آج کے دن کی ملاقات کو بھول جانے کی وجہ سے اور اپنے عملوں کی وجہ سے دیر پا عذاب کا مزہ چکھو اور (یاد رکھو کہ) ہم نے بھی (آج) تم کو اپنے ذہن سے اتار دیا ہے (یعنی تمہاری پروا کرنی چھوڑ دی ہے) ۔"}, {"arabic": " اِنَّمَا یُؤۡمِنُ بِاٰیٰتِنَا الَّذِیۡنَ اِذَا ذُکِّرُوۡا بِہَا خَرُّوۡا سُجَّدًا وَّ سَبَّحُوۡا بِحَمۡدِ رَبِّہِمۡ وَ ہُمۡ لَا یَسۡتَکۡبِرُوۡنَ ﴿ٛ۱۶﴾", "english": " Only they believe in Our Signs who, when they are reminded of them, fall down prostrate and celebrate the praises of their Lord, and they are not proud.", "french": " Seuls croient à Nos Signes ceux qui, lorsqu’on les leur rappelle, tombent en prosternation et célèbrent la gloire de leur Seigneur par Ses louanges ; et ils ne sont pas orgueilleux.", "german": " Nur jene glauben an Unsere Zeichen, die, wenn sie an sie gemahnt werden, anbetend niederfallen und das Lob ihres Herrn verkünden; und sie sind nicht hochmütig.", "spanish": " Sólo creen en Nuestros Signos, quienes, cuando se les recuerdan, se postran de bruces, celebran las ala­banzas de su Señor y no son orgu­llosos.", "urdu": " ہماری آیتوں پر تو وہی لوگ ایمان لاتے ہیں کہ جب ان کو ان کے متعلق یاد دلایا جاتا ہے تو وہ سجدہ کرتے ہوئے زمین پر گر جاتے ہیں اور اپنے رب کی تعریف اور تسبیح کرتے ہیں اور تکبر نہیں کرتے۔"}, {"arabic": " تَتَجَافٰی جُنُوۡبُہُمۡ عَنِ الۡمَضَاجِعِ یَدۡعُوۡنَ رَبَّہُمۡ خَوۡفًا وَّ طَمَعًا ۫ وَّ مِمَّا رَزَقۡنٰہُمۡ یُنۡفِقُوۡنَ ﴿۱۷﴾", "english": " Their sides keep away from their beds; and they call on their Lord in fear and hope, and spend out of what We have bestowed on them.", "french": " Leurs flancs restent éloignés de leur lit ; et ils s’adressent à leur Seigneur avec crainte et espoir, et dépensent de ces dons et richesses que Nous leur avons accordés.", "german": " Ihre Seiten halten sich fern von (ihren) Betten; sie rufen ihren Herrn an in Furcht und Hoffnung und spenden von dem, was Wir ihnen gegeben haben.", "spanish": " Cuyos costados se mantienen apartados de sus lechos; invocan a su Señor con temor y esperanza, y gastan de lo que les hemos con­cedido.", "urdu": " (اور) اُن (مومنوں) کے پہلو ان کے بستروں سے الگ ہو جاتے ہیں (یعنی تہجد کی نماز پڑھنے کے لئے) (اور) وہ اپنے رب کو اس کے عذابوں سے بچنے کے لئے اور اس کی رحمتوں کو حاصل کرنے کے لئے پکارتے ہیں اور جو کچھ ہم نے ان کو دیا ہے اس میں سے خدا کی راہ میں خرچ کرتے رہتے ہیں۔"}, {"arabic": " فَلَا تَعۡلَمُ نَفۡسٌ مَّاۤ اُخۡفِیَ لَہُمۡ مِّنۡ قُرَّۃِ اَعۡیُنٍ ۚ جَزَآءًۢ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۸﴾", "english": " And no soul knows what joy of the eyes is kept hidden for them, as a reward for their good works.", "french": " Et aucune âme ne sait quelle joie pour les yeux est tenue cachée pour elles, en récompense pour leurs bonnes actions.", "german": " Doch niemand weiß, was für Augenweide für sie verborgen ist als Lohn für ihre Taten.", "spanish": " No hay alma que sepa la alegría para los ojos que se les man­tiene reservada como recompensa por sus buenas obras.", "urdu": " اور (حقیقت یہ ہے کہ) کوئی شخص نہیں جانتا کہ ان (مومنوں) کے لئے ان کے اعمال کے بدلہ کے طور پر کیا کیا آنکھیں ٹھنڈی کرنے والی چیزیں چھپا کر رکھی گئی ہیں۔"}, {"arabic": " اَفَمَنۡ کَانَ مُؤۡمِنًا کَمَنۡ کَانَ فَاسِقًا ؕؔ لَا یَسۡتَوٗنَ ﴿۱۹﴾؃", "english": " Is he, then, who is a believer like one who is disobedient? They are not equal.", "french": " Celui qui est croyant est-il donc pareil à celui qui est désobéissant ? Ils ne sont pas égaux.", "german": " Ist wohl jener, der gläubig ist, dem gleich, der ungehorsam ist? Sie sind nicht gleichen Rangs.", "spanish": " ¿Acaso el creyente es como el desobediente? No, no son iguales.", "urdu": " کیا جو شخص مومن ہو اس کی طرح ہو سکتا ہے جو اطاعت سے باہر نکل جائے ایسے لوگ ہرگز برابر نہیں ہو سکتے۔"}, {"arabic": " اَمَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فَلَہُمۡ جَنّٰتُ الۡمَاۡوٰی ۫ نُزُلًۢا بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۲۰﴾", "english": " As for those who believe and do good works, they will have Gardens of Eternal Abode, as an entertainment, for what they used to do.", "french": " Quant à ceux qui croient et font de bonnes œuvres, ils auront, en tant qu’hôtes, les Jardins du Séjour Eternel , en retour pour ce qu’ils faisaient.", "german": " Jene, die glauben und gute Werke tun, sie werden Gärten der Heimstatt haben als eine Ergötzung für das, was sie getan.", "spanish": " En cuanto a quienes creen y practican las buenas obras, tendrán Jardines de Morada Eterna, como premio por lo que solían hacer.", "urdu": " وہ لوگ جو ایمان لائے ہیں اور اس کے مطابق انہوں نے عمل کیے ہیں انہیں رہائش کے قابل جنتیں ملیں گی۔ یہ ان کے اعمال کے مطابق مہمان داری ہوگی۔"}, {"arabic": " وَ اَمَّا الَّذِیۡنَ فَسَقُوۡا فَمَاۡوٰٮہُمُ النَّارُ ؕ کُلَّمَاۤ اَرَادُوۡۤا اَنۡ یَّخۡرُجُوۡا مِنۡہَاۤ اُعِیۡدُوۡا فِیۡہَا وَ قِیۡلَ لَہُمۡ ذُوۡقُوۡا عَذَابَ النَّارِ الَّذِیۡ کُنۡتُمۡ بِہٖ تُکَذِّبُوۡنَ ﴿۲۱﴾", "english": " And as for those who are disobedient, their abode will be the Fire. Every time they desire to come forth therefrom, they will be turned back into it, and it will be said to them, ‘Taste the punishment of the Fire which you used to deny,’", "french": " Et quant à ceux qui sont désobéissants, leur séjour sera le Feu. Chaque fois qu’ils désireront en sortir, ils y seront repoussés, et il leur sera dit : « Goûtez le châtiment du Feu que vous traitiez de mensonge. »", "german": " Jene aber, die ungehorsam sind – ihre Wohnstatt wird das Feuer sein. Sooft sie daraus entfliehen möchten, werden sie wieder dahin zurückgetrieben werden, und es wird zu ihnen gesprochen werden: \"Kostet nun die Strafe des Feuers, die ihr zu leugnen pflegtet!\"", "spanish": " Mas en cuanto a los desobedientes, su morada será el Fuego. Cada vez que deseen salir de él, serán devueltos al mismo, y se les dirá: “Probad el castigo del Fuego que acostumbrabais a negar”.", "urdu": " اور جو لوگ اطاعت سے نکل گئے ہیں ان کو رہنے کے لئے دوزخ ملے گی۔ جب کبھی اس سے نکلنے کا ارادہ کریں گے اسی کی طرف واپس کر دئیے جائیں گے اور اُن سے کہا جائے گا کہ اب دوزخ کا وہ عذاب چکھو جس کو تم جھٹلایا کرتے تھے۔"}, {"arabic": " وَ لَنُذِیۡقَنَّہُمۡ مِّنَ الۡعَذَابِ الۡاَدۡنٰی دُوۡنَ الۡعَذَابِ الۡاَکۡبَرِ لَعَلَّہُمۡ یَرۡجِعُوۡنَ ﴿۲۲﴾", "english": " And most surely We will make them taste of the nearer punishment before the greater punishment, so that they may return to Us with repentance .", "french": " Et très assurément, Nous leur ferons goûter le châtiment moins fort avant le plus grand châtiment, afin qu’ils retournent à Nous avec repentir .", "german": " Wahrlich, Wir werden sie von der näheren Strafe (hienieden) kosten lassen vor der größeren Strafe, ob sie sich vielleicht doch noch bekehren.", "spanish": " Y bien cierto es que les haremos probar el castigo menor antes del castigo mayor, para que vuelvan a Nosotros con arrepentimiento.", "urdu": " اور اس بڑے آنے والے عذاب سے پہلے ہم (اس دنیا کا) چھوٹا عذاب بھی ان کو چکھائیں گے تاکہ وہ لوٹیں (اور توبہ کریں اور اخروی عذاب سے بچ جائیں) ۔"}, {"arabic": " وَ مَنۡ اَظۡلَمُ مِمَّنۡ ذُکِّرَ بِاٰیٰتِ رَبِّہٖ ثُمَّ اَعۡرَضَ عَنۡہَا ؕ اِنَّا مِنَ الۡمُجۡرِمِیۡنَ مُنۡتَقِمُوۡنَ ﴿٪۲۳﴾", "english": " And who does greater wrong than he who is reminded of the Signs of his Lord and then turns away from them? We will surely punish the guilty.", "french": " Et qui est plus injuste que celui auquel sont rappelés les Signes de son Seigneur, et qui s’en détourne ensuite ? Certainement Nous exigerons rétribution de ceux qui transgressent.", "german": " Und wer verübt ärgeren Frevel als jener, der an die Zeichen seines Herrn gemahnt wird und sich dann doch davon abwendet? Wahrlich, Wir werden die Sünder streng bestrafen.", "spanish": " ¿Quién actúa más injustamente que aquel a quien se le recuerdan los ignos de su Señor y después se aparta de ellos? Nosotros retribuiremos debidamente a los transgresores.", "urdu": " اور جس کو اس کے رب کی آیات یاد دلائی جائیں پھر بھی وہ ان سے اعراض کرے اس سے زیادہ ظالم کون ہو سکتا ہے۔ ہم یقیناً مجرموں سے بدلہ لیں گے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ فَلَا تَکُنۡ فِیۡ مِرۡیَۃٍ مِّنۡ لِّقَآئِہٖ وَ جَعَلۡنٰہُ ہُدًی لِّبَنِیۡۤ اِسۡرَآءِیۡلَ ﴿ۚ۲۴﴾", "english": " And We did give Moses the Book — be not therefore in doubt as to the meeting with Him — and We made it a guidance for the children of Israel.", "french": " Et Nous donnâmes certainement le Livre à Moïse – ne sois donc pas dans le doute sur la rencontre avec Lui – et Nous en fîmes une direction pour les Enfants d’lsraël.", "german": " Ganz gewiss gaben Wir Moses das Buch – sei darum nicht im Zweifel darüber, dass auch du es bekommst –, und Wir machten es zu einer Führung für die Kinder Israels.", "spanish": " Entregamos a Moisés el Libro -no tengas pues duda en cuanto a la reunión con Él‑ y lo convertimos una guía para los Hijos de Israel.", "urdu": " اور ہم نے موسیٰ کو کتاب دی تھی پس تو بھی ایک مکمل کتاب کے ملنے کے متعلق شبہ نہ کر اور ہم نے اس (کتاب) کو بنی اسرائیل کے لئے ہدایت بنایا تھا۔"}, {"arabic": " وَ جَعَلۡنَا مِنۡہُمۡ اَئِمَّۃً یَّہۡدُوۡنَ بِاَمۡرِنَا لَمَّا صَبَرُوۡا ۟ؕ وَ کَانُوۡا بِاٰیٰتِنَا یُوۡقِنُوۡنَ ﴿۲۵﴾", "english": " And We made from among them leaders, who guided the people by Our command, whilst they themselves were steadfast and had firm faith in Our Signs.", "french": " Et lorsqu’ils avaient fait preuve d’endurance et qu’ils avaient cru fermement en Nos Signes, Nous avons fait d’entre eux des chefs qui ont guidé le peuple par Notre commandement.", "german": " Und Wir erweckten Führer aus ihrer Mitte, die (das Volk) leiteten nach Unserem Gebot, weil sie standhaft waren und fest an Unsere Zeichen glaubten.", "spanish": " E hicimos surgir de entre ellos unos jefes que guiaron al pueblo siguiendo Nuestro mandato, mientras ellos mismos eran perseverantes y mantenían una fe firme en Nuestros Signos.", "urdu": " اور ہم نے ان میں سے امام بنائے تھے جو کہ ہمارے حکم کے ساتھ لوگوں کو ہدایت دیتے تھے۔ اس وجہ سے کہ انہوں نے استقلال سے کام لیا اور وہ لوگ ہماری آیتوں پر مکمل یقین رکھتے تھے۔"}, {"arabic": " اِنَّ رَبَّکَ ہُوَ یَفۡصِلُ بَیۡنَہُمۡ یَوۡمَ الۡقِیٰمَۃِ فِیۡمَا کَانُوۡا فِیۡہِ یَخۡتَلِفُوۡنَ ﴿۲۶﴾", "english": " Verily, thy Lord — He will judge between them on the Day of Resurrection concerning that in which they disagree.", "french": " En vérité, ton Seigneur – Il jugera entre eux au Jour de la Résurrection concernant ce sur quoi ils étaient en désaccord.", "german": " Wahrlich, dein Herr wird richten zwischen ihnen am Tage der Auferstehung über das, worin sie uneinig sind.", "spanish": " En verdad, tu Señor es Quien juzgará entre ellos en el Día de la Resurrección, sobre aquello en que difieren.", "urdu": " تیرا رب تو وہ ہے جو (ان کلام الٰہی کے پہنچانے والوں اور) ان کے (منکروں کے) درمیان قیامت کے دن فیصلہ کرے گا۔ ہر اس امر کے متعلق جس میں وہ اختلاف کیا کرتے تھے۔"}, {"arabic": " اَوَ لَمۡ یَہۡدِ لَہُمۡ کَمۡ اَہۡلَکۡنَا مِنۡ قَبۡلِہِمۡ مِّنَ الۡقُرُوۡنِ یَمۡشُوۡنَ فِیۡ مَسٰکِنِہِمۡ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ ؕ اَفَلَا یَسۡمَعُوۡنَ ﴿۲۷﴾", "english": " Does it not guide them how many a generation We have destroyed before them, amid whose dwellings they now walk about? In that surely are Signs. Will they not then hearken?", "french": " Cela ne les guide-t-il pas, le nombre de générations que Nous avons anéanties avant eux et maintenant ils circulent dans leurs maisons en ruine ? Il y a assurément en cela des Signes. Ne veulent-ils donc pas écouter ?", "german": " Ist ihnen nicht klar, wie so manches Geschlecht Wir schon vor ihnen vernichtet haben, in deren Wohnstätten sie nun wandeln? Hierin sind wahrlich Zeichen. Wollen sie also nicht hören?", "spanish": " ¿No les sirve de guía la can­tidad de generaciones que hemos destruido antes de ellos, entre cuyas moradas ahora caminan ? Aquí hay ciertamente Signos. ¿No querrán escuchar?", "urdu": " کیا اُن کو اس بات نے ہدایت نہیں دی کہ ہم نے بہت سے زمانوں کے لوگوں کو ان سے پہلے ہلاک کر دیا تھا (اور اب) یہ لوگ انہی کے گھروں میں چلتے پھرتے ہیں۔ اس میں یقیناً بہت سے نشان ہیں مگر کیا وہ سنتے نہیں؟"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّا نَسُوۡقُ الۡمَآءَ اِلَی الۡاَرۡضِ الۡجُرُزِ فَنُخۡرِجُ بِہٖ زَرۡعًا تَاۡکُلُ مِنۡہُ اَنۡعَامُہُمۡ وَ اَنۡفُسُہُمۡ ؕ اَفَلَا یُبۡصِرُوۡنَ ﴿ؓ۲۸﴾", "english": " Have they not seen that We drive the water to the dry land and produce thereby crops of which their cattle eat, and they themselves? Will they not then see?", "french": " N’ont-ils pas vu que Nous poussons l’eau jusqu’à la terre desséchée, et que par ce moyen Nous produisons des récoltes dont mange leur bétail ainsi qu’eux-mêmes ? Ne veulent-ils donc pas voir ?", "german": " Haben sie nicht gesehen, dass Wir das Wasser treiben auf das dürre Land und dadurch Gewächs hervorbringen, an dem ihr Vieh sich labt und sie selber auch? Wollen sie also nicht sehen?", "spanish": " ¿No han visto acaso que llevamos el agua a la tierra seca y producimos de ella cosechas de las que comen sus ganados y ellos mismos? ¿Por qué no prestan aten­ción?", "urdu": " کیا انہوں نے نہیں دیکھا کہ ہم ایک بنجر زمین کی طرف پانی کو ہانک کر لے جاتے ہیں پھر اس (پانی) کے ذریعہ سے کھیتی نکالتے ہیں جس سے ان کے جانور بھی کھاتے ہیں اور وہ خود بھی کھاتے ہیں کیا وہ دیکھتے نہیں؟"}, {"arabic": " وَ یَقُوۡلُوۡنَ مَتٰی ہٰذَا الۡفَتۡحُ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۲۹﴾", "english": " And they say, ‘When will this victory come, if you are truthful?’", "french": " Et ils disent : « Quand viendra cette victoire, si vous êtes véridiques ? »", "german": " Und sie sprechen: \"Wann wird diese Entscheidung (stattfinden), wenn ihr die Wahrheit redet?\"", "spanish": " Dicen: “¿Cuándo vendrá esta victoria, si sois veraces?”.", "urdu": " اور وہ کہتے ہیں کہ یہ فتح جس کا تم ذکر کرتے ہو اگر تم سچے ہو تو بتاٶ کہ کب ہوگی۔"}, {"arabic": " قُلۡ یَوۡمَ الۡفَتۡحِ لَا یَنۡفَعُ الَّذِیۡنَ کَفَرُوۡۤا اِیۡمَانُہُمۡ وَ لَا ہُمۡ یُنۡظَرُوۡنَ ﴿۳۰﴾", "english": " Say, ‘On the day of victory the believing of the disbelievers will not avail them, nor will they be granted respite.’", "french": " Dis : « Le jour de la victoire, la croyance des mécréants ne leur sera d’aucune utilité, et aucun répit ne leur sera accordé. »", "german": " Sprich: \"Am Tage der Entscheidung soll den Ungläubigen ihr Glaube nichts nützen, noch sollen sie Aufschub erlangen.\"", "spanish": " Diles: “En el día de la vic­toria la fe de los incrédulos no les servirá nada, ni se les concederá respiro”.", "urdu": " تو کہہ دے کہ اس فتح کے دن کفار کو ان کا ایمان نفع نہیں دے گا اور نہ ان کو ڈھیل دی جائے گی۔"}], "Surah": 32}