{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں) ۔"}, {"arabic": " الٓـمّٓ ۚ﴿۲﴾", "english": " Alif Lam Mim.", "french": " Alif Lām Mīm (Je suis Allāh, le Plus-Savant).", "german": " Alif Lâm Mîm.", "spanish": " Alif Lam Mim.", "urdu": " میں اللہ سب سے زیادہ جاننے والا ہوں۔"}, {"arabic": " اَحَسِبَ النَّاسُ اَنۡ یُّتۡرَکُوۡۤا اَنۡ یَّقُوۡلُوۡۤا اٰمَنَّا وَ ہُمۡ لَا یُفۡتَنُوۡنَ ﴿۳﴾", "english": " Do men think that they will be left alone because they say, ‘We believe,’ and that they will not be tested?", "french": " Les hommes pensent-ils qu’ils seront laissés tranquilles parce qu’ils disent : « Nous croyons, » et qu’ils ne seront pas éprouvés ?", "german": " Meinen die Menschen, sie würden in Ruhe gelassen werden, wenn sie bloß sagen: \"Wir glauben\", und sie würden nicht auf die Probe gestellt?", "spanish": " ¿Piensan los hombre que se­rán dejados solos porque dicen: “Creemos” y que no serán puestos a prueba?", "urdu": " کیا (اس زمانہ کے) لوگوں نے یہ سمجھ رکھا ہے کہ ان کا یہ کہہ دینا کہ ہم ایمان لے آئے ہیں (کافی ہوگا) اور وہ چھوڑ دیئے جائیں گے اور ان کو آزمایا نہ جائے گا۔"}, {"arabic": " وَ لَقَدۡ فَتَنَّا الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ فَلَیَعۡلَمَنَّ اللّٰہُ الَّذِیۡنَ صَدَقُوۡا وَ لَیَعۡلَمَنَّ الۡکٰذِبِیۡنَ ﴿۴﴾", "english": " And We did test those who were before them. So Allah will surely distinguish those who are truthful and He will surely distinguish the liars from the truthful .", "french": " Et Nous avons certainement éprouvé ceux qui étaient avant eux. Ainsi Allāh distinguera assurément ceux qui sont véridiques, et Il reconnaîtra assurément les menteurs.", "german": " Wir stellten doch die auf die Probe, die vor ihnen waren. Also wird Allah gewiss die bezeichnen, die wahrhaftig sind, und gewiss wird Er die Lügner bezeichnen.", "spanish": " Y pusimos a prueba a quie­nes existieron antes que ellos. Al‑lah distinguirá pues ciertamente a quienes son veraces, y distinguirá en verdad a los mentirosos de los ve­races.", "urdu": " حالانکہ جو (لوگ) ان سے پہلے گذر چکے ہیں ان کو ہم نے آزمایا تھا (اور اب بھی وہ ایسا ہی کرے گا) سو اللہ ظاہر کر دے گا ان کو بھی جنہوں نے سچ بولا اور ان کو بھی جنہوں نے جھوٹ بولا۔"}, {"arabic": " اَمۡ حَسِبَ الَّذِیۡنَ یَعۡمَلُوۡنَ السَّیِّاٰتِ اَنۡ یَّسۡبِقُوۡنَا ؕ سَآءَ مَا یَحۡکُمُوۡنَ ﴿۵﴾", "english": " Or do those who commit evil deeds think that they will escape Us? Evil is what they judge.", "french": " Ou, est-ce que ceux qui commettent de mauvaises actions pensent qu’ils Nous échapperont ? Mauvais est leur jugement.", "german": " Oder glauben diejenigen, die böse Taten begehen, dass sie Uns entrinnen werden? Übel ist, wie sie urteilen.", "spanish": " ¿O acaso piensan quienes cometen malas acciones que escaparán a Nosotros? ¡Qué malo es lo que juzgan!", "urdu": " کیا جو لوگ بدیاں کرتے ہیں۔ وہ خیال کرتے ہیں کہ وہ ہمارے سزا سے بچ جائیں گے۔ اُن کا فیصلہ بہت برا ہے۔"}, {"arabic": " مَنۡ کَانَ یَرۡجُوۡا لِقَآءَ اللّٰہِ فَاِنَّ اَجَلَ اللّٰہِ لَاٰتٍ ؕ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۶﴾", "english": " Whoso hopes to meet Allah, let him be prepared for it , for Allah’s appointed time is certainly coming. And He is the All-Hearing, the All-knowing.", "french": " Quiconque espère rencontrer Allāh, qu’ils s’y prépare , car l’heure désignée par Allāh arrive certainement. Et Il est Celui Qui entend tout, l’Omniscient.", "german": " Wer auf die Begegnung mit Allah hofft (der wisse, dass) Allahs angesetzte Frist sicher abläuft. Und Er ist der Allhörende, der Allwissende.", "spanish": " Quien espere encontrar a Al-lah, que se prepare para ello, pues la hora fijada por Al‑lah vendrá ciertamente. Pues Él es Quien todo lo oye, el Omnisciente.", "urdu": " جو شخص اللہ کی ملاقات کی امید رکھتا ہے (اسے معلوم ہونا چاہیئے کہ) اللہ کا مقرر کردہ وقت ضرور آنے والا ہے اور وہ بہت سننے والا (اور) بہت جاننے والا ہے۔"}, {"arabic": " وَ مَنۡ جَاہَدَ فَاِنَّمَا یُجَاہِدُ لِنَفۡسِہٖ ؕ اِنَّ اللّٰہَ لَغَنِیٌّ عَنِ الۡعٰلَمِیۡنَ ﴿۷﴾", "english": " And whoso strives, strives only for his own soul; verily Allah is Independent of all creatures.", "french": " Et quiconque fait des efforts dans la voie d’Allāh, fait des efforts seulement pour l’avantage de son âme ; en vérité, Allāh est Indépendant de l’univers tout entier.", "german": " Wer da strebt, strebt nur für seine eigene Seele; denn Allah ist unabhängig von allen Welten.", "spanish": " Y quien se esfuerza, se esfuerza únicamente por su propia alma; en verdad, Al‑lah es Indepen­diente de todas las criaturas.", "urdu": " اور جو شخص خدا کے لئے کوشش کرتا ہے درحقیقت وہ اپنی جان ہی کے لئے کرتا ہے اللہ تمام جہانوں سے بے نیاز ہے (اور ان کی عبادت کا محتاج نہیں)۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَنُکَفِّرَنَّ عَنۡہُمۡ سَیِّاٰتِہِمۡ وَ لَنَجۡزِیَنَّہُمۡ اَحۡسَنَ الَّذِیۡ کَانُوۡا یَعۡمَلُوۡنَ ﴿۸﴾", "english": " And as to those who believe and do good works, We shall surely remove from them their evils, and We shall surely give them the best reward of their works.", "french": " Et quant à ceux qui croient et font de bonnes œuvres, Nous leur enlèverons assurément leurs méfaits, et Nous les récompenserons assurément selon leurs meilleures œuvres.", "german": " Und jene, die glauben und gute Werke tun – wahrlich, Wir werden ihre Übel von ihnen nehmen und ihnen den besten Lohn für ihre Taten geben.", "spanish": " Y en cuanto a quienes creen y hacen buenas obras, ciertamente les retiraremos sus malas acciones y les da­remos ciertamente la mejor recom­pensa por sus obras.", "urdu": " اور جو لوگ ایمان لائے ہیں اور ایمان کے مطابق انہوں نے عمل کئے ہم ان کی بدیوں کو ان سے دور کر دیں گے اور جو کام وہ کرتے تھے اس کے مطابق جو بہترین جزا ان کو مل سکتی ہوگی وہ ہم اُن کو دیں گے۔"}, {"arabic": " وَ وَصَّیۡنَا الۡاِنۡسَانَ بِوَالِدَیۡہِ حُسۡنًا ؕ وَ اِنۡ جَاہَدٰکَ لِتُشۡرِکَ بِیۡ مَا لَیۡسَ لَکَ بِہٖ عِلۡمٌ فَلَا تُطِعۡہُمَا ؕ اِلَیَّ مَرۡجِعُکُمۡ فَاُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۹﴾", "english": " And We have enjoined on man kindness to his parents; but if they strive to make thee associate that with Me of which thou hast no knowledge, then obey them not. Unto Me is your return, and I shall inform you of what you did.", "french": " Et Nous avons enjoint à l’homme la bonté envers ses parents, mais s’ils te forcent à M’associer ce dont tu n’as aucune connaissance, alors ne leur obéis pas. C’est vers Moi qu’est votre retour, et Je vous informerai de ce que vous avez fait.", "german": " Wir haben dem Menschen auf die Seele gebunden, seinen Eltern Gutes zu tun. Doch wenn sie dich bestimmen möschten, dass du Mir das zur Seite stellst, wovon du keine Kenntnis hast, so gehorche ihnen nicht. Zu Mir ist eure Heimkehr, dann will Ich euch verkünden, was ihr getan.", "spanish": " Hemos ordenado al hombre la benevolencia con sus padres; pero si disputan contigo para que tu también asocies partícipes conmigo; de lo cual no tienes ningún conocimiento, no les obedezcas. A Mí es a quien retornaréis, y os informaré de lo que hicisteis.", "urdu": " اور ہم نے انسان کو اپنے والدین سے اچھا سلوک کرنے کا حکم دیا ہے اور (کہا ہے کہ) اگر وہ دونوں تجھ سے اس بات میں بحث کریں کہ تو کسی کو میرا شریک قرار دے حالانکہ اس کا تجھے کوئی علم نہیں‘ تو ان دونوں کی فرمانبرداری نہ کر کیونکہ تم سب نے میری طرف ہی لوٹ کر آنا ہے اور میں تمہارے عمل (کی نیکی بدی) سے تم کو واقف کروں گا۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَنُدۡخِلَنَّہُمۡ فِی الصّٰلِحِیۡنَ ﴿۱۰﴾", "english": " And those who believe and do good works — them We shall surely admit into the company of the righteous.", "french": " Et ceux qui croient et font de bonnes œuvres – eux Nous les admettrons assurément au nombre des justes.", "german": " Und jene, die glauben und gute Werke tun – wahrlich, Wir werden sie unter die Rechtschaffenen einführen.", "spanish": " Mas quienes creen y hacen buenas obras: a ellos ciertamente los admitiré en la compañía de los justos.", "urdu": " اور جو لوگ ایمان لائے ہیں اور اس کے مطابق انہوں نے عمل بھی کیا ہے ہم ان کو اچھے بندوں میں داخل کریں گے۔"}, {"arabic": " وَ مِنَ النَّاسِ مَنۡ یَّقُوۡلُ اٰمَنَّا بِاللّٰہِ فَاِذَاۤ اُوۡذِیَ فِی اللّٰہِ جَعَلَ فِتۡنَۃَ النَّاسِ کَعَذَابِ اللّٰہِ ؕ وَ لَئِنۡ جَآءَ نَصۡرٌ مِّنۡ رَّبِّکَ لَیَقُوۡلُنَّ اِنَّا کُنَّا مَعَکُمۡ ؕ اَوَ لَیۡسَ اللّٰہُ بِاَعۡلَمَ بِمَا فِیۡ صُدُوۡرِ الۡعٰلَمِیۡنَ ﴿۱۱﴾", "english": " And of men there are some who say, ‘We believe in Allah,’ but when they are made to suffer in the cause of Allah, they regard the persecution of men to be like the punishment of Allah. And if help comes from thy Lord, they are sure to say, ‘Certainly, we were with you.’ Is not Allah best aware of what is in the bosom of His creatures?", "french": " Et parmi les hommes il y en a qui disent : « Nous croyons en Allāh, » mais quand on les fait souffrir pour la cause d’Allāh, ils considèrent la persécution des hommes comme si c’était le châtiment d’Allāh. Et s’il vient du secours de la part de ton Seigneur, ils sont sûrs de dire : « Certainement, nous étions avec vous. » Allāh n’est-Il pas le meilleur à savoir ce qui se trouve dans le sein de tout le monde ?", "german": " Unter den Menschen sind manche, die sprechen: \"Wir glauben an Allah\", doch wenn sie für Allahs Sache leiden müssen, so betrachten sie die Anfeindung durch Menschen gleich der Strafe Allahs. Kommt aber Hilfe von deinem Herrn, dann sprechen sie gewiss: \"Wahrlich, wir waren mit euch.\" Weiß Allah nicht am besten, was in den Herzen aller Geschöpfe ist?", "spanish": " Entre los hombres hay algu­nos que dicen: “Creemos en Al‑lah” ; pero cuando se les hace sufrir por la causa de Al‑lah, consideran que la persecución de los hombres es como el castigo de Al‑lah. Y si les llega la ayuda de tu Señor, dirán ciertamen­te, “En verdad estábamos con voso­tros.” ¿Acaso Al‑lah no sabe me­jor que nadie lo que hay en el corazón de toda la gente?.", "urdu": " اور لوگوں میں سے (بعض ایسے بھی ہوتے ہیں) جو کہتے ہیں کہ ہم اللہ پر ایمان لے آئے ہیں پھر جب اللہ کی وجہ سے ان کو تکلیف دی جاتی ہے وہ لوگوں کے عذاب کو اللہ کے عذاب کی طرح سمجھ لیتے ہیں اور اگر تیرے رب کی طرف سے مدد آتی ہے تو وہ کہتے ہیں (درحقیقت) ہم بھی تمہارے ساتھ تھے کیا دنیا جہان کے لوگوں کے دلوں میں جو کچھ ہے اس کو اللہ اچھی طرح نہیں جانتا۔"}, {"arabic": " وَ لَیَعۡلَمَنَّ اللّٰہُ الَّذِیۡنَ اٰمَنُوۡا وَ لَیَعۡلَمَنَّ الۡمُنٰفِقِیۡنَ ﴿۱۲﴾", "english": " And Allah will surly distinguish those who believe and He will surely distinguish the hypocrites from the believers .", "french": " Et Allāh distinguera assurément ceux qui croient, et Il reconnaîtra assurément les hypocrites.", "german": " Allah wird sicherlich die bezeichnen, die glauben, und Er wird sicherlich die Heuchler bezeichnen.", "spanish": " ¡Mas Al-lah distinguirá ciertamente a quienes creen y distin­guirá ciertamente a los hipócritas de los creyentes!", "urdu": " اور اللہ ضرور ظاہر کر دے گا ان کو بھی جو ایمان لائے اور ان کو بھی جو منافق ہیں۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا لِلَّذِیۡنَ اٰمَنُوا اتَّبِعُوۡا سَبِیۡلَنَا وَ لۡنَحۡمِلۡ خَطٰیٰکُمۡ ؕ وَ مَا ہُمۡ بِحٰمِلِیۡنَ مِنۡ خَطٰیٰہُمۡ مِّنۡ شَیۡءٍ ؕ اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿۱۳﴾", "english": " And those who disbelieve say to those who believe, ‘Follow our way, and we will surely bear your sins.’ And they cannot bear aught of their sins. They are surely liars.", "french": " Et ceux qui ne croient pas disent à ceux qui croient : « Suivez notre voie et nous porterons certainement le fardeau de vos péchés. Et ils ne porteront rien du fardeau de leurs péchés. Ils sont assurément des menteurs.", "german": " Und die Ungläubigen sprechen zu denen, die glauben: \"Folget unserem Weg, so wollen wir eure Sünden tragen.\" Sie können doch nichts tragen von ihren Sünden. Sie sind gewisslich Lügner.", "spanish": " Los incrédulos dicen a los cre­yentes: “Seguid nuestro camino, y ciertamente cargaremos vuestros pecados.” Pero no pueden llevar na­da de sus pecados. En verdad son embusteros.", "urdu": " اور کافر مومنوں سے کہتے ہیں‘ تم ہمارے پیچھے چلو۔ ہم تمہارے گناہ اٹھا لیں گے۔ حالانکہ وہ ان کے گناہ (بالکل) نہیں اٹھا سکتے۔ وہ یقیناً جھوٹے ہیں۔"}, {"arabic": " وَ لَیَحۡمِلُنَّ اَثۡقَالَہُمۡ وَ اَثۡقَالًا مَّعَ اَثۡقَالِہِمۡ ۫ وَ لَیُسۡـَٔلُنَّ یَوۡمَ الۡقِیٰمَۃِ عَمَّا کَانُوۡا یَفۡتَرُوۡنَ ﴿٪۱۴﴾", "english": " But they shall surely bear their own burdens, and other burdens along with their own burdens. And they will surely be questioned on the Day of Resurrection concerning that which they fabricated.", "french": " Mais ils porteront assurément leurs propres fardeaux, et d’autres fardeaux en plus de leurs propres fardeaux. Et ils seront assurément interrogés au Jour de la Résurrection, sur ce qu’ils ont inventé.", "german": " Aber sie sollen wahrlich ihre eigenen Lasten tragen und Lasten zu ihren Lasten hinzu. Und sie werden gewisslich befragt werden am Tage der Auferstehung um das, was sie erdichtet.", "spanish": " Pero sí que llevarán su propias cargas junto con otras cargas además de las suyas. Y ciertamente serán in­terrogados en el Día de la Resurrec­ción en cuanto a lo que tramaron.", "urdu": " حقیقت یہ ہے کہ وہ اپنے بوجھ بھی اٹھائیں گے اور اپنے بوجھوں کے سوا اور لوگوں کے بوجھ بھی اٹھائیں گے (جن کو وہ دھوکا دیتے ہیں) اور قیامت کے دن ان سے اس افترا کے بارے میں سوال کیا جائے گا۔"}, {"arabic": " وَ لَقَدۡ اَرۡسَلۡنَا نُوۡحًا اِلٰی قَوۡمِہٖ فَلَبِثَ فِیۡہِمۡ اَلۡفَ سَنَۃٍ اِلَّا خَمۡسِیۡنَ عَامًا ؕ فَاَخَذَہُمُ الطُّوۡفَانُ وَ ہُمۡ ظٰلِمُوۡنَ ﴿۱۵﴾", "english": " And We certainly sent Noah to his people, and he dwelt among them a thousand years save fifty years. Then the deluge overtook them, while they were wrongdoers.", "french": " Et Nous avons certainement envoyé Noé à son peuple, et la loi de Noé demeura en vigueur parmi eux mille ans moins cinquante. Alors le déluge les surprit pendant qu’ils étaient injustes.", "german": " Wir sandten Noah zu seinem Volke, und er weilte unter ihnen tausend Jahre weniger fünfzig Jahre. Da ereilte sie die Sintflut, weil sie Missetäter waren.", "spanish": " Ciertamente enviamos a Noé a su pueblo, y vivió entre ellos mil años menos cincuenta. A continuación el Diluvio cayó sobre ellos, mientras eran de los malvados.", "urdu": " اور ہم نے نوح کو اُس کی قوم کی طرف بھیجا تھا پس وہ ان میں نو سو پچاس سال تک رہا۔ سو اس کی قوم کے لوگوں کو طوفان نے آلیا اور وہ ظالم تھے۔"}, {"arabic": " فَاَنۡجَیۡنٰہُ وَ اَصۡحٰبَ السَّفِیۡنَۃِ وَ جَعَلۡنٰہَاۤ اٰیَۃً لِّلۡعٰلَمِیۡنَ ﴿۱۶﴾", "english": " But We saved him and those who were with him in the Ark; and We made it a Sign for all peoples.", "french": " Mais Nous le sauvâmes et ceux qui étaient avec lui dans l’Arche, et Nous en avons fait un Signe pour tous les peuples.", "german": " Aber Wir erretteten ihn und die Insassen der Arche; und Wir machten sie zu einem Zeichen für alle Völker.", "spanish": " Pero Nosotros los salvamos a él y a quienes estaban con él en el Arca; y lo convertimos en un Signo para todos los pueblos.", "urdu": " پس ہم نے اس کو اور اس کی کشتی میں بیٹھنے والے ساتھیوں کو نجات دی اور ہم نے اس واقعہ کو تمام جہان کے لوگوں کے لئے ایک نشان بنا دیا۔"}, {"arabic": " وَ اِبۡرٰہِیۡمَ اِذۡ قَالَ لِقَوۡمِہِ اعۡبُدُوا اللّٰہَ وَ اتَّقُوۡہُ ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۱۷﴾", "english": " And remember Abraham when he said to his people, ‘Worship Allah and fear Him. That is better for you if you understand.", "french": " Et souviens-toi d’ Abraham, quand il dit à son peuple : « Adorez Allāh et craignez-Le. Cela est mieux pour vous, si seulement vous saviez.", "german": " (Wir entsandten) auch Abraham, als er zu seinem Volke sprach: \"Verehret Allah und fürchtet Ihn. Das ist besser für euch, wenn ihr es wüsstet.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:17&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:17&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic18\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic18\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:18' style='text-decoration:underline'>29:18</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(18)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control18\"></i></button> <audio id=\"player18\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّمَا تَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ اَوۡثَانًا وَّ تَخۡلُقُوۡنَ اِفۡکًا ؕ اِنَّ الَّذِیۡنَ تَعۡبُدُوۡنَ مِنۡ دُوۡنِ اللّٰہِ لَا یَمۡلِکُوۡنَ لَکُمۡ رِزۡقًا فَابۡتَغُوۡا عِنۡدَ اللّٰہِ الرِّزۡقَ وَ اعۡبُدُوۡہُ وَ اشۡکُرُوۡا لَہٗ ؕ اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۱۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘You only worship idols beside Allah, and you forge a lie. Those whom you worship beside Allah have no power to provide sustenance for you. Then seek sustenance from Allah, and worship Him, and be grateful to Him. Unto Him will you be brought back.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_29_18_b' href='#'>b</a>]</sup>‘You only worship idols beside Allah, and you invent a lie. Those, whom you worship beside Allah, have no power to provide sustenance for you. Then seek sustenance from Allah, and worship Him, and be grateful to Him. Unto Him will you be brought back.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_18_b'>b</span></div> <div><div class='reference' data-id='ref_29_18_b' style='display:none'> <p><b>b.</b> <a href='/quran/22:72' target=_blank>22:72</a>. (<a href='javascript:void(0)' data-id='ref_29_18_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً تم اللہ کو چھوڑ کر محض بتوں کی عبادت کرتے ہو اور جھوٹ گھڑتے ہو۔ یقیناً وہ لوگ جن کی تم اللہ کی بجائے عبادت کرتے ہو تمہارے لئے کسی رزق کی ملکیت نہیں رکھتے۔ پس اللہ کے حضور ہی رزق چاہو اور اُس کی عبادت کرو اور اس کا شکر ادا کرو۔ اسی کی طرف تم لوٹائے جاؤ گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">تم اللہ کے سوا دوسری ہستیوں کی عبادت کرتے ہو اور (مذہب کے بارے میں) جھوٹی باتیں بناتے ہو۔ وہ (ہستیاں) جن کی تم اللہ کے سوا پرستش کرتے ہو تمہیں رزق نہیں دے سکتیں۔ پس اللہ سے اپنا رزق مانگو اور اس کی عبادت کرو اور اس کا شکر ادا کرو۔ تم کو اسی کی طرف لوٹا کر لے جایا جائے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Vous n’adorez que des idoles en dehors d’Allāh, et vous fabriquez un mensonge. Ceux que vous adorez en dehors d’Allāh n’ont aucun pouvoir de vous fournir <em>votre</em> subsistance. Recherchez donc <em>votre</em> subsistance auprès d’Allāh, et adorez-Le, et soyez-Lui reconnaissants. C’est à Lui que vous serez ramenés.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Sólo adoráis a ídolos en lu­gar de a Al‑lah, y forjáis mentiras. Aquellos a quienes adoráis fuera de Al‑lah no tienen poder para propor­cionaros el sostén. Buscad pues el sostén de Al‑lah, y adoradle, y sedle agradecidos. A Él seréis devueltos.”</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ihr verehret nur Götzen statt Allah, und ihr ersinnt eine Lüge. Jene, die ihr statt Allah verehrt, vermögen euch nicht zu versorgen. Suchet darum Versorgung bei Allah und verehret Ihn und seid Ihm dankbar. Zu Ihm werdet ihr zurückgebracht werden.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:18&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:18&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic19\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic19\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:19' style='text-decoration:underline'>29:19</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(19)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control19\"></i></button> <audio id=\"player19\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِنۡ تُکَذِّبُوۡا فَقَدۡ کَذَّبَ اُمَمٌ مِّنۡ قَبۡلِکُمۡ ؕ وَ مَا عَلَی الرَّسُوۡلِ اِلَّا الۡبَلٰغُ الۡمُبِیۡنُ ﴿۱۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And if you reject, then generations before you <em>also </em>rejected. And the Messenger is only responsible for the clear conveying <em>of the Message</em>.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And if you reject <i>the truth</i>, then the generations before you <i>also </i>rejected <i>it</i>. And <sup class='ref'>[<a class='ref' data-id='ref_29_19_c' href='#'>c</a>]</sup>the Messenger is only responsible for the clear delivery <i>of the Message</i>. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_19_c'>c</span></div> <div><div class='reference' data-id='ref_29_19_c' style='display:none'> <p><b>c.</b> <a href='/quran/16:36' target=_blank>16:36</a>; <a href='/quran/24:55' target=_blank>24:55</a>; <a href='/quran/36:18' target=_blank>36:18</a>. (<a href='javascript:void(0)' data-id='ref_29_19_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اگر تم تکذیب کرو تو تم سے پہلے بھی کئی اُمّتیں تکذیب کر چکی ہیں۔ اور پیغمبر پر کھلا کھلا پیغام پہنچانے کے سوا کچھ فرض نہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اگر تم میری بات کو جھوٹا قرار دو تو (یہ کوئی نئی بات نہیں) تم سے پہلی قوموں نے بھی (اپنے رسولوں کو) جھٹلایا تھا اور رسول کا کام تو صرف کھول کھول کر پہنچانا ہوتا ہے (زبردستی منوانا نہیں ہوتا) </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et si vous rejetez <em>la vérité</em>, alors des générations avant vous l’ont rejetée <em>aussi</em>. Et le Messager n’est responsable que de la transmission claire du Message. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y si os oponéis, muchas generaciones antes que vosotros <em>también</em> se opusieron<em>. </em>Mas el Mensa­jero sólo es responsable de la trans­misión diáfana <em>del Mensaje”.</em></span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und wenn ihr verwerft, so haben Geschlechter vor euch (auch) schon verworfen. Und dem Gesandten obliegt nur die deutliche Verkündigung.\"", "spanish": " Y acordaos de Abraham, cuando dijo a su pueblo: “Adorad a Al‑lah y temedle. Sería mejor para vo­sotros, si supierais;", "urdu": " اور (ہم نے) ابراہیم کو (بھی رسول بناکر بھیجا تھا) جب اس نے اپنی قوم سے کہا تھا کہ اللہ کی عبادت کرو اور اس کا تقویٰ اختیار کرو۔ اگر تم جانتے ہو تو یہ تمہارے لئے بہت اچھا ہے۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا کَیۡفَ یُبۡدِئُ اللّٰہُ الۡخَلۡقَ ثُمَّ یُعِیۡدُہٗ ؕ اِنَّ ذٰلِکَ عَلَی اللّٰہِ یَسِیۡرٌ ﴿۲۰﴾", "english": " See they not how Allah originates creation, then repeats it? That surely is easy for Allah.", "french": " Ne voient-ils pas comment Allāh commence la création, puis la répète ? Cela assurément est facile pour Allāh.", "german": " Sehen sie nicht, wie Allah Schöpfung hervorbringt und sie dann wiederholt? Das ist fürwahr ein leichtes für Allah.", "spanish": " ¿Acaso no ven cómo Al‑lah origina la creación, y después la repite? Eso es, ciertamente, fácil para Al‑lah.", "urdu": " کیا اُن کو معلوم نہیں کہ اللہ پیدائش عالم کو کس طرح پہلی دفعہ شروع کرتا ہے۔ پھر اس کو باربار لوٹاتا جاتا ہے یہ کام اللہ کے لئے بالکل آسان ہے۔"}, {"arabic": " قُلۡ سِیۡرُوۡا فِی الۡاَرۡضِ فَانۡظُرُوۡا کَیۡفَ بَدَاَ الۡخَلۡقَ ثُمَّ اللّٰہُ یُنۡشِیٴُ النَّشۡاَۃَ الۡاٰخِرَۃَ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿ۚ۲۱﴾", "english": " Say, ‘Travel in the earth, and see how He originated the creation. Then will Allah provide the latter creation.’ Surely, Allah has power over all things.", "french": " Dis : « Parcourez la terre, et voyez comment Il a commencé la création. Ensuite, Allāh créera plus tard l’autre création. » Assurément, Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Sprich: \"Reiset umher auf Erden und sehet, wie Er das erste Mal die Schöpfung hervorbrachte. Dann ruft Allah die nächste Schöpfung hervor.\" Wahrlich, Allah hat Macht über alle Dinge.", "spanish": " Diles: 'Viajad por la tierra, y ved como Él originó la creación. Luego Al‑lah hará surgir otra creación posterior . “En verdad, Al‑lah tiene poder sobre todas las cosas.", "urdu": " تو کہہ‘ ملک میں چاروں طرف پھرو پھر دیکھو کہ اللہ نے مخلوق کی پیدائش کس طرح شروع کی تھی پھر مرنے کے بعد ان کو دوبارہ زندہ کرتا چلا گیا اللہ ہر ایک چیز پر قادر ہے۔"}, {"arabic": " یُعَذِّبُ مَنۡ یَّشَآءُ وَ یَرۡحَمُ مَنۡ یَّشَآءُ ۚ وَ اِلَیۡہِ تُقۡلَبُوۡنَ ﴿۲۲﴾", "english": " He punishes whom He pleases and shows mercy unto whom He pleases; and to Him will you be turned back.", "french": " Il châtie qui Il veut, et accorde la miséricorde à qui Il veut ; et c’est à Lui que vous serez ramenés.", "german": " Er straft, wen Er will, und erweist Barmherzigkeit, wem Er will; und zu Ihm werdet ihr gewendet werden.", "spanish": " Él castiga a quien Le place y muestra misericordia a quien Le agrada; y a Él seréis devueltos;", "urdu": " وہ جس کو چاہتا ہے عذاب دیتا ہے اور جس پر چاہتا ہے رحم کرتا ہے اور اسی کی طرف تم کو لوٹا کر لایا جائے گا۔"}, {"arabic": " وَ مَاۤ اَنۡتُمۡ بِمُعۡجِزِیۡنَ فِی الۡاَرۡضِ وَ لَا فِی السَّمَآءِ ۫ وَ مَا لَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿٪۲۳﴾", "english": " And you cannot frustrate the designs of Allah in the earth nor in the heaven; nor have you any friend or helper beside Allah.", "french": " Et vous ne pouvez pas contrarier les desseins d’Allāh sur la terre, ni dans le ciel ; et vous n’avez aucun ami, ou aucun auxiliaire, en dehors d’Allāh.", "german": " Und ihr könnet (die Absichten Gottes) auf Erden oder im Himmel nicht vereiteln, noch habt ihr einen Freund oder Helfer außer Allah.", "spanish": " Y no podéis frustrar los designios de Al‑lah en la tierra ni en el cielo; ni tenéis amigo ni ayudante fuera de Al‑lah.", "urdu": " اور تم نہ زمین میں نہ آسمان میں خدا کو اس کی مرضی کے خلاف مجبور کر سکو گے اور خدا کے سوا نہ کوئی تمہارا دوست ہے نہ مددگار۔"}, {"arabic": " وَ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِ اللّٰہِ وَ لِقَآئِہٖۤ اُولٰٓئِکَ یَئِسُوۡا مِنۡ رَّحۡمَتِیۡ وَ اُولٰٓئِکَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۲۴﴾", "english": " Those who disbelieve in the Signs of Allah and the meeting with Him — it is they who have despaired of My mercy. And they will have a grievous punishment.", "french": " Ceux qui ne croient pas aux Signes d’Allāh et à la rencontre avec Lui – ceux-là désespèrent de Ma miséricorde. Et ceux-là auront un châtiment douloureux.", "german": " Diejenigen, die nicht an die Zeichen Allahs und an die Begegnung mit Ihm glauben – sie sind es, die an Meiner Barmherzigkeit verzweifeln. Und ihnen wird eine schmerzliche Strafe.", "spanish": " Quienes no creen en los Sig­nos de Al‑lah y en la reunión con Él: son estos quienes han desesperado de Mi misericordia. Para ellos habrá un severo castigo.", "urdu": " اور وہ لوگ جو اللہ کے نشانوں کا اور اس سے ملاقات ہونے کا انکار کرتے ہیں وہ لوگ ایسے ہیں جو میری رحمت سے مایوس ہو گئے ہیں اور وہی ہیں جن کو دردناک عذاب ملے گا۔"}, {"arabic": " فَمَا کَانَ جَوَابَ قَوۡمِہٖۤ اِلَّاۤ اَنۡ قَالُوا اقۡتُلُوۡہُ اَوۡ حَرِّقُوۡہُ فَاَنۡجٰٮہُ اللّٰہُ مِنَ النَّارِ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۲۵﴾", "english": " And the only answer of his people was that they said, ‘Slay him or burn him.’ But Allah saved him from the fire. In that surely are Signs for a people who would believe.", "french": " Et la seule réponse de son peuple fut qu’ils dirent : « Tuez-le ou brûlez-le. » Mais Allāh le sauva du feu. Assurément, il y a en cela des Signes pour un peuple qui croit.", "german": " Die Antwort seines Volkes war nur, dass sie sprachen: \"Erschlagt ihn oder verbrennt ihn.\" Doch Allah errettete ihn aus dem Feuer. Hierin sind wahrlich Zeichen für ein Volk, das glaubt.", "spanish": " La única respuesta de su pue­blo fue que dijeron: “Matadle o que­madle”. Pero Al‑lah le salvó del fuego. Aquí hay ciertamente Signos para un pueblo dispuesto a creer.", "urdu": " پس اس کی (یعنی ابراہیم کی) قوم کا جواب اس کے سوا کچھ نہ تھا کہ انہوں نے کہا اس کو قتل کر دو یا اس کو جلا دو (چنانچہ انہوں نے اس کو آگ میں ڈال دیا) مگر اللہ نے اس کو آگ سے بچا لیا‘ اس میں یقیناً مومن قوم کے لئے بڑے نشان ہیں۔"}, {"arabic": " وَ قَالَ اِنَّمَا اتَّخَذۡتُمۡ مِّنۡ دُوۡنِ اللّٰہِ اَوۡثَانًا ۙ مَّوَدَّۃَ بَیۡنِکُمۡ فِی الۡحَیٰوۃِ الدُّنۡیَا ۚ ثُمَّ یَوۡمَ الۡقِیٰمَۃِ یَکۡفُرُ بَعۡضُکُمۡ بِبَعۡضٍ وَّ یَلۡعَنُ بَعۡضُکُمۡ بَعۡضًا ۫ وَّ مَاۡوٰٮکُمُ النَّارُ وَ مَا لَکُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿٭ۙ۲۶﴾", "english": " And he said, ‘Verily you have taken for yourselves idols beside Allah, out of love for each other in the present life. Then on the Day of Resurrection you will deny each other, and curse each other. And your abode will be the Fire; and you will have no helpers.’", "french": " Et Abraham dit : « En vérité vous avez pris des idoles en adoration en dehors d’Allāh, par amitié entre vous dans la vie de ce monde. Ensuite au Jour de la Résurrection vous vous renierez, et vous vous maudirez les uns les autres. Et votre habitation sera le Feu ; et vous n’aurez pas d’aides «", "german": " Und er sprach: \"Ihr habt euch nur Götzen angenommen statt Allah, aus Liebe zueinander in diesem irdischen Leben. Dann aber, am Tage der Auferstehung, werdet ihr einander verleugnen und einander verfluchen. Euer Aufenthalt wird das Feuer sein; und ihr werdet keine Helfer finden.\"", "spanish": " Dijo: “En verdad, habéis adoptado ídolos para vosotros fuera de Al‑lah, por puro amor mutuo, en la presente vida. Más tarde, en el Día de la Resurrección os negaréis unos a otros y os maldeciréis mutuamente. Vuestra morada será el Infierno y no tendréis quien os ayude”.", "urdu": " (ابراہیم نے) کہا‘ تم نے اللہ کے سوا بتوں سے تعلق قائم کر چھوڑا ہے (اور تمہارا یہ فعل) ورلی زندگی میں دوسرے مشرکوں سے محبت بڑھانے کے لئے (ہے) پھر قیامت کے دن تم میں سے بعض بعض کا انکار کریں گے اور تم میں سے بعض بعض پر لعنت ڈالیں گے اور تمہارا ٹھکانا دوزخ ہوگا اور جن کو تم مددگار سمجھتے ہو ان میں سے کوئی تمہاری مدد کو نہ آئے گا۔"}, {"arabic": " فَاٰمَنَ لَہٗ لُوۡطٌ ۘ وَ قَالَ اِنِّیۡ مُہَاجِرٌ اِلٰی رَبِّیۡ ؕ اِنَّہٗ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۲۷﴾", "english": " And Lot believed him; and Abraham said, ‘I take refuge with my Lord; surely He is the Mighty, the Wise.’", "french": " Et Lot crut en lui, et Abraham dit : « Certainement j’émigre vers mon Seigneur ; assurément, Il est le Puissant, le Sage. »", "german": " Und Lot glaubte ihm; und (Abraham) sprach: \"Ich fliehe zu meinem Herrn; Er ist der Allmächtige, der Allweise.\"", "spanish": " Lot creyó en él; y A braham dijo: “Me refugio con mi Señor; en verdad, Él es el Poderoso, el Sabio”.", "urdu": " اس (نصیحت) کے بعد لوط اُس پر ایمان لے آئے اور (ابراہیم نے) کہا‘ میں تو اپنے رب کی طرف ہجرت کرکے جانے والا ہوں وہ یقیناً غالب (اور) بڑی حکمت والا ہے۔"}, {"arabic": " وَ وَہَبۡنَا لَہٗۤ اِسۡحٰقَ وَ یَعۡقُوۡبَ وَ جَعَلۡنَا فِیۡ ذُرِّیَّتِہِ النُّبُوَّۃَ وَ الۡکِتٰبَ وَ اٰتَیۡنٰہُ اَجۡرَہٗ فِی الدُّنۡیَا ۚ وَ اِنَّہٗ فِی الۡاٰخِرَۃِ لَمِنَ الصّٰلِحِیۡنَ ﴿۲۸﴾", "english": " And We bestowed on him Isaac and Jacob, and We placed the gift of prophethood and the Book among his descendants, and We gave him his reward in this life, and in the Hereafter he will surely be among the righteous.", "french": " Et Nous lui donnâmes Isaac et Jacob, et Nous établîmes le prophétat - nubuwwah - et le Livre parmi ses descendants, et Nous lui donnâmes sa récompense dans cette vie ; et dans l’au-delà il sera assurément parmi les justes.", "german": " Und Wir schenkten ihm Isaak und Jakob und gaben seinen Nachkommen das Prophetentum und die Schrift, und Wir gaben ihm seinen Lohn in diesem Leben, und im Jenseits wird er gewiss unter den Rechtschaffenen sein.", "spanish": " Le concedimos a Isaac y Jacob, y pusimos el don de la profecía y el Libro entre sus descendientes, le dimos su recompensa en esta vida, y en el Más Allá estará ciertamente entre los justos.", "urdu": " اور ہم نے اُسے اسحاق اور یعقوب بخشے‘ اور اُس کی ذریت کے ساتھ نبوت اور کتاب مخصوص کر دی اور ہم نے اس کو دنیا میں بھی اس کا اجر بخشا۔ اور آخرت میں بھی وہ نیک بندوں میں شامل کیا جائے گا۔"}, {"arabic": " وَ لُوۡطًا اِذۡ قَالَ لِقَوۡمِہٖۤ اِنَّکُمۡ لَتَاۡتُوۡنَ الۡفَاحِشَۃَ ۫ مَا سَبَقَکُمۡ بِہَا مِنۡ اَحَدٍ مِّنَ الۡعٰلَمِیۡنَ ﴿۲۹﴾", "english": " And We sent Lot; he said to his people, ‘You commit an abomination which none among mankind has ever committed before you.", "french": " Et Nous envoyâmes Lot, il dit à son peuple : « Vous commettez une indécence que nul parmi les hommes n’a jamais commise avant vous.", "german": " Und (Wir entsandten) Lot, da sprach er zu seinem Volk: \"Ihr begeht eine Schändlichkeit, die keiner von allen Menschen je vor euch begangen hat.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:29&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:29&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic30\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic30\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:30' style='text-decoration:underline'>29:30</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(30)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control30\"></i></button> <audio id=\"player30\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَئِنَّکُمۡ لَتَاۡتُوۡنَ الرِّجَالَ وَ تَقۡطَعُوۡنَ السَّبِیۡلَ ۬ۙ وَ تَاۡتُوۡنَ فِیۡ نَادِیۡکُمُ الۡمُنۡکَرَ ؕ فَمَا کَانَ جَوَابَ قَوۡمِہٖۤ اِلَّاۤ اَنۡ قَالُوا ائۡتِنَا بِعَذَابِ اللّٰہِ اِنۡ کُنۡتَ مِنَ الصّٰدِقِیۡنَ ﴿۳۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Do you indeed come <em>lustfully </em>to men and cut off the highway <I>for travellers</I>? And you commit abomination in your meetings!’ But the only answer of his people was that they said, ‘Bring upon us the punishment of Allah if thou speakest the truth.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_29_30_d' href='#'>d</a>]</sup>‘What! do you approach men <i>with lust </i>and commit robbery on the highway,<sup class='ref'>[<a class='ref' data-id='ref_29_30_2249' href='#'>2249</a>]</sup> and you commit abomination in your meetings?’<sup class='ref'>[<a class='ref' data-id='ref_29_30_2250' href='#'>2250</a>]</sup> But the only answer of his people was that they said, ‘Bring upon us the punishment of Allah if thou speakest the truth.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_30_d'>d</span><span class='collapsible plus' data-id='ref_29_30_2249'>2249</span><span class='collapsible plus' data-id='ref_29_30_2250'>2250</span></div> <div><div class='reference' data-id='ref_29_30_d' style='display:none'> <p><b>d.</b> <a href='/quran/7:82' target=_blank>7:82</a>; <a href='/quran/11:79' target=_blank>11:79</a>; <a href='/quran/26:166' target=_blank>26:166</a>. (<a href='javascript:void(0)' data-id='ref_29_30_d' class='ref'>close</a>)</p> </div> </div><div><a name='2249'></a><div class='reference' data-id='ref_29_30_2249' style='display:none'> <p><b>2249.</b> <i>Qata‘ut-Tariqa </i>meaning, he made the way dangerous for wayfarers and forbade them to use it, the Quranic expression signifies: (a) You rob travellers on the highway (Lot’s people had adopted the calling of the road). (b) You violate the Divinely appointed sex-laws and commit unnatural offences. (<a href='javascript:void(0)' data-id='ref_29_30_2249' class='ref'>close</a>)</p> </div> </div><div><a name='2250'></a><div class='reference' data-id='ref_29_30_2250' style='display:none'> <p><b>2250.</b> Three vices have been ascribed to the people of Lot in this verse, (1) unnatural vice; (2) highway robbery; (3) committing crimes openly and unashamedly in their assemblies. (<a href='javascript:void(0)' data-id='ref_29_30_2250' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا تم (شہوت کے ساتھ) مَردوں کی طرف آتے ہو اور راہزنی کرتے ہو اور اپنی مجالس میں سخت ناپسندیدہ باتیں کرتے ہو۔ پس اس کی قوم کا جواب کچھ نہ تھا مگر (یہ) کہ انہوں نے کہا ہمارے پاس اللہ کا عذاب لے آ اگر تُو سچوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا تم (عورتوں کو چھوڑ کر) مردوں کے پاس آتے ہو اور ڈاکے مارتے ہو۔ اور اپنی مجالس میں ناپسندیدہ حرکتیں کرتے ہو۔ اس پر اس کی قوم کا جواب اس کے سوا کچھ نہ تھا کہ انہوں نے کہہ دیا کہ اگر تو سچے لوگوں میں سے ہے تو اللہ کا عذاب ہم پر نازل کر دے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Vous approchez-vous en fait <em>lascivement</em> des hommes, et commettez-vous des vols de grand chemin ? Et dans vos assemblées vous vous adonnez à tout ce qui est répugnant ! » Mais la seule réponse de son peuple fut qu’ils dirent : « Amène sur nous le châtiment d’Allāh si tu dis vrai. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Os acercáis en verdad <em>disi­muladamente </em>a los hombres y cortáis el camino <em>a los viajeros? </em>¡Os permitís todo lo aborrecible en vuestras reu­niones! “Pero la única respuesta de su pueblo fue que dijeron: “Trae sobre nosotros el castigo de Al‑lah si dices la verdad”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Naht ihr euch tatsächlich Männern (in Begierde) und raubet ihr auf der Landstraße? Und in euren Versammlungen begeht ihr Abscheuliches!\" Jedoch die Antwort seines Volkes war nur, dass sie sprachen: \"Bringe Allahs Strafe über uns, wenn du die Wahrheit redest.\"", "spanish": " Y enviamos a Lot; que dijo a su pueblo: “Cometéis una abominación que nadie de la humanidad ha co­metido antes que vosotros”.", "urdu": " اور لوط کو بھی (ہم نے رسول بنا کر بھیجا) جبکہ اس نے اپنی قوم سے کہا کہ تم ایک ایسی بدی کرتے ہو جس کا ارتکاب دنیا میں تم سے پہلے کسی نے نہیں کیا تھا۔"}, {"arabic": " اَئِنَّکُمۡ لَتَاۡتُوۡنَ الرِّجَالَ وَ تَقۡطَعُوۡنَ السَّبِیۡلَ ۬ۙ وَ تَاۡتُوۡنَ فِیۡ نَادِیۡکُمُ الۡمُنۡکَرَ ؕ فَمَا کَانَ جَوَابَ قَوۡمِہٖۤ اِلَّاۤ اَنۡ قَالُوا ائۡتِنَا بِعَذَابِ اللّٰہِ اِنۡ کُنۡتَ مِنَ الصّٰدِقِیۡنَ ﴿۳۰﴾", "english": " ‘Do you indeed come lustfully to men and cut off the highway for travellers ? And you commit abomination in your meetings!’ But the only answer of his people was that they said, ‘Bring upon us the punishment of Allah if thou speakest the truth.’", "french": " Vous approchez-vous en fait lascivement des hommes, et commettez-vous des vols de grand chemin ? Et dans vos assemblées vous vous adonnez à tout ce qui est répugnant ! » Mais la seule réponse de son peuple fut qu’ils dirent : « Amène sur nous le châtiment d’Allāh si tu dis vrai. »", "german": " Naht ihr euch tatsächlich Männern (in Begierde) und raubet ihr auf der Landstraße? Und in euren Versammlungen begeht ihr Abscheuliches!\" Jedoch die Antwort seines Volkes war nur, dass sie sprachen: \"Bringe Allahs Strafe über uns, wenn du die Wahrheit redest.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:30&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:30&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic31\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic31\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:31' style='text-decoration:underline'>29:31</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(31)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control31\"></i></button> <audio id=\"player31\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ رَبِّ انۡصُرۡنِیۡ عَلَی الۡقَوۡمِ الۡمُفۡسِدِیۡنَ ﴿٪۳۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He said, ‘Help me, my Lord, against the wicked people.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> He said, <sup class='ref'>[<a class='ref' data-id='ref_29_31_e' href='#'>e</a>]</sup>‘Help me, my Lord, against the wicked people.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_31_e'>e</span></div> <div><div class='reference' data-id='ref_29_31_e' style='display:none'> <p><b>e.</b> <a href='/quran/26:170' target=_blank>26:170</a>. (<a href='javascript:void(0)' data-id='ref_29_31_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا اے میرے ربّ! اس فسادکرنے والی قوم کے خلاف میری مدد کر۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اِس پر لوط نے کہا‘ اے میرے رب! مفسد قوم کے خلاف میری مدد کر۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il dit : « Mon Seigneur, aide-moi contre le peuple qui crée le désordre. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Dijo: “Ayúdame, mi Señor, contra el pueblo corrompido”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er sprach: \"Hilf mir, mein Herr, wider das ruchlose Volk.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:31&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:31&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic32\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic32\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:32' style='text-decoration:underline'>29:32</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(32)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control32\"></i></button> <audio id=\"player32\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَمَّا جَآءَتۡ رُسُلُنَاۤ اِبۡرٰہِیۡمَ بِالۡبُشۡرٰی ۙ قَالُوۡۤا اِنَّا مُہۡلِکُوۡۤا اَہۡلِ ہٰذِہِ الۡقَرۡیَۃِ ۚ اِنَّ اَہۡلَہَا کَانُوۡا ظٰلِمِیۡنَ ﴿ۚۖ۳۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And when Our messengers brought Abraham the glad tidings, they said, ‘We are going to destroy the people of this town; surely its people are wrongdoers.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_29_32_a' href='#'>a</a>]</sup>And when Our messengers brought Abraham the tidings, they said, “<i>The tidings is</i>, ‘We are about to destroy the people of this town; surely, its people are wrongdoers.” <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_32_a'>a</span></div> <div><div class='reference' data-id='ref_29_32_a' style='display:none'> <p><b>a.</b> <a href='/quran/11:70' target=_blank>11:70</a>, <a href='/quran/11:71' target=_blank>71</a>. (<a href='javascript:void(0)' data-id='ref_29_32_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور جب ہمارے رسول ابراہیم کے پاس خوشخبری لے کر آئے۔ انہوں نے یہ بھی کہا کہ یقیناً ہم (لوط کی) اِس بستی کے رہنے والوں کو ہلاک کرنے والے ہیں۔ یقیناً اس کے باشندے ظالم لوگ ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور جب ہمارے رسول ابراہیم کے پاس بشارت لائے۔ تو انہوں نے کہا۔ ہم اس بستی والوں کو ہلاک کرنے والے ہیں۔ کیونکہ اس کے باشندے ظالم ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et lorsque Nos messagers apportèrent la bonne nouvelle à Abraham, ils dirent <em>cela aussi</em> : « Nous allons anéantir les habitants de cette ville, assurément ses habitants sont des injustes. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y cuando Nuestros mensa­jeros llevaron a Abraham la buena nueva, dijeron: “Vamos a destruir al pueblo de esta ciudad; en verdad sus gentes son injustas”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und da Unsere Gesandten Abraham die frohe Botschaft brachten, sprachen sie: \"Wir schicken uns an, die Bewohner dieser Stadt zu vernichten; denn ihre Bewohner sind Missetäter.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:32&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:32&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic33\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic33\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:33' style='text-decoration:underline'>29:33</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(33)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control33\"></i></button> <audio id=\"player33\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ اِنَّ فِیۡہَا لُوۡطًا ؕ قَالُوۡا نَحۡنُ اَعۡلَمُ بِمَنۡ فِیۡہَا ٝ۫ لَنُنَجِّیَنَّہٗ وَ اَہۡلَہٗۤ اِلَّا امۡرَاَتَہٗ ٭۫ کَانَتۡ مِنَ الۡغٰبِرِیۡنَ ﴿۳۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He said, ‘But Lot is there.’ They said, ‘We know full well who is there. We will surely save him and his family, except his wife, who is of those who remain behind.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> He said, ‘But Lot is there!’ They said, ‘We know very well who is there. <sup class='ref'>[<a class='ref' data-id='ref_29_33_b' href='#'>b</a>]</sup>We will, surely, save him and his family, <sup class='ref'>[<a class='ref' data-id='ref_29_33_c' href='#'>c</a>]</sup>except his wife, who is of those who remain behind.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_33_b'>b</span><span class='collapsible plus' data-id='ref_29_33_c'>c</span></div> <div><div class='reference' data-id='ref_29_33_b' style='display:none'> <p><b>b.</b> <a href='/quran/15:60' target=_blank>15:60</a>; <a href='/quran/51:36' target=_blank>51:36</a>. (<a href='javascript:void(0)' data-id='ref_29_33_b' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_29_33_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:84' target=_blank>7:84</a>; <a href='/quran/15:61' target=_blank>15:61</a>; <a href='/quran/26:172' target=_blank>26:172</a>; <a href='/quran/27:58' target=_blank>27:58</a>. (<a href='javascript:void(0)' data-id='ref_29_33_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا کہ اُس میں تو لُوط بھی ہے۔ انہوں نے (جواباً) کہا کہ ہم بہتر جانتے ہیں کہ اس میں کون ہے۔ہم یقیناً اسے اور اس کے تمام اہلِ خانہ کو بچا لیں گے سوائے اس کی بیوی کے، وہ پیچھے رہ جانے والوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(ابراہیم نے جواب میں) کہا کہ اس (بستی) میں تو لوط بھی رہتا ہے انہوں نے کہا ہم اس (بستی) کے رہنے والوں کو خوب جانتے ہیں۔ ہم اس (یعنی لوط) کو اور اس کے گھر والوں کو سوائے اس کی بیوی کے جو پیچھے رہنے والوں میں شامل ہو جائے گی نجات دیں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il dit : « Mais Lot s’y trouve ! » Ils répondirent : « Nous savons le mieux qui s’y trouve. Nous le sauverons assurément, lui et sa famille, excepté sa femme, qui est du nombre de ceux qui resteront en arrière. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Dijo: “Pero Lot está allí”. “Respondieron: “Sabemos muy bien quién está allí. Ciertamente lo sal­varemos a él y a su familia, excepto a su mujer, que es de las que se quedan detrás”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er sprach: \"Doch Lot ist dort.\" Sie sprachen: \"Wir wissen recht wohl, wer dort ist. Gewiss, wir werden ihn und die Seinen erretten, bis auf seine Frau, die zu denen gehört, die zurückbleiben.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=29:33&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=29:33&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic34\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic34\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/29:34' style='text-decoration:underline'>29:34</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(34)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control34\"></i></button> <audio id=\"player34\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَمَّاۤ اَنۡ جَآءَتۡ رُسُلُنَا لُوۡطًا سِیۡٓءَ بِہِمۡ وَ ضَاقَ بِہِمۡ ذَرۡعًا وَّ قَالُوۡا لَا تَخَفۡ وَ لَا تَحۡزَنۡ ۟ اِنَّا مُنَجُّوۡکَ وَ اَہۡلَکَ اِلَّا امۡرَاَتَکَ کَانَتۡ مِنَ الۡغٰبِرِیۡنَ ﴿۳۴﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And when Our messengers came to Lot, he was distressed on account of them and felt powerless with regard to them. And they said, ‘Fear not, nor grieve; we will surely save thee and thy family except thy wife, who is of those who remain behind.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And when Our messengers came to Lot, <sup class='ref'>[<a class='ref' data-id='ref_29_34_d' href='#'>d</a>]</sup>he was distressed on their account and felt powerless<sup class='ref'>[<a class='ref' data-id='ref_29_34_2251' href='#'>2251</a>]</sup> with regard to them. And they said, “Fear not, nor grieve, <i>and we have been charged with the Divine Message</i>: <sup class='ref'>[<a class='ref' data-id='ref_29_34_e' href='#'>e</a>]</sup>‘We will, surely, save thee and thy family except thy wife, who is of those who remain behind, <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_29_34_d'>d</span><span class='collapsible plus' data-id='ref_29_34_2251'>2251</span><span class='collapsible plus' data-id='ref_29_34_e'>e</span></div> <div><div class='reference' data-id='ref_29_34_d' style='display:none'> <p><b>d.</b> <a href='/quran/11:78' target=_blank>11:78</a>. (<a href='javascript:void(0)' data-id='ref_29_34_d' class='ref'>close</a>)</p> </div> </div><div><a name='2251'></a><div class='reference' data-id='ref_29_34_2251' style='display:none'> <p><b>2251.</b> <i>Daqa Bihi Dhar‘an </i>means, he lacked strength or ability or power to do the thing (Lane). Who the messengers mentioned in the verse were and what their mission was has been explained in <a href='/quran/11:70' target=_blank>11:70</a>, 71 and <a href='/quran/15:68' target=_blank>15:68</a>-72. Their visit distressed and grieved Prophet Lot because his people, having adopted the calling of the road, did not like strangers to visit their town and therefore they had forbidden Lot to receive outsiders. He feared that his people might humiliate him before his guests. (<a href='javascript:void(0)' data-id='ref_29_34_2251' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_29_34_e' style='display:none'> <p><b>e.</b> <a href='/quran/7:84' target=_blank>7:84</a>; <a href='/quran/27:58' target=_blank>27:58</a>. (<a href='javascript:void(0)' data-id='ref_29_34_e' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور جب ہمارے رسول لوط کے پاس آئے تو وہ ان کی وجہ سے ناخوش ہوا اور دل ہی دل میں ان سے بہت تنگی محسوس کی تو انہوں نے کہا کہ ڈر نہیں اور کوئی غم نہ کر۔ ہم یقیناً تجھے اور تیرے سب گھر والوں کو بچا لیں گے سوائے تیری بیوی کے، وہ پیچھے رہ جانے والوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور جب ہمارے رسول لوط کے پاس آئے تو ان کی وجہ سے اُسے دُکھ پہنچا نیز اُن کی وجہ سے اس کا دل تنگ ہو گیا۔ اور (اس کی اس حالت کو دیکھ کر ان پیغام لانے والوں نے ) کہا۔ کسی (آئندہ) بات کا خوف نہ کر اور نہ کسی گزشتہ واقعہ پر افسوس کر۔ ہم تجھ کو اور تیرے گھر والوں کو سوائے تیری بیوی کے جو پیچھے رہنے والوں میں شامل ہوجائے گی‘ نجات دینے والے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et lorsque Nos messagers vinrent à Lot, il fut affligé à cause d’eux, et se sentit impuissant à leur égard. Et ils dirent : « Ne crains pas, ne t’afflige pas ; nous te sauverons assurément, toi ainsi que ta famille, excepté ta femme, qui est du nombre de ceux qui resteront en arrière.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Cuando Nuestros Mensajeros llegaron a Lot, se angustió por ellos y se sintió indefenso frente a ellos. Dijeron: “No temas ni te afli­jas; ciertamente te salvaremos a ti y a tu familia, excepto a tu mujer, que es de las que se quedan detrás.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und da Unsere Gesandten zu Lot kamen, ward er besorgt ihretwegen und fühlte sich um ihretwillen in kraftloser Beklommenheit. Sie sprachen: \"Fürchte dich nicht und betrübe dich nicht; wir wollen sicherlich dich und die Deinen retten, bis auf deine Frau, die zu denen gehört, die zurückbleiben.", "spanish": " “¿Os acercáis en verdad disi­muladamente a los hombres y cortáis el camino a los viajeros? ¡Os permitís todo lo aborrecible en vuestras reu­niones! “Pero la única respuesta de su pueblo fue que dijeron: “Trae sobre nosotros el castigo de Al‑lah si dices la verdad”.", "urdu": " کیا تم (عورتوں کو چھوڑ کر) مردوں کے پاس آتے ہو اور ڈاکے مارتے ہو۔ اور اپنی مجالس میں ناپسندیدہ حرکتیں کرتے ہو۔ اس پر اس کی قوم کا جواب اس کے سوا کچھ نہ تھا کہ انہوں نے کہہ دیا کہ اگر تو سچے لوگوں میں سے ہے تو اللہ کا عذاب ہم پر نازل کر دے۔"}, {"arabic": " اِنَّا مُنۡزِلُوۡنَ عَلٰۤی اَہۡلِ ہٰذِہِ الۡقَرۡیَۃِ رِجۡزًا مِّنَ السَّمَآءِ بِمَا کَانُوۡا یَفۡسُقُوۡنَ ﴿۳۵﴾", "english": " ‘We are surely going to bring down on the people of this town a punishment from heaven, for they have been rebellious.’", "french": " Nous allons assurément faire tomber sur les habitants de cette ville un châtiment du ciel, car ils ont été rebelles. »", "german": "", "spanish": " “En verdad, haremos caer sobre las gentes de esta ciudad un castigo de los cielos, porque han sido rebeldes”.", "urdu": " ہم اس بستی پر ان کی نافرمانی کی وجہ سے عذاب نازل کرنے والے ہیں۔"}, {"arabic": " وَ لَقَدۡ تَّرَکۡنَا مِنۡہَاۤ اٰیَۃًۢ بَیِّنَۃً لِّقَوۡمٍ یَّعۡقِلُوۡنَ ﴿۳۶﴾", "english": " And We have left thereof a clear Sign for a people who would understand.", "french": " Et Nous en avons laissé un Signe clair pour un peuple qui veut comprendre.", "german": " Und Wir haben davon ein klares Zeichen zurückgelassen für Leute, die verstehen.", "spanish": " Y hemos dejado en todo ello un Signo claro para el pueblo que sea sensato.", "urdu": " اور ہم نے اس بستی کے (واقعہ) کے ذریعہ سے ایک کھلی عبرت کا سامان عقل والے لوگوں کے لئے پیچھے چھوڑا ہے ۔"}, {"arabic": " وَ اِلٰی مَدۡیَنَ اَخَاہُمۡ شُعَیۡبًا ۙ فَقَالَ یٰقَوۡمِ اعۡبُدُوا اللّٰہَ وَ ارۡجُوا الۡیَوۡمَ الۡاٰخِرَ وَ لَا تَعۡثَوۡا فِی الۡاَرۡضِ مُفۡسِدِیۡنَ ﴿۳۷﴾", "english": " And to Midian We sent their brother Shu‘aib who said, ‘O my people, serve Allah, and fear the Last Day and commit not iniquity in the earth, creating disorder.’", "french": " Et à Madian, Nous envoyâmes leur frère Shu‘aib, qui dit : « Ô mon peuple, adorez Allāh et gardez l’espoir en le Dernier Jour, et ne commettez pas d’iniquités sur la terre, créant le désordre. »", "german": " Und zu Midian (entsandten Wir) ihren Bruder Schoäb, der sprach: \"O mein Volk, dienet Allah und fürchtet den Jüngsten Tag und begehet nicht Unheil auf Erden, indem ihr Unfrieden stiftet.\"", "spanish": " Enviamos a Madián a su hermano Shu'aib quien dijo: “Oh, pueblo mío, servid a Al‑lah, temed el Ultimo Día y no cometáis iniquidad alguna en la tierra, creando el de­sorden”.", "urdu": " اور مدین کی طرف ہم نے ان کے بھائی شعیب کو رسول بنا کر بھیجا تھا (جب وہ آیا تو) اس نے کہا اے میری قوم! اللہ کی عبادت کرو اور اخروی زندگی کے وقت کو یاد رکھو اور ایسے مفسدانہ کام نہ کرو کہ ملک میں تمہارے کاموں کی وجہ سے فساد پھیل جائے۔"}, {"arabic": " فَکَذَّبُوۡہُ فَاَخَذَتۡہُمُ الرَّجۡفَۃُ فَاَصۡبَحُوۡا فِیۡ دَارِہِمۡ جٰثِمِیۡنَ ﴿۫۳۸﴾", "english": " But they called him a liar. So a violent earthquake seized them, and in their homes they lay prostrate upon the ground.", "french": " Mais ils le traitèrent de menteur. Aussi un violent tremblement de terre les saisit-il, et dans leurs habitations ils gisèrent prostrés sur le sol.", "german": " Jedoch sie erklärten ihn für einen Lügner. Da erfasste sie ein heftiges Erdbeben, und sie lagen in ihren Wohnungen hingestreckt auf dem Boden.", "spanish": " Pero ellos le llamaron menti­roso. Por lo que les sobrevino un violento terremoto y en sus casas quedaron, postrados en tierra.", "urdu": " اس پر انہوں نے اس کو جھٹلا دیا۔ اور ایک ہلا دینے والے عذاب نے ان کو پکڑ لیا۔ جس کے نتیجہ میں وہ اپنے گھروں میں (زمین سے) چمٹے کے چمٹے رہ گئے۔"}, {"arabic": " وَ عَادًا وَّ ثَمُوۡدَا۠ وَ قَدۡ تَّبَیَّنَ لَکُمۡ مِّنۡ مَّسٰکِنِہِمۡ ۟ وَ زَیَّنَ لَہُمُ الشَّیۡطٰنُ اَعۡمَالَہُمۡ فَصَدَّہُمۡ عَنِ السَّبِیۡلِ وَ کَانُوۡا مُسۡتَبۡصِرِیۡنَ ﴿ۙ۳۹﴾", "english": " And We destroyed ‘Ad and Thamud; and it is evident to you from their dwelling-places. And Satan made their deeds appear good to them, and thus turned them away from the path, sagacious though they were.", "french": " Et Nous avons anéanti les‘ Ād et les Thamūd ; et cela est visible pour vous à travers les ruines de leurs habitations. Et Satan avait fait leurs œuvres paraître belles à leurs yeux, et ainsi il les avait empêchés de suivre la voie, bien qu’ils fussent à même de discerner la vérité .", "german": " Und (Wir vernichteten) die 'Âd und die Thamûd; und es ist klar ersichtlich für euch aus ihren Wohnstätten. Satan ließ ihnen ihre Werke wohlgefällig erscheinen und machte sie abwendig von dem Pfad, wiewohl sie gute Beobachter waren.", "spanish": " Y destruimos a Ad y Zamud: os es evidente por sus moradas. Y Satanás hizo que sus acciones aparecieran buenas ante su vista, y los apartó así del camino, a pesar de que tenían la capacidad de discernir la verdad .", "urdu": " اور عاد کو بھی اور ثمود کو بھی (ہماری طرف سے ایک ہلا دینے والے عذاب نے پکڑ لیا) اور (اے اہل مکہ)! تم پر ان کی بستیوں کا حال ظاہر ہے اور شیطان نے ان کو ان کے عمل اچھے کرکے دکھائے اور اس (شیطان) نے ان کو (اللہ کے) راستہ سے روکا۔ حالانکہ وہ خوب سمجھتے تھے۔"}, {"arabic": " وَ قَارُوۡنَ وَ فِرۡعَوۡنَ وَ ہَامٰنَ ۟ وَ لَقَدۡ جَآءَہُمۡ مُّوۡسٰی بِالۡبَیِّنٰتِ فَاسۡتَکۡبَرُوۡا فِی الۡاَرۡضِ وَ مَا کَانُوۡا سٰبِقِیۡنَ ﴿ۚۖ۴۰﴾", "english": " And We destroyed Korah and Pharaoh and Haman. And Moses did come to them with manifest Signs, but they behaved proudly in the earth, yet they could not outstrip Us .", "french": " Et Nous avons anéanti Korah et Pharaon et Hāmān. Et Moïse vint à eux assurément avec des Signes manifestes, mais ils se comportèrent avec arrogance sur la terre ; et pourtant ils n’ont pas pu Nous échapper.", "german": " Und (Wir vernichteten) Korah und Pharao und Hâmân. Moses kam wahrlich zu ihnen mit offenbaren Zeichen, doch sie betrugen sich hoffärtig auf Erden, (Uns) aber konnten sie nicht entrinnen.", "spanish": " Y destruimos a Korah, al Faraón y a Hamán. Moisés compareció ante ellos con Signos manifiestos, pero se comportaron rgullosamente en la tierra, aunque no pudieron librarse de Nosotros.", "urdu": " اور قارون اور فرعون اور ہامان کو بھی (ہم نے عذاب میں گرفتار کیا) اور موسیٰ ان کے پاس کھلے کھلے نشان لے کر آئے تھے۔ پھر بھی (وہ نہ مانے بلکہ) انہوں نے ملک میں متکبرانہ رویہ اختیار کیا اور (ہمارے عذاب سے) بھاگ کر بچ نہ سکے۔"}, {"arabic": " فَکُلًّا اَخَذۡنَا بِذَنۡۢبِہٖ ۚ فَمِنۡہُمۡ مَّنۡ اَرۡسَلۡنَا عَلَیۡہِ حَاصِبًا ۚ وَ مِنۡہُمۡ مَّنۡ اَخَذَتۡہُ الصَّیۡحَۃُ ۚ وَ مِنۡہُمۡ مَّنۡ خَسَفۡنَا بِہِ الۡاَرۡضَ ۚ وَ مِنۡہُمۡ مَّنۡ اَغۡرَقۡنَا ۚ وَ مَا کَانَ اللّٰہُ لِیَظۡلِمَہُمۡ وَ لٰکِنۡ کَانُوۡۤا اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ﴿۴۱﴾", "english": " So each one of them We seized in his sin; of them were those against whom We sent a violent sandstorm, and of them were those whom a roaring blast overtook, and of them were those whom We caused the earth to swallow up, and of them were those whom We drowned. And Allah would not wrong them, but they used to wrong their own souls.", "french": " Ainsi Nous avons saisi chacun d’entre eux à cause de son péché ; parmi eux il y avait ceux contre lesquels Nous envoyâmes une violente tempête de sable ; et parmi eux il y avait ceux qu’une forte explosion a surpris ; et parmi eux il y avait ceux que Nous engloutîmes dans la terre ; et parmi eux il y avait ceux que Nous noyâmes. Et Allāh ne fut pas injuste envers eux ; mais ils furent injustes envers leur propre âme.", "german": " So erfassten Wir einen jeden in seiner Sünde; es waren unter ihnen welche, gegen die Wir einen Steinhagel schickten, und welche, die ein lauter Ruf ereilte, und welche, die Wir von der Erde verschlingen ließen, und welche, die Wir ertränkten. Und Allah wollte nicht ihnen Unrecht tun, sondern sich selbst haben sie Unrecht getan.", "spanish": " Así caímos sobre cada uno de ellos por su pecado; contra algunos de ellos enviamos una violenta tormenta de arena, otros quedaron sobrecogidos por un estallido espan­toso, otros hicimos que fueran tragados por la tierra, y hubo otros a quienes ahogamos. No fue Al-­lah quien los perjudicó, sino que fueron ellos los que arruinaron sus propias almas.", "urdu": " پس ہم نے ان میں سے ہر ایک کو اس کے گناہ کی وجہ سے پکڑ لیا۔ سو ان میں سے کوئی تو ایسا تھا کہ ہم نے اس پر پتھروں کا مینہ برسایا اور کوئی ایسا تھا کہ اس کو کسی اور سخت عذاب نے پکڑ لیا۔ اور کوئی ایسا تھا کہ ہم نے اس کو ملک میں ذلیل کر دیا۔ اور کوئی ایسا تھا کہ ہم نے اسے غرق کر دیا۔ اور اللہ ان پر ظلم کرنے والا نہیں تھا‘ بلکہ وہ خود ہی اپنی جانوں پر ظلم کرتے تھے۔"}, {"arabic": " مَثَلُ الَّذِیۡنَ اتَّخَذُوۡا مِنۡ دُوۡنِ اللّٰہِ اَوۡلِیَآءَ کَمَثَلِ الۡعَنۡکَبُوۡتِ ۖۚ اِتَّخَذَتۡ بَیۡتًا ؕ وَ اِنَّ اَوۡہَنَ الۡبُیُوۡتِ لَبَیۡتُ الۡعَنۡکَبُوۡتِ ۘ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۴۲﴾", "english": " The case of those who take helpers beside Allah is like unto the case of the spider, who makes for herself a house; and surely the frailest of all houses is the house of the spider, if they but knew!", "french": " Le cas de ceux qui prennent des protecteurs en dehors d’Allāh est comme le cas de l’araignée, qui se fait une sorte de demeure ; et assurément la plus frêle des demeures est la demeure de l’araignée, si seulement ils savaient !", "german": " Das Gleichnis derer, die sich Helfer nehmen neben Allah, ist wie das Gleichnis der Spinne, die sich ein Haus macht; und das gebrechlichste der Häuser ist gewiss das Haus der Spinne – wenn sie es nur begriffen!", "spanish": " El ejemplo de quienes adoptan protectores distintos a Al‑lah es como el de la araña, que se prepara una casa; la casa de la araña es en verdad la más frágil de todas las casas, ¡si lo supieran!", "urdu": " ان لوگوں کا حال جنہوں نے اللہ کو چھوڑ کر اور دوست بنا لیے‘ مکڑی کا سا حال ہے‘ جس نے (اپنے لئے) ایک گھر تو بنایا لیکن گھروں میں سب سے کمزور گھر مکڑی کا ہی ہوتا ہے کاش! کہ یہ لوگ جانتے۔"}, {"arabic": " اِنَّ اللّٰہَ یَعۡلَمُ مَا یَدۡعُوۡنَ مِنۡ دُوۡنِہٖ مِنۡ شَیۡءٍ ؕ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۴۳﴾", "english": " Verily, Allah knows whatever they call upon beside Him; and He is the Mighty, the Wise.", "french": " En vérité, Allāh connaît tout ce qu’ils invoquent en dehors de Lui ; et Il est le Puissant, le Sage.", "german": " Wahrlich, Allah kennt all das, was sie statt Ihn anrufen; und Er ist der Allmächtige, der Allweise.", "spanish": " En verdad, Al‑lah conoce todo aquello que invocan en vez de a Él; mas Él es el Poderoso, el Sabio.", "urdu": " اللہ ہر اس چیز کو جس کو یہ لوگ اس کے سوا پکارتے ہیں جانتا ہے اور وہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " وَ تِلۡکَ الۡاَمۡثَالُ نَضۡرِبُہَا لِلنَّاسِ ۚ وَ مَا یَعۡقِلُہَاۤ اِلَّا الۡعٰلِمُوۡنَ ﴿۴۴﴾", "english": " And these are similitudes which We set forth for mankind, but only those understand them who have knowledge.", "french": " Et ce sont là des comparaisons que Nous proposons aux hommes, mais seuls les comprennent ceux qui possèdent de la connaissance.", "german": " Dies sind Gleichnisse, die Wir für die Menschheit aufstellen, doch es verstehen sie nur jene, die Wissen haben.", "spanish": " Estas son semejanzas; ejemplos que proponemos a los humanos, pero sólo las entienden quienes tie­nen conocimiento.", "urdu": " اور یہ مثالیں ہیں جو ہم لوگوں کے لئے بیان کرتے ہیں۔ لیکن عالموں کے سوا کوئی ان کو اپنے پلے نہیں باندھتا۔"}, {"arabic": " خَلَقَ اللّٰہُ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لِّلۡمُؤۡمِنِیۡنَ ﴿٪۴۵﴾", "english": " Allah created the heavens and the earth in accordance with the requirements of wisdom. In that surely is a Sign for the believers.", "french": " Allāh a créé les cieux et la terre avec vérité. Assurément, il y a là un Signe pour les croyants.", "german": " Allah erschuf die Himmel und die Erde in Weisheit. Hierin ist wahrlich ein Zeichen für die Gläubigen.", "spanish": " Al‑lah creó los cielos y la tierra con la verdad. Aquí hay cier­tamente un Signo para los creyentes.", "urdu": " اللہ نے آسمانوں اور زمین کو خاص مقصد کے لئے پیدا کیا ہے۔ اس میں مومنوں کے لئے ایک بڑا نشان ہے۔"}, {"arabic": " اُتۡلُ مَاۤ اُوۡحِیَ اِلَیۡکَ مِنَ الۡکِتٰبِ وَ اَقِمِ الصَّلٰوۃَ ؕ اِنَّ الصَّلٰوۃَ تَنۡہٰی عَنِ الۡفَحۡشَآءِ وَ الۡمُنۡکَرِ ؕ وَ لَذِکۡرُ اللّٰہِ اَکۡبَرُ ؕ وَ اللّٰہُ یَعۡلَمُ مَا تَصۡنَعُوۡنَ ﴿۴۶﴾", "english": " Recite that which has been revealed to thee of the Book, and observe Prayer. Surely, Prayer restrains one from indecency and manifest evil, and remembrance of Allah indeed is the greatest virtue . And Allah knows what you do.", "french": " Récite ce qui t’a été révélé du Livre, et observe la Prière. Assurément, la Prière retient l’homme de l’indécence et de ce qui est répréhensible, et le souvenir d’Allāh est assurément la plus grande vertu. Et Allāh sait ce que vous faites.", "german": " Verlies, was dir von dem Buche offenbart ward, und verrichte das Gebet. Wahrlich, das Gebet hält ab von Schändlichkeiten und Unrecht; und an Allah denken ist gewiss die höchste (Tugend). Und Allah weiß, was ihr tut.", "spanish": " Recita lo que te ha sido revelado del Libro, y cumple la Ora­ción. En verdad, la Oración preserva a la persona de la obscenidad y el mal manifiesto, y el recuerdo de Al‑lah es en verdad la mayor virtud. Pues Al‑lah sabe lo que hacéis..", "urdu": " اس کتاب (یعنی قرآن) میں سے جو کچھ تیری طرف وحی کیا جاتا ہے اُسے پڑھ (اور لوگوں کو پڑھ کر سنا) اور نماز کو (اس کی سب شرائط کے ساتھ) ادا کر۔ یقیناً نماز سب بری اور ناپسندیدہ باتوں سے روکتی ہے اور اللہ کی یاد یقیناً (اور سب کاموں سے) بڑی ہے اور اللہ تمہارے اعمال کو جانتا ہے۔"}, {"arabic": " وَ لَا تُجَادِلُوۡۤا اَہۡلَ الۡکِتٰبِ اِلَّا بِالَّتِیۡ ہِیَ اَحۡسَنُ ٭ۖ اِلَّا الَّذِیۡنَ ظَلَمُوۡا مِنۡہُمۡ وَ قُوۡلُوۡۤا اٰمَنَّا بِالَّذِیۡۤ اُنۡزِلَ اِلَیۡنَا وَ اُنۡزِلَ اِلَیۡکُمۡ وَ اِلٰـہُنَا وَ اِلٰـہُکُمۡ وَاحِدٌ وَّ نَحۡنُ لَہٗ مُسۡلِمُوۡنَ ﴿۴۷﴾", "english": " And argue not with the People of the Book except with what is best; but argue not at all with such of them as are unjust. And say, ‘We believe in that which has been revealed to us and that which has been revealed to you; and our God and your God is one; and to Him we submit.’", "french": " Et ne discutez pas avec les gens du Livre, sauf avec ce qu'il y a de meilleur ; mais ne discutez aucunement avec ceux d’entre eux qui sont injustes. Et dites : « Nous croyons en ce qui nous a été révélé, et en ce qui vous a été révélé et notre Dieu est le Même Dieu Unique qu’est le Vôtre ; et c’est à Lui que nous nous soumettons. »", "german": " Und streitet nicht mit dem Volk der Schrift, es sei denn in der besten Art; doch (streitet überhaupt nicht) mit denen von ihnen, die ungerecht sind. Und sprecht: \"Wir glauben an das, was zu uns herabgesandt ward und was zu euch herabgesandt ward; und unser Gott und euer Gott ist Einer; und Ihm sind wir ergeben.\"", "spanish": " No disputéis con el Pueblo del libro, excepto con lo que sea mejor; pero no disputéis en absoluto con los que son injustos de entre ellos. De­cidles: “Creemos en lo que nos ha sido revelado y en lo que os ha sido revelado; nuestro Dios y vuestro Dios es Uno Sólo; y a Él nos sometemos”.", "urdu": " اور اہل کتاب سے کبھی بحث نہ کرو مگر اعلیٰ اور مضبوط دلیل کے ساتھ۔ سوائے ان لوگوں کے جو ان میں سے ظلم کرنے والے ہوں (ان کو الزامی جواب دے سکتے ہو) اور ان سے کہو کہ جو ہم پر نازل ہوا ہے ہم اس پر بھی ایمان لاتے ہیں اور جو تم پر نازل ہوا ہے اس پر بھی۔ اور ہمارا خدا اور تمہارا خدا ایک ہے اور ہم اس کے فرمانبردار ہیں۔"}, {"arabic": " وَ کَذٰلِکَ اَنۡزَلۡنَاۤ اِلَیۡکَ الۡکِتٰبَ ؕ فَالَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یُؤۡمِنُوۡنَ بِہٖ ۚ وَ مِنۡ ہٰۤؤُلَآءِ مَنۡ یُّؤۡمِنُ بِہٖ ؕ وَ مَا یَجۡحَدُ بِاٰیٰتِنَاۤ اِلَّا الۡکٰفِرُوۡنَ ﴿۴۸﴾", "english": " And in like manner have We sent down the Book to thee, so those to whom We have given true knowledge of the Book believe in it (the Qur’an); and of these Meccans also there are some who believe in it. And none but the ungrateful deny Our Signs.", "french": " Et c’est ainsi que Nous avons fait descendre le Livre sur toi ; ainsi ceux à qui Nous avons accordé une connaissance vraie du Livre, y croient. Et parmi ces gens-là de La Mecque aussi il y en a qui y croient. Et il n’y a que les ingrats qui nient Nos Signes.", "german": " Also haben Wir dir das Buch herniedergesandt, und so glauben die daran, denen Wir das Buch gegeben; und (auch) unter diesen sind einige, die daran glauben. Es sind aber nur die Ungläubigen, die Unsere Zeichen leugnen.", "spanish": " De la misma manera te hemos revelado el Libro, para que aquellos a quienes hemos dado el conocimiento verdadero del Libro, crean en él (el Corán). Y también entre estos mequíes hay algunos que creen en él. Pues nadie, excepto los desagradecidos, niegan Nuestros Signos.", "urdu": " اور اسی طرح ہم نے تجھ پر یہ مکمل کتاب اتاری ہے پس وہ لوگ جن کو ہم نے یہ کتاب دی ہے وہ اس پر ایمان لاتے ہیں اور ان لوگوں سے (یعنی اہل کتاب میں سے بھی) بعض اس پر ایمان لاتے ہیں اور ہماری آیتوں کا ضد کے ساتھ انکار صرف کافر ہی کرتے ہیں۔"}, {"arabic": " وَ مَا کُنۡتَ تَتۡلُوۡا مِنۡ قَبۡلِہٖ مِنۡ کِتٰبٍ وَّ لَا تَخُطُّہٗ بِیَمِیۡنِکَ اِذًا لَّارۡتَابَ الۡمُبۡطِلُوۡنَ ﴿۴۹﴾", "english": " And thou didst not recite any Book before it, nor didst thou write one with thy right hand; in that case the liars would have doubted.", "french": " Et tu n’avais jamais récité quelque Livre avant celui-ci, et tu ne l'avais jamais écrit de ta main droite avant celui-ci ; en ce cas les menteurs auraient eu quelque raison d’avoir des doutes.", "german": " Und nie verlasest du vordem ein Buch, noch konntest du eines schreiben mit deiner rechten Hand; sonst hätten die Lügner zweifeln können.", "spanish": " Tú no recitaste ningún Libro antes de él, ni escribiste ninguno con tu mano derecha; en ese caso, los mentirosos habrían dudado.", "urdu": " اور اس (قرآن) کے نازل ہونے سے پہلے تو کوئی کتاب نہ پڑھتا تھا‘ نہ لوگوں کو سناتا تھا اور نہ اسے اپنے دائیں ہاتھ سے لکھتا تھا۔ اگر ایسا ہوتا تو جھٹلانے والے شبہ میں پڑ جاتے۔"}, {"arabic": " بَلۡ ہُوَ اٰیٰتٌۢ بَیِّنٰتٌ فِیۡ صُدُوۡرِ الَّذِیۡنَ اُوۡتُوا الۡعِلۡمَ ؕ وَ مَا یَجۡحَدُ بِاٰیٰتِنَاۤ اِلَّا الظّٰلِمُوۡنَ ﴿۵۰﴾", "english": " Nay, it is a collection of clear Signs in the hearts of those who are given knowledge. And none but the wrongdoers deny Our Signs.", "french": " Non , mais c’est un recueil de Signes clairs dans le cœur de ceux à qui a été donnée la connaissance. Et il n’y a que les injustes pour nier Nos Signes.", "german": " Nein, es sind klare Zeichen in den Herzen derer, denen das Wissen gegeben ward. Es sind aber nur die Ungerechten, die Unsere Zeichen leugnen.", "spanish": " No, ésta es una colección de Signos claros para los corazones de aquellos que han recibido el conoci­miento. Mas nadie, excepto los injustos, niegan Nuestros Signos.", "urdu": " مگر یہ (قرآن) تو کھلی نشانیاں ہیں ان لوگوں کے دلوں میں جن کو علم دیا گیا ہے اور ہمارے نشانات کا ظالموں کے سوا کوئی انکار نہیں کرتا۔"}, {"arabic": " وَ قَالُوۡا لَوۡ لَاۤ اُنۡزِلَ عَلَیۡہِ اٰیٰتٌ مِّنۡ رَّبِّہٖ ؕ قُلۡ اِنَّمَا الۡاٰیٰتُ عِنۡدَ اللّٰہِ ؕ وَ اِنَّمَاۤ اَنَا نَذِیۡرٌ مُّبِیۡنٌ ﴿۵۱﴾", "english": " And they say, ‘Why are not Signs sent down to him from his Lord?’ Say, ‘The Signs are with Allah, and certainly I am a clear Warner.’", "french": " Et ils disent : « Pourquoi des Signes ne lui sont-ils pas envoyés par son Seigneur ? » Dis : « Les Signes ne sont qu’avec Allāh, et je ne suis qu’un Avertisseur qui avertit clairement. »", "german": " Dennoch sprechen sie: \"Warum wurden nicht Zeichen zu ihm herabgesandt von seinem Herrn?\" Sprich: \"Die Zeichen sind allein bei Allah, und ich bin nur ein aufklärender Warner.\"", "spanish": " Ellos dicen: “¿Por qué no te revela Signos tu Señor?” Diles: “Los Signos están en Al‑lah, y yo soy, ciertamente, un Amonestador fide­digno”.", "urdu": " اور وہ کہتے ہیں کہ کیوں اس کے رب کی طرف سے اس پر کوئی نشانات نہیں اترے۔ کہو کہ نشانات تو خدا کے پاس ہیں (جب وہ فائدہ دیکھتا ہے اتارتا ہے) اور میں تو ایک کھلا کھلا ہوشیار کرنے والا ہوں۔"}, {"arabic": " اَوَ لَمۡ یَکۡفِہِمۡ اَنَّاۤ اَنۡزَلۡنَا عَلَیۡکَ الۡکِتٰبَ یُتۡلٰی عَلَیۡہِمۡ ؕ اِنَّ فِیۡ ذٰلِکَ لَرَحۡمَۃً وَّ ذِکۡرٰی لِقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿٪۵۲﴾", "english": " Is it not enough for them that We have sent down to thee the Book which is recited to them? Verily, there is mercy in it and a reminder for a people who believe.", "french": " Ne leur suffit-il pas comme Signe que Nous ayons fait descendre le Livre sur toi qui leur est récité ? En vérité, il y a en ceci une grande miséricorde et un rappel pour un peuple qui croit.", "german": " Genügt es ihnen denn nicht, dass Wir dir das Buch herniedergesandt haben, das ihnen verlesen wird? Fürwahr, hierin ist Barmherzigkeit und Ermahnung für ein Volk, das glaubt.", "spanish": " ¿Acaso no les basta el que te hayamos revelado el Libro que se les recita? En verdad, en él hay misericordia y un recordatorio para el pueblo que cree.", "urdu": " کیا ان کے لئے (یہ نشان) کافی نہ تھا کہ ہم نے تجھ پر ایک مکمل کتاب (قرآن) کو نازل کیا جو انہیں پڑھ کر سنائی جاتی ہے۔ اس امر میں مومنوں کے لئے تو بڑی رحمت اور نصیحت کے سامان ہیں۔"}, {"arabic": " قُلۡ کَفٰی بِاللّٰہِ بَیۡنِیۡ وَ بَیۡنَکُمۡ شَہِیۡدًا ۚ یَعۡلَمُ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ الَّذِیۡنَ اٰمَنُوۡا بِالۡبَاطِلِ وَ کَفَرُوۡا بِاللّٰہِ ۙ اُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿۵۳﴾", "english": " Say, ‘Allah is sufficient as a Witness between me and you. He knows what is in the heavens and the earth. And as for those who believe in falsehood and disbelieve in Allah, they it is who are the losers.’", "french": " Dis : « Allāh suffit comme Témoin entre moi et vous. Il sait ce qu’il y a dans les cieux et sur la terre. Et quant à ceux qui croient au mensonge, et ne croient pas en Allāh, ceux-là sont les perdants.", "german": " Sprich: \"Allah genügt als Zeuge zwischen mir und euch. Er weiß, was in den Himmeln und was auf Erden ist. Und diejenigen, die das Falsche annehmen und Allah ablehnen, das sind die Verlierenden.\"", "spanish": " Diles: “Al-lah basta como testigo entre vosotros y yo. Él sabe lo que hay en los cielos y la tierra. Y en cuanto a quienes creen en la falsedad y no creen en Al-lah, son ellos los perdedores”.", "urdu": " تو کہہ دے میرے اور تمہارے درمیان بطور گواہ فیصلہ کرنے والا اللہ ہی کافی ہے اور جو کچھ آسمانوں میں ہے اور زمین میں ہے اسے وہ جانتا ہے اور جو لوگ باطل پر عمل کرتے ہیں اور اللہ کے احکام کا انکار کرتے ہیں وہی گھاٹے میں پڑنے والے ہیں۔"}, {"arabic": " وَ یَسۡتَعۡجِلُوۡنَکَ بِالۡعَذَابِ ؕ وَ لَوۡ لَاۤ اَجَلٌ مُّسَمًّی لَّجَآءَہُمُ الۡعَذَابُ ؕ وَ لَیَاۡتِیَنَّہُمۡ بَغۡتَۃً وَّ ہُمۡ لَا یَشۡعُرُوۡنَ ﴿۵۴﴾", "english": " They ask thee to hasten on the punishment; and had there not been an appointed term, the punishment would have come upon them. And it shall surely overtake them unexpectedly, while they perceive not.", "french": " Ils te demandent de hâter le châtiment et s’il n’y avait pas eu un terme fixé, le châtiment serait tombé sur eux. Et il tombera assurément sur eux à l’improviste, sans qu’ils ne l’ aient pressenti.", "german": " Sie verlangen von dir, dass du die Strafe beschleunigst. Wäre nicht eine Frist festgesetzt, die Strafe hätte sie schon ereilt, und sie wird gewiss unerwartet über sie kommen, da sie es nicht gewahren.", "spanish": " Te piden que apresures el castigo; mas de no haber existido un plazo fijado, el castigo habría caído sobre ellos. Y ciertamente les alcan­zará de improviso, cuando no se den cuenta.", "urdu": " اور وہ تجھ سے عذاب کے جلدی لانے کی خواہش کرتے ہیں اور اگر ایک مقرر وقت نہ ہوتا تو عذاب ان کے پاس آجاتا اور اب بھی وہ ان کے پاس ضرور (آئے گا اور) اچانک آئے گا اس حالت میں کہ وہ جانتے بھی نہ ہوں گے۔"}, {"arabic": " یَسۡتَعۡجِلُوۡنَکَ بِالۡعَذَابِ ؕ وَ اِنَّ جَہَنَّمَ لَمُحِیۡطَۃٌۢ بِالۡکٰفِرِیۡنَ ﴿ۙ۵۵﴾", "english": " They ask thee to hasten on the punishment; but verily, Hell is already encompassing the disbelievers.", "french": " Ils te demandent de hâter le châtiment mais en vérité, l’Enfer entoure déjà les mécréants.", "german": " Sie verlangen von dir, dass du die Strafe beschleunigst; doch wahrlich, die Hölle wird die Ungläubigen einschließen", "spanish": " Te piden que apresures el cas­tigo; pero en verdad, el infierno ya rodea a los incrédulos.", "urdu": " (اور) وہ تجھ سے عذاب کے جلدی لانے کا مطالبہ کرتے ہیں اور جہنم کافروں کو یقیناً تباہ کرنے والی ہے۔"}, {"arabic": " یَوۡمَ یَغۡشٰہُمُ الۡعَذَابُ مِنۡ فَوۡقِہِمۡ وَ مِنۡ تَحۡتِ اَرۡجُلِہِمۡ وَ یَقُوۡلُ ذُوۡقُوۡا مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۵۶﴾", "english": " Remember the day when the punishment will overwhelm them from above them and from underneath their feet, and He will say, ‘Taste ye the fruit of your actions.’", "french": " Le jour où le châtiment les enveloppera au-dessus d’eux et de dessous leurs pieds, et Il dira : « Goûtez les fruits de vos actions. »", "german": " an dem Tage, da die Strafe sie überwältigen wird von oben her und von ihren Füßen her, und Er wird sprechen: \"Kostet nun (die Früchte) eurer Taten.\"", "spanish": " Recuerda el día en que el escarmiento les sobrevendrá esde arriba y desde debajo de sus pies, y Él dirá: “Probad el fruto de vuestras acciones”.", "urdu": " جس دن (کہ جہنم کا عذاب کافروں کو گھیر کر تباہ کر دے گا) (یہ وہ دن ہوگا کہ خدائی) عذاب ان کے اوپر سے بھی انہیں ڈھانک لے گا اور ان کے پاٶں کے نیچے سے نکل کر بھی ان کو گھیر لے گا اور (خدا) کہے گا۔ اپنے عملوں کا نتیجہ چکھو۔"}, {"arabic": " یٰعِبَادِیَ الَّذِیۡنَ اٰمَنُوۡۤا اِنَّ اَرۡضِیۡ وَاسِعَۃٌ فَاِیَّایَ فَاعۡبُدُوۡنِ ﴿۵۷﴾", "english": " O My servants who believe! verily, vast is My earth, so worship Me alone.", "french": " Ô Mes serviteurs qui croyez ! En vérité, Ma terre est vaste ; alors adorez-Moi Seul.", "german": " O Meine Diener, die ihr glaubt, weit ist Mein Land. Darum verehret Mich allein.", "spanish": " ¡Oh, siervos míos que creéis! En verdad, amplia es Mi tierra, ado­radme pues sólo a Mí.", "urdu": " اے میرے مومن بندو! میری زمین وسیع ہے۔ پس تم میری ہی عبادت کرو۔"}, {"arabic": " کُلُّ نَفۡسٍ ذَآئِقَۃُ الۡمَوۡتِ ۟ ثُمَّ اِلَیۡنَا تُرۡجَعُوۡنَ ﴿۵۸﴾", "english": " Every soul shall taste of death; then to Us shall you be brought back.", "french": " Chaque âme goûtera la mort ; ensuite c’est auprès de Nous que vous serez ramenés tous.", "german": " Jedes Lebewesen soll den Tod kosten; zu Uns sollt ihr dann zurückgebracht werden.", "spanish": " Toda alma probará el gusto de la muerte; luego seréis devuel­tos a Nosotros.", "urdu": " ہر جاندار موت کامزہ چکھنے والا ہے۔ پھر ہماری طرف ہی تم (سب) کو لوٹایا جائے گا۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَنُبَوِّئَنَّہُمۡ مِّنَ الۡجَنَّۃِ غُرَفًا تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ نِعۡمَ اَجۡرُ الۡعٰمِلِیۡنَ ﴿٭ۖ۵۹﴾", "english": " And those who believe and do good works — them shall We surely house in lofty mansions of Paradise, beneath which rivers flow. They will abide therein. Excellent is the reward of those who work good ,", "french": " Et ceux qui croient et font de bonnes œuvres – Nous les logerons assurément dans des habitations élevées du Paradis, sous lesquelles coulent des rivières. Ils y demeureront éternellement. Qu’elle est excellente la récompense de ceux qui font de bonnes œuvres ,", "german": " Und jene, die glauben und gute Werke tun, sie beherbergen Wir in den oberen Gemächern des Paradieses, durch das Ströme fließen. Darin werden sie weilen immerdar. Herrlich ist der Lohn der (Gutes) Wirkenden,", "spanish": " A quienes creen y hacen buenas obras, a ellos los alojaremos ciertamente en mansiones elevadas del Paraíso, bajo las cuales corren íos. Allí morarán. Excelente es la recompensa de los que hacen el bien.", "urdu": " اور وہ لوگ جو ایمان لاتے ہیں اور اس کے مطابق عمل بھی کرتے ہیں ہم ان کو جنت میں بالاخانوں میں جگہ دیں گے (ایسی جنت میں) کہ اس کے (سایوں) تلے نہریں بہتی ہونگی۔ وہ (مومن) ان جنتوں میں ہمیشہ کے لئے رہتے چلے جائیں گے اور اچھے عمل کرنے والوں کا اجر بہت اچھا ہوتا ہے۔"}, {"arabic": " الَّذِیۡنَ صَبَرُوۡا وَ عَلٰی رَبِّہِمۡ یَتَوَکَّلُوۡنَ ﴿۶۰﴾", "english": " Those who are steadfast, and put their trust in their Lord.", "french": " Ceux qui sont patients, et qui placent leur confiance en leur Seigneur !", "german": " die da standhaft sind und auf ihren Herrn vertrauen.", "spanish": " Los que son perseverantes y ponen su confianza en su Señor.", "urdu": " ان (مومنوں) کا جو (اپنے عقیدہ اور عمل پر) جمے رہتے ہیں اور اپنے رب پر توکل کرتے ہیں۔"}, {"arabic": " وَ کَاَیِّنۡ مِّنۡ دَآبَّۃٍ لَّا تَحۡمِلُ رِزۡقَہَا ٭ۖ اَللّٰہُ یَرۡزُقُہَا وَ اِیَّاکُمۡ ۫ۖ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۶۱﴾", "english": " And how many an animal there is that carries not its own sustenance! Allah provides for it and for you. And He is the All-Hearing, the All-knowing.", "french": " Et combien d’animaux existe-t-il qui ne portent pas leur propre nourriture ! Allāh les nourrit ainsi que vous. Il est Celui Qui Entend Tout, l’Omniscient.", "german": " Und wie so manches Tier gibt´s, das nicht seinen eigenen Unterhalt trägt! Allah versorgt es und euch. Und Er ist der Allhörende, der Allwissende.", "spanish": " ¡Cuántos animales hay que no pueden procurarse su propio sus­tento! Al‑lah provee para ellos y para vosotros. Él es Quien Todo lo Oye, el Omnisciente.", "urdu": " اس دنیا میں بہت سے جانور بھی ہیں جو اپنے ساتھ (انسانوں کی طرح) اپنا رزق نہیں اٹھائے پھرتے‘ اللہ ہی ان کو رزق دیتا ہے اور تم کو بھی۔ اور وہ بہت دعائیں سننے والا (اور) حالات سے خوب آگاہ ہے۔"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ مَّنۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ سَخَّرَ الشَّمۡسَ وَ الۡقَمَرَ لَیَقُوۡلُنَّ اللّٰہُ ۚ فَاَنّٰی یُؤۡفَکُوۡنَ ﴿۶۲﴾", "english": " And if thou ask them, ‘Who has created the heavens and the earth and pressed into service the sun and the moon?’, they will surely say, ‘Allah.’ How then are they being turned away from the truth ?", "french": " Et si tu leur demandes : « Qui a créé les cieux et la terre, et assujetti le soleil et la lune ? » Certainement ils répondront : « Allāh ». Comment donc sont-ils détournés de la vérité ?", "german": " Und wenn du sie fragst: \"Wer hat die Himmel und die Erde geschaffen und die Sonne und den Mond dienstbar gemacht?\" dann werden sie gewisslich sagen: \"Allah\". Wieso lassen sie sich dann abwendig machen?", "spanish": " Y si les preguntáis: “¿Quién ha creado los cielos y la tierra y ha puesto en servicio al sol y la lu­na? dirán ciertamente: “Al‑lah”. ¿Cómo se extravían, pues?", "urdu": " اور اگر تو ان لوگوں سے پوچھے کہ آسمانوں اور زمین کو کس نے پیدا کیا ہے اور سورج اور چاند کو (بغیر مزدوری کے) کس نے انسانوں کی خدمت میں لگایا ہوا ہے؟ تو وہ کہیں گے۔ اللہ نے (پھر جب وہ یہ بات جانتے ہیں) تو کس طرف کو بہکائے جا رہے ہیں۔"}, {"arabic": " اَللّٰہُ یَبۡسُطُ الرِّزۡقَ لِمَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ وَ یَقۡدِرُ لَہٗ ؕ اِنَّ اللّٰہَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۶۳﴾", "english": " Allah enlarges the means of sustenance for such of His servants as He pleases, and straitens them for whom He pleases . Surely Allah has full knowledge of all things.", "french": " Allāh élargit les moyens de subsistance de qui Il veut parmi Ses serviteurs et parfois Il les lui restreint. Assurément, Allāh est Omniscient.", "german": " Allah weitet und beschränkt die Mittel zum Unterhalt, wem Er will von Seinen Dienern. Wahrlich, Allah hat volle Kenntnis von allen Dingen.", "spanish": " Al-lah amplía los medios de sustento de aquellos e Sus siervos que Le place, y se los recorta a quienes quiere. En verdad Al‑lah tiene pleno conocimiento de todas las cosas.", "urdu": " اللہ ہی اپنے بندوں میں سے جس کے لئے چاہتا ہے رزق فراخ کر دیتا ہے اور جس کے لئے چاہتا ہے تنگ کر دیتا ہے۔ اللہ یقیناً ہر چیز سے اچھی طرح واقف ہے۔"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ مَّنۡ نَّزَّلَ مِنَ السَّمَآءِ مَآءً فَاَحۡیَا بِہِ الۡاَرۡضَ مِنۡۢ بَعۡدِ مَوۡتِہَا لَیَقُوۡلُنَّ اللّٰہُ ؕ قُلِ الۡحَمۡدُ لِلّٰہِ ؕ بَلۡ اَکۡثَرُہُمۡ لَا یَعۡقِلُوۡنَ ﴿٪۶۴﴾", "english": " And if thou ask them, ‘Who sends down water from the sky and therewith gives life to the earth after its death?’, they will surely say, ‘Allah.’ Say, ‘All praise belongs to Allah.’ But most of them understand not.", "french": " Et si tu leur demandes : « Qui fait descendre l’eau du ciel et en ranime la terre après sa mort ? » ils répondront assurément : « Allāh. » Dis : « Toutes les louanges appartiennent à Allāh ! » Mais la plupart d’entre eux ne comprennent pas.", "german": " Und wenn du sie fragst: \"Wer sendet Wasser vom Himmel nieder und belebt damit die Erde nach ihrem Tod?\" – dann werden sie gewisslich sagen: \"Allah\". Sprich: \"Aller Preis gebührt Allah\" Jedoch die meisten von ihnen verstehen es nicht.", "spanish": " Y si les preguntas: “¿Quién envía el agua desde el cielo dando así la vida a la tierra después de su muerte?” , dirán ciertamente: “Al­-lah”. Diles: “Toda alabanza corres­ponde a Al‑lah”. Pero la mayoría de ellos no entiende.", "urdu": " اور اگر تو ان سے پوچھے کہ بادل سے کس نے پانی اتارا ہے؟ اور پھر اس کے ذریعہ سے زمین کو اس کے مرنے کے بعد زندہ کیا ہے؟ تو وہ کہیں گے۔ یقیناً اللہ نے تو کہہ دے کہ سب تعریف اللہ ہی کے لئے ہے لیکن ان (انسانوں) میں سے اکثر سمجھتے نہیں۔"}, {"arabic": " وَ مَا ہٰذِہِ الۡحَیٰوۃُ الدُّنۡیَاۤ اِلَّا لَہۡوٌ وَّ لَعِبٌ ؕ وَ اِنَّ الدَّارَ الۡاٰخِرَۃَ لَہِیَ الۡحَیَوَانُ ۘ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۶۵﴾", "english": " And this life of the world is nothing but a pastime and a sport, and the Home of the Hereafter — that indeed is Life, if they but knew!", "french": " Et cette vie du monde n’est qu’un amusement et un jeu ; et la Demeure de l’au-delà – cela est la vraie Vie, si seulement ils savaient !", "german": " Dieses irdische Leben ist nichts als ein eitles Getändel und ein Spiel; die Wohnstatt des Jenseits aber – das ist Leben fürwahr, wenn sie es nur wüssten!", "spanish": " La vida del mundo no es sino un pasatiempo y un juego, y el Hogar del Más Allá es la Vida en verdad. ¡Si lo supieran!", "urdu": " اور یہ ورلی زندگی صرف ایک غفلت اور کھیل کا سامان ہے اور اخروی زندگی کا گھر ہی درحقیقت اصلی زندگی کا گھر کہلا سکتا ہے کاش کہ وہ لوگ جانتے۔"}, {"arabic": " فَاِذَا رَکِبُوۡا فِی الۡفُلۡکِ دَعَوُا اللّٰہَ مُخۡلِصِیۡنَ لَہُ الدِّیۡنَ ۬ۚ فَلَمَّا نَجّٰہُمۡ اِلَی الۡبَرِّ اِذَا ہُمۡ یُشۡرِکُوۡنَ ﴿ۙ۶۶﴾", "english": " And when they go on board a ship, they call on Allah, with sincere and exclusive faith in Him. But when He brings them safe to land, behold, they associate partners with Him ;", "french": " Et lorsqu’ils montent à bord d’un navire, ils invoquent Allāh, d’une foi sincère et exclusive en Lui. Mais lorsqu’Il les ramène sains et saufs à terre, voilà qu’ils Lui attribuent des associés ;", "german": " Und wenn sie ein Schiff besteigen, dann rufen sie Allah an, in lauterem Gehorsam gegen Ihn. Bringt Er sie dann aber heil ans Land, siehe, dann stellen sie (Ihm) Götter zur Seite,", "spanish": " Cuando van a bordo de una embarcación, invocan a Al‑lah, con fe sincera y exclusiva en Él. Pero cuando Él les lleva seguros a tierra, he ahí que Le asocian partícipes.", "urdu": " اور جب وہ لوگ کشتی میں سوار ہوتے ہیں تو اپنی عقیدت کا خالصتہ اللہ کے لئے کرکے اس سے دعا مانگتے ہیں مگر جب وہ ان کو خشکی کی طرف نجات دے کر پہنچا دیتا ہے تو اچانک پھر شرک کرنے لگ جاتے ہیں۔"}, {"arabic": " لِیَکۡفُرُوۡا بِمَاۤ اٰتَیۡنٰہُمۡ ۚۙ وَ لِیَتَمَتَّعُوۡا ٝ فَسَوۡفَ یَعۡلَمُوۡنَ ﴿۶۷﴾", "english": " That they may deny that which We have bestowed on them, and that they may enjoy themselves for a time . But they will soon come to know.", "french": " Pour qu’ils puissent nier ce que Nous leur avons accordé, et puissent jouir des bénéfices temporaires. Mais bientôt ils sauront.", "german": " damit sie das leugnen, was Wir ihnen beschert haben, und damit sie sich ergötzen mögen. Bald aber werden sie es erfahren!", "spanish": " Para negar lo que les hemos concedido, y disfrutar durante algún tiempo. Pero pronto sabrán.", "urdu": " تا کہ ہم نے جو کچھ انہیں دیا ہے اس کا انکار کر دیں (اور اس انعام کو خدا کے سوا دوسرے شریکوں کی طرف منسوب کردیں) اور اس (عارضی توبہ) کا نتیجہ یہ ہوتا ہے کہ (اللہ تعالیٰ ان کو چھوڑ دیتا ہے اور) وہ ایک عرصہ تک دنیوی سامانوں سے فائدہ اٹھاتے ہیں۔ پس (ایک دن یہ بخشش ختم ہو جائے گی اور) وہ (اپنی حقیقی جزا کو) دیکھ لیں گے۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّا جَعَلۡنَا حَرَمًا اٰمِنًا وَّ یُتَخَطَّفُ النَّاسُ مِنۡ حَوۡلِہِمۡ ؕ اَفَبِالۡبَاطِلِ یُؤۡمِنُوۡنَ وَ بِنِعۡمَۃِ اللّٰہِ یَکۡفُرُوۡنَ ﴿۶۸﴾", "english": " Have they not seen that We have made the sanctuary secure for them , while people are snatched away from all around them? Would they then believe in falsehood and deny the favour of Allah?", "french": " N’ont-ils pas vu que Nous avons fait le sanctuaire sûr pour eux , alors que les hommes sont enlevés tout autour ? Croiront-ils donc aux mensonges et renieront-ils la faveur d’Allāh ?", "german": " Haben sie denn nicht gesehen, dass Wir eine Freistatt sicher gemacht haben, während rings um sie die Menschen hinweggerissen werden? Wollen sie da noch an Falsches glauben und die Huld Allahs leugnen?", "spanish": " ¿No han visto que hemos he­cho el santuario seguro para ellos, mientras las gentes son expulsadas de su alrededor? ¿Van a creer pues en la falsedad y negar el favor de Al‑lah?", "urdu": " کیا انہیں معلوم نہیں کہ ہم نے حرم (یعنی مکہ) کو امن کی جگہ بنا دیا ہے اور ان لوگوں کے ارد گرد سے (یعنی مکہ کے باہر سے) لوگ اچک لیے جاتے ہیں۔ تو کیاوہ جھوٹ پر تو ایمان لاتے ہیں اور اللہ کی نعمت کا انکار کرتے ہیں۔"}, {"arabic": " وَ مَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا اَوۡ کَذَّبَ بِالۡحَقِّ لَمَّا جَآءَہٗ ؕ اَلَیۡسَ فِیۡ جَہَنَّمَ مَثۡوًی لِّلۡکٰفِرِیۡنَ ﴿۶۹﴾", "english": " And who is more unjust than he who invents a lie concerning Allah, or rejects the truth when it comes to him? Is there not an abode in Hell for those who disbelieve?", "french": " Et qui est plus injuste que celui qui fabrique un mensonge concernant Allāh, ou qui rejette la vérité lorsqu’elle vient à lui ? N’y a-t-il pas en Enfer une habitation pour ceux qui refusent de croire ?", "german": " Und wer ist ungerechter als jener, der eine Lüge wider Allah erdichtet oder die Wahrheit verwirft, wenn sie zu ihm kommt? Ist denn nicht eine Wohnstatt in der Hölle für die Ungläubigen?", "spanish": " ¿Quién es más injusto que aquel que inventa una mentira sobre Al‑lah, o rechaza la verdad cuando le ha llegado? ¿No hay acaso una morada en el Infierno para los in­crédulos?", "urdu": " اور جو شخص اللہ پر جھوٹ باندھ کر افترا کرتا ہے‘ اس سے زیادہ ظالم کون ہو سکتا ہے یا (اس سے) جو سچی بات کو اس وقت جھٹلاتا ہے جب وہ اس کے پاس آجاتی ہے کیا ایسے کافروں کی جگہ جہنم میں نہیں ہونی چاہیئے۔"}, {"arabic": " وَ الَّذِیۡنَ جَاہَدُوۡا فِیۡنَا لَنَہۡدِیَنَّہُمۡ سُبُلَنَا ؕ وَ اِنَّ اللّٰہَ لَمَعَ الۡمُحۡسِنِیۡنَ ﴿٪۷۰﴾", "english": " And as for those who strive in Our path — We will surely guide them in Our ways. And verily Allah is with those who do good.", "french": " Et quant à ceux qui font des efforts pour Notre cause – Nous les dirigerons assurément sur Nos voies. Et, en vérité, Allāh est avec ceux qui font le bien.", "german": " Und diejenigen, die in Unserer Sache bestrebt sind – Wir werden sie gewiss leiten auf Unseren Wegen. Wahrlich, Allah ist mit denen, die Gutes tun.", "spanish": " En cuanto a los que se esfuerzan en Nuestro camino: en verdad los guiaremos por Nuestras sendas. Pues Al‑lah está en verdad con los que hacen el bien.", "urdu": " اور وہ (لوگ) جو ہم سے ملنے کی کوشش کرتے ہیں۔ ہم ان کو ضرور اپنے رستوں کی طرف آنے کی توفیق بخشیں گے اور اللہ یقیناً محسنوں کے ساتھ ہے۔"}], "Surah": 29}