{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " حٰمٓ ۚ﴿۲﴾", "english": " Ha Mim.", "french": " Ḥā Mīm (Le Très-Louable, le Seigneur de l’Honneur).", "german": " Hâ Mîm.", "spanish": " Ha Mim.", "urdu": " حمید (اور) مجید (خدا اس سورۃ کو اتارنے والا ہے) ۔"}, {"arabic": " تَنۡزِیۡلُ الۡکِتٰبِ مِنَ اللّٰہِ الۡعَزِیۡزِ الۡحَکِیۡمِ ﴿۳﴾", "english": " The revelation of this Book is from Allah, the Mighty, the Wise.", "french": " La révélation de ce Livre provient d’Allāh, le Puissant, le Sage.", "german": " Die Offenbarung des Buches ist von Allah, dem Allmächtigen, dem Allweisen.", "spanish": " La revelación de este Libro procede de Al-lah, el Poderoso, el Sabio.", "urdu": " غالب اور حکمت والے اللہ کی طرف سے اس کتاب کو اتارا گیا ہے۔"}, {"arabic": " اِنَّ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ لَاٰیٰتٍ لِّلۡمُؤۡمِنِیۡنَ ؕ﴿۴﴾", "english": " Verily in the heavens and the earth are Signs for those who believe.", "french": " En vérité, dans les cieux et sur la terre, il y a des Signes pour les croyants.", "german": " Wahrlich, in den Himmeln und auf der Erde sind Zeichen für jene, die glauben.", "spanish": " En verdad, en los cielos y en la tierra hay Signos para quienes creen.", "urdu": " آسمانوں اور زمین میںمومنوں کیلئے بڑے نشانات ہیں۔"}, {"arabic": " وَ فِیۡ خَلۡقِکُمۡ وَ مَا یَبُثُّ مِنۡ دَآبَّۃٍ اٰیٰتٌ لِّقَوۡمٍ یُّوۡقِنُوۡنَ ۙ﴿۵﴾", "english": " And in your own creation and in that of all the creatures which He scatters in the earth are Signs for a people who possess firm faith.", "french": " Et dans votre propre création et dans celle de toutes les créatures qu’Il éparpille sur la terre , il y a des Signes pour un peuple qui possède la certitude de la foi.", "german": " Und in eurer Erschaffung und all der Geschöpfe, die Er (über die Erde) ausstreut, sind Zeichen für Leute, die festen Glauben haben.", "spanish": " Y en vuestra propia creación y en la de todas las criaturas que Él esparce por la tierra hay Signos para la gente que posee fe firme.", "urdu": " اور اسی طرح تمہاری پیدائش میں اور اس میں جو وہ (اللہ) جانداروں میں سے (زمین میں) پھیلاتا ہے یقین کرنے والی قوم کے لئے نشانات ہیں۔"}, {"arabic": " وَ اخۡتِلَافِ الَّیۡلِ وَ النَّہَارِ وَ مَاۤ اَنۡزَلَ اللّٰہُ مِنَ السَّمَآءِ مِنۡ رِّزۡقٍ فَاَحۡیَا بِہِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا وَ تَصۡرِیۡفِ الرِّیٰحِ اٰیٰتٌ لِّقَوۡمٍ یَّعۡقِلُوۡنَ ﴿۶﴾", "english": " And in the alternation of night and day, and the provision that Allah sends down from the sky, whereby He quickens the earth after its death, and in the change of the winds, are Signs for a people who try to understand.", "french": " Et dans l’alternance de la nuit et du jour, et dans la provision qu’Allāh a fait descendre du ciel, par laquelle Il ranime la terre après sa mort, et dans le changement des vents, il y a des Signes pour un peuple doué d’intelligence.", "german": " Und in dem Wechsel von Nacht und Tag und in der Versorgung, die Allah vom Himmel niedersendet, wodurch Er die Erde neu belebt nach ihrem Tod, und in dem Wandel der Winde sind Zeichen für Leute, die Verstand besitzen.", "spanish": " Y en la alternación de la noche y el día y en la provisión que Al-lah envía desde el cielo, por la que devuelve la vida a la tierra después su muerte, y en el cambio de los vientos, hay Signos para un pueblo que intente entender.", "urdu": " اور رات اور دن کے آگے پیچھے آنے جانے میں بھی اور جو اللہ نے رزق کا موجب (یعنی پانی) بادل سے اتارا ہے پھر اس سے زمین کو اس کے مرنے کے بعد زندہ کیا ہے (اس میں بھی) اور ہواٶں کے ادھر ادھر چلانے میں بھی عقل والی قوم کے لئے بہت سے نشانات ہیں۔"}, {"arabic": " تِلۡکَ اٰیٰتُ اللّٰہِ نَتۡلُوۡہَا عَلَیۡکَ بِالۡحَقِّ ۚ فَبِاَیِّ حَدِیۡثٍۭ بَعۡدَ اللّٰہِ وَ اٰیٰتِہٖ یُؤۡمِنُوۡنَ ﴿۷﴾", "english": " These are the Signs of Allah which We rehearse unto thee with truth. In what word, then, after rejecting that of Allah and His Signs will they believe?", "french": " Ce sont là les Signes d’Allāh que Nous te récitons avec vérité. A quelle parole donc croiront-ils, après avoir rejeté celle d ’Allāh et Ses Signes ?", "german": " Dies sind die Zeichen Allahs, die Wir dir mit der Wahrheit vortragen. An welches Wort wollen sie denn glauben nach Allah und Seinen Zeichen?", "spanish": " Estos son los Signos de Al-lah que te repetimos con verdad. ¿En qué palabra creerán, después de rechazar la palabra de Al-lah y Sus Signos?", "urdu": " یہ سب اللہ کے نشان ہیں جن کو ہم تیرے سامنے پوری سچائی کے ساتھ بیان کرتے ہیں پھر (بتاٶ تو) اللہ اور اس کے نشانوں کے بعد وہ کس چیز پر ایمان لائیں گے۔"}, {"arabic": " وَیۡلٌ لِّکُلِّ اَفَّاکٍ اَثِیۡمٍ ۙ﴿۸﴾", "english": " Woe to every sinful liar,", "french": " Malheur à tout menteur pécheur,", "german": " Wehe jedem sündigen Lügner,", "spanish": " ¡Ay de cada mentiroso pecador!", "urdu": " ہر جھوٹے اور گنہگار کے لئے عذاب مقدر ہے۔"}, {"arabic": " یَّسۡمَعُ اٰیٰتِ اللّٰہِ تُتۡلٰی عَلَیۡہِ ثُمَّ یُصِرُّ مُسۡتَکۡبِرًا کَاَنۡ لَّمۡ یَسۡمَعۡہَا ۚ فَبَشِّرۡہُ بِعَذَابٍ اَلِیۡمٍ ﴿۹﴾", "english": " Who hears the Signs of Allah recited unto him, and then proudly persists in his disbelief , as though he heard them not. So give him the tidings of a painful punishment.", "french": " Qui entend réciter à son intention les Signes d’Allāh, et s’obstine ensuite avec orgueil dans sa mécréance , comme s’il ne les avait pas entendus. Annonce-lui donc la nouvelle d’un châtiment douloureux.", "german": " der Allahs Zeichen hört, wie sie ihm vorgetragen werden, und dann im Hochmut verharrt, als hätte er sie nicht gehört – darum verkünde ihm qualvolle Strafe! –,", "spanish": " Que escucha los Signos de Al-lah que se le recitan y luego persiste orgullosamente en su incredulidad, como si no los oyera. Dadle, pues, la noticia de un doloroso castigo.", "urdu": " جو ان آیات کو جو اس کے سامنے بیان کی جاتی ہیں سنتا ہے۔ پھر تکبر کے ساتھ اپنی ہر بات پر اصرار کرتا رہتا ہے گویا کہ اس نے خدا کے نشان سنے ہی نہیں۔ پس ایسے شخص کو دردناک عذاب کی خبر دے۔"}, {"arabic": " وَ اِذَا عَلِمَ مِنۡ اٰیٰتِنَا شَیۡئَاۨ اتَّخَذَہَا ہُزُوًا ؕ اُولٰٓئِکَ لَہُمۡ عَذَابٌ مُّہِیۡنٌ ؕ﴿۱۰﴾", "english": " And when he learns something of Our Signs, he makes a jest of them. For such there is an abasing punishment.", "french": " Et, lorsqu’il apprend quelque chose de Nos Signes, il le tourne en dérision. Ces gens-là auront un châtiment avilissant.", "german": " und der, wenn er etwas von Unseren Zeichen kennen lernt, Spott damit treibt. Für solche ist schmähliche Strafe.", "spanish": " Mas cuando oye algo de Nuestros Signos, se burla de ellos. Para éstos habrá un castigo afrentoso.", "urdu": " اور جب وہ شخص ہماری آیتوں میں سے کسی کی خبر پاتا ہے تو اس سے تمسخر کرنے لگ جاتا ہے۔ ایسے لوگوں کو رسوا کرنے والا عذاب پہنچے گا۔"}, {"arabic": " مِنۡ وَّرَآئِہِمۡ جَہَنَّمُ ۚ وَ لَا یُغۡنِیۡ عَنۡہُمۡ مَّا کَسَبُوۡا شَیۡئًا وَّ لَا مَا اتَّخَذُوۡا مِنۡ دُوۡنِ اللّٰہِ اَوۡلِیَآءَ ۚ وَ لَہُمۡ عَذَابٌ عَظِیۡمٌ ﴿ؕ۱۱﴾", "english": " Before them is Hell; and that which they have earned shall not avail them aught, nor shall those whom they have taken for protectors beside Allah. And they will have a great punishment.", "french": " Devant eux se trouve l’Enfer ; et ce qu’ils auront acquis ne leur servira à rien, ni ceux qu’ils auront pris comme protecteurs en dehors d’Allāh. Et ils auront un très grand châtiment.", "german": " Vor ihnen ist die Hölle; und das, was sie erworben haben, soll ihnen nichts nützen noch die Beschützer, die sie sich statt Allah angenommen haben. Und ihnen wird gewaltige Strafe.", "spanish": " Ante ellos está el Infierno; y lo que han conseguido no les servirá de nada, como tampoco aquellos que ha tomado por protectores al margen de Al-lah. Y tendrán un serio castigo.", "urdu": " ان کے آگے جہنم ہے‘ اور ان کے اعمال ان کو کچھ بھی نفع نہیں دیں گے اور نہ وہ معبود (نفع دیں گے) جن کو انہوں نے اللہ کے سوا اختیار کر رکھا ہے اور ان کو بہت بڑا عذاب پہنچے گا۔"}, {"arabic": " ہٰذَا ہُدًی ۚ وَ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِ رَبِّہِمۡ لَہُمۡ عَذَابٌ مِّنۡ رِّجۡزٍ اَلِیۡمٌ ﴿٪۱۲﴾", "english": " This is guidance. And for those who disbelieve in the Signs of their Lord is the torture of a painful punishment.", "french": " Ceci est une grande direction. Et pour ceux qui refusent de croire aux Signes de leur Seigneur, il y a le supplice d’un châtiment douloureux.", "german": " Das ist Führung. Und denjenigen, die die Zeichen ihres Herrn leugnen, wird eine qualvolle Strafe für den Götzendienst.", "spanish": " Ésta es la guía. Para aquellos que no creen en los Signos de su Señor está la tortura de un castigo doloroso.", "urdu": " یہ (سچی) ہدایت ہے اور جنہوں نے اپنے رب کی آیتوں کا کفر کیا ہے ان کو بتوں کی پرستش کی وجہ سے دردناک عذاب پہنچے گا۔"}, {"arabic": " اَللّٰہُ الَّذِیۡ سَخَّرَ لَکُمُ الۡبَحۡرَ لِتَجۡرِیَ الۡفُلۡکُ فِیۡہِ بِاَمۡرِہٖ وَ لِتَبۡتَغُوۡا مِنۡ فَضۡلِہٖ وَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿ۚ۱۳﴾", "english": " Allah it is Who has subjected the sea to you that ships may sail thereon by His command, and that you may seek of His bounty, and that you may be grateful.", "french": " C’est Allāh Qui vous a assujetti la mer afin que les navires puissent y voguer par Son commandement, et que vous puissiez rechercher quelque munificence de Sa part, et que vous puissiez être reconnaissants.", "german": " Allah ist es, Der euch das Meer dienstbar gemacht hat, dass die Schiffe darauf hinsegeln nach Seinem Geheiß und dass ihr nach Seiner Gnadenfülle trachtet und dass ihr dankbar seiet.", "spanish": " Al-lah es Quien os ha sometido al mar para que los buques naveguen en él siguiendo Su orden, para que busquéis de Su magnanimidad y seáis agradecidos.", "urdu": " اللہ وہی ہے جس نے سمندر کو تمہاری خدمت پر لگایا ہوا ہے تا کہ اس کے حکم سے اس میں کشتیاں چلیں اور تا کہ تم (ان کے ذریعہ سے) اس کے فضل کو تلاش کرو اور تا کہ تم شکر کرو۔"}, {"arabic": " وَ سَخَّرَ لَکُمۡ مَّا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ جَمِیۡعًا مِّنۡہُ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیٰتٍ لِّقَوۡمٍ یَّتَفَکَّرُوۡنَ ﴿۱۴﴾", "english": " And He has subjected to you whatsoever is in the heavens and whatsoever is in the earth: all this is from Him. In that surely are Signs for a people who reflect.", "french": " Et Il vous a assujetti tout ce qui est dans les cieux et tout ce qui est sur la terre ; et tout ceci vient de Lui. Assurément, il y a en cela des Signes pour un peuple qui réfléchit.", "german": " Und Er hat euch dienstbar gemacht, was in den Himmeln und was auf Erden ist; alles ist von Ihm. Hierin sind wahrlich Zeichen für Leute, die nachdenken.", "spanish": " Él os ha sometido cuanto hay en los cielos y cuanto hay en la tierra; todo esto procede de Él. Aquí hay en verdad Signos para un pueblo que reflexiona.", "urdu": " اور جو کچھ آسمانوں میں ہے اور زمین میں ہے سب کا سب اس نے تمہاری خدمت پر لگایا ہوا ہے اس میں فکر کرنے والی قوم کے لئے بڑے نشان ہیں۔"}, {"arabic": " قُلۡ لِّلَّذِیۡنَ اٰمَنُوۡا یَغۡفِرُوۡا لِلَّذِیۡنَ لَا یَرۡجُوۡنَ اَیَّامَ اللّٰہِ لِیَجۡزِیَ قَوۡمًۢا بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۱۵﴾", "english": " Tell those who believe to forgive those who persecute them and fear not the Days of Allah, that He may requite a people for what they earn.", "french": " Dis aux croyants de pardonner à ceux qui ne s’attendent pas à ce que viennent les jours promis d’Allāh, afin qu’Il puisse rétribuer un peuple pour ce qu’il acquérait.", "german": " Sprich zu denen, die glauben sie möchten denen vergeben, die nicht die Strafe Allahs fürchten, auf dass Er die Leute belohne für das, was sie verdienen.", "spanish": " Di a quienes creen, que ejerciten el perdón hacia aquellos que no esperan que los días prometidos por Al-lah vayan a llegar , para que Él pueda retribuir a los hombres según lo que merecen.", "urdu": " تو مومنوں سے کہہ دے کہ جو لوگ اللہ کی سزا سے نہیں ڈرتے ان کو معاف کر دیں‘ اس کا نتیجہ یہ ہوگا کہ خدا (خود) ایسی قوم کو ان کے اعمال کی جزا دے گا۔"}, {"arabic": " مَنۡ عَمِلَ صَالِحًا فَلِنَفۡسِہٖ ۚ وَ مَنۡ اَسَآءَ فَعَلَیۡہَا ۫ ثُمَّ اِلٰی رَبِّکُمۡ تُرۡجَعُوۡنَ ﴿۱۶﴾", "english": " Whoso does right, does it for his own soul; and whoso does wrong, does so to its detriment. Then to your Lord will you all be brought back.", "french": " Quiconque fait le bien, le fait pour sa propre âme, et quiconque fait le mal, c’est à son détriment. Ensuite à votre Seigneur, vous serez tous ramenés.", "german": " Wer das Rechte tut, der tut es für seine eigene Seele, und wer Unrecht tut, der tut es wider sie. Zuletzt werdet ihr zu eurem Herrn zurückgebracht werden.", "spanish": " Quien actúa rectamente lo hace por su propia alma. Y quien practica el mal lo hace en su propio perjuicio. Luego seréis todos devueltos a vuestro Señor.", "urdu": " جو کوئی ایمان کے مطابق عمل کرتا ہے اس کا فائدہ اسی کی جان کو پہنچتا ہے اور جو کوئی برے کام کرتا ہے اس کا نقصان (بھی) اسی کی جان کو پہنچتا ہے پھر تم اپنے رب کی طرف لوٹا کر لے جائے جاٶ گے۔"}, {"arabic": " وَ لَقَدۡ اٰتَیۡنَا بَنِیۡۤ اِسۡرَآءِیۡلَ الۡکِتٰبَ وَ الۡحُکۡمَ وَ النُّبُوَّۃَ وَ رَزَقۡنٰہُمۡ مِّنَ الطَّیِّبٰتِ وَ فَضَّلۡنٰہُمۡ عَلَی الۡعٰلَمِیۡنَ ﴿ۚ۱۷﴾", "english": " And verily, We gave the children of Israel the Book, and sovereignty, and prophethood; and We provided them with good and pure things, and We exalted them over the peoples of the time .", "french": " Et en vérité, Nous donnâmes aux Enfants d’lsraël le Livre, et le pouvoir, et le prophètat – nubuwwah - ; et Nous les approvisionnâmes de choses bonnes et pures, et Nous les élevâmes au-dessus des peuples de l’époque .", "german": " Wir gaben den Kindern Israels die Schrift und Herrschaft und Prophetentum, und Wir versorgten sie mit guten Dingen und bevorzugten sie vor den Völkern.", "spanish": " En verdad, entregamos a los hijos de Israel el Libro, la soberanía y la profecía; les proporcionamos cosas buenas y puras, y los exaltamos por encima de los pueblos de su época.", "urdu": " اور ہم نے بنی اسرائیل کو کتاب اور حکومت اور نبوت بخشی تھی اور پاکیزہ چیزوں میں سے رزق عطا فرمایا تھا اور اپنے زمانہ کے لوگوں پر ان کو فضیلت بخشی تھی۔"}, {"arabic": " وَ اٰتَیۡنٰہُمۡ بَیِّنٰتٍ مِّنَ الۡاَمۡرِ ۚ فَمَا اخۡتَلَفُوۡۤا اِلَّا مِنۡۢ بَعۡدِ مَا جَآءَہُمُ الۡعِلۡمُ ۙ بَغۡیًۢا بَیۡنَہُمۡ ؕ اِنَّ رَبَّکَ یَقۡضِیۡ بَیۡنَہُمۡ یَوۡمَ الۡقِیٰمَۃِ فِیۡمَا کَانُوۡا فِیۡہِ یَخۡتَلِفُوۡنَ ﴿۱۸﴾", "english": " And We gave them clear Signs regarding this affair. And they did not differ but after true knowledge had come to them, through mutual envy. Verily, thy Lord will judge between them on the Day of Resurrection concerning that wherein they differed.", "french": " Et Nous leur donnâmes des instructions explicites au sujet de la Loi. Et ils n’ont été en désaccord qu’après que la vraie connaissance leur fut parvenue, par suite d'agressivité entre eux. En vérité, au Jour de la Résurrection, ton Seigneur jugera entre eux concernant ce sur quoi ils étaient en désaccord.", "german": " Und Wir gaben ihnen deutliche Weisungen in der Sache. Und sie wurden nicht eher uneins, als bis das Wissen zu ihnen gekommen war – durch selbstsüchtigen Neid untereinander. Dein Herr wird zwischen ihnen richten am Tage der Auferstehung über das, worin sie uneins waren.", "spanish": " Y les dimos instrucciones claras en relación con la Ley. Sólo iscutieron, por rivalidad mutua, después de que les llegara el verdadero conocimiento. Ciertamente, tu Señor juzgará entre ellos en el Día de la Resurrección sobre aquello en lo que divergían.", "urdu": " اور ہم نے ان کو کھلی کھلی شریعت عطا کی تھی اور بنی اسرائیل نے اسی وقت اس کے بارہ میں اختلاف کیا جب ان کے پاس کامل علم (قرآن) آگیا (یہ اختلاف) ان کی باہمی سرکشی کی وجہ سے تھا‘ تیرا رب ان کے درمیان قیامت کے دن ان کی اختلافی باتوں کے متعلق فیصلہ کرے گا۔"}, {"arabic": " ثُمَّ جَعَلۡنٰکَ عَلٰی شَرِیۡعَۃٍ مِّنَ الۡاَمۡرِ فَاتَّبِعۡہَا وَ لَا تَتَّبِعۡ اَہۡوَآءَ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ ﴿۱۹﴾", "english": " Then We set thee on a clear path in the matter of religion ; so follow it, and follow not the evil inclinations of those who know not.", "french": " Ensuite Nous t’avons établi sur un chemin clair de la Loi ; suis-le donc, et ne suis pas les vains désirs de ceux qui ne savent pas.", "german": " Dann brachten Wir dich auf einen klaren Pfad in der Sache des Glaubens: so befolge ihn, und folge nicht den Launen derer, die nichts wissen.", "spanish": " Luego te situamos en el camino claro de la Ley; síguelo, pues, y no sigas las inclinaciones perversas de quienes no saben.", "urdu": " اور ہم نے تجھ کو شریعت کے ایک طریقے پر مقرر کیا ہے پس تو اس کے پیچھے چل اور ان لوگوں کی خواہشوں کے پیچھے مت چل جو علم نہیں رکھتے۔"}, {"arabic": " اِنَّہُمۡ لَنۡ یُّغۡنُوۡا عَنۡکَ مِنَ اللّٰہِ شَیۡئًا ؕ وَ اِنَّ الظّٰلِمِیۡنَ بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ۚ وَ اللّٰہُ وَلِیُّ الۡمُتَّقِیۡنَ ﴿۲۰﴾", "english": " Verily, they will not avail thee aught against Allah. And as for the wrongdoers, some of them are friends of others; but Allah is the Friend of the righteous.", "french": " En vérité, ils ne te serviront à rien contre Allāh. Et certainement les injustes sont amis les uns des autres ; mais Allāh est l’Ami des pieux.", "german": " Sie werden dir nichts nützen wider Allah. Und was die Frevler anbelangt, so sind einige von ihnen Freunde anderer: Allah aber ist der Freund der Rechtschaffenen.", "spanish": " En verdad no te servirán de nada contra Al-lah. Y en cuanto a los inicuos, algunos de ellos son amigos de otros. Pero Al-lah es el Amigo de los justos.", "urdu": " وہ اللہ کے مقابلہ میں تجھے کچھ فائدہ نہیں پہنچا سکتے۔ اور ظالم آپس میں ایک دوسرے کو پناہ دینے والے ہیں اور اللہ متقیوں کو پناہ دینے والا ہے۔"}, {"arabic": " ہٰذَا بَصَآئِرُ لِلنَّاسِ وَ ہُدًی وَّ رَحۡمَۃٌ لِّقَوۡمٍ یُّوۡقِنُوۡنَ ﴿۲۱﴾", "english": " This Book contains clear evidences for mankind and is a guidance and a mercy for a people who possess firm faith.", "french": " Ce Livre renferme des preuves claires et raisonnables pour l’humanité, et il est une direction et une miséricorde pour un peuple qui possède une foi ferme.", "german": " Diese (Lehren) sind die Mittel zur Erleuchtung für die Menschheit und eine Führung und Barmherzigkeit für Leute, die festen Glauben haben.", "spanish": " Este Libro contiene evidencias claras para la humanidad y es guía y misericordia para la gente que posee fe firme.", "urdu": " یہ (تعلیمات) لوگوں کے لئے عقلی دلیلیں ہیں اور یقین رکھنے والی قوم کے لئے ہدایت اور رحمت کا موجب ہیں۔"}, {"arabic": " اَمۡ حَسِبَ الَّذِیۡنَ اجۡتَرَحُوا السَّیِّاٰتِ اَنۡ نَّجۡعَلَہُمۡ کَالَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ ۙ سَوَآءً مَّحۡیَاہُمۡ وَ مَمَاتُہُمۡ ؕ سَآءَ مَا یَحۡکُمُوۡنَ ﴿٪۲۲﴾", "english": " Do those who commit evil deeds think that We shall make them like those who believe and do good works, so that their life and their death shall be equal? Evil indeed is what they judge.", "french": " Ceux qui commettent des iniquités s’imaginent-ils que Nous les traiterons de la même façon que ceux qui croient et font de bonnes œuvres, de sorte que leur vie et leur mort soient égales ? Leur jugement est vraiment mauvais !", "german": " Wähnen die, die Böses verüben, etwa, dass Wir sie denen gleich behandeln werden, die glauben und gute Werke tun, so dass ihr Leben und ihr Tod gleich sein wird? Schlimm ist, wie sie urteilen!", "spanish": " ¿Creen acaso quienes cometen malas acciones que les haremos iguales a aquellos que creen y hacen buenas obras, de modo que su vida y su muerte sean iguales? Qué malo es en verdad lo que juzgan.", "urdu": " کیا جن لوگوں نے بدیاں کی ہیں وہ خیال کرتے ہیں کہ ہم ان کو مومنوں اور ایمان کے مطابق عمل کرنے والوں کا سا درجہ دیں گے یہاں تک کہ ان دونوں کی زندگی اور موت برابر ہو جائے گی۔ وہ بہت برا فیصلہ کرتے ہیں۔"}, {"arabic": " وَ خَلَقَ اللّٰہُ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ وَ لِتُجۡزٰی کُلُّ نَفۡسٍۭ بِمَا کَسَبَتۡ وَ ہُمۡ لَا یُظۡلَمُوۡنَ ﴿۲۳﴾", "english": " And Allah has created the heavens and the earth with truth and that every soul may be requited for that which it earns; and they shall not be wronged.", "french": " Et Allāh a créé les cieux et la terre avec vérité, et pour que chaque âme soit rétribuée pour ce qu’elle acquiert ; et ils ne seront pas injustement traités.", "german": " Allah hat die Himmel und die Erde in Weisheit geschaffen und daher wird jeder belohnt werden für das, was er verdient; und kein Unrecht sollen sie leiden.", "spanish": " Al-lah ha creado los cielos y la tierra con verdad y para que se recompense a cada alma por lo que ha merecido; y no serán perjudicados.", "urdu": " اور اللہ نے آسمانوں اور زمین کو ایک ابدی قانون کے مطابق پیدا کیا ہے اور اس کا نتیجہ یہ نکلے گا کہ ہر شخص کو اس کے عمل کے مطابق جزا ملے گی۔ اور ان میں سے کسی پر بھی ظلم نہیں کیا جائے گا۔"}, {"arabic": " اَفَرَءَیۡتَ مَنِ اتَّخَذَ اِلٰـہَہٗ ہَوٰٮہُ وَ اَضَلَّہُ اللّٰہُ عَلٰی عِلۡمٍ وَّ خَتَمَ عَلٰی سَمۡعِہٖ وَ قَلۡبِہٖ وَ جَعَلَ عَلٰی بَصَرِہٖ غِشٰوَۃً ؕ فَمَنۡ یَّہۡدِیۡہِ مِنۡۢ بَعۡدِ اللّٰہِ ؕ اَفَلَا تَذَکَّرُوۡنَ ﴿۲۴﴾", "english": " Hast thou seen him who conceives of his god according to his own fancy, and whom Allah has adjudged astray on basis of His knowledge, and whose ears and whose heart He has sealed up, and on whose eyes He has put a covering? Who, then, will guide him after Allah has condemned him ? Will you not then heed?", "french": " As-tu vu celui qui a tourné ses propres désirs en son dieu, et qu’Allāh a déclaré égaré malgré le fait qu'il a pleine connaissance de la vérité , et dont Il a scellé les oreilles et le cœur, et sur les yeux de qui Il a mis un voile ? Qui donc le guidera après qu’ Allāh l’ait condamné ? Ne voulez-vous donc pas prendre note ?", "german": " Hast du den gesehen, der sich sein eigen Gelüst zum Gott nimmt und den Allah zum Irrenden erklärt aufgrund (Seines) Wissens und dem Er Ohren und Herz versiegelt und auf dessen Augen Er eine Decke gelegt hat? Wer sollte ihn wohl richtig führen außer Allah? Wollt ihr euch da nicht ermahnen lassen?", "spanish": " ¿Has visto a quien convierte a su deseo en su señor, a quien Al-lah ha juzgado intencionadamente como extraviado, cuyos oídos y cuyo corazón Él ha sellado, y sobre cuyos ojos ha puesto una venda? ¿Quién, pues, lo guiará después de que Al-lah lo ha condenado? ¿No caeréis en la cuenta?", "urdu": " کیا تو نے اس شخص کی حالت پر بھی غور کیا ہے جس نے اپنی خواہش نفسانی کو اپنا معبود بنا لیا ہے اور اللہ نے اس کو (اپنے) علم کامل کی بنا پر گمراہ قرار دیا ہے‘ اور اس کے کانوں اور اس کے دل پر مہر لگا دی ہے اور اس کی آنکھوں پر پردہ ڈال دیا ہے۔ سو اب اللہ کے (اس فعل کے) بعد اس کو کون ہدایت دے سکے گا؟ کیا تم نصیحت نہیں حاصل کرتے؟"}, {"arabic": " وَ قَالُوۡا مَا ہِیَ اِلَّا حَیَاتُنَا الدُّنۡیَا نَمُوۡتُ وَ نَحۡیَا وَ مَا یُہۡلِکُنَاۤ اِلَّا الدَّہۡرُ ۚ وَ مَا لَہُمۡ بِذٰلِکَ مِنۡ عِلۡمٍ ۚ اِنۡ ہُمۡ اِلَّا یَظُنُّوۡنَ ﴿۲۵﴾", "english": " And they say, ‘There is nothing but this our present life; we die and we live here ; and nothing but Time destroys us.’ But they have no knowledge of that; they do but conjecture.", "french": " Et ils disent : « A part notre vie d’ici-bas, il n’y a rien ; nous mourons et nous vivons ici ; et il n’y a que le Temps qui nous détruit. » Mais ils n’ont aucune connaissance de cela ; ils ne font que conjecturer.", "german": " Und sie sprechen: \"Es gibt nichts als dies unser Leben hienieden; wir sterben und wir leben, und nichts als die Zeit vernichtet uns.\" Jedoch sie haben kein Wissen davon; sie vermuten bloß.", "spanish": " Mas dicen; “No hay más que esta nuestra vida presente; vivimos y morimos aquí ; y nada nos destruye sino el Tiempo”. Pero no tienen conocimiento de ello; no hacen más que conjeturas.", "urdu": " اور وہ کہتے ہیں کہ یہی ورلی زندگی ہمارے لئے مقدر ہے اسی زندگی کو گذارتے ہوئے ہم مریں گے اور اسی کا لطف اٹھاتے ہوئے ہم زندہ رہیں گے اور زمانہ ہی ہمیں (اپنے اثر سے) ہلاک کرتا ہے لیکن ان کو اس بات کا کوئی حقیقی علم نہیں وہ صرف ڈھکونسلے مار رہے ہیں۔"}, {"arabic": " وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیٰتُنَا بَیِّنٰتٍ مَّا کَانَ حُجَّتَہُمۡ اِلَّاۤ اَنۡ قَالُوا ائۡتُوۡا بِاٰبَآئِنَاۤ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۲۶﴾", "english": " And when Our clear Signs are recited unto them, their only contention is that they say, ‘Bring back our fathers, if you are truthful.’", "french": " Et lorsque Nos Signes clairs leur sont récités, leur seul argument est qu’ils disent : « Ramenez nos pères si vous êtes véridiques. »", "german": " Und wenn ihnen Unsere deutlichen Zeichen vorgetragen werden, so ist ihr Einwand nur der, dass sie sagen: \"Bringt unser Väter (zurück), wenn ihr wahrhaftig seid.\"", "spanish": " Y cuando se les recitan Nuestros Signos claros, su único argumento consiste en decir: “Devolvednos a nuestros padres, si sois veraces”.", "urdu": " اور جب انہیں ہماری کھلی کھلی آیات سنائی جاتی ہیں تو ان کا اس کے سوا کوئی جواب نہیں ہوتا کہ وہ کہہ دیتے ہیں کہ اگر تم سچے ہو تو ہمارے باپ دادوں کو بھی (زندہ کرکے) لے آٶ۔"}, {"arabic": " قُلِ اللّٰہُ یُحۡیِیۡکُمۡ ثُمَّ یُمِیۡتُکُمۡ ثُمَّ یَجۡمَعُکُمۡ اِلٰی یَوۡمِ الۡقِیٰمَۃِ لَا رَیۡبَ فِیۡہِ وَ لٰکِنَّ اَکۡثَرَ النَّاسِ لَا یَعۡلَمُوۡنَ ﴿٪۲۷﴾", "english": " Say, ‘ It is Allah Who gives you life, then causes you to die; then He will gather you together unto the Day of Resurrection about which there is no doubt. But most men know not.’", "french": " Dis : « C’est Allāh Qui vous donne la vie, puis vous fait mourir ; puis Il vous rassemblera le Jour de la Résurrection, sur lequel il n’y a aucun doute. Mais la plupart des hommes ne savent pas. »", "german": " Sprich: \"Allah gibt euch Leben und lässt euch drauf sterben; dann wird Er euch versammeln zum Tage der Auferstehung; daran ist kein Zweifel. Allein die meisten Menschen wissen es nicht.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=45:27&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=45:27&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic28\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic28\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/45:28' style='text-decoration:underline'>45:28</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(28)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control28\"></i></button> <audio id=\"player28\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لِلّٰہِ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ یَوۡمَ تَقُوۡمُ السَّاعَۃُ یَوۡمَئِذٍ یَّخۡسَرُ الۡمُبۡطِلُوۡنَ ﴿۲۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">To Allah belongs the kingdom of the heavens and the earth; and on the day when the Hour shall come, on that day those who follow falsehood will be the losers.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> To Allah belongs the Kingdom of the heavens and the earth; and on the day when the Hour shall come, on that day those who follow falsehood shall be the losers. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اللہ ہی کی ہے آسمانوں اور زمین کی بادشاہت۔ اور جس دن قیامت ہوگی اس دن جھوٹ بولنے والے نقصان اٹھائیں گے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور آسمانوں اور زمین کی بادشاہت خدا ہی کی ہے اور جس وقت موعودہ گھڑی آئے گی اس دن جھوٹ بولنے والے بڑے خسارہ میں ہوں گے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">A Allāh appartient le royaume des cieux et de la terre ; et le jour où l’Heure viendra, ce jour-là ceux qui rejettent la vérité seront les perdants.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">A Al-lah pertenece el reino de los cielos y la tierra; y en el día en que llegue la Hora, en ese día sufrirán quienes rechazaron la verdad.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Allahs ist die Herrschaft über die Himmel und die Erde; und an dem Tage, wenn die \"Stunde\" kommen soll, an jenem Tage werden die Lügner zugrunde gehen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=45:28&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=45:28&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic29\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic29\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/45:29' style='text-decoration:underline'>45:29</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(29)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control29\"></i></button> <audio id=\"player29\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ تَرٰی کُلَّ اُمَّۃٍ جَاثِیَۃً ۟ کُلُّ اُمَّۃٍ تُدۡعٰۤی اِلٰی کِتٰبِہَا ؕ اَلۡیَوۡمَ تُجۡزَوۡنَ مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۲۹﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And thou wilt see every people on <em>their </em>knees. Every people will be summoned to their record, <I>and it shall be said to them</I>, ‘This day shall you be requited for that which you did.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And thou wilt see every people on <i>their </i>knees. Every people will be <sup class='ref'>[<a class='ref' data-id='ref_45_29_b' href='#'>b</a>]</sup>summoned to its Book,<sup class='ref'>[<a class='ref' data-id='ref_45_29_2714A' href='#'>2714A</a>]</sup> <i>and it shall be said to them</i>, ‘This day shall you be requited for that which you did.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_45_29_b'>b</span><span class='collapsible plus' data-id='ref_45_29_2714A'>2714A</span></div> <div><div class='reference' data-id='ref_45_29_b' style='display:none'> <p><b>b.</b> <a href='/quran/17:14' target=_blank>17:14</a>. (<a href='javascript:void(0)' data-id='ref_45_29_b' class='ref'>close</a>)</p> </div> </div><div><a name='2714A'></a><div class='reference' data-id='ref_45_29_2714A' style='display:none'> <p><b>2714A.</b> The words, 'every people will be summoned to its Book,' suggest that the \"Hour\" referred to in the previous verse signifies the hour of the reckoning of a people in this very life, because in this life also nations are judged by their deeds and are punished or rewarded accordingly. (<a href='javascript:void(0)' data-id='ref_45_29_2714A' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور تُو ہر امّت کو گھٹنوں کے بَل گرا ہوا دیکھے گا۔ ہر اُمّت اپنی کتاب کی طرف بلائی جائے گی ۔ آج کے دن تم اس کی جزا دیئے جاؤگے جو تم کیا کرتے تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور تو ہر ایک امت کو دیکھے گا کہ وہ زمین پر گھٹنوں کے بل گری ہوئی ہوگی۔ ہر ایک قوم کو اپنی شریعت کی طرف بلایا جائے گا۔ اس دن تم کو تمہارے اعمال کے مطابق جزا دی جائے گی۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et tu verras chaque peuple agenouillé. Chaque peuple sera appelé à son registre, <em>et il leur sera dit</em> : « Aujourd’hui vous serez rétribués pour ce que vous avez fait.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Verás a todos los hombres postrados sobre sus rodillas. Cada pueblo será amonestado según lo que hicieron <em>y se les dirá:</em> “En este día seréis correspondidos por lo que hicisteis”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und du wirst jedes Volk knien sehen. Jedes Volk wird zu seinem Buche gerufen werden: \"Heute sollt ihr belohnt werden für das, was ihr getan.", "spanish": " Diles: “Es Al-lah Quien os da la vida y luego os reunirá juntos en el Día de la Resurrección, sobre el que no hay duda alguna. Aunque la mayoría de los hombres no lo saben”.", "urdu": " تو کہہ دے کہ اللہ ہی تم کوزندہ کرتا ہے۔ پھر وہی تم کو مارے گا۔ پھر وہی تم کو قیامت کے دن تک جمع کرتا جائے گا (اور) اس میں کوئی شبہ نہیں لیکن اکثر لوگ اس کا علم نہیں رکھتے۔"}, {"arabic": " ہٰذَا کِتٰبُنَا یَنۡطِقُ عَلَیۡکُمۡ بِالۡحَقِّ ؕ اِنَّا کُنَّا نَسۡتَنۡسِخُ مَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۳۰﴾", "english": " ‘This is Our Book; it speaks against you with truth. We caused all that you did to be fully recorded.’", "french": " Ceci est Notre Livre ; il témoigne contre vous avec vérité. Certainement Nous avons fait consigner par écrit tout ce que vous avez fait. »", "german": "", "spanish": " “Este es Nuestro Libro; habla contra vosotros con verdad. Hemos hecho que todo lo que hicisteis quede plenamente registrado”.", "urdu": " (اور ہم کہیں گے دیکھو) یہ ہماری کتاب ہے جو تمہارے خلاف سچی سچی شہادت دے رہی ہے۔ جو کچھ تم عمل کرتے تھے ہم اس کو لکھتے جاتے تھے۔"}, {"arabic": " فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فَیُدۡخِلُہُمۡ رَبُّہُمۡ فِیۡ رَحۡمَتِہٖ ؕ ذٰلِکَ ہُوَ الۡفَوۡزُ الۡمُبِیۡنُ ﴿۳۱﴾", "english": " Now as for those who believed and did good works, their Lord will admit them into His mercy. That is the clear achievement.", "french": " Alors, quant à ceux qui ont cru et qui ont fait de bonnes œuvres, leur Seigneur les admettra dans Sa miséricorde. C’est là le triomphe manifeste.", "german": " Was nun die betrifft, die glaubten und gute Werke vollbrachten, so wird ihr Herr sie führen in Seine Barmherzigkeit. Das ist die offenbare Glückseligkeit.", "spanish": " Ahora bien, a quienes creyeron e hicieron buenas obras, su Señor los admitirá a Su misericordia. Ése es el éxito manifiesto.", "urdu": " پس جو لوگ مومن تھے اور جنہوں نے نیک عمل کیے تھے انہیں ان کا رب اپنی رحمت کے (سایہ کے) نیچے رکھے گا اور یہی کھلی کھلی کامیابی ہے۔"}, {"arabic": " وَ اَمَّا الَّذِیۡنَ کَفَرُوۡا ۟ اَفَلَمۡ تَکُنۡ اٰیٰتِیۡ تُتۡلٰی عَلَیۡکُمۡ فَاسۡتَکۡبَرۡتُمۡ وَ کُنۡتُمۡ قَوۡمًا مُّجۡرِمِیۡنَ ﴿۳۲﴾", "english": " But as to those who disbelieved: “Were not My Signs recited unto you? But you were arrogant, and were a guilty people.", "french": " Mais quant à ceux qui n’ont pas cru, il leur sera dit : « Mes Signes ne vous furent-ils pas récités ? Mais vous étiez arrogants, et vous étiez un peuple coupable. »", "german": " Doch zu jenen, die ungläubig waren: «Sind euch Meine Zeichen nicht vorgetragen worden? Ihr aber wart hoffärtig, und ihr wurdet ein sündiges Volk.", "spanish": " En cuanto a los que no creen: “¿No se os recitaron Mis Signos? Pero erais arrogantes y fuisteis un pueblo culpable”.", "urdu": " اور وہ لوگ جو کافر ہو گئے تھے (ان سے کہا جائے گا کہ) کیا میری آیتیں تم کو پڑھ کر نہ سنائی جاتی تھیں‘ مگر (باوجود اس کے) تم تکبر کرتے تھے۔ اور تم مجرم قوم میں شامل ہو گئے تھے۔"}, {"arabic": " وَ اِذَا قِیۡلَ اِنَّ وَعۡدَ اللّٰہِ حَقٌّ وَّ السَّاعَۃُ لَا رَیۡبَ فِیۡہَا قُلۡتُمۡ مَّا نَدۡرِیۡ مَا السَّاعَۃُ ۙ اِنۡ نَّظُنُّ اِلَّا ظَنًّا وَّ مَا نَحۡنُ بِمُسۡتَیۡقِنِیۡنَ ﴿۳۳﴾", "english": " “And when it was said, ‘The promise of Allah is certainly true, and as to the Hour, there is no doubt about its coming ,’ you said, ‘We know not what the Hour is; we think it to be nothing but a conjecture, and we are not convinced.’ ”", "french": " Et lorsqu’il vous a été dit : « La promesse d’Allāh est certainement vraie, et quant à l’Heure, il n’y a pas de doute concernant sa venue , » vous avez dit : « Nous ne savons pas ce qu’est l’Heure ; nous pensons que ce n’est qu’une conjecture, et nous n’ en sommes pas convaincus ! »", "german": " Und als gesprochen wurde: \"Die Verheißung Allahs ist wahr, und über die \"Stunde\" ist kein Zweifel\", da spracht ihr: \"Wir wissen nicht, was die \"Stunde\" ist; wir halten (sie) für einen Wahn, und wir sind nicht überzeugt.\"»", "spanish": " “Y cuando se dijo: “La promesa de Al-lah es ciertamente verdadera, y en cuanto a la Hora, no hay duda alguna sobre su llegada” , respondisteis: “No sabemos qué es la Hora; pensamos que no es más que una conjetura, y no estamos convencidos”.", "urdu": " اور جب ان سے یہ کہا جاتا ہے کہ اللہ کا وعدہ تو سچا ہے اور (دنیا کی) آخری تباہی ضرور آنے والی ہے۔ اس میں کوئی شک نہیں تو اس پر وہ کہہ دیتے ہیں کہ ہم نہیں جانتے قیامت کیا چیز ہے؟ ہمیں تو اس کے متعلق صرف گمان سا ہے اور ہمیں اس پر یقین کوئی نہیں۔"}, {"arabic": " وَ بَدَا لَہُمۡ سَیِّاٰتُ مَا عَمِلُوۡا وَ حَاقَ بِہِمۡ مَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿۳۴﴾", "english": " And the evil consequences of their deeds will become apparent to them, and that which they used to mock at shall encompass them.", "french": " Et les mauvaises conséquences de leurs actions leur apparaîtront, et ce dont-ils se moquaient les enveloppera.", "german": " Und die bösen Folgen ihres Tuns werden ihnen offenbar werden, und das, worüber sie zu spotten pflegten, soll sie umfangen.", "spanish": " Entonces se les harán evidentes las perversas consecuencias de sus acciones y se verán rodeados de aquello de lo que acostumbraban a burlarse.", "urdu": " اور اس وقت ان پر ان کے اعمال کی خرابیاں ظاہر ہو جائیں گے اور جن باتوں پر وہ ہنسا کرتے تھے (یعنی ان کا انکار کیا کرتے تھے) وہ ان کا احاطہ کر لیں گی (اور سچ مچ ان کی آنکھوں کے آگے آجائیں گی) ۔"}, {"arabic": " وَ قِیۡلَ الۡیَوۡمَ نَنۡسٰکُمۡ کَمَا نَسِیۡتُمۡ لِقَآءَ یَوۡمِکُمۡ ہٰذَا وَ مَاۡوٰٮکُمُ النَّارُ وَ مَا لَکُمۡ مِّنۡ نّٰصِرِیۡنَ ﴿۳۵﴾", "english": " And it will be said to them , ‘This day shall We forget you, as you forgot the meeting of this day of yours. And your resort is the Fire, and you will have no helpers.", "french": " Et il leur sera dit : « Aujourd’hui Nous vous oublierons tout comme vous aviez oublié la rencontre de votre Jour que voici. Et votre demeure est le Feu, et vous n’aurez pas d’aides.", "german": " Und es wird gesprochen werden: \"Heute haben Wir euch vergessen, wie ihr das Eintreffen dieses eures Tags vergaßet. Euer Aufenthalt ist das Feuer, und von Helfern habt ihr keinen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=45:35&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=45:35&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic36\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic36\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/45:36' style='text-decoration:underline'>45:36</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(36)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control36\"></i></button> <audio id=\"player36\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ذٰلِکُمۡ بِاَنَّکُمُ اتَّخَذۡتُمۡ اٰیٰتِ اللّٰہِ ہُزُوًا وَّ غَرَّتۡکُمُ الۡحَیٰوۃُ الدُّنۡیَا ۚ فَالۡیَوۡمَ لَا یُخۡرَجُوۡنَ مِنۡہَا وَ لَا ہُمۡ یُسۡتَعۡتَبُوۡنَ ﴿۳۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘This <em>is so</em>, because you made a jest of the Signs of Allah, and the life of the world deceived you.’ Therefore, that day they will not be taken out from thence, nor will they be taken back into favour.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘This is <i>so</i>, because <sup class='ref'>[<a class='ref' data-id='ref_45_36_b' href='#'>b</a>]</sup>you made a jest of the Signs of Allah, and the life of the world deceived you.’ Therefore that day they will not be taken out of it, nor will they be taken back into favour. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_45_36_b'>b</span></div> <div><div class='reference' data-id='ref_45_36_b' style='display:none'> <p><b>b.</b> <a href='/quran/5:58' target=_blank>5:58</a>, <a href='/quran/5:59' target=_blank>59</a>. (<a href='javascript:void(0)' data-id='ref_45_36_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یہ اس لئے ہو گا کہ تم نے اللہ کے نشانات کو تمسخر بنالیا اور دنیا کی زندگی نے تمہیں دھوکہ میں ڈال دیا تھا۔ پس آج وہ اُس (آگ) سے نکالے نہیں جائیں گے اور نہ ہی ان کا کوئی عذر قبول کیا جائے گا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یہ اس لئے ہوگا کہ تم نے اللہ کے نشانوں کو ہنسی کا موجب بنا لیا تھا اور دنیا کی زندگی نے تم کو دھوکا دے دیا تھا۔ پس آج نہ تو وہ اس عذاب سے نکالے جائیں گے اور نہ ان کی طرف سے خدا کو راضی کرنے کی کوشش قبول کی جائے گی۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ceci parce que vous avez tourné en dérision les Signes d’Allāh, et que la vie du monde vous a trompés. » C’est pourquoi, ce jour-là ils ne seront pas retirés de là, et il ne leur en sera <em>même</em> pas accordé l’accès au seuil.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“<em>Así es</em> porque hicisteis objeto de escarnio los Signos de Al-lah, y la vida del mundo os engañó”. Por tanto, en ese día no se les sacará de ese lugar ni les será permitido acceder al umbral.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dies, weil ihr Allahs Zeichen zum Gespött machtet und das Leben in dieser Welt euch betrog.\" Drum sollen sie an jenem Tage nicht von dort herausgebracht werden, noch wird ihnen erlaubt sein, wiedergutzumachen.", "spanish": " Y se les dirá: “Hoy nos olvidaremos de vosotros, al igual que olvidasteis la reunión de este día vuestro. Vuestra morada es el Fuego, y no tendréis quien os ayude”.", "urdu": " اور ان سے کہا جائے گا کہ آج ہم نے تم کو اسی طرح بے مدد چھوڑ دیا ہے جس طرح کہ تم نے اس دن کی ملاقات کے خیال کو چھوڑ دیا تھا اور تمہارا ٹھکانا آگ ہوگا اور کوئی تمہاری مدد کرنے والا نہیں ہوگا۔"}, {"arabic": " فَلِلّٰہِ الۡحَمۡدُ رَبِّ السَّمٰوٰتِ وَ رَبِّ الۡاَرۡضِ رَبِّ الۡعٰلَمِیۡنَ ﴿۳۷﴾", "english": " All praise, then, belongs to Allah, Lord of the heavens, and Lord of the earth, the Lord of all the worlds.", "french": " Toute louange appartient donc à Allāh, le Seigneur des cieux, le Seigneur de la terre, le Seigneur de tous les mondes.", "german": " Aller Preis denn sei Allah, dem Herrn der Himmel und dem Herrn der Erde, dem Herrn der Welten!", "spanish": " Toda alabanza pertenece, pues, a Al-lah, Señor de los cielos y Señor de la tierra, y Señor de todos los mundos.", "urdu": " پس اللہ جو آسمانوں اور زمین کارب ہے اور تمام جہانوں کا رب ہے سب تعریف اسی کی ہے۔"}, {"arabic": " وَ لَہُ الۡکِبۡرِیَآءُ فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ۪ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿٪۳۸﴾", "english": " And His is the majesty in the heavens and the earth; and He is the Mighty, the Wise.", "french": " Et à Lui la majesté dans les cieux et sur la terre ; et Il est le Puissant, le Sage.", "german": " Sein ist die Herrlichkeit in den Himmeln und auf Erden; und Er ist der Allmächtige, der Allweise.", "spanish": " Suya es la majestad en los cielos y en la tierra; pues Él es el Poderoso, el Sabio.", "urdu": " اور آسمانوں اور زمین میں سب بڑائی بھی اسی کی ہے۔ اور وہ غالب (اور) حکمت والا ہے۔"}], "Surah": 45}