{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں۔)"}, {"arabic": " الٓـمّٓصٓ ۚ﴿۲﴾", "english": " Alif Lam Mim Sad.", "french": " Alif Lām Mīm Ṣād (Je suis Allāh, le Plus-Savant, le Véridique).", "german": " Alif Lâm Mîm Sâd.", "spanish": " Alif Lam Mim Sad.", "urdu": " میں اللہ سب سے زیادہ جاننے والا اور صادق ہوں۔"}, {"arabic": " کِتٰبٌ اُنۡزِلَ اِلَیۡکَ فَلَا یَکُنۡ فِیۡ صَدۡرِکَ حَرَجٌ مِّنۡہُ لِتُنۡذِرَ بِہٖ وَ ذِکۡرٰی لِلۡمُؤۡمِنِیۡنَ ﴿۳﴾", "english": " This is a Book revealed unto thee — so let there be no straitness in thy bosom concerning it — that thou mayest warn thereby, and that it be an exhortation to the believers.", "french": " C’est un Livre qui t’a été révélé – n’aie donc au cœur aucune gêne à son sujet – afin que, par ce moyen, tu avertisses et que ce soit une exhortation aux croyants.", "german": " Ein Buch, zu dir hinabgesandt – so lass deswegen keine Bangigkeit sein in deiner Brust –, auf dass du damit warnest: eine Ermahnung für die Gläubigen.", "spanish": " Éste es un Libro revelado a ti – que no haya strechez en tu pecho respecto a él – para que puedas advertir con él y sea una exhortación para los creyentes.", "urdu": " (یہ قرآن) ایک عظیم الشان کتاب (ہے جو) تیری طرف اتاری گئی ہے (تو نے خود نہیں بنائی) پس تیرے سینہ میں اس کی وجہ سے کوئی تنگی پیدا نہ ہو(اس کے اتارنے کی غرض یہ ہے کہ) تواس کے ذریعہ سے (مخاطبین کو آنے والے عذاب سے) ہوشیارکرے اور یہ (کتاب) مومنوں کیلئے ایک یاد دہانی ہے۔"}, {"arabic": " اِتَّبِعُوۡا مَاۤ اُنۡزِلَ اِلَیۡکُمۡ مِّنۡ رَّبِّکُمۡ وَ لَا تَتَّبِعُوۡا مِنۡ دُوۡنِہٖۤ اَوۡلِیَآءَ ؕ قَلِیۡلًا مَّا تَذَکَّرُوۡنَ ﴿۴﴾", "english": " Follow that which has been sent down to you from your Lord, and follow no protectors other than Him. How little do you remember!", "french": " Suivez ce que votre Seigneur a fait descendre sur vous et ne suivez pas d’autres protecteurs que Lui. Mais il est rare que vous suiviez un avertissement.", "german": " Folget dem, was zu euch herabgesandt ward von eurem Herrn, und folget keinen anderen Beschützern außer Ihm. Wie wenig seid ihr (dessen) eingedenk!", "spanish": " Seguid lo que os ha sido revelado por vuestro Señor, y no sigáis a otros protectores que no sean Él. ¡Qué poco recordáis!", "urdu": " (ہم ان لوگوں سے کہتے ہیں کہ) جو (کلام) تمہاری طرف تمہارے رب کی طرف سے نازل کیا گیا ہے اس کی اتباع کرو۔ اور اس (خدا) کے سوا جو (تمہارے خیال میں) دوسرے کارساز ہیں ان کی اتباع نہ کرو۔ لیکن تم بالکل نصیحت حاصل نہیں کرتے۔"}, {"arabic": " وَ کَمۡ مِّنۡ قَرۡیَۃٍ اَہۡلَکۡنٰہَا فَجَآءَہَا بَاۡسُنَا بَیَاتًا اَوۡ ہُمۡ قَآئِلُوۡنَ ﴿۵﴾", "english": " How many a town have We destroyed! And Our punishment came upon it by night or while they slept at noon.", "french": " Que de villes Nous avons détruites ! et Notre châtiment est descendu sur elles pendant la nuit ou pendant qu’ils faisaient la sieste.", "german": " Wie so manche Stadt haben Wir zerstört! Unsere Strafe kam über sie des Nachts oder während sie schliefen am Mittag;", "spanish": " ¡Cuántas ciudades hemos destruido! Nuestro castigo les llegó de noche o mientras descansaban a mediodía.", "urdu": " اور بہت سی بستیاں ایسی ہیں کہ ہم نے ان کو ہلاک کر دیا (جس کی تفصیل یہ ہے کہ) ان کے پاس ہمارا عذاب رات کو سوتے ہوئے یا (دوپہرکو) قیلولہ کرتے ہوئے آیا۔"}, {"arabic": " فَمَا کَانَ دَعۡوٰٮہُمۡ اِذۡ جَآءَہُمۡ بَاۡسُنَاۤ اِلَّاۤ اَنۡ قَالُوۡۤا اِنَّا کُنَّا ظٰلِمِیۡنَ ﴿۶﴾", "english": " So when Our punishment came upon them, their cry was nothing but that they said: ‘We were indeed wrongdoers!’", "french": " Alors quand Notre châtiment est descendu sur eux, ils n’ont rien crié d’autre que ceci : « En vérité, nous avons mal agi ! »", "german": " und ihr Ruf, da Unsere Strafe über sie kam, war nichts anderes als dass sie sprachen: \"Wir waren fürwahr Frevler!\"", "spanish": " Así, cuando les llegó nuestro castigo, su clamor consistió únicamente en decir: “¡fuimos realmente inicuos!”.", "urdu": " سو اس وقت جب کہ ان کے پاس ہمارا عذاب آیا۔ ان کی زبان پر صرف یہ فقرہ تھا کہ ہم یقیناً ظالم تھے۔"}, {"arabic": " فَلَنَسۡـَٔلَنَّ الَّذِیۡنَ اُرۡسِلَ اِلَیۡہِمۡ وَ لَنَسۡـَٔلَنَّ الۡمُرۡسَلِیۡنَ ۙ﴿۷﴾", "english": " And We will certainly question those to whom the Messengers were sent, and We will certainly question the Messengers.", "french": " Et Nous interrogerons assurément ceux auprès desquels les Messagers ont été envoyés, et Nous interrogerons assurément les Messagers.", "german": " Wahrlich, fragen werden Wir jene, zu denen (die Gesandten) geschickt wurden, und fragen werden Wir die Gesandten.", "spanish": " Mas preguntaremos ciertamente a quienes fueron enviados los Mensajeros y preguntaremos ciertamente a los Mensajeros.", "urdu": " پس ہم ان لوگوںسے (بھی) ضرور پوچھیںگے جن کی طرف رسول بھیجے گئے تھے اورہم رسولوں سے بھی ضرور پوچھیں گے۔"}, {"arabic": " فَلَنَقُصَّنَّ عَلَیۡہِمۡ بِعِلۡمٍ وَّ مَا کُنَّا غَآئِبِیۡنَ ﴿۸﴾", "english": " Then will We certainly relate to them their deeds with knowledge, for We were never absent.", "french": " Alors Nous leur raconterons assurément leurs actions , en toute connaissance, car Nous n’étions jamais absent.", "german": " Dann werden Wir ihnen wahrlich (ihre Taten) aufzählen mit Wissen, denn Wir waren niemals abwesend.", "spanish": " Entonces les enumeraremos indudablemente sus acciones con conocimiento, ya que nunca estuvimos ausentes.", "urdu": " پھر ہم ضرور ان کے سامنے اپنے علم کے مطابق حقیقت بیان کریں گے اور ہم کبھی بھی ان لوگوں سے غائب نہیں ہوئے (ہمیشہ ان کے حالات دیکھتے تھے)"}, {"arabic": " وَ الۡوَزۡنُ یَوۡمَئِذِ ۣالۡحَقُّ ۚ فَمَنۡ ثَقُلَتۡ مَوَازِیۡنُہٗ فَاُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۹﴾", "english": " And the weighing on that day will be true. Then as for those whose scales are heavy, it is they who shall prosper.", "french": " Et la pesée ce jour-là sera juste. Alors quant à ceux dont la balance sera lourde, ce sont eux qui prospéreront.", "german": " Und das Wägen an jenem Tage wird wahrhaftig sein. Deren Waagschale dann schwer ist, die werden Erfolg haben.", "spanish": " Y la medida de peso en ese día será justa. Y aquellos cuyas balanzas sean más pesadas, son los que prosperarán.", "urdu": " اور اس (یعنی قیامت کے) دن تمام اعمال کا وزن کرنا ایک ثابت شدہ حقیقت ہے۔ جن کے وزن بھاری ہوئے وہ لوگ بامراد (لوگوں میں شامل) ہوں گے۔"}, {"arabic": " وَ مَنۡ خَفَّتۡ مَوَازِیۡنُہٗ فَاُولٰٓئِکَ الَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ بِمَا کَانُوۡا بِاٰیٰتِنَا یَظۡلِمُوۡنَ ﴿۱۰﴾", "english": " And as for those whose scales are light, it is they who shall have ruined their souls because of their being unjust to Our Signs.", "french": " Et quant à ceux dont la balance sera légère, ce sont eux qui auront causé leur propre perte parce qu’ils étaient injustes envers Nos Signes.", "german": " Deren Waagschale aber leicht ist, das sind jene, die ihre Seelen zugrunde gerichtet haben, weil sie sich vergingen gegen Unsere Zeichen.", "spanish": " Pero aquellos cuyas balanzas sean ligeras, serán los que habrán arruinado sus almas por haber sido injustos con nuestros Signos.", "urdu": " اور جن کے وزن ہلکے ہوئے تو (سمجھ لو) ایسے لوگ اپنی جانوں کے معاملہ میں خسارہ پانے والے ہیں (اور انہوں نے اپنی جانوں کو گھاٹے میں ڈالا ہے) یہ اس لئے ہوا ہے کہ وہ ہماری آیتوں (کے معاملہ) میں ظلم سے کام لیتے تھے۔"}, {"arabic": " وَ لَقَدۡ مَکَّنّٰکُمۡ فِی الۡاَرۡضِ وَ جَعَلۡنَا لَکُمۡ فِیۡہَا مَعَایِشَ ؕ قَلِیۡلًا مَّا تَشۡکُرُوۡنَ ﴿٪۱۱﴾", "english": " And We have established you in the earth and provided for you therein the means of subsistence. How little thanks you give!", "french": " Et Nous vous avons établis sur la terre, et Nous vous y avons fourni vos moyens de subsistance. Que vous êtes peu reconnaissants !", "german": " Wir hatten euch auf der Erde festgesetzt und euch darin die Mittel bereitet zum Unterhalt. Wie wenig seid ihr dankbar!", "spanish": " Os establecimos en la tierra y os proporcionamos en ella los medios de subsistencia. ¡Qué poco agradecidos sois!", "urdu": " اور ہم نے ضرور تم کو زمین میں طاقت بخشی تھی اور اس میں تمہارے لئے (قسم قسم کے) معیشت کے سامان مقرر کیے تھے مگر تم شکر بالکل نہیں کرتے۔"}, {"arabic": " وَ لَقَدۡ خَلَقۡنٰکُمۡ ثُمَّ صَوَّرۡنٰکُمۡ ثُمَّ قُلۡنَا لِلۡمَلٰٓئِکَۃِ اسۡجُدُوۡا لِاٰدَمَ ٭ۖ فَسَجَدُوۡۤا اِلَّاۤ اِبۡلِیۡسَ ؕ لَمۡ یَکُنۡ مِّنَ السّٰجِدِیۡنَ ﴿۱۲﴾", "english": " And We did create you and then We gave you shape; then said We to the angels, ‘Submit to Adam;’ and they all submitted but Iblis did not ; he would not be of those who submit.", "french": " Et, en vérité, c’est Nous Qui vous avons créés ; puis Nous vous avons donné forme ; puis Nous avons dit aux anges : « Soumettez-vous à Adam » ; et tous ils se soumirent, sauf Iblīs ; il ne fut pas de ceux qui se soumettent.", "german": " Und Wir haben euch hervorgebracht, dann gaben Wir euch Gestalt; dann sprachen Wir zu den Engeln: \"Unterwerfet euch Adam\"; und sie alle unterwarfen sich. Nur Iblis nicht; er gehörte nicht zu denen, die sich unterwerfen.", "spanish": " Os creamos y os dimos forma; entonces dijimos a los ángeles: “someteos a Adán;” y todos ellos se sometieron, excepto Iblis, que no lo hizo; no quiso ser de los que se someten.", "urdu": " اور ہم نے تمہیں (پہلے مبہم شکل میں) پیدا کیا تھا۔ جس کے بعد تم کو (تمہارے مناسب حال) صورتیں بخشی تھیں پھر ملائکہ سے کہا تھا کہ آدم کی اطاعت کرو‘ اس پر فرشتوں نے تو (آدم کی) اطاعت کی مگر ابلیس (نے نہ کی) وہ اطاعت گزاروں میں سے نہیں بنا۔"}, {"arabic": " قَالَ مَا مَنَعَکَ اَلَّا تَسۡجُدَ اِذۡ اَمَرۡتُکَ ؕ قَالَ اَنَا خَیۡرٌ مِّنۡہُ ۚ خَلَقۡتَنِیۡ مِنۡ نَّارٍ وَّ خَلَقۡتَہٗ مِنۡ طِیۡنٍ ﴿۱۳﴾", "english": " God said, ‘What prevented thee from submitting when I commanded thee?’ He said, ‘I am better than he. Thou hast created me of fire while him hast Thou created of clay.’", "french": " Allāh dit : « Qu’est-ce qui t’a empêché de te soumettre, quand Je te l’ ai commandé ? » Il répondit : « Je suis meilleur que lui. Tu m’as créé de feu, alors que Tu l’as créé d’argile. »", "german": " Er sprach: \"Was hinderte dich, dass du dich nicht unterwarfest, als Ich es dir gebot?\" Er sagte: \"Ich bin besser als er. Du hast mich aus Feuer erschaffen, ihn aber erschufst Du aus Lehm!\"", "spanish": " Dios dijo: “¿qué te impidió someterte cuando te lo ordené?”. Él dijo: “Soy mejor que él. Tú me creaste de fuego, mientras que a él lo creaste de barro”.", "urdu": " (اس پر خدا نے اس سے) کہا کہ میرے حکم کے باوجود تجھے سجدہ کرنے سے کس نے روکا تھا۔ اس نے جواب دیا کہ میں تو اس (آدم) سے بہتر ہوں تو نے میری فطرت میں آگ رکھی ہے اور اس کی فطرت میں گیلی مٹی کی صفت رکھی ہے۔"}, {"arabic": " قَالَ فَاہۡبِطۡ مِنۡہَا فَمَا یَکُوۡنُ لَکَ اَنۡ تَتَکَبَّرَ فِیۡہَا فَاخۡرُجۡ اِنَّکَ مِنَ الصّٰغِرِیۡنَ ﴿۱۴﴾", "english": " God said, ‘Then go down hence; it is not for thee to be arrogant here. Get out; thou art certainly of those who are abased.’", "french": " Allāh dit : « Alors descends d’ici, il ne convient pas que tu fasses l’arrogant ici. Sors d’ici, tu es sûrement du nombre des avilis. »", "german": " Er sprach; \"Hinab mit dir von hier; es ziemt sich nicht für dich, hier hoffärtig zu sein. Hinaus denn; du bist wahrlich der Erniedrigten einer.\"", "spanish": " Dios dijo: “Entonces sal fuera de inmediato; no te corresponde aquí ser arrogante. Sal; ciertamente eres de los que han sido degradados”.", "urdu": " (اللہ نے) فرمایا (اگر یہ بات ہے تو) تو اس (جنت) سے چلا جا۔ کیونکہ تیرے لئیمناسب نہیں کہ تو اس میں تکبر سے کام لے۔ پس (یہاں سے) نکل جا تو ذلیل لوگوں میں سے ہے۔"}, {"arabic": " قَالَ اَنۡظِرۡنِیۡۤ اِلٰی یَوۡمِ یُبۡعَثُوۡنَ ﴿۱۵﴾", "english": " He said, ‘Grant me respite till the day when they will be raised up.’", "french": " Il dit : « Accorde-moi un répit jusqu’au jour où ils seront ressuscités. »", "german": " Er sprach: \"Gewähre mir Aufschub bis zum Tage, wenn sie auferweckt werden.\"", "spanish": " Él dijo: “Concédeme un respiro hasta el día en que sean resucitados”.", "urdu": " اس نے کہا (اے میرے رب)! مجھے اس دن تک مہلت دے جبکہ وہ اٹھائے جائیں گے۔"}, {"arabic": " قَالَ اِنَّکَ مِنَ الۡمُنۡظَرِیۡنَ ﴿۱۶﴾", "english": " God said, ‘Thou shalt be of those who are given respite.’", "french": " Allāh dit : « Tu es de ceux à qui un répit est accordé. »", "german": " Er sprach: \"Dir sei Aufschub gewährt.\"", "spanish": " Dios dijo: “Serás de aquellos a los que se conceda un plazo”.", "urdu": " (اللہ نے) جواب دیا تجھے (تیرے مطالبہ کے مطابق) ڈھیل دی گئی ہے۔"}, {"arabic": " قَالَ فَبِمَاۤ اَغۡوَیۡتَنِیۡ لَاَقۡعُدَنَّ لَہُمۡ صِرَاطَکَ الۡمُسۡتَقِیۡمَ ﴿ۙ۱۷﴾", "english": " He said: ‘Now, since Thou hast adjudged me as lost, I will assuredly lie in wait for them on Thy straight path.", "french": " Il dit : « Eh bien, puisque Tu m’as déclaré égaré, je me tiendrai assurément à l’affût pour les surprendre sur Ton droit chemin.", "german": " Er sprach: \"Wohlan, da Du mich als verloren verurteilt hast, will ich ihnen gewisslich auflauern auf Deinem geraden Weg.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:17&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:17&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic18\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic18\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:18' style='text-decoration:underline'>7:18</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(18)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control18\"></i></button> <audio id=\"player18\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ثُمَّ لَاٰتِیَنَّہُمۡ مِّنۡۢ بَیۡنِ اَیۡدِیۡہِمۡ وَ مِنۡ خَلۡفِہِمۡ وَ عَنۡ اَیۡمَانِہِمۡ وَ عَنۡ شَمَآئِلِہِمۡ ؕ وَ لَا تَجِدُ اَکۡثَرَہُمۡ شٰکِرِیۡنَ ﴿۱۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Then will I surely come upon them from before them and from behind them and from their right and from their left, and Thou wilt not find most of them to be grateful.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Then will I surely come upon them from before them and from behind them and from their right and from their left,<sup class='ref'>[<a class='ref' data-id='ref_7_18_955' href='#'>955</a>]</sup> and Thou wilt not find most of them to be grateful.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_18_955'>955</span></div> <div><a name='955'></a><div class='reference' data-id='ref_7_18_955' style='display:none'> <p><b>955.</b> Note the network of seductions threatened by Satan. (<a href='javascript:void(0)' data-id='ref_7_18_955' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پھر میں ضرور اُن تک ان کے سامنے سے بھی اور ان کے پیچھے سے بھی اور ان کے دائیں سے بھی اور ان کے بائیں سے بھی آؤں گا۔ اور تو ان میں سے اکثر کو شکر گزار نہیں پائے گا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">پھر میں ان کے پاس آٶں گے ان کے سامنے سے بھی اور ان کے پیچھے سے بھی‘ ان کی دائیں طرف سے بھی اور ان کی بائیں طرف سے بھی (تا کہ ان کو ورغلاٶں) اور تو ان میں سے اکثر کو شکر گزار نہیں پائے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Alors assurément, je fondrai sur eux de devant et de derrière, de leur droite et de leur gauche, et Tu ne trouveras pas la plupart d’entre eux reconnaissants. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Entonces caeré ciertamente sobre ellos, por delante y por detrás, y por su derecha y su izquierda, y encontrarás que la mayoría de ellos no son agradecidos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Dann will ich über sie kommen von vorne und von hinten, von ihrer Rechten und von ihrer Linken, und Du wirst die Mehrzahl von ihnen nicht dankbar finden.\"", "spanish": " Dijo: “Y ahora, ya que Tú me has juzgado como perdido, me quedaré ciertamente a su espera en Tu camino recto”.", "urdu": " اس نے کہا کہ چونکہ تو نے مجھے ہلاک کیا ہے۔ اس لئے میں ان (انسانوں) کے لئے تیرے سیدھے راستہ پر بیٹھ جاٶں گا۔"}, {"arabic": " قَالَ اخۡرُجۡ مِنۡہَا مَذۡءُوۡمًا مَّدۡحُوۡرًا ؕ لَمَنۡ تَبِعَکَ مِنۡہُمۡ لَاَمۡلَـَٔنَّ جَہَنَّمَ مِنۡکُمۡ اَجۡمَعِیۡنَ ﴿۱۹﴾", "english": " God said: ‘Get out hence, despised and banished. Whosoever of them shall follow thee, I will surely fill Hell with you all.’", "french": " Allāh dit : « Sors de là, méprisé et banni. Quant à ceux d’entre eux qui te suivront, Je remplirai assurément l’Enfer de vous tous. »", "german": " Er sprach: \"Hinweg mit dir, verachtet und verstoßen! Wahrlich, wer von ihnen dir folgt – Ich werde die Hölle füllen mit euch allesamt.\"", "spanish": " Dios dijo: “¡Sal de aquí, despreciado y desterrado! Si alguno de ellos te sigue, sepa que indudablemente llenaré el Infierno con todos vosotros”.", "urdu": " (اللہ نے) فرمایا‘ اس جگہ سے نکل جا۔ تیری ہمیشہ مذمت کی جائے گی اور تو راندئہ درگاہ رہے گا۔ جو (بھی) ان (انسانوں) میں سے تیری اتباع کریں گے (میں ان سے کہتا ہوں کہ) تم سب سے میں جہنم کو بھر دوں گا۔"}, {"arabic": " وَ یٰۤاٰدَمُ اسۡکُنۡ اَنۡتَ وَ زَوۡجُکَ الۡجَنَّۃَ فَکُلَا مِنۡ حَیۡثُ شِئۡتُمَا وَ لَا تَقۡرَبَا ہٰذِہِ الشَّجَرَۃَ فَتَکُوۡنَا مِنَ الظّٰلِمِیۡنَ ﴿۲۰﴾", "english": " ‘And O Adam, dwell thou and thy wife in the garden and eat therefrom wherever you will, but approach not this tree lest you be among the wrongdoers.’", "french": " » Ô Adam, demeure, toi ainsi que ta femme, dans le jardin et mangez- en partout où vous voudrez, mais n’approchez pas de cet arbre-ci, pour que vous ne soyez pas de ceux qui agissent mal. »", "german": " O Adam, weile du und dein Weib in dem Garten und esset, wo immer ihr wollt, nur nähert euch nicht diesem Baume, sonst seid ihr Ungerechte.", "spanish": " “Y ¡Oh, Adán!, habitad tú y tu esposa en el Jardín y comed de él en donde queráis, pero no os acerquéis a este árbol, no sea que os contéis entre los malvados”.", "urdu": " اور اے آدم! (میں تجھ سے کہتا ہوں کہ) تو اور تیرا ساتھی جنت میں رہو۔ پس تم جہاں سے چاہو کھاٶ (اور پیئو) اور اس (ممنوعہ) درخت کے قریب نہ جانا ورنہ تم ظالم ہو جاٶ گے۔"}, {"arabic": " فَوَسۡوَسَ لَہُمَا الشَّیۡطٰنُ لِیُبۡدِیَ لَہُمَا مَا وٗرِیَ عَنۡہُمَا مِنۡ سَوۡاٰتِہِمَا وَ قَالَ مَا نَہٰکُمَا رَبُّکُمَا عَنۡ ہٰذِہِ الشَّجَرَۃِ اِلَّاۤ اَنۡ تَکُوۡنَا مَلَکَیۡنِ اَوۡ تَکُوۡنَا مِنَ الۡخٰلِدِیۡنَ ﴿۲۱﴾", "english": " But Satan whispered evil suggestions to them so that he might make known to them what was hidden from them of their shame, and said, ‘Your Lord has only forbidden you this tree, lest you should become angels or such beings as live for ever.’", "french": " Mais Satan leur chuchota de mauvaises suggestions de façon à leur révéler une partie de leurs faiblesses qui étaient restées cachées d’eux de leur pudeur, et dit : « Votre Seigneur ne vous a interdit cet arbre par crainte que vous ne deveniez deux anges ou que vous ne viviez pour toujours. »", "german": " Doch Satan flüsterte ihnen Böses ein, dass er ihnen kundtun möchte, was ihnen verborgen war von ihrer Scham. Er sprach: \"Euer Herr hat euch diesen Baum nur deshalb verboten, damit ihr nicht Engel werdet oder Ewiglebende.\"", "spanish": " Pero Satanás les susurró insinuaciones a fin de darles a conocer sus carencias, que les habían permanecido ocultas, respecto a su vergüenza, y dijo: “Al-lah no os habría prohibido este árbol, excepto que Él deseara que no os convirtáis en ángeles ni seáis de quienes son inmortales”.", "urdu": " اس پر شیطان نے ان (دونوں یعنی آدم اور اس کے ساتھی کے دل) میں وسوسہ ڈالا تا کہ جو کچھ ان کے ننگ میں سے ان پر چھپایا گیا تھا اس کو ظاہر کردے اور کہا اس درخت سے تمہارے رب نے تم کو صرف اس لئے منع کیا ہے کہ کہیں تم دونوں فرشتے نہ بن جاٶ یا تم دونوں ہمیشہ کی زندگی نہ پالو۔"}, {"arabic": " وَ قَاسَمَہُمَاۤ اِنِّیۡ لَکُمَا لَمِنَ النّٰصِحِیۡنَ ﴿ۙ۲۲﴾", "english": " And he swore to them, saying , ‘Surely, I am a sincere counsellor unto you.’", "french": " Et il leur jura : « En vérité, je suis pour vous deux un conseiller sincère. »", "german": " Und er schwor ihnen: \"Gewiss, ich bin euch ein aufrichtiger Ratgeber.\"", "spanish": " Y él les juró diciéndoles : “En verdad, soy un consejero sincero para vosotros”.", "urdu": " اور (شیطان نے) ان سے قسمیں کھا کھا کر کہا کہ میں تم دونوں کا خیر خواہ ہوں۔"}, {"arabic": " فَدَلّٰٮہُمَا بِغُرُوۡرٍ ۚ فَلَمَّا ذَاقَا الشَّجَرَۃَ بَدَتۡ لَہُمَا سَوۡاٰتُہُمَا وَ طَفِقَا یَخۡصِفٰنِ عَلَیۡہِمَا مِنۡ وَّرَقِ الۡجَنَّۃِ ؕ وَ نَادٰٮہُمَا رَبُّہُمَاۤ اَلَمۡ اَنۡہَکُمَا عَنۡ تِلۡکُمَا الشَّجَرَۃِ وَ اَقُلۡ لَّکُمَاۤ اِنَّ الشَّیۡطٰنَ لَکُمَا عَدُوٌّ مُّبِیۡنٌ ﴿۲۳﴾", "english": " So he caused them to fall into disobedience by deceit. And when they tasted of the tree, their shame became manifest to them and they began to stick the leaves of the garden together over themselves. And their Lord called them, saying , ‘Did I not forbid you that tree and tell you: verily, Satan is to you an open foe?’", "french": " C’est ainsi que par tromperie, il les fit chuter en désobéissance . Et lorsqu’ils eurent goûté de l’arbre, leur pudeur leur devint manifeste, et ils commencèrent à se couvrir des feuilles du jardin. Et leur Seigneur les appela : « Ne vous avais-Je pas défendu cet arbre-là, et dit, ‘En vérité, Satan est pour vous un ennemi déclaré’ ? »", "german": " So verführte er sie durch Trug. Und als sie von dem Baume kosteten, da ward ihre Scham ihnen offenbar und sie begannen, sich in die Blätter des Gartens zu hüllen. Und ihr Herr rief sie: «Habe Ich euch nicht diesen Baum verwehrt und euch gesagt: \"Wahrlich, Satan ist euch ein offenkundiger Feind\"?»", "spanish": " De este modo les hizo caer en la desobediencia mediante el engaño. Y cuando gustaron del árbol, su vergüenza se les hizo manifiesta y ambos empezaron a colocarse sobre si mismos las hojas del jardín. Mas su Señor los llamó diciendo: “¿No os prohibí ese árbol y os dije: en verdad, Satanás es vuestro enemigo declarado?”.", "urdu": " پھر ان دونوں کو دھوکا دے کر اپنے مقام سے ہٹا دیا۔ پھر جب ان دونوں نے اس (ممنوعہ) درخت سے (کچھ) چکھ لیا تو ان کے ننگ ان پر ظاہر ہو گئے اور وہ لگے جنت کی زینت کے سامانوں کو اپنے اوپر چمٹانے۔ اور ان دونوں کو ان کے رب نے بلایا۔ (اور کہا) کیا میں نے تم دونوں کو اس درخت سے منع نہیں کیا تھا اور یہ نہیں کہا تھا کہ شیطان تم دونوں کا کھلا کھلا دشمن ہے۔"}, {"arabic": " قَالَا رَبَّنَا ظَلَمۡنَاۤ اَنۡفُسَنَا ٜ وَ اِنۡ لَّمۡ تَغۡفِرۡ لَنَا وَ تَرۡحَمۡنَا لَنَکُوۡنَنَّ مِنَ الۡخٰسِرِیۡنَ ﴿۲۴﴾", "english": " They said, ‘Our Lord, we have wronged ourselves; and if Thou forgive us not and have not mercy on us, we shall surely be of the lost.’", "french": " Ils dirent : « Notre Seigneur, Nous avons agi injustement envers nous-mêmes ; et si Tu ne nous pardonnes pas, et si Tu ne nous fais pas miséricorde, nous serons assurément du nombre des perdants. »", "german": " Sie sprachen: \"Unser Herr, wir haben wider uns selbst gesündigt; und wenn Du uns nicht verzeihst und Dich unser erbarmst, dann werden wir gewiss unter den Verlorenen sein.\"", "spanish": " Ellos dijeron: “Señor Nuestro, nos hemos hecho daño a nosotros mismos; y si Tú no nos perdonas y no tienes misericordia de nosotros, estaremos ciertamente entre los perdidos”.", "urdu": " ان دونوں نے کہا‘ اے ہمارے رب! ہم نے اپنی جانوں پر ظلم کیا اور اگر تو ہم کو نہ بخشے گا اور ہم پر رحم نہ کرے گا تو ہم نقصان اٹھانے والوں میں سے ہو جائیں گے۔"}, {"arabic": " قَالَ اہۡبِطُوۡا بَعۡضُکُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَ لَکُمۡ فِی الۡاَرۡضِ مُسۡتَقَرٌّ وَّ مَتَاعٌ اِلٰی حِیۡنٍ ﴿۲۵﴾", "english": " He said, ‘Go forth, some of you being enemies of others. And for you there is an abode on the earth and a provision for a time.’", "french": " Allāh dit : « Partez d’ici ; les uns seront les ennemis des autres. Et pour vous il y aura une habitation sur la terre et une provision pour un temps. »", "german": " Er sprach: \"Hinab mit euch; die einen von euch sind den anderen feind. Und es sei euch auf der Erde ein Aufenthaltsort und eine Versorgung auf Zeit.\"", "spanish": " Él dijo: “¡Marchad!; algunos de vosotros seréis enemigos de los otros. Pues para vosotros hay una morada en la tierra y provisiones durante algún tiempo”.", "urdu": " (تب اللہ نے) فرمایا۔ تم سب کے سب یہاں سے چلے جاٶ۔ تم میں سے بعض بعض کے دشمن ہوں گے اور تمہارے لئے اسی زمین میں ٹھکانا ہوگا اور کچھ مدت تک فائدہ اٹھانا (مقدر) ہوگا۔"}, {"arabic": " قَالَ فِیۡہَا تَحۡیَوۡنَ وَ فِیۡہَا تَمُوۡتُوۡنَ وَ مِنۡہَا تُخۡرَجُوۡنَ ﴿٪۲۶﴾", "english": " He said, ‘Therein shall you live, and therein shall you die, and therefrom shall you be brought forth.’", "french": " Il dit : « Là vous demeurerez, et là vous mourrez, et c’est de là qu’on vous fera sortir. »", "german": " Er sprach: \"Dort sollt ihr leben, und dort sollt ihr sterben, und von dort sollt ihr hervorgebracht werden.\"", "spanish": " Dijo: “en ella viviréis, en ella moriréis y de ella seréis retornados.”", "urdu": " (پھر) فرمایا‘ اسی زمیں میں تم زندہ رہو گے اور اسی میں تم مرو گے اور اسی میں سے تم نکالے جاٶ گے۔"}, {"arabic": " یٰبَنِیۡۤ اٰدَمَ قَدۡ اَنۡزَلۡنَا عَلَیۡکُمۡ لِبَاسًا یُّوَارِیۡ سَوۡاٰتِکُمۡ وَ رِیۡشًا ؕ وَ لِبَاسُ التَّقۡوٰی ۙ ذٰلِکَ خَیۡرٌ ؕ ذٰلِکَ مِنۡ اٰیٰتِ اللّٰہِ لَعَلَّہُمۡ یَذَّکَّرُوۡنَ ﴿۲۷﴾", "english": " O children of Adam! We have indeed sent down to you raiment to cover your shame, and to be an elegant dress; but the raiment of righteousness — that is the best. That is one of the Signs of Allah, that they may remember.", "french": " Ô enfants d’Adam, Nous avons en vérité fait descendre sur vous des vêtements pour couvrir votre nudité et pour servir de parure ; mais c’est le vêtement de la piété qui est le meilleur. Cela relève des Signes d’Allāh, afin qu’ils se souviennent.", "german": " O Kinder Adams, Wir gaben euch Kleidung, eure Scham zu bedecken, und zum Schmuck; doch das Kleid der Frömmigkeit – das ist das beste. Dies ist eins der Zeichen Allahs, auf dass sie (dessen) eingedenk sein mögen.", "spanish": " ¡Oh, hijos de Adán! En verdad os hemos entregado vestiduras para ubrir vuestra vergüenza y como vestido elegante; pero sabed que la vestidura de la justicia es la mejor. Ése es uno de los Signos de Al-lah, para que recuerden.", "urdu": " اے آدم کی اولاد! ہم نے تمہارے لئے ایک ایسا لباس پیدا کیا ہے جو تمہاری چھپانے والی جگہوں کو چھپاتا ہے اور زینت (کا موجب بھی) ہے اور تقویٰ کا لباس (تو) سب سے بہتر لباس ہے۔ یہ (لباس کا حکم) اللہ کے احکام سے ہے تا کہ تم نصیحت حاصل کرو۔"}, {"arabic": " یٰبَنِیۡۤ اٰدَمَ لَا یَفۡتِنَنَّکُمُ الشَّیۡطٰنُ کَمَاۤ اَخۡرَجَ اَبَوَیۡکُمۡ مِّنَ الۡجَنَّۃِ یَنۡزِعُ عَنۡہُمَا لِبَاسَہُمَا لِیُرِیَہُمَا سَوۡاٰتِہِمَا ؕ اِنَّہٗ یَرٰٮکُمۡ ہُوَ وَ قَبِیۡلُہٗ مِنۡ حَیۡثُ لَا تَرَوۡنَہُمۡ ؕ اِنَّا جَعَلۡنَا الشَّیٰطِیۡنَ اَوۡلِیَآءَ لِلَّذِیۡنَ لَا یُؤۡمِنُوۡنَ ﴿۲۸﴾", "english": " O children of Adam! let not Satan seduce you, even as he turned your parents out of the garden, stripping them of their raiment that he might show them their shame. Truly he sees you, he and his tribe, from where you see them not. Surely, We have made satans friends for those who believe not.", "french": " Ô enfants d’Adam, ne laissez pas Satan vous séduire, comme il a fait sortir vos parents du jardin en les dépouillant de leurs vêtements pour leur montrer leur faiblesse. En vérité, il vous voit, lui et sa bande, de là où vous ne pouvez les voir. Assurément Nous avons fait des satans amis de ceux qui ne croient pas.", "german": " O Kinder Adams, lasst Satan euch nicht verführen, wie er eure Eltern aus dem Garten vertrieb, ihnen ihre Kleidung raubend, auf dass er ihnen ihre Scham zeigte. Wahrlich, er sieht euch, er und seine Schar, von wo ihr sie nicht seht. Denn siehe, Wir haben die Teufel zu Freunden derer gemacht, die nicht glauben.", "spanish": " ¡Oh, hijos de Adán! que no os seduzca Satanás, como expulsó a vuestros padres del Jardín, despojándolos de sus vestiduras para mostrarles su vergüenza. En verdad él os ve -él y su tribu- desde donde vosotros no lo veis. Ciertamente, hemos hecho a los demonios amigos de los que no creen.", "urdu": " اے آدم کے بیٹو! شیطان تم کو (اللہ کی راہ سے) بہکا نہ دے جس طرح اس نے تمہارے والدین کو جنت سے نکالا تھا‘ ان دونوں سے ان کا لباس اس نے چھین لیا تھا تا کہ ان پر ان کی چھپانے والی چیزیں ظاہر کردے وہ اور اس کا قبیلہ تم کو وہاں سے دیکھتے ہیں جہاں سے تم ان کو نہیں دیکھتے۔ ہم نے شیطانوں کو کافروں کا دوست بنایا ہے۔"}, {"arabic": " وَ اِذَا فَعَلُوۡا فَاحِشَۃً قَالُوۡا وَجَدۡنَا عَلَیۡہَاۤ اٰبَآءَنَا وَ اللّٰہُ اَمَرَنَا بِہَا ؕ قُلۡ اِنَّ اللّٰہَ لَا یَاۡمُرُ بِالۡفَحۡشَآءِ ؕ اَتَقُوۡلُوۡنَ عَلَی اللّٰہِ مَا لَا تَعۡلَمُوۡنَ ﴿۲۹﴾", "english": " And when they commit a foul deed, they say: ‘We found our fathers doing it, and Allah has enjoined it upon us.’ Say, ‘Allah never enjoins foul deeds. Do you say of Allah what you know not?’", "french": " Et lorsqu’ils commettent une indécence, ils disent : « Nous avons trouvé que nos pères faisaient cela et Allāh nous l’a commandé. » Dis : « Allāh n’enjoint jamais l’indécence. Dites-vous d’Allāh ce que vous ne savez pas ? »", "german": " Und wenn sie eine Schandtat begehen, sagen sie: \"Wir fanden unsere Väter dabei, und Allah hat sie uns befohlen.\" Sprich: \"Allah befiehlt niemals Schandtaten. Wollt ihr denn von Allah reden, was ihr nicht wisset?\"", "spanish": " Y cuando cometen una acción ilícita, dicen: “Hemos visto a nuestros padres cometerla y Al-lah nos la impone”. Diles: “Al-lah nunca impone acciones ilícitas. ¿Decís de Al-lah lo que no sabéis?”.", "urdu": " اور جب وہ (کافر) کوئی برا کام کرتے ہیں تو کہتے ہیں ہم نے اپنے باپ دادوں کو اسی پر پایا تھا اور اللہ نے اسی کا ہم کو حکم دیا ہے۔ تو کہہ دے اللہ کبھی بری باتوں کا حکم نہیں دیتا۔ کیا تم اللہ کے متعلق وہ باتیں جھوٹے طور پر کہتے ہو جو تم جانتے نہیں۔"}, {"arabic": " قُلۡ اَمَرَ رَبِّیۡ بِالۡقِسۡطِ ۟ وَ اَقِیۡمُوۡا وُجُوۡہَکُمۡ عِنۡدَ کُلِّ مَسۡجِدٍ وَّ ادۡعُوۡہُ مُخۡلِصِیۡنَ لَہُ الدِّیۡنَ ۬ؕ کَمَا بَدَاَکُمۡ تَعُوۡدُوۡنَ ﴿ؕ۳۰﴾", "english": " Say, ‘My Lord has enjoined justice. And fix your attention aright at every time and place of worship, and call upon Him, making yourselves sincere towards Him in religion. As He brought you into being, so shall you return.’", "french": " Dis : « Mon Seigneur a prescrit la justice. Et concentrez votre attention correctement à chaque heure et lieu d’adoration et invoquez-Le, étant sincères dans votre foi à Son égard. Tout comme Il vous a amenés à l’existence, de même retournerez-vous à Lui . »", "german": " Sprich: \"Mein Herr hat Gerechtigkeit befohlen. Sammelt eure Aufmerksamkeit (zu jeder Zeit und) an jeder Stätte der Andacht, und rufet Ihn an in lauterem Gehorsam gegen Ihn. Wie Er euch ins Dasein gebracht, so sollt ihr zurückkehren.\"", "spanish": " Diles: Mi Señor ha ordenado la justicia. Dirigid vuestros rostros a la dirección adecuada en cada lugar de adoración, llamadle, siendo sinceros ante Él en la religión. Pues Él os dio el ser y a Él volveréis.", "urdu": " تو کہہ دے میرے رب نے مجھے انصاف کا حکم دیا ہے اور یہ کہ ہر مسجد کے پاس اپنی توجہ درست کر لیا کرو اور اللہ کی عبادت کو خالص اسی کا حق قرار دیتے ہوئے اسی کو پکارو‘ جس طرح اس نے تم کو شروع کیا تھا۔ پھر ایک دن تم اسی حالت کی طرف لوٹو گے۔"}, {"arabic": " فَرِیۡقًا ہَدٰی وَ فَرِیۡقًا حَقَّ عَلَیۡہِمُ الضَّلٰلَۃُ ؕ اِنَّہُمُ اتَّخَذُوا الشَّیٰطِیۡنَ اَوۡلِیَآءَ مِنۡ دُوۡنِ اللّٰہِ وَ یَحۡسَبُوۡنَ اَنَّہُمۡ مُّہۡتَدُوۡنَ ﴿۳۱﴾", "english": " Some has He guided, and as for others error has become their desert. They have taken evil ones for friends to the exclusion of Allah, and they think that they are rightly guided.", "french": " Il a guidé les uns, tandis que pour les autres, l’erreur est devenue leur dû. Ces derniers ont pris des satans pour amis à la place d’Allāh, et ils pensent être bien guidés.", "german": " Einige hat Er geleitet, anderen aber ward nach Gebühr Irrtum zuteil. Sie haben sich die Teufel zu Freunden genommen und Allah ausgeschlossen, und sie wähnen, sie seien rechtgeleitet.", "spanish": " Él ha guiado a algunos y, en cuanto a otros el error ha sido su merecido. Han tomado como amigos a los malvados, excluyendo a Al-lah, y piensan que están correctamente guiados.", "urdu": " ایک فریق کو اس نے ہدایت دی لیکن ایک اور فریق ہے جس پر گمراہی واجب ہو گئی ہے (یعنی وہ گمراہی کا مستحق ٹھہرا ہے) انہوں نے اللہ کو چھوڑ کر شیطانوں کو اپنا دوست بنا لیا ہے اور وہ خیال کرتے ہیں کہ وہ ہدایت پا گئے ہیں۔"}, {"arabic": " یٰبَنِیۡۤ اٰدَمَ خُذُوۡا زِیۡنَتَکُمۡ عِنۡدَ کُلِّ مَسۡجِدٍ وَّ کُلُوۡا وَ اشۡرَبُوۡا وَ لَا تُسۡرِفُوۡا ۚ اِنَّہٗ لَا یُحِبُّ الۡمُسۡرِفِیۡنَ ﴿٪۳۲﴾", "english": " O children of Adam! look to your adornment at every time and place of worship, and eat and drink but exceed not the bounds; surely, He does not love those who exceed the bounds.", "french": " Ô enfants d’Adam ! Prenez soin de votre parure à chaque occasion et en chaque lieu d’adoration ; mangez et buvez sans dépasser les limites. Assurément, Il n’aime pas ceux qui commettent des excès.", "german": " O Kinder Adams, leget euren Schmuck an (zu jeder Zeit und) an jeder Stätte der Andacht, und esset und trinket, doch überschreitet das Maß nicht; wahrlich, Er liebt nicht die Unmäßigen.", "spanish": " ¡Oh, hijos de Adán! Cuidad de vuestras galas en cada momento y lugar de adoración, y comed y bebed, pero no superéis los límites; en verdad, Él no ama a quienes superan los límites.", "urdu": " اے آدم کے بیٹو! ہر مسجد کے قریب زینت (کے سامان) اختیار کر لیا کرو اور کھاٶ اور پیئو اور اسراف نہ کرو‘ کیونکہ وہ (اللہ) اسراف کرنے والوں کو پسند نہیں کرتا۔"}, {"arabic": " قُلۡ مَنۡ حَرَّمَ زِیۡنَۃَ اللّٰہِ الَّتِیۡۤ اَخۡرَجَ لِعِبَادِہٖ وَ الطَّیِّبٰتِ مِنَ الرِّزۡقِ ؕ قُلۡ ہِیَ لِلَّذِیۡنَ اٰمَنُوۡا فِی الۡحَیٰوۃِ الدُّنۡیَا خَالِصَۃً یَّوۡمَ الۡقِیٰمَۃِ ؕ کَذٰلِکَ نُفَصِّلُ الۡاٰیٰتِ لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۳۳﴾", "english": " Say, ‘Who has forbidden the adornment of Allah which He has produced for His servants, and the good things of His providing?’ Say, ‘They are for the believers in the present life and exclusively for them on the Day of Resurrection. Thus do We explain the Signs for a people who have knowledge.’", "french": " Dis : « Qui a interdit la parure d’Allāh, qu’Il a produite pour Ses serviteurs et les bonnes choses en guise de provisions ? » Dis : « Elles sont destinées aux croyants dans cette vie-ci, et seront exclusivement pour eux au Jour de la Résurrection. » C’est ainsi que Nous expliquons clairement les Signes pour un peuple possédant de la connaissance.", "german": " Sprich: \"Wer hat den Schmuck Allahs verboten, den Er für Seine Diener hervorgebracht, und die guten Dinge der Versorgung?\" Sprich: \"Sie sind für die Gläubigen in diesem Leben (und) ausschließlich (für sie) am Tage der Auferstehung.\" Also machen Wir die Zeichen klar für Leute, die Kenntnis besitzen.", "spanish": " Diles: “¿Quién ha prohibido las galas de Al-lah que Él produjo para Sus siervos, y las cosas buenas que Él proporciona?”. Diles: “Son para os creyentes en la vida actual y exclusivamente para ellos el Día de la Resurrección. Así explicamos los Signos a los hombres que tienen conocimiento.", "urdu": " تو کہہ دے کہ اللہ کی اس زینت کو جس کو اس نے اپنے بندوں کے لئے نکالاہے‘ کس نے حرام کیا ہے؟ اسی طرح رزق میں سے پاکیزہ چیزوں کو بھی (کس نے حرام کیا ہے) تو کہہ دے یہ تو (اصل میں) اس دنیا میں (بھی) مومنوں کے لئے ہیں اور قیامت کے دن صرف ان کے لئے ہی ہوں گی۔ اسی طرح ہم اپنے نشانات کو علم والے لوگوں کے لئے کھول کر بیان کرتے ہیں۔"}, {"arabic": " قُلۡ اِنَّمَا حَرَّمَ رَبِّیَ الۡفَوَاحِشَ مَا ظَہَرَ مِنۡہَا وَ مَا بَطَنَ وَ الۡاِثۡمَ وَ الۡبَغۡیَ بِغَیۡرِ الۡحَقِّ وَ اَنۡ تُشۡرِکُوۡا بِاللّٰہِ مَا لَمۡ یُنَزِّلۡ بِہٖ سُلۡطٰنًا وَّ اَنۡ تَقُوۡلُوۡا عَلَی اللّٰہِ مَا لَا تَعۡلَمُوۡنَ ﴿۳۴﴾", "english": " Say, ‘My Lord has only forbidden foul deeds, whether open or secret, and sin and wrongful transgression, and that you associate with Allah that for which He has sent down no authority, and that you say of Allah that of which you have no knowledge.’", "french": " Dis : « Mon Seigneur n’a interdit que les indécences, qu’elles soient commises ouvertement ou en secret, et le péché, et la transgression injustifiée, et que vous associiez à Allāh ce pour quoi Il ne vous a accordé aucune autorité, et que vous disiez d’Allāh ce dont vous n’avez aucune connaissance. »", "german": " Sprich: \"Mein Herr hat nur Schändlichkeiten verboten, seien sie offen oder verborgen, dazu Sünde und ungerechte Gewalttat, und dass ihr Allah das zur Seite setzet, wozu Er keine Vollmacht herabsandte, und dass ihr von Allah aussaget, was ihr nicht wisset.\"", "spanish": " Diles: “Mi Señor sólo ha prohibido las malas acciones, públicas o secretas, el pecado, y rebelarse sin justificación; que asociéis a Al-lah aquello a lo que Él no ha concedido potestad, y que digáis de Al-lah lo que no sabéis”.", "urdu": " تو کہہ دے میرے رب نے صرف برے اعمال کو خواہ وہ ظاہر ہوں یا چھپے ہوئے اور گناہ کو اور بغیر حق کے سرکشی کو حرام کیا ہے اور اس بات کو کہ تم اللہ کے ساتھ کسی ایسے وجود کو جس کے لئے اس (اللہ) نے کوئی دلیل نہیں اتاری شریک قرار دو‘ اور اس بات کو بھی (حرام قرار دیا ہے) کہ تم اللہ پر ایسے جھوٹے الزام لگاٶ‘ جن کو تم جانتے نہیں۔"}, {"arabic": " وَ لِکُلِّ اُمَّۃٍ اَجَلٌ ۚ فَاِذَا جَآءَ اَجَلُہُمۡ لَا یَسۡتَاۡخِرُوۡنَ سَاعَۃً وَّ لَا یَسۡتَقۡدِمُوۡنَ ﴿۳۵﴾", "english": " And for every people there is a term, and when their term is come, they cannot remain behind a single moment, nor can they get ahead of it .", "french": " Et pour chaque peuple, il y a un terme. Et à l’expiration de leur terme, ils ne peuvent rester un seul moment en arrière, ni le devancer.", "german": " Jedem Volk ist eine Frist gesetzt; und wenn ihre Stunde gekommen ist, dann können sie (sie) auch nicht um einen Augenblick hinausschieben, noch können sie (sie) vorverschieben.", "spanish": " Pues para cada pueblo hay un plazo, y cuando se cumple su plazo, no pueden quedarse atrás un solo momento, ni pueden adelantar lo.", "urdu": " اور ہر قوم کے لئے ایک (خاتمہ کا) وقت مقرر ہے پس جب ان (کے خاتمہ) کا وقت آجائے تو وہ نہ اس سے ایک گھڑی پیچھے رہ سکتے ہیں اور نہ (ایک گھڑی) آگے بڑھ سکتے ہیں۔"}, {"arabic": " یٰبَنِیۡۤ اٰدَمَ اِمَّا یَاۡتِیَنَّکُمۡ رُسُلٌ مِّنۡکُمۡ یَقُصُّوۡنَ عَلَیۡکُمۡ اٰیٰتِیۡ ۙ فَمَنِ اتَّقٰی وَ اَصۡلَحَ فَلَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۳۶﴾", "english": " O children of Adam! if Messengers come to you from among yourselves, rehearsing My Signs unto you, then whoso shall fear God and do good deeds, on them shall come no fear nor shall they grieve.", "french": " Ô enfants d’Adam, si des Messagers d’entre vous-mêmes viennent vous expliquer Mes Signes, alors tous ceux qui craindront Allāh et amèneront une réforme ne seront ni dans la crainte ni ne seront-ils affligés.", "german": " O Kinder Adams, wenn zu euch Gesandte kommen aus eurer Mitte, die euch Meine Zeichen verkünden – wer dann gottesfürchtig ist und gute Werke tut, keine Furcht soll über sie kommen, noch sollen sie trauern.", "spanish": " ¡Oh, hijos de Adán! si os vienen Mensajeros de entre vosotros mismos, explicándoos Mis Signos, sabed entonces que a quienes teman a Dios y hagan buenas obras, no les sobrecogerá el temor ni serán afligidos.", "urdu": " اے آدم کے بیٹو! اگر تمہارے پاس تم میں سے رسول بنا کر بھیجے جائیں اس طرح کہ وہ تمہارے سامنے میری آیات پڑھ کر سناتے ہوں تو جو لوگ تقویٰ اختیار کریں اور اصلاح کریں ان کو (آئندہ کے لئے) کسی قسم کا خوف نہ ہوگا‘ اور نہ وہ (ماضی کی کسی بات پر) غمگین ہوں گے۔"}, {"arabic": " وَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا وَ اسۡتَکۡبَرُوۡا عَنۡہَاۤ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۳۷﴾", "english": " But those who reject Our Signs and turn away from them with disdain, these shall be the inmates of the Fire; they shall abide therein.", "french": " Et ceux qui repoussent Nos Signes et s’en détournent avec dédain, ceux-là seront les habitants du Feu où ils demeureront longtemps.", "german": " Die aber, die Unsere Zeichen verwerfen und sich mit Verachtung von ihnen abwenden, die sollen die Bewohner des Feuers sein; darin müßen sie bleiben.", "spanish": " Pero quienes rechacen Nuestros Signos y se aparten de ellos con desdén, serán los habitantes del Fuego; en él morarán durante un tiempo largo.", "urdu": " اور وہ لوگ جو ہماری آیتوں کا انکار کرتے ہیں اور ان سے تکبر کرکے اعراض کرتے ہیں وہ دوزخی ہیں وہ اس (دوزخ) میں ایک لمبا عرصہ پڑے رہیں گے۔"}, {"arabic": " فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا اَوۡ کَذَّبَ بِاٰیٰتِہٖ ؕ اُولٰٓئِکَ یَنَالُہُمۡ نَصِیۡبُہُمۡ مِّنَ الۡکِتٰبِ ؕ حَتّٰۤی اِذَا جَآءَتۡہُمۡ رُسُلُنَا یَتَوَفَّوۡنَہُمۡ ۙ قَالُوۡۤا اَیۡنَ مَا کُنۡتُمۡ تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ ؕ قَالُوۡا ضَلُّوۡا عَنَّا وَ شَہِدُوۡا عَلٰۤی اَنۡفُسِہِمۡ اَنَّہُمۡ کَانُوۡا کٰفِرِیۡنَ ﴿۳۸﴾", "english": " Who is, then, more unjust than he who forges a lie against Allah or gives the lie to His Signs? It is these who shall have their lot as ordained till when Our messengers shall visit them to take away their souls, they shall say, ‘Where is that which you used to call upon beside Allah?’ They will answer, ‘We cannot find them;’ and they will bear witness against themselves that they were disbelievers.", "french": " Qui donc est plus injuste que celui qui invente un mensonge contre Allāh, ou qui dément Ses Signes ? Ceux-là auront leur part qui a été prescrite, jusqu’au moment où Nos Messagers viennent à eux pour emporter leur âme, ils diront, « Où donc se trouve ce à quoi vous aviez l’habitude de faire appel à la place d’Allāh ? » Ils répondront : « Nous les avons complètement perdus. » Et ils porteront témoignage contre eux-mêmes qu’ils étaient mécréants.", "german": " Wer ist wohl frevelhafter als der; der eine Lüge wider Allah erdichtet oder Seine Zeichen der Lüge zeiht? Diesen soll das ihnen bestimmte Los werden, bis Unsere Boten zu ihnen kommen, ihnen den Tod zu bringen; sie werden sprechen: \"Wo ist nun das, was ihr statt Allah anzurufen pflegtet?\" Jene werden antworten: \"Wir können sie nicht finden\"; und sie werden gegen sich selbst Zeugnis ablegen, dass sie Ungläubige waren.", "spanish": " ¿Quién es, pues, más injusto que quien urde una mentira contra Al-lah o tacha de falsedades sus Signos? Son éstos quienes correrán la suerte que se les ordenó hasta que Nuestros Mensajeros los visiten, para llevarse sus almas, y digan: “¿En dónde está lo que solíais invocar aparte de Al-lah?”. Responderán: “están completamente perdidos para nosotros”; y serán testigos contra ellos mismos de haber sido incrédulos.", "urdu": " پس (بتاٶ کہ) اس سے زیادہ ظالم کون ہو سکتا ہے جو اللہ پر جھوٹ (بول کر) افترا کرتا ہو‘ یا جس نے اللہ کی آیتوں کی تکذیب کی ہو‘ ان لوگوں کو مقررہ سزا میں سے اپنا حصہ پہنچتا رہے گا یہاں تک کہ جب ان کے پاس ہمارے فرشتے ان کی جانیں نکالنے کے لئے آجائیں گے تو وہ کہیں گے کہ وہ (شریک) کہاں ہیں جن کو تم اللہ کے سوا پکارتے تھے‘ اس وقت یہ لوگ جواب دیں گے کہ وہ تو ہم سے غائب ہو گئے اور وہ اپنے آپ پر خود گواہی دیں گے کہ وہ منکروں میں شامل تھے۔"}, {"arabic": " قَالَ ادۡخُلُوۡا فِیۡۤ اُمَمٍ قَدۡ خَلَتۡ مِنۡ قَبۡلِکُمۡ مِّنَ الۡجِنِّ وَ الۡاِنۡسِ فِی النَّارِ ؕ کُلَّمَا دَخَلَتۡ اُمَّۃٌ لَّعَنَتۡ اُخۡتَہَا ؕ حَتّٰۤی اِذَا ادَّارَکُوۡا فِیۡہَا جَمِیۡعًا ۙ قَالَتۡ اُخۡرٰٮہُمۡ لِاُوۡلٰٮہُمۡ رَبَّنَا ہٰۤؤُلَآءِ اَضَلُّوۡنَا فَاٰتِہِمۡ عَذَابًا ضِعۡفًا مِّنَ النَّارِ ۬ؕ قَالَ لِکُلٍّ ضِعۡفٌ وَّ لٰکِنۡ لَّا تَعۡلَمُوۡنَ ﴿۳۹﴾", "english": " He will say, ‘Enter ye into the Fire among the nations of Jinn and men who passed away before you.’ Every time a people enters, it shall curse its sister (people) until, when they have all successively arrived therein, the last of them will say of the first of them: ‘Our Lord, these led us astray, so give them a double punishment of the Fire.’ He will say, ‘For each preceding party there shall be double punishment , but you do not know.’", "french": " Il dira : « Entrez dans le Feu parmi les peuples des djinns et des hommes qui vous ont devancés. » Toutes les fois qu’une nation y entrera, elle maudira sa nation sœur. Puis lorsque toutes les nations, les unes après les autres, y seront arrivées, la dernière dira de la première : « Notre Seigneur, voilà ceux qui nous ont égarés ; inflige-leur donc un double châtiment du Feu. » Il dira : « Pour chacune il y aura un double châtiment , mais vous ne savez pas. »", "german": " Er wird sprechen: \"Tretet ein in das Feuer zu den Scharen der Jinn und der Menschen, die vor euch dahingingen.\" Sooft eine Schar eintritt, wird sie ihre Schwesterschar verfluchen, bis endlich, wenn sie alle nacheinander darin angekommen sind, die letzten von den ersten sprechen werden: \"Unser Herr, diese da haben uns irregeführt, so gib ihnen die Pein des Feuers mehrfach.\" Er wird sprechen: \"Jeder hat mehrfach, allein ihr wisst es nicht.\"", "spanish": " Él dirá: “Entrad en el Fuego entre las naciones de yinn y hombres que murieron antes que vosotros”. Cada vez que una nación entre, maldecirá a su nación hermana, hasta que, cuando hayan llegado sucesivamente todas, la última de ellas diga de la primera: “¡Señor nuestro, éstos nos extraviaron, imponles pues un doble castigo del uego!” Él dirá: “para cada grupo precedente habrá un doble castigo, pero vosotros no lo sabéis”.", "urdu": " (تب اللہ ان سے) کہے گا جاٶ جاکر آگ میں ان امتوں کے ساتھ شامل ہو جاٶ جو تم سے پہلے جنوں اور انسانوں میں سے گزر چکی ہیں۔ جب کوئی قوم (آگ میں) داخل ہوگی تو (اپنے سے پہلی) بہن (یعنی قوم) کو لعنت کرے گی‘ یہاں تک کہ جب سب اس (آگ) میں داخل ہوچکیں گے تو ان میں سے آخری (داخل ہونے والی جماعت) اپنے سے پہلی کے متعلق کہے گی اے ہمارے رب ان لوگوں نے ہم کو گمراہ کیا۔ پس تو ان کو دوزخ میں کئی گنے زیادہ عذاب دے (اس پر وہ) فرمائے گا‘ سب کو ہی زیادہ عذاب مل رہا ہے لیکن تم جانتے نہیں۔"}, {"arabic": " وَ قَالَتۡ اُوۡلٰٮہُمۡ لِاُخۡرٰٮہُمۡ فَمَا کَانَ لَکُمۡ عَلَیۡنَا مِنۡ فَضۡلٍ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ تَکۡسِبُوۡنَ ﴿٪۴۰﴾", "english": " And the first of them will say to the last of them: ‘You have then no superiority over us; taste therefore the punishment for all that you did.’", "french": " Et la première dira à la dernière : « Vous n’avez donc aucune supériorité sur nous ; alors goûtez le châtiment pour ce que vous avez acquis. »", "german": " Und die ersten werden zu den letzten sagen: \"So hattet ihr denn keinen Vorzug vor uns; kostet also die Strafe für das, was ihr getan.\"", "spanish": " Mas los primeros de ellos dirán a los últimos: “No tenéis superioridad sobre nosotros; probad pues el castigo por todo lo que hicisteis”.", "urdu": " اور (اس پر) ان میں سے پہلی قوم اپنے سے پچھلی قوم کو کہے گی‘ تم کو ہم پر کوئی فضیلت نہیں تھی (کہ تم کو کم عذاب دیا جائے) پس تم اپنے اعمال کی وجہ سے عذاب چکھو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا وَ اسۡتَکۡبَرُوۡا عَنۡہَا لَا تُفَتَّحُ لَہُمۡ اَبۡوَابُ السَّمَآءِ وَ لَا یَدۡخُلُوۡنَ الۡجَنَّۃَ حَتّٰی یَلِجَ الۡجَمَلُ فِیۡ سَمِّ الۡخِیَاطِ ؕ وَ کَذٰلِکَ نَجۡزِی الۡمُجۡرِمِیۡنَ ﴿۴۱﴾", "english": " Those who reject Our Signs and turn away from them with disdain, the gates of the spiritual firmament will not be opened for them, nor will they enter Heaven until a camel goes through the eye of a needle. And thus do We requite the offenders.", "french": " Ceux qui rejettent Nos Signes et s’en détournent avec dédain, les portes du ciel ne s’ouvriront pas pour eux, et ils n’entreront pas non plus au Paradis avant qu’un chameau ne passe par le chas d’une aiguille. Et c’est ainsi que Nous payons les coupables.", "german": " Die Unsere Zeichen verwerfen und sich mit Verachtung von ihnen abwenden, denen werden die Pforten des Himmels nicht aufgemacht, noch werden sie in den Garten eingehen, ehe denn ein Kamel durch ein Nadelöhr geht. Also belohnen Wir die Missetäter.", "spanish": " A quienes rechazan Nuestros Signos y se apartan de ellos con desprecio no se les abrirán las puertas del cielo, ni entrarán en él mientras un camello no pase a través del ojo de una aguja. Y así premiamos a los pecadores.", "urdu": " وہ لوگ جنہوں نے ہماری آیتوں کو جھٹلایا ہے اور تکبر کرکے ان سے اعراض کیا ہے ان کے لئے آسمان کے دروازے نہیں کھولے جائیں گے اور وہ جنت میں داخل نہیں ہوں گے یہاں تک کہ اونٹ سوئی کے ناکہ میں داخل ہو اور ہم مجرموں کو اسی طرح جزا دیتے ہیں۔"}, {"arabic": " لَہُمۡ مِّنۡ جَہَنَّمَ مِہَادٌ وَّ مِنۡ فَوۡقِہِمۡ غَوَاشٍ ؕ وَ کَذٰلِکَ نَجۡزِی الظّٰلِمِیۡنَ ﴿۴۲﴾", "english": " They shall have a bed of Hell, and over them coverings of the same. And thus do We requite the unjust.", "french": " Ils auront l’Enfer pour lit, et sur eux des couvertures de ténèbres . Et c’est ainsi que nous payons les injustes.", "german": " Sie sollen die Hölle zum Pfuhl haben und als Decke über sich. Also belohnen Wir die Ungerechten.", "spanish": " Tendrán el Infierno por lecho y se taparán con cubiertas de lo mismo. Pues de este modo recompensamos al injusto.", "urdu": " (اور) ان کے لئے بچھونا بھی جہنم ہی سے ہوگا اور ان کے اوپر بھی اوڑھنے اس (جہنم) ہی میں سے ہوں گے اور اسی طرح ہم ظالموں کو جزا دیتے ہیں۔"}, {"arabic": " وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَا نُکَلِّفُ نَفۡسًا اِلَّا وُسۡعَہَاۤ ۫ اُولٰٓئِکَ اَصۡحٰبُ الۡجَنَّۃِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۴۳﴾", "english": " But as to those who believe and do good works — and We task not any soul beyond its capacity — these are the inmates of Heaven; they shall abide therein.", "french": " Mais ceux qui croient et qui font de bonnes œuvres – et Nous ne chargeons aucune âme au-delà de ses moyens – ceux-là seront les habitants du Paradis, et ils y demeureront éternellement.", "german": " Die aber, die glauben und gute Werke tun – Wir belasten keine Seele über ihr Vermögen –, sie sind die Bewohner des Himmels; darin sollen sie ewig weilen.", "spanish": " En cuanto a los que creen y hacen buenas obras – y no imponemos a nadie tarea alguna que supere su capacidad – éstos son los habitantes del Cielo; en él morarán.", "urdu": " اور جو لوگ ایمان لائے اور جنہوں نے نیک عمل کئے ہیں (ان کو یاد رہے کہ) ہم کسی جان پر اس کی طاقت سے زیادہ ذمہ داری نہیں ڈالتے۔ وہ (لوگ) جنت (میں داخل ہونے) والے ہیں (اور) اس میں ہمیشہ رہتے چلے جائیں گے۔"}, {"arabic": " وَ نَزَعۡنَا مَا فِیۡ صُدُوۡرِہِمۡ مِّنۡ غِلٍّ تَجۡرِیۡ مِنۡ تَحۡتِہِمُ الۡاَنۡہٰرُ ۚ وَ قَالُوا الۡحَمۡدُ لِلّٰہِ الَّذِیۡ ہَدٰٮنَا لِہٰذَا ۟ وَ مَا کُنَّا لِنَہۡتَدِیَ لَوۡ لَاۤ اَنۡ ہَدٰٮنَا اللّٰہُ ۚ لَقَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِالۡحَقِّ ؕ وَ نُوۡدُوۡۤا اَنۡ تِلۡکُمُ الۡجَنَّۃُ اُوۡرِثۡتُمُوۡہَا بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۴۴﴾", "english": " And We shall remove whatever rancour may be in their hearts. Beneath them shall flow rivers. And they shall say, ‘All praise belongs to Allah Who has guided us to this. And we could not have found guidance, if Allah had not guided us. The Messengers of our Lord did indeed bring the truth.’ And it shall be proclaimed unto them: ‘This is the Heaven which you have been given for an inheritance as a reward for what you used to do.’", "french": " Et Nous ôterons toute rancœur qu’ils pourraient avoir au cœur. Sous eux couleront des ruisseaux. Et ils diront : « Louange à Allāh, Qui nous a guidés vers ce Paradis. Et si Allāh ne nous avait pas guidés, nous n’aurions pas été guidés. Les Messagers de notre Seigneur ont assurément apporté la Vérité. » Et on leur proclamera : « Voici le Paradis qui vous a été donné en héritage, en récompense de ce que vous avait fait. »", "german": " Und Wir wollen alles hinwegräumen, was an Groll in ihren Herzen sein mag. Unter ihnen sollen Ströme fließen. Und sie werden sprechen: \"Aller Preis gehört Allah, Der uns zu diesem geleitet hat! Wir hätten nicht den Weg zu finden vermocht, hätte Allah uns nicht geleitet. Die Gesandten unseres Herrn haben in der Tat die Wahrheit gebracht.\" Und es soll ihnen zugerufen werden: \"Das ist der Himmel, der euch zum Erbe gegeben ward für das, was ihr gewirkt.\"", "spanish": " Retiraremos cualquier rencor que pueda haber en sus corazones. Por debajo de ellos correrán ríos. Y dirán: “toda alabanza corresponde a Al-lah quien nos ha guiado hasta aquí. Y no hubiéramos encontrado guía si Al-lah no nos hubiera encaminado. Los Mensajeros de Nuestro Señor trajeron verdaderamente la verdad”. Y se les proclamará: éste es el Cielo que se os ha dado por herencia como recompensa de lo que hicisteis”.", "urdu": " اور ہم ان جنتیوں کے سینے میں سے (ایک دوسرے کے متعلق) سب کدورت نکال پھینکیں گے اور نہریں ان کے قبضہ اور تصرف میں بہتی ہوں گی اور وہ کہیں گے سب تعریف کا اللہ ہی مستحق ہے جس نے ہم کو اس (بہشت) کا راستہ دکھایا اور اگر اللہ ہمیں اس کا راستہ نہ دکھاتا تو ہم کبھی بھی (اس کا) راستہ نہیں پا سکتے تھے۔ ہمارے رب کے رسول یقیناً سچ لیکر ہمارے پاس آئے تھے اور انہیں بلند آواز سے کہدیا جائے گا کہ یہ وہ جنت ہے جس کا تمہیں تمہارے اعمال کی وجہ سے وارث کیا گیا ہے۔"}, {"arabic": " وَ نَادٰۤی اَصۡحٰبُ الۡجَنَّۃِ اَصۡحٰبَ النَّارِ اَنۡ قَدۡ وَجَدۡنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَہَلۡ وَجَدۡتُّمۡ مَّا وَعَدَ رَبُّکُمۡ حَقًّا ؕ قَالُوۡا نَعَمۡ ۚ فَاَذَّنَ مُؤَذِّنٌۢ بَیۡنَہُمۡ اَنۡ لَّعۡنَۃُ اللّٰہِ عَلَی الظّٰلِمِیۡنَ ﴿ۙ۴۵﴾", "english": " And the inmates of Heaven will call out to the inmates of Hell: ‘We have indeed found what our Lord promised us to be true. Have you too found what your Lord promised you to be true?’ They shall say: ‘Yes’. Then a proclaimer shall proclaim between them saying , ‘The curse of Allah is on the wrongdoers —", "french": " Et les habitants du Paradis appelleront ceux de l’Enfer ainsi : « Nous avons assurément trouvé vrai ce que notre Seigneur nous avait promis. Avez-vous aussi trouvé vrai ce que votre Seigneur vous avait promis ? » Ils diront ; « Oui. » Ensuite, un crieur proclamera parmi eux : « Que la malédiction d’Allāh soit sur les personnes malfaisantes –", "german": " Und die Bewohner des Himmels werden den Bewohnern der Hölle zurufen: \"Seht, wir haben als Wahrheit gefunden, was unser Herr uns verhieß. Habt ihr auch als Wahrheit gefunden, was euer Herr verhieß?\" Jene werden sprechen: \"Ja.\" Dann wird ein Ausrufer zwischen ihnen rufen: \"Der Fluch Allahs über die Missetäter,</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:45&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:45&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic46\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic46\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:46' style='text-decoration:underline'>7:46</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(46)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control46\"></i></button> <audio id=\"player46\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">الَّذِیۡنَ یَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ وَ یَبۡغُوۡنَہَا عِوَجًا ۚ وَ ہُمۡ بِالۡاٰخِرَۃِ کٰفِرُوۡنَ ﴿ۘ۴۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Who turn <em>men </em>away from the path of Allah and seek to make it crooked, and who are disbelievers in the Hereafter.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_7_46_a' href='#'>a</a>]</sup>‘Who hinder <i>men </i>from the path of Allah and seek to make it crooked<sup class='ref'>[<a class='ref' data-id='ref_7_46_977' href='#'>977</a>]</sup> and who are disbelievers in the Hereafter.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_46_a'>a</span><span class='collapsible plus' data-id='ref_7_46_977'>977</span></div> <div><div class='reference' data-id='ref_7_46_a' style='display:none'> <p><b>a.</b> <a href='/quran/7:87' target=_blank>7:87</a>; <a href='/quran/11:20' target=_blank>11:20</a>; <a href='/quran/14:4' target=_blank>14:4</a>; <a href='/quran/16:89' target=_blank>16:89</a>. (<a href='javascript:void(0)' data-id='ref_7_46_a' class='ref'>close</a>)</p> </div> </div><div><a name='977'></a><div class='reference' data-id='ref_7_46_977' style='display:none'> <p><b>977.</b> The expression signifies that the wrongdoers desire to corrupt true religion. They are not only themselves wicked but also try to make others like themselves and even seek to distort and tamper with religious teaching. (<a href='javascript:void(0)' data-id='ref_7_46_977' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">جو اللہ کے راستے سے روکتے ہیں اور اسے ٹیڑھا (دیکھنا) چاہتے ہیں اور وہ آخرت کے منکر ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">جو اللہ کے راستہ سے (لوگوں کو) روکتے تھے اور اس راستہ میں کجی تلاش کرتے تھے اور وہ ساتھ ہی بعد میں آنے والی (زندگی) کے منکر تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Qui empêchent <em>les gens</em> de suivre la voie d’Allāh, et cherchent à la rendre tortueuse, et qui ne croient pas à l’au-delà. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Quienes apartan <em>a los hombres</em> del camino de Al-lah e intentan hacerlo tortuoso, y no creen en el Más Allá”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">die abhalten von Allahs Weg und ihn zu krümmen suchen und die nicht an das Jenseits glauben!\"", "spanish": " Y los moradores del Cielo gritarán a los del Infierno: “En verdad hemos comprobado que lo que Nuestro Señor nos prometió es cierto. ¿Habéis comprobado también ser cierta la promesa de vuestro Señor?”. llos dirán: “Sí”. Luego, un pregonero anunciará entre ellos, diciendo: “La maldición de Al-lah cae sobre los injustos”.", "urdu": " اور جنتی لوگ دوزخیوں سے کہیں گے کہ ہم سے ہمارے رب نے جو وعدہ کیا تھا اس کو تو ہم نے سچا پالیا‘ کیا تم نے بھی اس وعدہ کو جو تمہارے رب نے کیا تھا سچا پایا ہے اس پر (دوزخی) کہیں گے‘ ہاں! (ہاں) پس ایک پکارنے والا ان کے درمیان زور سے پکارے گا۔ کہ ان ظالموں پر خدا کی لعنت ہو۔"}, {"arabic": " وَ بَیۡنَہُمَا حِجَابٌ ۚ وَ عَلَی الۡاَعۡرَافِ رِجَالٌ یَّعۡرِفُوۡنَ کُلًّۢا بِسِیۡمٰہُمۡ ۚ وَ نَادَوۡا اَصۡحٰبَ الۡجَنَّۃِ اَنۡ سَلٰمٌ عَلَیۡکُمۡ ۟ لَمۡ یَدۡخُلُوۡہَا وَ ہُمۡ یَطۡمَعُوۡنَ ﴿۴۷﴾", "english": " And between the two there shall be a partition, and on the elevated places there shall be men who will know all by their marks. And they will call out to the people of Heaven: ‘Peace be on you.’ These will not have yet entered it although they will be hoping to do so.", "french": " Et entre les deux, il y aura une cloison, et sur les Lieux Elevés du Paradis se trouveront des hommes qui reconnaîtront tous à leurs marques et ils crieront aux habitants du Paradis : « La paix soit avec vous ! » Ceux-ci n’y seront pas encore entrés tout en espérant de le faire .", "german": " Und zwischen den zweien soll eine Trennung sein; und in den Höhen sind Leute, die alle an ihren Merkmalen erkennen werden. Sie werden der Schar des Himmels zurufen: \"Friede sei über euch!\" Diese sind (noch) nicht in den Himmel eingegangen, obwohl sie es erhoffen.", "spanish": " Entre ambos habrá un muro, y en los lugares elevados habrá hombres que conocerán a todos por sus marcas. Y gritarán a los hombres del Cielo: “la paz sea con vosotros”. Éstos aún no habrán entrado en él, aunque tendrán la esperanza de hacerlo.", "urdu": " اور ان دونوں (یعنی دوزخیوں اور جنتیوں) میں ایک روک ہوگی اور اعراف پر کچھ لوگ ہوں گے جو کہ سب کو ان کے چہروں کی نشانیوں سے پہچانتے ہوں گے اور وہ جنتیوں کو (دیکھ کر) پکاریں گے (اور کہیں گے) تم پر سلامتی ہو‘ وہ (مخاطب جنتی عملاً) ابھی جنت میں داخل نہ ہوئے ہوں گے لیکن جنت میں جانے کی توقع رکھتے ہوں گے۔"}, {"arabic": " وَ اِذَا صُرِفَتۡ اَبۡصَارُہُمۡ تِلۡقَآءَ اَصۡحٰبِ النَّارِ ۙ قَالُوۡا رَبَّنَا لَا تَجۡعَلۡنَا مَعَ الۡقَوۡمِ الظّٰلِمِیۡنَ ﴿٪۴۸﴾", "english": " And when their eyes are turned towards the people of the Fire, they will say, ‘Our Lord, put us not with the unjust people.’", "french": " Et lorsque leurs yeux se tourneront vers les habitants du Feu, ils diront : « Notre Seigneur, ne nous mets pas avec les personnes malfaisantes. »", "german": " Und wenn ihre Blicke sich den Bewohnern des Feuers zuwenden, sagen sie: \"Unser Herr, mache uns nicht zum Volk der Frevler.\"", "spanish": " Mas cuando sus miradas se dirijan hacia los hombres del Fuego, dirán: “Señor nuestro, no nos coloques entre las gentes injustas”.", "urdu": " اور جب ان (جنتیوں) کی نظریں دوزخیوں کی طرف پھرائی جائیں گی تو وہ کہیں گے‘ اے ہمارے رب! ہم کو ظالم قوم میں سے مت بنائیو!"}, {"arabic": " وَ نَادٰۤی اَصۡحٰبُ الۡاَعۡرَافِ رِجَالًا یَّعۡرِفُوۡنَہُمۡ بِسِیۡمٰہُمۡ قَالُوۡا مَاۤ اَغۡنٰی عَنۡکُمۡ جَمۡعُکُمۡ وَ مَا کُنۡتُمۡ تَسۡتَکۡبِرُوۡنَ ﴿۴۹﴾", "english": " And the occupants of the elevated places will call out to men whom they will know by their marks, and say, “Your multitude availed you not, nor your arrogance.", "french": " Et les occupants des Lieux Elevés interpelleront certains hommes qu’ils reconnaîtront à leurs marques et ils diront : « Ni votre multitude ni votre arrogance ne vous ont profité.", "german": " Und die in den Höhen werden den Leuten, die sie an ihren Merkmalen erkennen, zurufen (und) sprechen: \"Nichts hat euch eure Menge gefruchtet, noch eure Hoffart.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:49&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:49&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic50\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic50\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:50' style='text-decoration:underline'>7:50</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(50)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control50\"></i></button> <audio id=\"player50\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اَہٰۤؤُلَآءِ الَّذِیۡنَ اَقۡسَمۡتُمۡ لَا یَنَالُہُمُ اللّٰہُ بِرَحۡمَۃٍ ؕ اُدۡخُلُوا الۡجَنَّۃَ لَا خَوۡفٌ عَلَیۡکُمۡ وَ لَاۤ اَنۡتُمۡ تَحۡزَنُوۡنَ ﴿۵۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">“Are these the men about whom you swore that Allah would not extend mercy to them? <I>To them it has been said</I>, ‘Enter Paradise; no fear <em>shall come </em>upon you, nor shall you grieve.’”</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_7_50_b' href='#'>b</a>]</sup>‘Are these<sup class='ref'>[<a class='ref' data-id='ref_7_50_981' href='#'>981</a>]</sup> the men about whom you swore that Allah would not extend mercy to them?’ <i>To them God </i>will say, ‘Enter Paradise; no fear <i>shall come </i>upon you, nor shall you grieve.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_50_b'>b</span><span class='collapsible plus' data-id='ref_7_50_981'>981</span></div> <div><div class='reference' data-id='ref_7_50_b' style='display:none'> <p><b>b.</b> <a href='/quran/23:111' target=_blank>23:111</a>. (<a href='javascript:void(0)' data-id='ref_7_50_b' class='ref'>close</a>)</p> </div> </div><div><a name='981'></a><div class='reference' data-id='ref_7_50_981' style='display:none'> <p><b>981.</b> The reference in the word \"these\" is to the would-be inmates of Heaven. The Prophets will address the inmates of Hell and tell them to look at the would-be inmates of Heaven––the poor believers whom they ridiculed and looked down upon and then will ask them, \"Are these the men about whom you swore that Allah would not extend mercy to them?\" (<a href='javascript:void(0)' data-id='ref_7_50_981' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا یہی وہ لوگ ہیں کہ جن کے متعلق تم قسمیں کھایا کرتے تھے کہ اللہ ان پر رحم نہیں کرے گا۔ (اے مومنو!) جنت میں داخل ہو جاؤ تم پر کوئی خوف نہیں ہوگا اور نہ تم کبھی غمگین ہوگے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(پھر جنتیوں کی طرف اشارہ کرکے دوزخیوں سے کہیں گے کہ) کیا یہ وہی لوگ ہیں جن کے متعلق تم قسمیں کھا کر کہا کرتے تھے کہ اللہ کبھی ان سے رحمت کا معاملہ نہیں کرے گا۔ (پھر ان جنتی لوگوں کو جو جنت میں داخل ہونے کے انتظار میں کھڑے ہوں گے اللہ کہے گا کہ) جاٶ تم جنت میں داخل ہو جاٶ۔ نہ تو تم کو (آئندہ کے متعلق) کوئی خوف لاحق ہوگا اور نہ تمہیں ماضی کا کوئی واقعہ ملول کرے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Sont-ce là ceux à propos de qui vous aviez juré qu’Allāh ne voudrait pas étendre sur eux <em>Sa</em> miséricorde ? »<em> Allāh leur dira</em> : « Entrez au Paradis ; vous n’aurez aucune crainte, ni vous ne serez désolés. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Son éstos los hombres de quienes jurasteis que Al-lah no les concedería Su misericordia?”. A ellos se les ha dicho: “Entrad en el Paraíso; ningún temor os <em>sobrecogerá,</em> ni seréis afligidos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Sind das jene, von denen ihr schwuret, Allah würde ihnen nicht Barmherzigkeit erweisen?\" Gehet ein in das Paradies; keine Furcht soll über euch kommen, noch sollet ihr trauern.", "spanish": " Y los ocupantes de los lugares elevados gritarán a los hombres a quienes conocerán por sus marcas; y dirán: “vuestra muchedumbre no os ha servido de nada, ni tampoco vuestra arrogancia”.", "urdu": " اور اعراف والے لوگ کچھ (دوزخی) لوگوں کو جنہیں وہ ان کے چہرہ کے نشانوں سے پہچانتے تھے کہیں گے کہ نہ تمہاری تعداد نے تم کو کوئی فائدہ پہنچایا۔ اور نہ ہی (تمہارے ان دعووں نے) جن کی بنا پر تم تکبر کرتے تھے۔"}, {"arabic": " اَہٰۤؤُلَآءِ الَّذِیۡنَ اَقۡسَمۡتُمۡ لَا یَنَالُہُمُ اللّٰہُ بِرَحۡمَۃٍ ؕ اُدۡخُلُوا الۡجَنَّۃَ لَا خَوۡفٌ عَلَیۡکُمۡ وَ لَاۤ اَنۡتُمۡ تَحۡزَنُوۡنَ ﴿۵۰﴾", "english": " “Are these the men about whom you swore that Allah would not extend mercy to them? To them it has been said , ‘Enter Paradise; no fear shall come upon you, nor shall you grieve.’”", "french": " Sont-ce là ceux à propos de qui vous aviez juré qu’Allāh ne voudrait pas étendre sur eux Sa miséricorde ? » Allāh leur dira : « Entrez au Paradis ; vous n’aurez aucune crainte, ni vous ne serez désolés. »", "german": " Sind das jene, von denen ihr schwuret, Allah würde ihnen nicht Barmherzigkeit erweisen?\" Gehet ein in das Paradies; keine Furcht soll über euch kommen, noch sollet ihr trauern.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:50&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:50&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic51\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic51\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:51' style='text-decoration:underline'>7:51</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(51)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control51\"></i></button> <audio id=\"player51\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ نَادٰۤی اَصۡحٰبُ النَّارِ اَصۡحٰبَ الۡجَنَّۃِ اَنۡ اَفِیۡضُوۡا عَلَیۡنَا مِنَ الۡمَآءِ اَوۡ مِمَّا رَزَقَکُمُ اللّٰہُ ؕ قَالُوۡۤا اِنَّ اللّٰہَ حَرَّمَہُمَا عَلَی الۡکٰفِرِیۡنَ ﴿ۙ۵۱﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And the inmates of the Fire will call out to the inmates of Heaven, ‘Pour out on us some water or some of that which Allah has provided for you.’ They will say, ‘Verily, Allah has forbidden them both to disbelievers — </span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And the inmates of the Fire will call out to the inmates of Heaven, ‘Pour out on us some water or some of that which Allah has provided for you.’ They will say, ‘Verily, Allah has forbidden them both to disbelievers, </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اہلِ نار اہلِ جنت کو آواز دیں گے کہ اس پانی میں سے ہمیں بھی کچھ عطا کرو یا اس رزق میں سے جو اللہ نے تمہیں عطا کیا ہے۔ وہ جواب دیں گے یقیناً اللہ نے یہ دونوں کافروں پر حرام کر دیئے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور دوزخی لوگ جنتیوں کی طرف مخاطب ہو کر کہیں گے کہ ذرا کچھ پانی ہماری طرف بھی پھینکو یا جو کچھ تمہیں اللہ نے دیا ہے‘ اس میں سے ہمیں بھی کچھ دو (اس پر جنتی) کہیں گے اللہ نے یہ دونوں چیزیں کافروں پر حرام کر دی ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et les habitants du Feu crieront aux habitants du Paradis : « Versez sur nous un peu d’eau ou <em>donnez-nous</em> un peu de la provision qu'Allāh vous a accordée. » Ils répondront : « En vérité, Allāh a interdit les deux aux mécréants –</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y los moradores del Fuego gritarán a los moradores del Cielo: “Verted sobre nosotros un poco de agua o algo de lo que Al-lah os ha proporcionado”. Responderán: “En verdad, Al-lah ha prohibido ambas cosas a los incrédulos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und die Bewohner des Feuers werden den Bewohnern des Himmels zurufen: \"Schüttet etwas Wasser auf uns aus oder etwas von dem, was Allah euch gegeben hat.\" Sie werden sprechen: \"Fürwahr, Allah hat beides verwehrt für die Ungläubigen,", "spanish": " “¿Son éstos los hombres de quienes jurasteis que Al-lah no les concedería Su misericordia?”. A ellos se les ha dicho: “Entrad en el Paraíso; ningún temor os sobrecogerá, ni seréis afligidos”.", "urdu": " (پھر جنتیوں کی طرف اشارہ کرکے دوزخیوں سے کہیں گے کہ) کیا یہ وہی لوگ ہیں جن کے متعلق تم قسمیں کھا کر کہا کرتے تھے کہ اللہ کبھی ان سے رحمت کا معاملہ نہیں کرے گا۔ (پھر ان جنتی لوگوں کو جو جنت میں داخل ہونے کے انتظار میں کھڑے ہوں گے اللہ کہے گا کہ) جاٶ تم جنت میں داخل ہو جاٶ۔ نہ تو تم کو (آئندہ کے متعلق) کوئی خوف لاحق ہوگا اور نہ تمہیں ماضی کا کوئی واقعہ ملول کرے گا۔"}, {"arabic": " الَّذِیۡنَ اتَّخَذُوۡا دِیۡنَہُمۡ لَہۡوًا وَّ لَعِبًا وَّ غَرَّتۡہُمُ الۡحَیٰوۃُ الدُّنۡیَا ۚ فَالۡیَوۡمَ نَنۡسٰہُمۡ کَمَا نَسُوۡا لِقَآءَ یَوۡمِہِمۡ ہٰذَا ۙ وَ مَا کَانُوۡا بِاٰیٰتِنَا یَجۡحَدُوۡنَ ﴿۵۲﴾", "english": " ‘Those who took their religion for a pastime and a sport, and whom the life of the world beguiled.’ This day, then, shall We forget them as they forgot the meeting of this day of theirs, and as they used to deny Our Signs.", "french": " Ceux qui prirent leur religion pour un amusement et un jeu, et qui furent trompés par la vie terrestre. »Donc aujourd’hui, Nous les oublierons, tout comme ils oublièrent la rencontre de leur jour que voici et tout comme ils reniaient Nos Signes.", "german": "", "spanish": " “Quienes tomaron su religión como juego y pasatiempo, y fueron seducidos por la vida de este mundo”. Este día, pues, los olvidaremos como ellos olvidaron el encuentro de este día suyo, y por negar Nuestros Signos.", "urdu": " (ایسے کافر) جنہوں نے اپنے دین کو ہنسی اور کھیل بنا رکھا تھا اور دنیوی زندگی نے انہیں دھوکا میں ڈال رکھا تھا پس آج (خدا ان سے کہتا ہے کہ) ہم بھی ان کو چھوڑ دیں گے جس طرح انہوں نے اپنے اس دن کے ملنے (کے خیال) کو بالکل چھوڑ رکھا تھا‘ اور بوجہ اس کے کہ وہ ہماری آیتوں کا بضد انکار کرتے تھے۔"}, {"arabic": " وَ لَقَدۡ جِئۡنٰہُمۡ بِکِتٰبٍ فَصَّلۡنٰہُ عَلٰی عِلۡمٍ ہُدًی وَّ رَحۡمَۃً لِّقَوۡمٍ یُّؤۡمِنُوۡنَ ﴿۵۳﴾", "english": " And surely We have brought them a Book which We have expounded with knowledge, a guidance and a mercy for a people who believe.", "french": " Et assurément, Nous leur avons apporté un Livre que Nous avons expliqué avec connaissance, comme une gouverne et une miséricorde pour un peuple qui croit.", "german": " Und fürwahr, Wir haben ihnen ein Buch gebracht, das Wir mit Wissen darlegten, als eine Richtschnur und eine Barmherzigkeit für Leute, die da glauben.", "spanish": " Ciertamente les trajimos un Libro que les expusimos con conocimiento; una guía y una misericordia para las gentes que creen.", "urdu": " اور ہم نے ان کو ایک عظیم الشان کتاب دی ہے جسے ہم نے علم کی بنا پر خوب کھول کر بیان کیا ہے (اس حال میں کہ) وہ مومن لوگوں کے لئے ہدایت اور رحمت ہے۔"}, {"arabic": " ہَلۡ یَنۡظُرُوۡنَ اِلَّا تَاۡوِیۡلَہٗ ؕ یَوۡمَ یَاۡتِیۡ تَاۡوِیۡلُہٗ یَقُوۡلُ الَّذِیۡنَ نَسُوۡہُ مِنۡ قَبۡلُ قَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِالۡحَقِّ ۚ فَہَلۡ لَّنَا مِنۡ شُفَعَآءَ فَیَشۡفَعُوۡا لَنَاۤ اَوۡ نُرَدُّ فَنَعۡمَلَ غَیۡرَ الَّذِیۡ کُنَّا نَعۡمَلُ ؕ قَدۡ خَسِرُوۡۤا اَنۡفُسَہُمۡ وَ ضَلَّ عَنۡہُمۡ مَّا کَانُوۡا یَفۡتَرُوۡنَ ﴿٪۵۴﴾", "english": " Do they wait only for the fulfilment of warnings thereof? On the day when the fulfilment thereof shall come, those who had forgotten it before shall say, ‘The Messengers of our Lord did indeed bring the truth. Have we then any intercessors to intercede for us? Or could we be sent back so that we might do deeds other than that which we used to do?’ They have indeed ruined their souls and that which they used to fabricate has failed them.", "french": " N’attendent-ils que l’accomplissement des avertissements qui s’y trouvent ? Au jour où l’accomplissement aura lieu, ceux qui l’avaient oublié auparavant diront : « Les Messagers de notre Seigneur ont bien apporté la vérité. Aurons-nous des médiateurs pour intercéder en notre faveur ? Où pourrons-nous être renvoyés sur la terre afin que nous fassions des œuvres autres que celles que nous faisions ? » Ils ont causé leur propre perte et ce qu’ils inventaient ne leur a été d’aucun recours.", "german": " Warten sie auf etwas denn seine Erfüllung? An dem Tage, da seine Erfüllung kommt, werden jene, die es vordem vergessen hatten, sagen: \"Die Gesandten unseres Herrn haben in der Tat die Wahrheit gebracht. Haben wir wohl Fürsprecher, die für uns Fürsprache einlegen? Oder könnten wir zurückgeschickt werden, auf dass wir anderes tun möchten, als wir zu tun pflegten?\" Sie haben ihre Seelen zugrunde gerichtet, und das, was sie zu erdichten gewohnt waren, hat sie im Stich gelassen.", "spanish": " ¿Esperan acaso sólo el cumplimiento de sus advertencias? El día en el que venga su cumplimiento, los que lo hayan olvidado dirán: “En verdad los Mensajeros de Nuestro Señor trajeron la verdad. ¿Tendremos algún mediador que interceda por nosotros? O ¿no podríamos ser devueltos para que realizáramos acciones distintas a las que hicimos?”. En verdad han arruinado sus almas y lo que maquinaron les ha fallado.", "urdu": " کیا (آج) یہ لوگ اس کتاب کی (مذکورہ باتوں کی) حقیقت (کے کھلنے) کا انتظار کر رہے ہیں جس دن اس کی حقیقت واضح ہو جائے گی۔ وہ لوگ جنہوں نے (اس سے) پہلے اس کو ترک کر دیا تھا‘ کہیں گے ہمارے رب کے رسول جو کچھ کہتے تھے سچ کہتے تھے پس کیا ہمارے کوئی شفیع ہیں جو ہماری شفاعت کریں یا (کیا ممکن ہے کہ) ہمیں پھر دنیا میں لوٹا دیا جائے تو ہم جو کچھ (برے) عمل کرتے تھے ان کی جگہ دوسرے (نیک) عمل کرنے لگ جائیں وہ لوگ (جن کا اوپر ذکر ہو چکا ہے) یقیناً گھاٹے میں پڑ گئے ہیں (اور اپنی جانوں کو بھی انہوں نے گھاٹے میں ڈال دیا) اور جو باتیں وہ اپنے دل سے بنا کر کہا کرتے تھے (آج) ان سے کھوئی گئیں۔"}, {"arabic": " اِنَّ رَبَّکُمُ اللّٰہُ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ فِیۡ سِتَّۃِ اَیَّامٍ ثُمَّ اسۡتَوٰی عَلَی الۡعَرۡشِ ۟ یُغۡشِی الَّیۡلَ النَّہَارَ یَطۡلُبُہٗ حَثِیۡثًا ۙ وَّ الشَّمۡسَ وَ الۡقَمَرَ وَ النُّجُوۡمَ مُسَخَّرٰتٍۭ بِاَمۡرِہٖ ؕ اَلَا لَہُ الۡخَلۡقُ وَ الۡاَمۡرُ ؕ تَبٰرَکَ اللّٰہُ رَبُّ الۡعٰلَمِیۡنَ ﴿۵۵﴾", "english": " Surely, your Lord is Allah Who created the heavens and the earth in six periods; then He settled Himself on the Throne. He makes the night cover the day, which pursues it swiftly. And He created the sun and the moon and the stars, all made subservient by His command. Verily, His is the creation and the command. Blessed is Allah, the Lord of the worlds.", "french": " Assurément votre Seigneur est Allāh, Qui a créé les cieux et la terre en six périodes ; ensuite Il S’est établi sur le Trône. Il fait la nuit couvrir le jour, qu’elle poursuit rapidement . Et Il a créé le soleil et la lune et les astres, tous subordonnés à Ses commandements. Attention ! C’est à Lui qu’appartiennent la création et le commandement. Béni est Allāh, le Seigneur des mondes.", "german": " Siehe, euer Herr ist Allah, Der in sechs Zeiten die Himmel und die Erde erschuf; dann setzte Er Sich auf den Thron. Er lässt die Nacht den Tag verhüllen, der ihr eilends folgt. Und (erschuf) die Sonne und den Mond und die Sterne, Seinem Gesetz dienstbar. Wahrlich, Sein ist die Schöpfung und das Gesetz! Segensreich ist Allah, der Herr der Welten.", "spanish": " En verdad vuestro Señor es Al-lah, Quien creó los cielos y la tierra en seis períodos; a continuación se instaló en el Trono. Él hace que la noche cubra al día, que la sigue rápidamente. Y Él creó el sol, la luna y las estrellas todos ellos sometidos a Su mandato. Suyos son, en verdad, la creación y el mandato. ¡Bendito sea Al-lah, el Señor de los mundos!", "urdu": " تمہارا رب یقیناً اللہ ہے جس نے آسمانوں اور زمین کو چھ وقتوں میں پیدا کیا ہے پھر (اس کے بعد) وہ (حکومت کے) تخت پر مضبوطی سے قائم ہو گیا وہ رات کو دن پر ڈھانکتا ہے‘ جو اسے جلدی سے پکڑنا چاہتی ہے اور سورج کو اور چاند کو اور ستاروں کو اس نے اس طرح پیدا کیا ہے کہ وہ سب اس کے حکم کے ماتحت (بغیر کسی تنخواہ کے انسان کے) کام کر رہے ہیں۔ سنو‘ پیدا کرنا بھی اسی کا کام ہے‘ اور قانون بنانا بھی (اسی کا کام ہے) اللہ بہت برکت والا ہے جو سارے جہانوں کا رب ہے۔"}, {"arabic": " اُدۡعُوۡا رَبَّکُمۡ تَضَرُّعًا وَّ خُفۡیَۃً ؕ اِنَّہٗ لَا یُحِبُّ الۡمُعۡتَدِیۡنَ ﴿ۚ۵۶﴾", "english": " Call upon your Lord in humility and in secret. Surely, He does not love the transgressors.", "french": " Invoquez votre Seigneur avec humilité et en secret. Assurément, Il n’aime pas les transgresseurs.", "german": " Rufet zu eurem Herrn in Demut und im verborgenen. Wahrlich, Er liebt die Übertreter nicht.", "spanish": " Invocad a vuestro Señor con humildad y en secreto. En verdad, Él no ama a los transgresores.", "urdu": " تم اپنے رب کو گڑگڑا کر بھی اور چپکے چپکے بھی پکارو‘ یقیناً وہ حد سے گزرنے والوں کو پسند نہیں کرتا۔"}, {"arabic": " وَ لَا تُفۡسِدُوۡا فِی الۡاَرۡضِ بَعۡدَ اِصۡلَاحِہَا وَ ادۡعُوۡہُ خَوۡفًا وَّ طَمَعًا ؕ اِنَّ رَحۡمَتَ اللّٰہِ قَرِیۡبٌ مِّنَ الۡمُحۡسِنِیۡنَ ﴿۵۷﴾", "english": " And create not disorder in the earth after it has been set in order, and call upon Him in fear and hope. Surely, the mercy of Allah is nigh unto those who do good.", "french": " Et ne fomentez pas le désordre sur la terre après qu’elle aura été mise en ordre, et invoquez-Le avec crainte et espoir. Assurément, la miséricorde d’Allāh est proche de ceux qui font le bien.", "german": " Und stiftet nicht Unfrieden auf Erden, nach ihrer Befriedung, und rufet Ihn an in Furcht und Hoffnung. Wahrlich, Allahs Barmherzigkeit ist nahe denen, die Gutes tun.", "spanish": " Y no creéis el desorden en la tierra después de haber sido puesta en orden; mas invocadle en el temor y en la esperanza. En verdad, la misericordia de Al-lah está cerca de quienes hacen el bien.", "urdu": " اور زمین میں اس کی اصلاح کے بعد فساد نہ کرو اور اس (خدا) کو خوف اور طمع کے ساتھ پکارو‘ اللہ کی رحمت یقیناً محسنوں کے قریب ہے۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ یُرۡسِلُ الرِّیٰحَ بُشۡرًۢا بَیۡنَ یَدَیۡ رَحۡمَتِہٖ ؕ حَتّٰۤی اِذَاۤ اَقَلَّتۡ سَحَابًا ثِقَالًا سُقۡنٰہُ لِبَلَدٍ مَّیِّتٍ فَاَنۡزَلۡنَا بِہِ الۡمَآءَ فَاَخۡرَجۡنَا بِہٖ مِنۡ کُلِّ الثَّمَرٰتِ ؕ کَذٰلِکَ نُخۡرِجُ الۡمَوۡتٰی لَعَلَّکُمۡ تَذَکَّرُوۡنَ ﴿۵۸﴾", "english": " And He it is Who sends the winds as glad tidings before His mercy, till, when they bear a heavy cloud, We drive it to a dead land, then We send down water therefrom, and We bring forth therewith fruits of every kind. In like manner do We bring forth the dead that you may remember.", "french": " Et c’est Lui Qui envoie les vents comme avant-coureurs de Sa miséricorde, jusqu’à ce qu’ils apportent un nuage tout chargé de pluie . Nous le dirigeons vers une terre desséchée ; puis Nous en faisons descendre de l’eau, et par ce moyen, Nous produisons des fruits de toutes variétés. De la même manière, Nous ferons sortir les morts, pour que vous vous souveniez.", "german": " Er ist es, Der Seiner Barmherzigkeit die Winde als frohe Botschaft voraussendet, bis dass, wenn sie eine schwere Wolke tragen, Wir sie zu einem toten Lande treiben; dann lassen Wir aus ihr Wasser niederregnen und bringen damit Früchte hervor von jeglicher Art. Also bringen Wir auch die Toten hervor, auf dass ihr dessen eingedenk sein möchtet.", "spanish": " Pues Él es Quien envía los vientos como buena nueva por delante de Su misericordia, hasta que, cuando llevan una nube pesada, la llevamos a un territorio árido, después hacemos que descarguen el agua y producimos en ella toda clase de frutos. De igual manera devolvemos la vida a los muertos, para que recordéis.", "urdu": " اور وہی ہے جو ہواٶں کو اپنی رحمت سے پہلے خوش خبری دینے کے لئے بھیجتا ہے یہاں تک کہ جب وہ بوجھل بادلوں کو اٹھالیتی ہیں ہم ان کو ایک مردہ ملک کی طرف چلا کر لے جاتے ہیں پھر ہم ان میں سے پانی اتارتے ہیں پھر ہم اس پانی کے ذریعہ سے ہر قسم کے پھل پیدا کرتے ہیں۔ اسی طرح ہم مردوں کو نکالا کرتے ہیں تا کہ تم نصیحت حاصل کرو۔"}, {"arabic": " وَ الۡبَلَدُ الطَّیِّبُ یَخۡرُجُ نَبَاتُہٗ بِاِذۡنِ رَبِّہٖ ۚ وَ الَّذِیۡ خَبُثَ لَا یَخۡرُجُ اِلَّا نَکِدًا ؕ کَذٰلِکَ نُصَرِّفُ الۡاٰیٰتِ لِقَوۡمٍ یَّشۡکُرُوۡنَ ﴿٪۵۹﴾", "english": " And as for the good land, its vegetation comes forth plentifully by the command of its Lord; and that which is bad, its vegetation does not come forth but scantily. In like manner do We vary the Signs for a people who are grateful.", "french": " Et quant à la bonne terre, sa végétation pousse en abondance selon le commandement de son Seigneur ; et quant à la mauvaise, rien n’en sort sauf ce qui est sans valeur. De la même manière, Nous varions les Signes pour un peuple qui est reconnaissant.", "german": " Und das gute Land – seine Pflanzen sprießen hervor nach dem Gebot seines Herrn; das aber schlecht ist, (seine Pflanzen) sprießen nur kümmerlich. Also wenden und wenden Wir die Zeichen für Leute, die dankbar sind.", "spanish": " Y en cuanto a la buena tierra, su vegetación brota en abundancia por mandato de su Señor; pero si es mala, su vegetación sólo produce cosas carentes de valor. De la misma manera variamos los Signos para la gente que es agradecida.", "urdu": " اور اچھا ملک (جس کی مٹی عمدہ ہو) اس کی روئیدگی اپنے رب کے حکم سے نکلتی ہے اور وہ (ملک) جس کی مٹی خراب ہو اس کی پیداوار ردی ہی نکلتی ہے اس طرح ہم شکر گذار قوم کے لئے (اپنے) نشانات کو کھول کر بیان کرتے ہیں۔"}, {"arabic": " لَقَدۡ اَرۡسَلۡنَا نُوۡحًا اِلٰی قَوۡمِہٖ فَقَالَ یٰقَوۡمِ اعۡبُدُوا اللّٰہَ مَا لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرُہٗ ؕ اِنِّیۡۤ اَخَافُ عَلَیۡکُمۡ عَذَابَ یَوۡمٍ عَظِیۡمٍ ﴿۶۰﴾", "english": " We sent Noah to his people and he said, ‘O my people, worship Allah, you have no other God but Him. Indeed, I fear for you the punishment of the great day.’", "french": " En vérité, Nous avons envoyé Noé à son peuple et il dit : « Ô mon peuple, adorez Allāh ; vous n’avez pas d’autre dieu que Lui. En vérité, je crains pour vous le châtiment d’un Jour Énorme. »", "german": " Wir entsandten Noah zu seinem Volk und er sprach: \"O mein Volk, dienet Allah; ihr habt keinen anderen Gott als Ihn. Wahrlich, ich fürchte für euch die Strafe des Großen Tags.\"", "spanish": " Enviamos a Noé a su pueblo y dijo: “¡Oh, pueblo mío! Adorad a Al-lah, no tenéis otro Dios sino Él. En verdad, temo para vosotros el castigo del gran día”.", "urdu": " ہم ضرور نوح کو رسول بنا کر اس کی قوم کی طرف بھیج چکے ہیں پھر (جب وہ ان کے پاس آیا تو) اس نے کہا‘ اے میری قوم! اللہ کی عبادت کرو‘ اس کے سوا تمہارا کوئی معبود نہیں میں تم پر بڑے دن کے عذاب کے نازل ہونے سے ڈرتا ہوں۔"}, {"arabic": " قَالَ الۡمَلَاُ مِنۡ قَوۡمِہٖۤ اِنَّا لَنَرٰٮکَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۶۱﴾", "english": " The chiefs of his people said, ‘Surely, we see thee to be in manifest error.’", "french": " Les chefs de son peuple dirent. « Nous te voyons assurément dans une erreur manifeste. »", "german": " Es sprachen die Häupter seines Volks: \"Wahrlich, wir sehen dich in offenkundigem Irrtum.\"", "spanish": " Los jefes de su pueblo respondieron: “Ciertamente te vemos en un error evidente”.", "urdu": " اس کی قوم کے بڑے لوگوں نے کہا اے نوح! ہم تجھ کو کھلی گمراہی میں (مبتلا) دیکھتے ہیں۔"}, {"arabic": " قَالَ یٰقَوۡمِ لَیۡسَ بِیۡ ضَلٰلَۃٌ وَّ لٰکِنِّیۡ رَسُوۡلٌ مِّنۡ رَّبِّ الۡعٰلَمِیۡنَ ﴿۶۲﴾", "english": " He said, ‘O my people, there is no error in me, but I am a Messenger from the Lord of the worlds.", "french": " Il dit : « Ô mon peuple, il n’y a pas d’erreur en moi ; mais je suis un Messager du Seigneur des mondes.", "german": "", "spanish": " Él dijo: “¡Oh, pueblo mío! no hay error en mí, pues soy Mensajero del Señor de los mundos”.", "urdu": " (تب) اس (یعنی نوح) نے کہا‘ اے میری قوم! مجھ میں تو کوئی گمراہی (کی بات) نہیں پائی جاتی‘ بلکہ میں تمام جہانوں کے رب کی طرف سے رسول (ہوکر آیا) ہوں۔"}, {"arabic": " اُبَلِّغُکُمۡ رِسٰلٰتِ رَبِّیۡ وَ اَنۡصَحُ لَکُمۡ وَ اَعۡلَمُ مِنَ اللّٰہِ مَا لَا تَعۡلَمُوۡنَ ﴿۶۳﴾", "english": " ‘I deliver to you the messages of my Lord and give you sincere advice, and I know from Allah what you do not know.", "french": " Je vous transmets les Messages de mon Seigneur et je vous donne des conseils sincères, et je sais par Allāh ce que vous ne savez pas.", "german": " Ich überbringe euch die Botschaften meines Herrn und gebe euch aufrichtigen Rat, und ich weiß durch Allah, was ihr nicht wisset.", "spanish": " Os transmito los mensajes de mi Señor y os doy mi más sincero consejo, ya que sé por Al-lah lo que vosotros no sabéis.", "urdu": " (اور) تمہیں اپنے رب کے پیغام پہنچاتا ہوں اور تمہاری خیر خواہی کرتا ہوں اور اللہ کے دئے ہوئے علم سے وہ کچھ جانتا ہوں جو تم نہیں جانتے۔"}, {"arabic": " اَوَ عَجِبۡتُمۡ اَنۡ جَآءَکُمۡ ذِکۡرٌ مِّنۡ رَّبِّکُمۡ عَلٰی رَجُلٍ مِّنۡکُمۡ لِیُنۡذِرَکُمۡ وَ لِتَتَّقُوۡا وَ لَعَلَّکُمۡ تُرۡحَمُوۡنَ ﴿۶۴﴾", "english": " ‘Do you wonder that an exhortation has come to you from your Lord through a man from among yourselves, that he may warn you and that you may become righteous and that you may be shown mercy?’", "french": " Vous étonnez-vous qu’un avertissement vous soit venu de votre Seigneur par l’intermédiaire d’un homme d’entre vous, afin qu’il vous avertisse et que vous deveniez pieux, et que miséricorde vous soit faite ? »", "german": " Wundert ihr euch, dass eine Ermahnung zu euch gekommen ist von eurem Herrn, durch einen Mann aus eurer Mitte, auf dass er euch warne und dass ihr rechtschaffen werdet und vielleicht Erbarmen findet?\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:64&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:64&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic65\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic65\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:65' style='text-decoration:underline'>7:65</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(65)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control65\"></i></button> <audio id=\"player65\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">فَکَذَّبُوۡہُ فَاَنۡجَیۡنٰہُ وَ الَّذِیۡنَ مَعَہٗ فِی الۡفُلۡکِ وَ اَغۡرَقۡنَا الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا ؕ اِنَّہُمۡ کَانُوۡا قَوۡمًا عَمِیۡنَ ﴿٪۶۵﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">But they accused him of falsehood, so We saved him and those with him in the Ark, and We drowned those who rejected Our Signs. They were indeed a blind people.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> But <sup class='ref'>[<a class='ref' data-id='ref_7_65_d' href='#'>d</a>]</sup>they called him a liar, so We saved him and those with him in the Ark and We drowned those who rejected Our Signs. They were indeed a blind<sup class='ref'>[<a class='ref' data-id='ref_7_65_994' href='#'>994</a>]</sup> people. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_65_d'>d</span><span class='collapsible plus' data-id='ref_7_65_994'>994</span></div> <div><div class='reference' data-id='ref_7_65_d' style='display:none'> <p><b>d.</b> <a href='/quran/7:73' target=_blank>7:73</a>; <a href='/quran/26:120' target=_blank>26:120</a>-121. (<a href='javascript:void(0)' data-id='ref_7_65_d' class='ref'>close</a>)</p> </div> </div><div><a name='994'></a><div class='reference' data-id='ref_7_65_994' style='display:none'> <p><b>994.</b> ‘<i>Amin </i>is the plural of <i>A‘ma </i>which means, blind in both eyes; blind in respect of the mind; erring (Lane). (<a href='javascript:void(0)' data-id='ref_7_65_994' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">پس انہوں نے اسے جھٹلادیا اور ہم نے اسے اور ان کو جو کشتی میں اس کے ساتھ تھے نجات بخشی اور انہیں غرق کر دیا جنہوں نے ہمارے نشانات کو جھٹلایا تھا۔ یقیناً وہ ایک اندھی قوم تھے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(مگر) پھر (بھی) انہوں نے اس کا انکار کیا۔ پس ہم نے اس کو اور اس کے ساتھیوں کو ایک کشتی کے ذریعہ نجات دی اور ہم نے ان لوگوں کو جنہوں نے ہماری آیتوں کا انکار کیا تھا غرق کر دیا۔ وہ ایک اندھی قوم تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Mais ils le traitèrent de menteur ; alors, Nous l’avons sauvé et ceux qui se trouvaient avec lui dans l’Arche, et Nous avons noyé ceux qui rejetaient Nos Signes. C’était un peuple aveugle, en vérité.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Pero lo acusaron de falsedad, por lo que lo salvamos a él y a quienes con él se encontraban en el Arca y ahogamos a quienes rechazaron Nuestros Signos. Era en verdad un pueblo ciego.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Doch sie leugneten ihn, dann erretteten Wir ihn und die bei ihm waren in der Arche, und ließen jene ertrinken, die Unsere Zeichen verwarfen. Sie waren wahrlich ein blindes Volk.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:65&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:65&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic66\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic66\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:66' style='text-decoration:underline'>7:66</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(66)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control66\"></i></button> <audio id=\"player66\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِلٰی عَادٍ اَخَاہُمۡ ہُوۡدًا ؕ قَالَ یٰقَوۡمِ اعۡبُدُوا اللّٰہَ مَا لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرُہٗ ؕ اَفَلَا تَتَّقُوۡنَ ﴿۶۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And unto ‘Ad <em>We sent </em>their brother Hud. He said, ‘O my people, worship Allah; you have no other deity but Him. Will you not then be God-fearing?’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> And <sup class='ref'>[<a class='ref' data-id='ref_7_66_a' href='#'>a</a>]</sup>unto ‘Ad<sup class='ref'>[<a class='ref' data-id='ref_7_66_995' href='#'>995</a>]</sup> <i>We sent </i>their brother Hud.<sup class='ref'>[<a class='ref' data-id='ref_7_66_996' href='#'>996</a>]</sup> He said, ‘O my people, worship Allah; you have no other deity but Him. Will you not then fear <i>Him</i>?’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_66_a'>a</span><span class='collapsible plus' data-id='ref_7_66_995'>995</span><span class='collapsible plus' data-id='ref_7_66_996'>996</span></div> <div><div class='reference' data-id='ref_7_66_a' style='display:none'> <p><b>a.</b> <a href='/quran/11:51' target=_blank>11:51</a>; <a href='/quran/46:22' target=_blank>46:22</a>. (<a href='javascript:void(0)' data-id='ref_7_66_a' class='ref'>close</a>)</p> </div> </div><div><a name='995'></a><div class='reference' data-id='ref_7_66_995' style='display:none'> <p><b>995.</b> ‘<i>Ad </i>was the name of a tribe who lived in the remote past in Arabia. At one time they ruled over most of the fertile parts of greater Arabia, particularly Yemen, Syria and Mesopotamia. They were the first people to exercise dominion over practically the whole of Arabia. They are known as ‘<i>Adul</i>-<i>Ula </i>or the first ‘<i>Ad</i>. See also <a href='/quran/11:51#1323' target=_blank><b>1323</b></a>. (<a href='javascript:void(0)' data-id='ref_7_66_995' class='ref'>close</a>)</p> </div> </div><div><a name='996'></a><div class='reference' data-id='ref_7_66_996' style='display:none'> <p><b>996.</b> <i>Hud </i>was seventh in descent from Noah. (<a href='javascript:void(0)' data-id='ref_7_66_996' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور عاد کی طرف ان کے بھائی ہود کو (ہم نے بھیجا)۔ اس نے کہا کہ اے میری قوم! اللہ کی عبادت کرو۔ اس کے سوا تمہارا اور کوئی معبود نہیں۔ کیا تم تقویٰ اختیار نہیں کروگے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور یقیناً عاد کی طرف ہم نے ان کے بھائی ہود کو (رسول بنا کر) بھیجا تھا۔ (تب) اس نے کہا‘ اے میری قوم! اللہ کی عبادت کرو‘ اس کے سوا تمہارا اور کوئی معبود نہیں تو کیا تم تقویٰ اختیار نہیں کرتے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et aux ‘Ād, Nous envoyâmes leur frère Hūd. Il dit : « Ô mon peuple, adorez Allāh ; vous n’avez d’autre dieu que Lui. Vous ne voulez donc pas <em>Le</em> craindre ? »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Y a los ‘Ad <em>enviamos</em> a su hermano Hud. Él dijo: “Oh, pueblo mío, adorad a Al-lah, no tenéis otro Dios sino Él. ¿No seréis pues temerosos de Dios?”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und zu den ´Âd (entsandten Wir) ihren Bruder Hüd. Er sprach: \"O mein Volk, dienet Allah; ihr habt keinen anderen Gott als Ihn. Wollt ihr also nicht gottesfürchtig sein?\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:66&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:66&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic67\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic67\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:67' style='text-decoration:underline'>7:67</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(67)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control67\"></i></button> <audio id=\"player67\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ الۡمَلَاُ الَّذِیۡنَ کَفَرُوۡا مِنۡ قَوۡمِہٖۤ اِنَّا لَنَرٰٮکَ فِیۡ سَفَاہَۃٍ وَّ اِنَّا لَنَظُنُّکَ مِنَ الۡکٰذِبِیۡنَ ﴿۶۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">The disbelieving chiefs of his people said, ‘We surely see thee <em>lost</em> in foolishness, and we surely think thee to be <em>one </em>of the liars.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> The disbelieving chiefs of his people said, <sup class='ref'>[<a class='ref' data-id='ref_7_67_b' href='#'>b</a>]</sup>‘We surely see thee <i>lost </i>in foolishness and we surely think thee to be <i>one </i>of the liars.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_67_b'>b</span></div> <div><div class='reference' data-id='ref_7_67_b' style='display:none'> <p><b>b.</b> <a href='/quran/41:16' target=_blank>41:16</a>. (<a href='javascript:void(0)' data-id='ref_7_67_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس کی قوم میں سے اُن سرداروں نے جنہوں نے کفر کیا تھا کہا ہم تو تجھے یقیناً ایک بڑی بیوقوفی میں مبتلا دیکھتے ہیں اور یقیناً ہم سمجھتے ہیں کہ تو ضرور جھوٹے لوگوں میں سے ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(تب) اس کی قوم کے کفار سرداروں نے کہا (اے ہود)! ہم تجھ کو یقیناً بیوقوفی میں (مبتلا) پاتے ہیں اور ہم تجھے یقیناً جھوٹوں میں سے خیال کرتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Les chefs mécréants de son peuple dirent : « Nous te voyons assurément <em>perdu</em> dans une<em> grande</em> stupidité, et Nous sommes convaincus que tu es du nombre des menteurs. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Los jefes incrédulos de su pueblo respondieron: “ciertamente te vemos <em>perdido</em> en la necedad, y pensamos, en verdad, que eres uno de los mentirosos”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Die ungläubigen Häupter seines Volkes sprachen: \"Wahrlich, wir sehen dich in Torheit, und wahrlich, wir erachten dich für einen Lügner.\"</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:67&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:67&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic68\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic68\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:68' style='text-decoration:underline'>7:68</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(68)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control68\"></i></button> <audio id=\"player68\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَالَ یٰقَوۡمِ لَیۡسَ بِیۡ سَفَاہَۃٌ وَّ لٰکِنِّیۡ رَسُوۡلٌ مِّنۡ رَّبِّ الۡعٰلَمِیۡنَ ﴿۶۸﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">He replied, ‘O my people, there is no foolishness in me, but I am a Messenger from the Lord of the worlds.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> He replied, <sup class='ref'>[<a class='ref' data-id='ref_7_68_c' href='#'>c</a>]</sup>‘O my people, there is no foolishness in me, but I am a Messenger from the Lord of the worlds; <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_68_c'>c</span></div> <div><div class='reference' data-id='ref_7_68_c' style='display:none'> <p><b>c.</b> <a href='/quran/7:62' target=_blank>7:62</a>. (<a href='javascript:void(0)' data-id='ref_7_68_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اس نے کہا اے میری قوم! مجھے کوئی بیوقوفی لاحق نہیں بلکہ میں تو تمام جہانوں کے ربّ کی طرف سے ایک رسول ہوں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اس (یعنی ہود) نے کہا۔ اے میری قوم! مجھ میں بیوقوفی کی کوئی بات نہیں (پائی جاتی) لیکن (یہ ضرور ہے کہ) میں سب جہانوں کے رب کی طرف سے رسول ہوں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il répondit : « Ô mon peuple, il n’y a en moi aucune stupidité, mais je suis un Messager du Seigneur des mondes.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">Respondió: ¡Oh, pueblo mío, no hay necedad en mí, ya que soy Mensajero del Señor de los mundos!</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er antwortete: \"O mein Volk, es ist keine Torheit in mir, sondern ich bin ein Gesandter vom Herrn der Welten.", "spanish": " “¿Os admiráis de que os haya llegado una exhortación de vuestro Señor a través de un hombre de los vuestros, que pueda amonestaros para que seáis piadosos y se os muestre misericordia?”.", "urdu": " کیا تم اس بات پر تعجب کرتے ہو کہ تمہارے پاس تمہارے رب کی طرف سے تمہی میں سے ایک آدمی پر ایک نصیحت سے پرکلام نازل ہوا ہے تا کہ وہ تم کو ہوشیار کرے اور تا کہ تم متقی بن جاٶ اور اس کے نتیجہ میں تم پر رحم کیا جائے۔"}, {"arabic": " اُبَلِّغُکُمۡ رِسٰلٰتِ رَبِّیۡ وَ اَنَا لَکُمۡ نَاصِحٌ اَمِیۡنٌ ﴿۶۹﴾", "english": " ‘I deliver to you the messages of my Lord and I am to you a sincere and faithful counsellor.", "french": " Je vous transmets les Messages de mon Seigneur, et je suis pour vous un conseiller sincère.", "german": " Ich überbringe euch die Botschaften meines Herrn, und ich bin euch ein aufrichtiger und getreuer Berater.", "spanish": " “Os transmito los mensajes de mi Señor y soy vuestro sincero y fiel consejero”.", "urdu": " میں اپنے رب کے پیغام کو پہنچاتا ہوں اور میں تمہارا خیر خواہ (اور) امانت دار ہوں۔"}, {"arabic": " اَوَ عَجِبۡتُمۡ اَنۡ جَآءَکُمۡ ذِکۡرٌ مِّنۡ رَّبِّکُمۡ عَلٰی رَجُلٍ مِّنۡکُمۡ لِیُنۡذِرَکُمۡ ؕ وَ اذۡکُرُوۡۤا اِذۡ جَعَلَکُمۡ خُلَفَآءَ مِنۡۢ بَعۡدِ قَوۡمِ نُوۡحٍ وَّ زَادَکُمۡ فِی الۡخَلۡقِ بَصۜۡطَۃً ۚ فَاذۡکُرُوۡۤا اٰلَآءَ اللّٰہِ لَعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿۷۰﴾", "english": " ‘Do you wonder that an exhortation has come to you from your Lord through a man from among yourselves that he may warn you? And remember the time when He made you inheritors of His favours after the people of Noah, and increased you abundantly in constitution. Remember, then, the favours of Allah, that you may prosper.’", "french": " Vous étonnez-vous qu’une exhortation de votre Seigneur vous soit parvenue par l’intermédiaire d’un des vôtres, pour qu’il vous avertisse ? Et souvenez-vous du temps quand Il vous a fait hériter de Ses grâces après le peuple de Noé, en vous augmentant grandement dans votre descendance. Souvenez-vous donc des grâces d’Allāh afin que vous puissiez prospérer. »", "german": "", "spanish": " “¿Os admiráis de que os haya llegado una exhortación de vuestro eñor a través de un hombre de los vuestros para advertiros? Y acordaos de cuando os hizo herederos de Sus favores después el Pueblo de Noé, y os aumentó con generosidad en constitución física . Acordaos, pues, de los favores de Al-lah para que prosperéis”.", "urdu": " کیا تم اس بات پر تعجب کرتے ہو کہ تم ہی میں سے ایک شخص پر تمہارے رب کی طرف سے نصیحت کی بات اتری ہے تا کہ وہ تمہیں آنے والے عذاب سے ہوشیار کرے اور یاد کرو جب اس (خدا) نے تم کو نوح کی قوم کے بعد (اس کا) جانشین بنا دیا اور تمہارے جسم کو بہت مضبوط بنایا پس اللہ کی نعمتوں کو یاد کرو تا کہ تم با مراد ہو جاٶ۔"}, {"arabic": " قَالُوۡۤا اَجِئۡتَنَا لِنَعۡبُدَ اللّٰہَ وَحۡدَہٗ وَ نَذَرَ مَا کَانَ یَعۡبُدُ اٰبَآؤُنَا ۚ فَاۡتِنَا بِمَا تَعِدُنَاۤ اِنۡ کُنۡتَ مِنَ الصّٰدِقِیۡنَ ﴿۷۱﴾", "english": " They said, ‘Hast thou come to us that we may worship Allah alone and forsake what our fathers used to worship? Bring us, then, that which thou threatenest us with, if thou art of the truthful.’", "french": " Ils dirent : « Es-tu venu vers nous pour que nous adorions Allāh Seul, et que nous abandonnions ce que nos pères adoraient ? Fais donc descendre sur nous ce dont tu nous menaces, si tu es du nombre des véridiques. »", "german": " Sie sprachen: \"Bist du zu uns gekommen, damit wir Allah allein verehren und das verlassen, was unsere Väter anbeteten? Bring uns denn her, was du uns androhst, wenn du wahrhaftig bist!\"", "spanish": " Ellos respondieron: “¿Has venido a nosotros para que adoremos a Al-lah solamente y abandonemos lo que adoraban nuestros padres? Tráenos, pues, aquello con lo que nos amenazas, si eres veraz”.", "urdu": " انہوں نے کہا (اے ہود)! کیا تو ہمارے پاس اس لئے آیا ہے کہ ہم اللہ (کو) ایک (قرار دے کر اس) کی عبادت کریں اور جن کی ہمارے باپ دادا پرستش کرتے تھے ان کو چھوڑ دیں۔ پس جس بات سے تو ہم کو ڈراتا ہے اگر تو سچا ہے تو اس کو لے آ۔"}, {"arabic": " قَالَ قَدۡ وَقَعَ عَلَیۡکُمۡ مِّنۡ رَّبِّکُمۡ رِجۡسٌ وَّ غَضَبٌ ؕ اَتُجَادِلُوۡنَنِیۡ فِیۡۤ اَسۡمَآءٍ سَمَّیۡتُمُوۡہَاۤ اَنۡتُمۡ وَ اٰبَآؤُکُمۡ مَّا نَزَّلَ اللّٰہُ بِہَا مِنۡ سُلۡطٰنٍ ؕ فَانۡتَظِرُوۡۤا اِنِّیۡ مَعَکُمۡ مِّنَ الۡمُنۡتَظِرِیۡنَ ﴿۷۲﴾", "english": " He replied, ‘Indeed there have already fallen on you punishment and wrath from your Lord. Do you dispute with me about names which you have named — you and your fathers — for which Allah has sent down no authority? Wait then, I am with you among those who wait.’", "french": " Il répondit : « En vérité, vous avez déjà été frappés par le châtiment et le courroux de votre Seigneur. Débattrez-vous avec moi au sujet des noms que vos pères et vous-mêmes avez nommés, ce pour quoi Allāh ne vous a transmis aucune autorité ? Attendez donc, moi aussi, je suis avec vous parmi ceux qui attendent. »", "german": " Er antwortete: \"Niedergefallen ist nunmehr auf euch Strafe und Zorn von eurem Herrn. Wollt ihr mit mir über Namen streiten, die ihr nanntet – ihr und eure Väter –, wozu Allah keine Vollmacht hinabsandte? Wartet denn, ich bin mit euch unter den Wartenden.\"", "spanish": " Respondió: “En verdad, ya han caído sobre vosotros el castigo y la ira de vuestro Señor. ¿Disputáis conmigo sobre nombres que habéis mencionado – vosotros y vuestros padres – y para los que Al-lah no ha dado autoridad alguna? Esperad, pues, estoy con vosotros entre los que esperan”.", "urdu": " اس نے کہا تمہارے رب کی طرف سے تم پر عذاب اور غضب نازل ہو چکا ہے۔ کیا تم ان ناموں کے متعلق مجھ سے بحث کرتے ہو جو تم نے اور تمہارے باپ دادوں نے تجویز کیے تھے۔ اللہ نے ان کے لئے کوئی دلیل نہیں اتاری۔ پس تم بھی (میرے لئے عذاب کا) انتظار کرو۔ میں بھی تمہارے ساتھ (تمہارے لئے) عذاب کا انتظار کرتا رہوں گا (اور دیکھیں گے کس کی امیدیں پوری ہوتی ہیں)"}, {"arabic": " فَاَنۡجَیۡنٰہُ وَ الَّذِیۡنَ مَعَہٗ بِرَحۡمَۃٍ مِّنَّا وَ قَطَعۡنَا دَابِرَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا وَ مَا کَانُوۡا مُؤۡمِنِیۡنَ ﴿٪۷۳﴾", "english": " And We saved him and those who were with him, by Our mercy, and We cut off the last remnant of those who rejected Our Signs. And they were not believers.", "french": " Et Nous l’avons sauvé ainsi que ceux qui étaient avec lui, par Notre miséricorde, et Nous avons coupé net le dernier vestige de ceux qui rejetèrent Nos Signes, et ils n’étaient point croyants.", "german": " Sodann erretteten Wir ihn und die mit ihm waren durch Unsere Barmherzigkeit, und Wir schnitten den letzten Zweig derer ab, die Unsere Zeichen leugneten und nicht Gläubige waren.", "spanish": " Y lo salvamos a él y a quienes estaban con él, por Nuestra misericordia, y destruimos los últimos restos de los que rechazaron Nuestros Signos. Pues no eran creyentes.", "urdu": " آخر ہم نے اس کو اور اس کے ساتھیوں کو اپنی رحمت کے ذریعہ نجات بخشی اور جن لوگوں نے ہماری آیتوں کا انکار کیا تھا اور مومنوں میں شامل نہ ہوئے تھے ان کی جڑ (تک) کاٹ دی۔"}, {"arabic": " وَ اِلٰی ثَمُوۡدَ اَخَاہُمۡ صٰلِحًا ۘ قَالَ یٰقَوۡمِ اعۡبُدُوا اللّٰہَ مَا لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرُہٗ ؕ قَدۡ جَآءَتۡکُمۡ بَیِّنَۃٌ مِّنۡ رَّبِّکُمۡ ؕ ہٰذِہٖ نَاقَۃُ اللّٰہِ لَکُمۡ اٰیَۃً فَذَرُوۡہَا تَاۡکُلۡ فِیۡۤ اَرۡضِ اللّٰہِ وَ لَا تَمَسُّوۡہَا بِسُوۡٓءٍ فَیَاۡخُذَکُمۡ عَذَابٌ اَلِیۡمٌ ﴿۷۴﴾", "english": " And to Thamud We sent their brother Salih. He said, ‘O my people, worship Allah; you have no other deity but Him. Verily there has come to you a clear evidence from your Lord — this she-camel of Allah, a Sign for you. So leave her that she may feed in Allah’s earth, and do her no harm, lest a painful punishment seize you.", "french": " Et aux Thamūd Nous envoyâmes leur frère Ṣāliḥ. Il dit : « Ô mon peuple, adorez Allāh ; vous n’avez d’autre dieu que Lui. En vérité, une preuve évidente vous est venue de votre Seigneur ; cette chamelle d’Allāh est pour vous un Signe. Laissez-là donc paître sur la terre d’Allāh, et ne lui faites aucun mal, sinon un châtiment douloureux vous atteindra.", "german": " Und zu den Thamûd (entsandten Wir) ihren Bruder Sâleh. Er sprach: \"O mein Volk, dienet Allah; ihr habt keinen anderen Gott als Ihn. Wahrlich, nunmehr ist zu euch ein deutlicher Beweis von eurem Herrn gekommen – diese Kamelstute Allahs, ein Zeichen für euch. So lasset sie auf Allahs Erde weiden und tut ihr nichts zuleide, sonst würde euch schmerzliche Strafe treffen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:74&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:74&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic75\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic75\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:75' style='text-decoration:underline'>7:75</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(75)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control75\"></i></button> <audio id=\"player75\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اذۡکُرُوۡۤا اِذۡ جَعَلَکُمۡ خُلَفَآءَ مِنۡۢ بَعۡدِ عَادٍ وَّ بَوَّاَکُمۡ فِی الۡاَرۡضِ تَتَّخِذُوۡنَ مِنۡ سُہُوۡلِہَا قُصُوۡرًا وَّ تَنۡحِتُوۡنَ الۡجِبَالَ بُیُوۡتًا ۚ فَاذۡکُرُوۡۤا اٰلَآءَ اللّٰہِ وَ لَا تَعۡثَوۡا فِی الۡاَرۡضِ مُفۡسِدِیۡنَ ﴿۷۵﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">And remember <em>the time </em>when He made you inheritors <em>of His favours</em> after ‘Ad, and assigned you an abode in the land; you build palaces in its plains, and you hew the mountains into houses. Remember, therefore, the favours of Allah and commit not iniquity in the earth, causing disorder.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And remember <i>the time </i><sup class='ref'>[<a class='ref' data-id='ref_7_75_b' href='#'>b</a>]</sup>when He made you heirs <i>to His favours </i>after ‘Ad and settled you in the land so <i>that </i>you build palaces in its plains and <sup class='ref'>[<a class='ref' data-id='ref_7_75_c' href='#'>c</a>]</sup>you hew<sup class='ref'>[<a class='ref' data-id='ref_7_75_1002' href='#'>1002</a>]</sup> the mountains into dwellings. Remember, therefore, the favours of Allah and commit not iniquity in the earth causing disorder.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_75_b'>b</span><span class='collapsible plus' data-id='ref_7_75_c'>c</span><span class='collapsible plus' data-id='ref_7_75_1002'>1002</span></div> <div><div class='reference' data-id='ref_7_75_b' style='display:none'> <p><b>b.</b> <a href='/quran/6:166' target=_blank>6:166</a>; <a href='/quran/7:70' target=_blank>7:70</a>, <a href='/quran/7:130' target=_blank>130</a>; <a href='/quran/10:15' target=_blank>10:15</a>. (<a href='javascript:void(0)' data-id='ref_7_75_b' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_7_75_c' style='display:none'> <p><b>c.</b> <a href='/quran/15:83' target=_blank>15:83</a>; <a href='/quran/26:150' target=_blank>26:150</a>. (<a href='javascript:void(0)' data-id='ref_7_75_c' class='ref'>close</a>)</p> </div> </div><div><a name='1002'></a><div class='reference' data-id='ref_7_75_1002' style='display:none'> <p><b>1002.</b> The words, <i>you build palaces in its plains</i>, refer to the winter residences of the tribe, while the expression, <i>and you hew the mountains into dwellings</i>, allude to their summer resorts in the hills. The tribe of Thamud were a cultured people––industrious, wealthy and resourceful. Judged by the standards of their time, they led a luxurious and comfortable life, going up to the hills in the hot season and spending their winter in the plains. (<a href='javascript:void(0)' data-id='ref_7_75_1002' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور (وہ وقت) یاد کرو جب اس نے تم کو عاد کے بعد جانشین بنایا اور زمین میں تمہیں آباد کیا۔ تم اس کے میدانوں میں قلعے تعمیر کرتے ہو اور گھر بنانے کے لئے پہاڑ تراشتے ہو۔ پس اللہ کی نعمتوں کو یاد کرو اور فسادی بنتے ہوئے زمین میں تخریب کاری نہ کرو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور یاد کرو جب اس (خدا) نے تم کو عاد کی قوم کے بعد (ان کا) جانشین بنا دیا اور زمین میں تمہارا (اس طرح) ٹھکانا بنایا کہ تم اس کے میدانوں میں قلعے بناتے تھے اور پہاڑوں میں کھود کر گھر بناتے تھے۔ پس اللہ کی نعمتوں کو یاد کرو اور زمین میں جان بوجھ کر فساد مت کرو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et souvenez-vous lorsque <em>Allāh</em> a fait de vous les héritiers <em>de Ses grâces</em> après les ‘Ād et où Il vous a établis sur la terre, et vous bâtissiez des palais sur ses plaines et vous tailliez des maisons dans les montagnes. Souvenez-vous donc des grâces d’Allāh et ne commettez pas d’iniquité sur la terre comme des fauteurs de désordre. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Y acordaos <em>de la época</em> cuando Él os hizo herederos de <em>Sus favores</em> después de los Ad, y os asignó una morada en la tierra; construís palacios en sus llanuras y horadáis casas en las montañas. Acordaos, pues, de los favores de Al-lah y no cometáis iniquidad en la tierra provocando el desorden”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und gedenket (der Zeit), da Er euch zu Erben einsetzte nach den ´Âd und euch eine Stätte anwies im Land; ihr erbaut Paläste in seinen Ebenen und grabt Wohnungen in die Berge. Seid also der Gnaden Allahs eingedenk und verübt nicht Unheil auf Erden, indem ihr Unfrieden stiftet.\"", "spanish": " Y a los Zamud enviamos a su hermano Salih. Dijo: “Oh, pueblo mío, adorad a Al-lah; no tenéis otro Dios fuera de Él. En verdad, os ha llegado una prueba clara de vuestro Señor: ésta camella de Al-lah , un Signo para vosotros. Dejad pues que se alimente en la tierra de Al-lah y no hacedle daño, no sea que os alcance un castigo doloroso;", "urdu": " اور ہم نے ثمود کی طرف (بھی) ان کے بھائی صالح کو (رسول بنا کر بھیجا تھا) اس نے (ان سے) کہا اے میری قوم اللہ کی عبادت کرو اس کے سوا تمہارا کوئی اور معبود نہیں۔ تمہارے پاس تمہارے رب کی طرف سے ایک کھلی دلیل آچکی ہے (اور وہ یہ ہے کہ) یہ اللہ کی اونٹنی ہے جو تمہارے لئے بطور نشان ہے پس اس کو چھوڑ دو کہ اللہ کی زمین میں کھاتی پھرے اور اس کو کوئی تکلیف نہ پہنچاٶ (ایسا کیا تو) تم کو دردناک عذاب پہنچے گا۔"}, {"arabic": " قَالَ الۡمَلَاُ الَّذِیۡنَ اسۡتَکۡبَرُوۡا مِنۡ قَوۡمِہٖ لِلَّذِیۡنَ اسۡتُضۡعِفُوۡا لِمَنۡ اٰمَنَ مِنۡہُمۡ اَتَعۡلَمُوۡنَ اَنَّ صٰلِحًا مُّرۡسَلٌ مِّنۡ رَّبِّہٖ ؕ قَالُوۡۤا اِنَّا بِمَاۤ اُرۡسِلَ بِہٖ مُؤۡمِنُوۡنَ ﴿۷۶﴾", "english": " The chief men of his people who were arrogant said to those who were reckoned weak — those among them who believed — ‘Do you know for certain that Salih is one sent by his Lord?’ They answered, ‘Surely, we believe in that with which he has been sent.’", "french": " Les chefs de son peuple, qui étaient arrogants, dirent à ceux qui étaient considérés comme faibles – à ceux d’entre eux qui étaient croyants – : « Savez-vous pour certain que Ṣāliḥ a été envoyé par son Seigneur ? » Ils répondirent : « Nous croyons assurément en ce avec quoi il a été envoyé. »", "german": " Die Häupter seines Volkes, die hoffärtig waren, sprachen zu denen, die als schwach galten – das waren die Gläubigen unter ihnen –: \"Seid ihr gewiss, dass Sâleh ein Abgesandter seines Herrn ist?\" Sie antworteten: \"Wahrlich, wir glauben an das, womit er gesandt ward.\"", "spanish": " Los jefes de su pueblo, que eran arrogantes, dijeron a los onsiderados débiles – a quienes creían de entre ellos -: “¿Sabéis con certeza que Salih es un enviado de su Señor?”. Respondieron: “ciertamente, creemos en aquello con lo que ha sido enviado”.", "urdu": " (اس پر) اس (یعنی صالح) کی قوم میں سے جن بڑوں نے تکبر کیا تھا ان لوگوں سے جو صالح کی قوم میں سے ایمان لائے تھے مگر ضعیف تھے کہا کہ کیا تم (واقعہ میں) سمجھتے ہو کہ صالح اپنے رب کی طرف سے رسول ہے۔ ان مومنوں نے کہا ہم تو اس تعلیم پر جس کے ساتھ وہ بھیجا گیا ہے ایمان لاتے ہیں۔"}, {"arabic": " قَالَ الَّذِیۡنَ اسۡتَکۡبَرُوۡۤا اِنَّا بِالَّذِیۡۤ اٰمَنۡتُمۡ بِہٖ کٰفِرُوۡنَ ﴿۷۷﴾", "english": " Those who were arrogant said, ‘Verily, we do disbelieve in that in which you believe.’", "french": " Les orgueilleux dirent : « En vérité, nous nions ce en quoi vous croyez. »", "german": " Da sprachen die Hoffärtigen: \"Wir glauben nicht an das, woran ihr glaubt.\"", "spanish": " Los arrogantes dijeron: “En verdad, no creemos en lo que vosotros creéis”.", "urdu": " (اس پر) وہ لوگ جنہوں نے تکبر سے کام لیا تھا بولے جس (تعلیم) پر تم ایمان لائے ہو ہم اس کے منکر ہیں۔"}, {"arabic": " فَعَقَرُوا النَّاقَۃَ وَ عَتَوۡا عَنۡ اَمۡرِ رَبِّہِمۡ وَ قَالُوۡا یٰصٰلِحُ ائۡتِنَا بِمَا تَعِدُنَاۤ اِنۡ کُنۡتَ مِنَ الۡمُرۡسَلِیۡنَ ﴿۷۸﴾", "english": " Then they hamstrung the shecamel and rebelled against the command of their Lord, and said, ‘O Salih, bring us that which thou threatenest us with, if thou art indeed one of the Messengers.’", "french": " Ensuite, ils coupèrent les jarrets de la chamelle et se révoltèrent contre le commandement de leur Seigneur. Et ils dirent : « Ô Ṣāliḥ, apporte-nous ce dont tu nous menaces, si tu es vraiment l’un des Messagers. »", "german": " Dann schnitten sie der Kamelstute die Sehnen durch und trotzten dem Befehl ihres Herrn und sprachen: \"O Sâleh, bring uns das her, was du uns androhst, wenn du einer der Gesandten bist.\"", "spanish": " Entonces desjarretaron a la camella y se rebelaron contra el mandato de su Señor, diciendo: “Oh, Salih, tráenos eso con lo que nos amenazas, si eres en realidad uno de los Mensajeros”.", "urdu": " پھر انہوں نے (جوش میں آکر) اونٹنی کی کونچیں کاٹ دیں اور اپنے رب کے حکم کی نافرمانی کی اور کہا اے صالح! جس عذاب کا تو ہم سے وعدہ کرتا ہے اگر تو (سچا) رسول ہے تو اسے لے آ۔"}, {"arabic": " فَاَخَذَتۡہُمُ الرَّجۡفَۃُ فَاَصۡبَحُوۡا فِیۡ دَارِہِمۡ جٰثِمِیۡنَ ﴿۷۹﴾", "english": " So the earthquake seized them and in their homes they lay prostrate upon the ground.", "french": " Aussi le tremblement de terre les saisit, de sorte que transformés en cadavres ils gisent prostrés dans leurs maisons.", "german": " Dann erfasste sie das Erdbeben, und am Morgen lagen sie in ihren Wohnungen auf dem Boden hingestreckt.", "spanish": " A continuación, el terremoto les atrapó y se convirtieron en cadáveres postrados en sus moradas.", "urdu": " اس پر ان کو زلزلہ نے پکڑ لیا اور وہ اپنے گھروں میں گھٹنوں کے بل گرے ہوئے رہ گئے۔"}, {"arabic": " فَتَوَلّٰی عَنۡہُمۡ وَ قَالَ یٰقَوۡمِ لَقَدۡ اَبۡلَغۡتُکُمۡ رِسَالَۃَ رَبِّیۡ وَ نَصَحۡتُ لَکُمۡ وَ لٰکِنۡ لَّا تُحِبُّوۡنَ النّٰصِحِیۡنَ ﴿۸۰﴾", "english": " Then Salih turned away from them and said, ‘O my people, I did deliver the message of my Lord unto you and offered you sincere counsel, but you love not sincere counsellors.’", "french": " Ensuite, Ṣāliḥ se détourna d’eux et dit : « Ô mon peuple, je vous ai transmis le Message de mon Seigneur, et je vous ai donné des conseils sincères, mais vous n’aimez pas les conseillers sincères. »", "german": " Da wandte er sich von ihnen ab und sprach: \"O mein Volk, ich überbrachte euch die Botschaft meines Herrn und bot euch aufrichtigen Rat an, ihr aber liebt die treuen Berater nicht.\"", "spanish": " Entonces Salih se apartó de ellos y dijo: “Oh, pueblo mío, os entregué el Mensaje de mi Señor y os aconsejé sinceramente, pero no amáis a los consejeros sinceros.", "urdu": " تب صالح ان (یعنی اپنی قوم کے لوگوں) کو چھوڑ کر دوسری طرف چل دیا اور کہا اے میری قوم! میں نے تم کو اپنے رب کا پیغام پہنچا دیا تھا اور تمہاری خیر خواہی کی باتیں تم سے کہہ دی تھیں لیکن تم لوگ خیر خواہوں کو پسند نہیں کرتے۔"}, {"arabic": " وَ لُوۡطًا اِذۡ قَالَ لِقَوۡمِہٖۤ اَتَاۡتُوۡنَ الۡفَاحِشَۃَ مَا سَبَقَکُمۡ بِہَا مِنۡ اَحَدٍ مِّنَ الۡعٰلَمِیۡنَ ﴿۸۱﴾", "english": " And We sent Lot — when he said to his people, ‘Do you commit an abomination such as no one in the world ever did before you?", "french": " Et Nous envoyâmes Lot – lorsqu’il dit à son peuple : « Commettrez-vous cette abomination que personne au monde n’a commise avant vous ?", "german": " Und (Wir entsandten) Lot, da er zu seinem Volke sprach: \"Wollt ihr eine Schandtat begehen, wie sie keiner in der Welt vor euch je begangen hat?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:81&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:81&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic82\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic82\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:82' style='text-decoration:underline'>7:82</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(82)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control82\"></i></button> <audio id=\"player82\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">اِنَّکُمۡ لَتَاۡتُوۡنَ الرِّجَالَ شَہۡوَۃً مِّنۡ دُوۡنِ النِّسَآءِ ؕ بَلۡ اَنۡتُمۡ قَوۡمٌ مُّسۡرِفُوۡنَ ﴿۸۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘You approach men with lust instead of women. Nay, you are a people who exceed <em>all </em>bounds.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_7_82_c' href='#'>c</a>]</sup>‘You approach men with lust instead of women. Nay, you are a people who exceed <i>all bounds</i>.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_82_c'>c</span></div> <div><div class='reference' data-id='ref_7_82_c' style='display:none'> <p><b>c.</b> <a href='/quran/26:166' target=_blank>26:166</a>; <a href='/quran/27:56' target=_blank>27:56</a>; <a href='/quran/29:30' target=_blank>29:30</a>. (<a href='javascript:void(0)' data-id='ref_7_82_c' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً تم شہوانی جذبات کی خاطر عورتوں کو چھوڑ کر مَردوں کے پاس آتے ہو۔ بلکہ تم ایک بہت ہی حد سے بڑھی ہوئی قوم ہو۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا تم عورتوں کو چھوڑ کر مردوں کے پاس شہوت کے ارادہ سے آتے ہو۔ بلکہ (اصل بات یہ ہے کہ) تم حد سے بڑھنے والی قوم ہو۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Vous vous approchez des hommes avec lasciveté au lieu des femmes. Vous êtes assurément un peuple qui dépasse toutes les bornes. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Os acercáis a los hombres con lujuria en vez de a las mujeres. ¡No!, sois un pueblo que ha excedido <em>todos</em> los límites”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ihr naht Männern in Begierde anstatt Frauen. Ja, ihr seid ein ausschweifendes Volk.\"", "spanish": " Y enviamos a Lot, -cuando dijo a su pueblo-: “¿Cometéis una abominación como nadie en el mundo cometió antes que vosotros?", "urdu": " اور (ہم نے) لوط کو بھی (اس کی قوم کی طرف رسول کرکے بھیجا تھا) جب اس نے (جاکر) اپنی قوم سے کہا‘ کیا تم ایسی بے حیائی کرتے ہو کہ تم سے پہلے ساری قوموں میں سے کسی نے نہیں کی تھی۔"}, {"arabic": " وَ مَا کَانَ جَوَابَ قَوۡمِہٖۤ اِلَّاۤ اَنۡ قَالُوۡۤا اَخۡرِجُوۡہُمۡ مِّنۡ قَرۡیَتِکُمۡ ۚ اِنَّہُمۡ اُنَاسٌ یَّتَطَہَّرُوۡنَ ﴿۸۳﴾", "english": " And the answer of his people was no other than that they said, ‘Turn them out of your town, for they are men who would keep pure.’", "french": " Et la réponse de son peuple ne fut autre que celle-ci : « Expulsez-les de votre ville, car ce sont des hommes qui veulent rester purs ! »", "german": " Da war die Antwort seines Volkes nichts anderes, als dass sie sprachen: \"Treibt sie hinaus aus eurer Stadt, denn sie sind Leute, die sich reinsprechen möchten.\"", "spanish": " Pero la respuesta de su pueblo no consistió más que en decir: “Expulsarlos de vuestra ciudad, ya que son hombres que quieren conservarse puros”.", "urdu": " اس پر اس کی قوم نے صرف یہ کہا (اے لوگو)! لوط اور اس کے ساتھیوں کو شہر سے نکال دو۔ وہ ایسے لوگ ہیں جو اپنی پاکیزگی پر اتراتے ہیں۔"}, {"arabic": " فَاَنۡجَیۡنٰہُ وَ اَہۡلَہٗۤ اِلَّا امۡرَاَتَہٗ ۫ۖ کَانَتۡ مِنَ الۡغٰبِرِیۡنَ ﴿۸۴﴾", "english": " And We saved him and his family, except his wife: she was of those who stayed behind.", "french": " Et Nous les sauvâmes lui et sa famille, excepté sa femme : elle était de ceux qui étaient restés en arrière.", "german": " Sodann erretteten Wir ihn und die Seinen, ausgenommen sein Weib; sie gehörte zu denen, die zurückblieben.", "spanish": " Entonces le salvamos, a él y a su familia, excepto a su mujer: fue una de las que se quedaron detrás.", "urdu": " پس ہم نے اس کو اور اس کے اہل کو سوائے اس کی بیوی کے نجات دی۔ وہ (بیوی) پیچھے رہنے والوں میں سے ہو گئی۔"}, {"arabic": " وَ اَمۡطَرۡنَا عَلَیۡہِمۡ مَّطَرًا ؕ فَانۡظُرۡ کَیۡفَ کَانَ عَاقِبَۃُ الۡمُجۡرِمِیۡنَ ﴿٪۸۵﴾", "english": " And We rained upon them a rain. Now see, what was the end of the sinners!", "french": " Et Nous fîmes pleuvoir une espèce de pluie sur eux. Regardez donc comment ont fini les pécheurs.", "german": " Und Wir ließen einen gewaltigen Regen über sie niedergehen. Nun sieh, wie das Ende der Sünder war!", "spanish": " E hicimos caer sobre ellos una lluvia. ¡Mirad ahora cuál fue el fin de los pecadores!", "urdu": " اور ہم نے ان پر (پتھروں کی) ایک بارش (زلزلہ کی وجہ سے) برسائی۔ پس دیکھ کہ مجرموں کا انجام کیسا ہوا۔"}, {"arabic": " وَ اِلٰی مَدۡیَنَ اَخَاہُمۡ شُعَیۡبًا ؕ قَالَ یٰقَوۡمِ اعۡبُدُوا اللّٰہَ مَا لَکُمۡ مِّنۡ اِلٰہٍ غَیۡرُہٗ ؕ قَدۡ جَآءَتۡکُمۡ بَیِّنَۃٌ مِّنۡ رَّبِّکُمۡ فَاَوۡفُوا الۡکَیۡلَ وَ الۡمِیۡزَانَ وَ لَا تَبۡخَسُوا النَّاسَ اَشۡیَآءَہُمۡ وَ لَا تُفۡسِدُوۡا فِی الۡاَرۡضِ بَعۡدَ اِصۡلَاحِہَا ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿ۚ۸۶﴾", "english": " And to Midian We sent their brother Shu‘aib. He said, ‘O my people, worship Allah; you have no other deity but Him. A clear Sign has indeed come to you from your Lord. So give full measure and full weight, and diminish not unto people their things, and create not disorder in the earth after it has been set in order. This is better for you, if you are believers.", "french": " Et aux Madian Nous envoyâmes leur frère Shu‘aib. Il dit : « Ô mon peuple, adorez Allāh. Vous n’avez d’autre dieu que Lui. Un Signe manifeste vous est assurément venu de votre Seigneur. Et donnez la pleine mesure et le bon poids et ne privez pas les gens des choses qui leur sont dues, et ne répandez pas le désordre sur la terre après que l’ordre y ait été rétabli. Cela vaut mieux pour vous, si vous êtes des croyants.", "german": " Und zu Midian (entsandten Wir) ihren Bruder Schoäb. Er sprach: \"O mein Volk, dienet Allah; ihr habt keinen anderen Gott als Ihn. Ein deutliches Zeichen von eurem Herrn ist nunmehr zu euch gekommen. Drum gebet volles Maß und Gewicht und schmälert den Menschen ihre Dinge nicht und stiftet nicht Unfrieden auf Erden nach ihrer Regelung. Das ist besser für euch, wenn ihr Gläubige seid.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:86&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:86&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic87\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic87\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:87' style='text-decoration:underline'>7:87</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(87)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control87\"></i></button> <audio id=\"player87\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ لَا تَقۡعُدُوۡا بِکُلِّ صِرَاطٍ تُوۡعِدُوۡنَ وَ تَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ مَنۡ اٰمَنَ بِہٖ وَ تَبۡغُوۡنَہَا عِوَجًا ۚ وَ اذۡکُرُوۡۤا اِذۡ کُنۡتُمۡ قَلِیۡلًا فَکَثَّرَکُمۡ ۪ وَ انۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ الۡمُفۡسِدِیۡنَ ﴿۸۷﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And sit not on every path, threatening and turning away from the path of Allah those who believe in Him, and seeking to make it crooked. And remember when you were few and He multiplied you. And behold, what was the end of those who created disorder!</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And sit not on every path, threatening and <sup class='ref'>[<a class='ref' data-id='ref_7_87_a' href='#'>a</a>]</sup>turning away from the path of Allah those who believe in Him and seeking to make it crooked. And <sup class='ref'>[<a class='ref' data-id='ref_7_87_b' href='#'>b</a>]</sup>remember when you were few and He multiplied<sup class='ref'>[<a class='ref' data-id='ref_7_87_1012' href='#'>1012</a>]</sup> you. And behold, what was the end of those who created disorder! <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_87_a'>a</span><span class='collapsible plus' data-id='ref_7_87_b'>b</span><span class='collapsible plus' data-id='ref_7_87_1012'>1012</span></div> <div><div class='reference' data-id='ref_7_87_a' style='display:none'> <p><b>a.</b> <a href='/quran/7:46' target=_blank>7:46</a>; <a href='/quran/11:20' target=_blank>11:20</a>; <a href='/quran/14:4' target=_blank>14:4</a>; <a href='/quran/16:89' target=_blank>16:89</a>. (<a href='javascript:void(0)' data-id='ref_7_87_a' class='ref'>close</a>)</p> </div> </div><div><div class='reference' data-id='ref_7_87_b' style='display:none'> <p><b>b.</b> <a href='/quran/3:124' target=_blank>3:124</a>; <a href='/quran/8:27' target=_blank>8:27</a>. (<a href='javascript:void(0)' data-id='ref_7_87_b' class='ref'>close</a>)</p> </div> </div><div><a name='1012'></a><div class='reference' data-id='ref_7_87_1012' style='display:none'> <p><b>1012.</b> The children of Abraham from Keturah, who was a bondwoman, were despised by both the Israelites and the Ishmaelites. They were looked down upon as weak and despicable, but God increased their numbers and gave them wealth and power. (<a href='javascript:void(0)' data-id='ref_7_87_1012' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور ہر شاہراہ پر نہ بیٹھا کرودھمکاتے ہوئے اور اللہ کے راستہ سے روکتے ہوئے اس شخص کو جو اس پر ایمان لایا ہے جبکہ تم اس (راہ) کو ٹیڑھا (دیکھنا) چاہتے ہو۔ اور یاد کرو جب تم بہت تھوڑے تھے پھر اس نے تمہیں کثرت بخشی اور غور کرو کہ فساد کرنے والوں کا انجام کیسا تھا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور ہر رستہ پر (اس نیت سے) نہ بیٹھا کرو کہ جو اللہ پر ایمان لائے اس کو اللہ کے راستہ سے ڈراٶ اور روکو اور اس (خدا کے رستہ) میں غلطیاں پیدا کرنے کی کوشش کرتے رہو اور یاد کرو جب تم تھوڑے تھے تو خدا نے تم کو زیادہ کر دیا تھا اور ہمیشہ نظر میں رکھو کہ فساد کرنے والوں کا انجام کیا ہوتا رہا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et ne vous asseyez pas sur tous les chemins, menaçant ceux qui croient en Allāh les empêchant de suivre Sa voie, et cherchant à la rendre tortueuse. Et souvenez-vous quand vous étiez peu nombreux et Il vous multiplia ; et regardez donc comment ont fini ceux qui ont créé le désordre !</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“No os apostéis en cualquier camino amenazando y apartando del camino de Al-lah a los que creen en Él, e intentando hacerlo tortuoso. Acordaos de cuando erais pocos y Él os multiplicó. ¡Mirad cuál fue el fin de los que sembraron la discordia!</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und lauert nicht drohend auf jedem Weg, indem ihr die von Allahs Weg abtrünnig machen möchtet, die an Ihn glauben, und indem ihr ihn (den Weg) zu krümmen sucht. Und denkt daran, wie ihr wenige wart und Er euch mehrte. Und schauet, wie das Ende derer war, die Unfrieden stifteten!</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:87&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:87&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic88\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic88\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:88' style='text-decoration:underline'>7:88</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(88)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control88\"></i></button> <audio id=\"player88\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِنۡ کَانَ طَآئِفَۃٌ مِّنۡکُمۡ اٰمَنُوۡا بِالَّذِیۡۤ اُرۡسِلۡتُ بِہٖ وَ طَآئِفَۃٌ لَّمۡ یُؤۡمِنُوۡا فَاصۡبِرُوۡا حَتّٰی یَحۡکُمَ اللّٰہُ بَیۡنَنَا ۚ وَ ہُوَ خَیۡرُ الۡحٰکِمِیۡنَ ﴿۸۸﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And if there is a party among you who believes in that with which I have been sent, and a party who does not believe, then have patience until Allah judges between us. And He is the Best of judges.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And if there is a party among you, who believes in that with which I have been sent, and a party who does not believe, then have patience until Allah judges between us. And He is the Best of judges.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اگر تم میں سے ایک گروہ اس (ہدایت) پر ایمان لے آیا ہے جسے دے کر مجھے بھجوایا گیا اور ایک گروہ ایسا ہے جو ایمان نہیں لایا تو صبر کرو یہاں تک کہ اللہ ہمارے درمیان فیصلہ کر دے اور وہ فیصلہ کرنے والوں میں سب سے بہتر ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اگر تم میں سے کوئی گروہ اس پر ایمان لایا ہے جس کے ساتھ میں بھیجا گیا ہوں اور کوئی گروہ ایسا ہے جو ایمان نہیں لایا تو صبر سے کام لو۔ یہاں تک کہ اللہ ہم (مومنوں اور کافروں) میں فیصلہ کر دے اور وہی سب سے بہتر فیصلہ کرنے والا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et s’il y a parmi vous un groupe qui croit en ce avec quoi j’ai été envoyé, et un groupe qui n’y croit pas, alors patientez jusqu’à ce qu’Allāh juge entre nous. Et Il est le Meilleur des juges. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Mas si hay un grupo entre vosotros que cree en aquello con lo que he sido enviado, y un grupo que no cree, tened paciencia hasta que Al-lah juzgue entre nosotros. Él es el Mejor de los jueces”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und wenn unter euch solche sind, die an das glauben, womit ich gesandt bin, und andere, die nicht glauben, so habet Geduld, bis Allah zwischen uns richtet, denn Er ist der beste Richter.\"", "spanish": " Y a Madián enviamos a su hermano Shu’aib. Dijo: “Oh, pueblo mío, adorad a Al-lah; no tenéis otro Dios sino Él. En verdad os ha llegado un Signo claro de vuestro Señor. Entregad pues la medida completa y todo el peso, y no deis a las gentes menos de lo que les pertenece por derecho, ni creéis el desorden en la tierra después deque ha sido pacificada. Esto es mejor para vosotros si sois creyentes.", "urdu": " اور مدین کی طرف ان کے بھائی شعیب کو بھی (یقیناً ہم نے رسول کرکے بھیجا) انہوں نے کہا اے میری قوم! اللہ کی عبادت کرو‘ اس کے سوا تمہارا اور کوئی معبود نہیں۔ تمہارے رب کی طرف سے ایک کھلا نشان آچکا ہے (یعنی خود شعیب علیہ السلام) پس چاہیے کہ ماپ اور تول دونوں پورے دیا کرو اور لوگوں کو ان کی چیزیں حق سے کم نہ دیا کرو اور زمین میں اس کی اصلاح کے بعد فساد نہ کرو اگر تم مومن ہو تو یہ تمہارے لئے بہت ہی اچھا ہے۔"}, {"arabic": " قَالَ الۡمَلَاُ الَّذِیۡنَ اسۡتَکۡبَرُوۡا مِنۡ قَوۡمِہٖ لَنُخۡرِجَنَّکَ یٰشُعَیۡبُ وَ الَّذِیۡنَ اٰمَنُوۡا مَعَکَ مِنۡ قَرۡیَتِنَاۤ اَوۡ لَتَعُوۡدُنَّ فِیۡ مِلَّتِنَا ؕ قَالَ اَوَ لَوۡ کُنَّا کٰرِہِیۡنَ ﴿۟۸۹﴾", "english": " The chief men of his people who were arrogant said, ‘Assuredly, we will drive thee out, O Shu‘aib, and the believers that are with thee, from our town, or you shall have to return to our religion.’ He said: ‘Even though we be unwilling?", "french": " Les chefs de son peuple, qui étaient arrogants, dirent : « Nous te chasserons assurément de notre ville, ô Shu‘aib, et les croyants qui se trouvent avec toi, ou bien vous reviendrez à notre religion. » Il dit : « Comment, même si nous y répugnons ?", "german": " Die Häupter seines Volkes, die hoffärtig waren, sprachen: \"O Schoäb, wir wollen dich und die Gläubigen mit dir aus unserer Stadt hinaustreiben, oder ihr kehrtet zu unserem Bekenntnis zurück.\" Er sprach: \"Auch wenn wir nicht willens sind?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=7:89&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=7:89&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic90\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic90\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/7:90' style='text-decoration:underline'>7:90</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(90)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control90\"></i></button> <audio id=\"player90\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">قَدِ افۡتَرَیۡنَا عَلَی اللّٰہِ کَذِبًا اِنۡ عُدۡنَا فِیۡ مِلَّتِکُمۡ بَعۡدَ اِذۡ نَجّٰنَا اللّٰہُ مِنۡہَا ؕ وَ مَا یَکُوۡنُ لَنَاۤ اَنۡ نَّعُوۡدَ فِیۡہَاۤ اِلَّاۤ اَنۡ یَّشَآءَ اللّٰہُ رَبُّنَا ؕ وَسِعَ رَبُّنَا کُلَّ شَیۡءٍ عِلۡمًا ؕ عَلَی اللّٰہِ تَوَکَّلۡنَا ؕ رَبَّنَا افۡتَحۡ بَیۡنَنَا وَ بَیۡنَ قَوۡمِنَا بِالۡحَقِّ وَ اَنۡتَ خَیۡرُ الۡفٰتِحِیۡنَ ﴿۹۰﴾</p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘We have indeed been forging a lie against Allah, if we <em>now </em>return to your religion after Allah has saved us therefrom. And it behoves us not to return thereto except that Allah, our Lord, should <em>so </em>will. Our Lord comprehends all things in <em>His</em> knowledge. In Allah have we put our trust. <em>So </em>O our Lord, decide Thou between us and between our people with truth, and Thou art the Best of those who decide.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘If we returned to your religion after Allah has saved us therefrom, <i>we would indeed admit that </i>we had been forging a lie against Allah. And it behoves us not to return thereto except that Allah, our Lord, should <i>so </i>will. <sup class='ref'>[<a class='ref' data-id='ref_7_90_a' href='#'>a</a>]</sup>Our Lord comprehends all things in His knowledge. In Allah have we put our trust. <i>So</i>, O our Lord, decide Thou between us and between our people with truth and Thou art the Best of those who decide.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_7_90_a'>a</span></div> <div><div class='reference' data-id='ref_7_90_a' style='display:none'> <p><b>a.</b> <a href='/quran/2:256' target=_blank>2:256</a>; <a href='/quran/40:8' target=_blank>40:8</a>. (<a href='javascript:void(0)' data-id='ref_7_90_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">یقیناً ہم اللہ پر جھوٹ گھڑنے والے ہوں گے اگر ہم اس کے بعد بھی تمہاری ملّت میں لَوٹ آئیں کہ اللہ ہمیں اس سے نجات عطا کرچکا ہے۔ اور ہمارے لئے ہرگز ممکن نہیں کہ ہم اس میں واپس آئیں سوائے اس کے کہ اللہ ہمارا ربّ ایسا چاہے۔ ہمارا ربّ علم کے لحاظ سے ہر چیز پر حاوی ہے۔ اللہ پر ہی ہم توکل کرتے ہیں۔ اے ہمارے ربّ! ہمارے اور ہماری قوم کے درمیان حق کے ساتھ فیصلہ کردے اور تُو فیصلہ کرنے والوں میں سب سے بہتر ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">(حقیقت یہ ہے کہ) اگر ہم تمہارے مذہب میں لوٹ بھی آئیں اس کے بعد کہ اللہ نے ہمیں اس سے نجات دے دی ہے تو (اس کے معنے یہ نہ ہوں گے کہ تم سچے ہو بلکہ یہ ہوں گے کہ) حقیقت میں ہم نے اللہ پرجھوٹا افترا کیا تھا اور (اب ایمان لانے کے بعد) اللہ کی مشیت کے سوااس (پہلے مذہب) کی طرف ہمارا لوٹنا ہمارے اختیار سے باہر ہے۔ ہمارا رب ہرچیزکاکامل علم رکھتا ہے ہم اللہ ہی پر توکل کرتے ہیں (اور کہتے ہیں) اے ہمارے رب! ہمارے اور ہماری قوم کے درمیان سچ کے مطابق فیصلہ کر دے اور تو سب فیصلہ کرنے والوں سے بہتر ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Nous inventerions en vérité un mensonge contre Allāh si nous revenions <em>maintenant</em> à votre religion après qu’Allāh nous en ait sauvés ! et il ne nous sied pas d’y revenir à moins qu’Allāh, notre Seigneur, ne le veuille. En matière de connaissance, notre Seigneur embrasse toute chose. C’est en Allāh que nous avons placé notre confiance. Ô notre Seigneur, décide donc entre nous et notre peuple par la vérité, et Tu es le Meilleur de ceux qui décident. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“En verdad que habríamos estado urdiendo una mentira contra Al-lah, si <em>ahora</em> volvemos a vuestra religión después de que Al-lah nos salvara de ella. Y no nos corresponde a nosotros volver a ella, salvo que Al-lah, nuestro Señor, <em>así</em> lo deseara. En Conocimiento Nuestro Señor alcanza todas las cosas. En Al-lah ponemos nuestra confianza. <em>Así pues,</em> Oh Señor nuestro, decide Tú entre nosotros y entre nuestro pueblo con la verdad, pues Tú eres el Mejor de los que deciden”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Wir hätten ja eine Lüge wider Allah erdichtet, wenn wir zu eurem Bekenntnis zurückkehren würden, nachdem Allah uns daraus gerettet hat. Es ziemt sich nicht für uns, dass wir dazu zurückkehren, es sei denn, dass Allah, unser Herr, es will. Unser Herr umfasst alle Dinge mit Wissen. Auf Allah vertrauen wir. O unser Herr, entscheide denn Du zwischen uns und zwischen unserem Volk nach Wahrheit, denn Du bist der beste Entscheider.\"", "spanish": " Los jefes de su pueblo, que eran arrogantes, dijeron: “Ciertamente e expulsaremos de nuestra ciudad a ti, oh Shu’aib y a los creyentes que están contigo, a menos que volváis a nuestra religión”. Él respondió: “¿Aunque no estuviésemos dispuestos?”.", "urdu": " اس کی قوم میں سے جو لوگ متکبر ہوئے تھے ان میں سے بڑے لوگوں نے کہا اے شعیب! ہم تجھ کو اور ان کو جو تجھ پر ایمان لائے ہیں اپنے ملک سے نکال دیں گے‘ یا پھر تم ہمارے مذہب میں لوٹ آٶ گے اس پر اس نے کہا اور اگر ہم (اس فعل کو) ناپسند بھی کریں (تو کیا پھر بھی نکال دو گے)"}], "Surah": 7}