{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اَلَمۡ نَشۡرَحۡ لَکَ صَدۡرَکَ ۙ﴿۲﴾", "english": " Have We not opened for thee thy bosom,", "french": " N’avons-Nous pas ouvert pour toi ta poitrine ?", "german": " Haben Wir dir nicht deine Brust erschlossen,", "spanish": " ¿Acaso no te hemos abierto el pecho,", "urdu": " کیا ہم نے تیرے لئے تیرے سینہ کو کھول نہیں دیا۔"}, {"arabic": " وَ وَضَعۡنَا عَنۡکَ وِزۡرَکَ ۙ﴿۳﴾", "english": " And removed from thee thy burden", "french": " Et ne t’avons-Nous pas soulagé de ton fardeau", "german": " und dir abgenommen deine Last,", "spanish": " Y retirado de ti tu carga,", "urdu": " اور تیرے اس بوجھ کو تجھ پر سے اتار کر پھینک نہیں دیا۔"}, {"arabic": " الَّذِیۡۤ اَنۡقَضَ ظَہۡرَکَ ۙ﴿۴﴾", "english": " Which had well nigh broken thy back,", "french": " Qui brisait presque ton échine ?", "german": " die dir den Rücken niederwuchtete,", "spanish": " Que había estado a punto de romperte la espalda,", "urdu": " ایسا بوجھ‘ جس نے تیری کمر توڑ رکھی تھی۔"}, {"arabic": " وَ رَفَعۡنَا لَکَ ذِکۡرَکَ ؕ﴿۵﴾", "english": " And We exalted thy name?", "french": " Et n’avons-Nous pas rehaussé ta renommée ?", "german": " und haben Wir (nicht) deinen Ruf erhöht?", "spanish": " Y exaltado tu nombre?", "urdu": " اور تیرے ذکر کو بھی ہم نے بلند کر دیا ہے۔"}, {"arabic": " فَاِنَّ مَعَ الۡعُسۡرِ یُسۡرًا ۙ﴿۶﴾", "english": " Surely there is ease after hardship.", "french": " Assurément, il y a le soulagement à côté des difficultés.", "german": " Also, wahrlich, kommt mit der Drangsal die Erleichterung,", "spanish": " En verdad, tras toda tribulación hay siempre desahogo.", "urdu": " پس (یاد رکھ کہ) اس تنگی کے ساتھ ایک بڑی کامیابی مقدر ہے۔"}, {"arabic": " اِنَّ مَعَ الۡعُسۡرِ یُسۡرًا ؕ﴿۷﴾", "english": " Aye , surely there is ease after hardship.", "french": " Oui , sûrement il y a le soulagement à côté des difficultés.", "german": " wahrlich, mit der Drangsal kommt die Erleichterung.", "spanish": " ¡Si! En verdad que hay desahogo después de la tribulación.", "urdu": " (ہاں) یقیناً اس تنگی کے ساتھ ایک (اور بھی) بڑی کامیابی (مقدر) ہے۔"}, {"arabic": " فَاِذَا فَرَغۡتَ فَانۡصَبۡ ۙ﴿۸﴾", "english": " So when thou art free, strive hard,", "french": " Alors, lorsque tu es libre de tes tâches immédiates , sois résolu,", "german": " Wenn du nun entlastet bist, mühe dich eifrig.", "spanish": " Así pues, cuando estés libre esfuérzate al máximo,", "urdu": " پس جب (بھی) تو فارغ ہو تو (خدا تعالیٰ سے ملنے کے لئے) پھر کوشش میں لگ جا۔"}, {"arabic": " وَ اِلٰی رَبِّکَ فَارۡغَبۡ ٪﴿۹﴾", "english": " And to thy Lord do thou attend whole - heartedly .", "french": " Et tourne-toi vers ton Seigneur avec empressement.", "german": " Und zu deinem Herrn wende dich, Ihn begierig suchend.", "spanish": " Y vuelve hacia tu Señor buscándole con anhelo.", "urdu": " اور تو اپنے رب کی طرف متوجہ ہو۔"}], "Surah": 94}