{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Cle­mente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ الضُّحٰی ۙ﴿۲﴾", "english": " By the growing brightness of the forenoon,", "french": " Par la lumière grandissante de la matinée,", "german": " Beim Vormittage,", "spanish": " Por la claridad de la ma­ ñana,", "urdu": " میں دن کو شہادت کے طور پر پیش کرتا ہوں‘ جب وہ روشن ہو جائے۔"}, {"arabic": " وَ الَّیۡلِ اِذَا سَجٰی ۙ﴿۳﴾", "english": " And by the night when it becomes still,", "french": " Et par la nuit lorsque son obscurité se répand,", "german": " und bei der Nacht, wenn sie am stillsten ist,", "spanish": " Y por la noche cuando se ex­ tiende ,", "urdu": " اور رات کو (شہادت کے طور پر پیش کرتا ہوں) جب اس کی تاریکی چاروں طرف پھیل جائے۔"}, {"arabic": " مَا وَدَّعَکَ رَبُّکَ وَ مَا قَلٰی ؕ﴿۴﴾", "english": " Thy Lord has not forsaken thee, nor is He displeased with thee .", "french": " Ton Seigneur ne t’a pas abandonné, et Il n’est pas non plus mécontent de toi .", "german": " dein Herr hat dich nicht verlassen, noch ist Er böse.", "spanish": " u Señor no te ha abandonado, ni está disgustado contigo .", "urdu": " کہ نہ تیرے رب نے تجھے ترک کیا ہے اور نہ تجھ سے ناراض ہوا ہے۔"}, {"arabic": " وَ لَلۡاٰخِرَۃُ خَیۡرٌ لَّکَ مِنَ الۡاُوۡلٰی ؕ﴿۵﴾", "english": " Surely every hour that follows is better for thee than the one that precedes.", "french": " Assurément, chaque instant qui suit est meilleur pour toi que le précédent.", "german": " Wahrlich, jede (Stunde), die kommt, wird besser für dich sein als die, die (ihr) vorausging.", "spanish": " En verdad que la parte posterior será mejor para ti que la anterior.", "urdu": " اور (دیکھ تو سہی کہ) تیری ہر پیچھے آنے والی گھڑی پہلی سے بہتر ہوتی ہے۔"}, {"arabic": " وَ لَسَوۡفَ یُعۡطِیۡکَ رَبُّکَ فَتَرۡضٰی ؕ﴿۶﴾", "english": " And thy Lord will soon give thee and thou wilt be well pleased.", "french": " Et ton Seigneur t’accordera bientôt et tu seras très satisfait.", "german": " Und fürwahr, dein Herr wird dir geben und du wirst wohlzufrieden sein.", "spanish": " Y tu Señor pronto te dará y tú te sentirás complacido.", "urdu": " اور ضرور تیرا رب تجھے (وہ کچھ دے کر رہے گا جس پر تو خوش ہو جائے گا۔"}, {"arabic": " اَلَمۡ یَجِدۡکَ یَتِیۡمًا فَاٰوٰی ۪﴿۷﴾", "english": " Did He not find thee an orphan and give thee shelter?", "french": " Ne t’a-t-Il pas trouvé orphelin et Il t ’a donné refuge ?", "german": " Fand Er dich nicht als Waise und gab (dir) Obdach?", "spanish": " ¿Por ventura no te encontró huérfano y te dio amparo?", "urdu": " کیا (اس زندگی میں اس کا سلوک تیرے ساتھ غیر معمولی نہیں رہا اور) اس نے تجھے یتیم پاکر (اپنے زیر سایہ) جگہ نہیں دی۔"}, {"arabic": " وَ وَجَدَکَ ضَآلًّا فَہَدٰی ۪﴿۸﴾", "english": " And He found thee wandering in search for Him and guided thee unto Himself .", "french": " Et Il t’a trouvé errant à Sa recherche et Il t’ a guidé vers Lui-Même .", "german": " Er fand dich irrend (in deiner Sehnsucht nach Ihm) und führte (dich) richtig.", "spanish": " Y te encontró vagando en Su busca y te guió hacia Sí mismo .", "urdu": " اور (جب) اس نے تجھے (اپنی قوم کی محبت میں) سرشار دیکھا تو (ان کی اصلاح کا) صحیح راستہ تجھے بتا دیا۔"}, {"arabic": " وَ وَجَدَکَ عَآئِلًا فَاَغۡنٰی ؕ﴿۹﴾", "english": " And He found thee in want and enriched thee .", "french": " Et Il t’a trouvé dans le besoin et Il t ’a enrichi.", "german": " Und Er fand dich in Armut und machte (dich) reich.", "spanish": " Y te halló necesitado y te enri­queció.", "urdu": " اور جب تجھے کثیر العیال پایا تو (اپنے فضل سے) غنی کر دیا۔"}, {"arabic": " فَاَمَّا الۡیَتِیۡمَ فَلَا تَقۡہَرۡ ؕ﴿۱۰﴾", "english": " So the orphan, oppress not,", "french": " Donc, quant à l’orphelin, ne le maltraite pas,", "german": " Darum bedrücke nicht die Waise,", "spanish": " No maltrates, pues, al huér­fano.", "urdu": " پس (ان احسانوں کے نتیجہ میں) تو بھی یتیموں کو ابھارنے میں لگا رہ۔"}, {"arabic": " وَ اَمَّا السَّآئِلَ فَلَا تَنۡہَرۡ ﴿ؕ۱۱﴾", "english": " And him who seeks thy help , chide not,", "french": " Et quant au mendiant, ne le réprimande pas,", "german": " und schilt nicht den Bettler,", "spanish": " En cuanto al mendigo, no le reprendas,", "urdu": " اور سوالی کو تو جھڑک مت۔"}, {"arabic": " وَ اَمَّا بِنِعۡمَۃِ رَبِّکَ فَحَدِّثۡ ﴿٪۱۲﴾", "english": " And the bounty of thy Lord, proclaim.", "french": " Et quant à la munificence de ton Seigneur, proclame -la aux autres .", "german": " und erzähle von der Gnade deines Herrn.", "spanish": " Y en cuanto a la bondad de tu Señor, relátala a los demás .", "urdu": " اور تو اپنے رب کی نعمت کا ضرور اظہار کرتا رہ۔"}], "Surah": 93}