{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِذَا السَّمَآءُ انۡشَقَّتۡ ۙ﴿۲﴾", "english": " When the heaven bursts asunder,", "french": " Lorsque le ciel éclatera,", "german": " Wenn der Himmel birst;", "spanish": " Cuando el cielo estalle en pedazos,", "urdu": " جب آسمان پھٹ جائے گا۔"}, {"arabic": " وَ اَذِنَتۡ لِرَبِّہَا وَ حُقَّتۡ ۙ﴿۳﴾", "english": " And gives ear to her Lord — and this is incumbent upon her —", "french": " Et qu ’il écoutera son Seigneur – et cela lui incombe –", "german": " und seinem Herrn horcht – und (das) ist ihm Pflicht –,", "spanish": " Y preste oídos a su Señor ‑y esto le corresponde a él‑", "urdu": " اور اپنے رب (کی بات سننے) کے لئے کان دھرے گا۔ اور یہی (اس پر) فرض ہے۔"}, {"arabic": " وَ اِذَا الۡاَرۡضُ مُدَّتۡ ۙ﴿۴﴾", "english": " And when the earth is spread out,", "french": " Et lorsque la terre sera étendue,", "german": " und wenn die Erde sich dehnt,", "spanish": " Y cuando la tierra se extienda,", "urdu": " اور جب زمین پھیلا دی جائے گی۔"}, {"arabic": " وَ اَلۡقَتۡ مَا فِیۡہَا وَ تَخَلَّتۡ ۙ﴿۵﴾", "english": " And casts out all that is in her, and becomes empty;", "french": " Et qu ’elle rejettera tout ce qui est en elle, et se videra ;", "german": " und auswirft, was in ihr ist, und leer wird;", "spanish": " Y arroje fuera todo lo que hay en ella, quedando vacía;", "urdu": " اور جو کچھ اس میں ہے وہ اس کو نکال پھینکے گی‘ اور خالی ہو جائے گی۔"}, {"arabic": " وَ اَذِنَتۡ لِرَبِّہَا وَ حُقَّتۡ ؕ﴿۶﴾", "english": " And gives ear to her Lord — and this is incumbent upon her —", "french": " Et qu ’elle écoutera son Seigneur – et cela lui incombe.", "german": " und ihrem Herrn horcht – und (das) ist ihr Pflicht –,", "spanish": " Y preste oídos a su Señor ‑y esto le corresponde a ella‑", "urdu": " اور اپنے رب (کی بات سننے) کے لئے کان دھرے گی اور یہی (اس پر) فرض ہے۔"}, {"arabic": " یٰۤاَیُّہَا الۡاِنۡسَانُ اِنَّکَ کَادِحٌ اِلٰی رَبِّکَ کَدۡحًا فَمُلٰقِیۡہِ ۚ﴿۷﴾", "english": " Thou, O man, art verily labouring towards thy Lord, a hard labouring; then thou art going to meet Him.", "french": " Toi, ô homme, tu peines en vérité vers ton Seigneur d’un dur labeur ; alors tu Le rencontreras.", "german": " O Mensch, du mühst dich hart um deinen Herrn, so sollst du Ihm begegnen.", "spanish": " Tú, ¡Oh hombre!, que trabajas ciertamente por comparecer ante tu Señor, con un trabajo duro; entonces L e encontrarás.", "urdu": " اے انسان! تو اپنے رب کی طرف پورا زور لگا کر جانے والا ہے (اور) پھر اس سے ملنے والا ہے۔"}, {"arabic": " فَاَمَّا مَنۡ اُوۡتِیَ کِتٰبَہٗ بِیَمِیۡنِہٖ ۙ﴿۸﴾", "english": " Then as for him who is given his book of record in his right hand,", "french": " Alors quant à celui à qui sera remis son dossier en sa main droite,", "german": " Was nun den anlangt, dem sein Buch (der Rechenschaft) in seine Rechte gegeben wird,", "spanish": " Entonces, a aquél a quien se le haya dado su libro de registro en su mano derecha,", "urdu": " پس جس کے داہنے ہاتھ میں اس کا اعمال نامہ دیا جائے گا۔"}, {"arabic": " فَسَوۡفَ یُحَاسَبُ حِسَابًا یَّسِیۡرًا ۙ﴿۹﴾", "english": " He will soon have an easy reckoning,", "french": " Lui, en vérité, aura un compte facile,", "german": " so wird er bald ein leichtes Gericht haben,", "spanish": " Pronto tendrá una cuenta fácil,", "urdu": " تو اس سے جلد ہی آسان حساب لے لیا جائے گا۔"}, {"arabic": " وَّ یَنۡقَلِبُ اِلٰۤی اَہۡلِہٖ مَسۡرُوۡرًا ؕ﴿۱۰﴾", "english": " And he will return to his household, rejoicing.", "french": " Et il retournera jubilant à sa famille.", "german": " und wird frohgemut zu den Seinen zurückkehren.", "spanish": " Y volverá a su familia, regocijad o.", "urdu": " اور وہ اپنے اہل کی طرف خوش (بخوش) لوٹے گا۔"}, {"arabic": " وَ اَمَّا مَنۡ اُوۡتِیَ کِتٰبَہٗ وَرَآءَ ظَہۡرِہٖ ﴿ۙ۱۱﴾", "english": " But as for him who will have his book of record given to him behind his back,", "french": " Mais quant à celui à qui son dossier sera remis derrière son dos,", "german": " Was aber den anlangt, dem sein Buch hinter seinem Rücken gegeben wird,", "spanish": " Mas en cuanto a aquel se le entregue su libro de registro detrás de la espalda,", "urdu": " اور جس کو اس کی پیٹھ کے پیچھے سے اس کا اعمال نامہ دیا جائے گا۔"}, {"arabic": " فَسَوۡفَ یَدۡعُوۡا ثُبُوۡرًا ﴿ۙ۱۲﴾", "english": " He will soon call for destruction,", "french": " Certainement, il priera pour son propre anéantissement,", "german": " so wird er sich bald Vernichtung herbeiwünschen,", "spanish": " Pronto clamará por la destrucción,", "urdu": " وہ جلد ہی (اپنے منہ سے اپنی) ہلاکت کو بلائے گا۔"}, {"arabic": " وَّ یَصۡلٰی سَعِیۡرًا ﴿ؕ۱۳﴾", "english": " And he will burn in a blazing Fire.", "french": " Et il brûlera dans un Feu ardent.", "german": " und wird in ein flammendes Feuer eingehen.", "spanish": " Y arderá en un Fuego lla­meante.", "urdu": " اور بھڑکتی ہوئی آگ میں داخل ہوگا۔"}, {"arabic": " اِنَّہٗ کَانَ فِیۡۤ اَہۡلِہٖ مَسۡرُوۡرًا ﴿ؕ۱۴﴾", "english": " Verily, before this he lived joyfully among his family.", "french": " En vérité, il vivait joyeusement auparavant au sein de sa famille.", "german": " Gewiss, er lebte glücklich dahin unter seinen Angehörigen.", "spanish": " En verdad, antes de esto, vivía alegremente entre su familia.", "urdu": " وہ اپنے اہل و عیال میں خوب خوش رہا کرتا تھا۔"}, {"arabic": " اِنَّہٗ ظَنَّ اَنۡ لَّنۡ یَّحُوۡرَ ﴿ۚۛ۱۵﴾", "english": " He indeed thought that he would never return to God .", "french": " En vérité, il s’imaginait que jamais il ne ressusciterait.", "german": " Er dachte bestimmt, dass er nie (zu Gott) zurückkehren würde.", "spanish": " En verdad, pensaba que nun­ca retornaría a Dios .", "urdu": " (اور) یقین رکھتا تھا کہ فراخی کے بعد کبھی اسے تنگی نہ آئے گی۔"}, {"arabic": " بَلٰۤی ۚۛ اِنَّ رَبَّہٗ کَانَ بِہٖ بَصِیۡرًا ﴿ؕ۱۶﴾", "english": " Yea! surely, his Lord sees him full well.", "french": " Oui ! assurément, son Seigneur le voit très bien.", "german": " Ja! wahrlich, sein Herr sieht ihn wohl.", "spanish": " ¡Sí! Ciertamente su Señor le observa muy bien.", "urdu": " مگر ایسا تو (ضرور) ہونا تھا‘ کیونکہ اس کا رب اسے یقیناً دیکھ رہا تھا۔"}, {"arabic": " فَلَاۤ اُقۡسِمُ بِالشَّفَقِ ﴿ۙ۱۷﴾", "english": " But nay! I call to witness the evening twilight,", "french": " Mais non ! Je prends à témoin la lueur du crépuscule,", "german": " Doch nein! Ich rufe das abendliche Zwielicht zum Zeugen,", "spanish": " Mas ¡No!. Convoco como testigo al crepúsculo de la tarde,", "urdu": " اور ان کے خیال کی غلطی کے ثبوت میں ہم شفق کو پیش کرتے ہیں۔"}, {"arabic": " وَ الَّیۡلِ وَ مَا وَسَقَ ﴿ۙ۱۸﴾", "english": " And the night and all that it envelops,", "french": " Et la nuit, et tout ce qu’elle enveloppe,", "german": " und die Nacht und was sie verhüllt,", "spanish": " Y a la noche y a todo lo que ella envuelve,", "urdu": " اور رات کو بھی اور اسے بھی جسے وہ سمیٹ لیتی ہے۔"}, {"arabic": " وَ الۡقَمَرِ اِذَا اتَّسَقَ ﴿ۙ۱۹﴾", "english": " And the moon when it becomes full,", "french": " Et la lune lorsqu’elle devient pleine,", "german": " und den Mond, wenn er voll wird,", "spanish": " Y a la luna cuando entra en plenilunio,", "urdu": " اور چاند کو (بھی) جب وہ تیرھویں کا ہو جائے (شہادت کے طور پر پیش کرتے ہیں)"}, {"arabic": " لَتَرۡکَبُنَّ طَبَقًا عَنۡ طَبَقٍ ﴿ؕ۲۰﴾", "english": " That you shall assuredly pass on from one stage to another.", "french": " Que vous passerez assurément d’un état à un autre.", "german": " dass ihr sicherlich von einem Zustand in den anderen versetzt werden sollt.", "spanish": " De que pasaréis ciertamente de una etapa a otra.", "urdu": " تم ضرور درجہ بدرجہ ان حالتوں کو پہنچو گے۔"}, {"arabic": " فَمَا لَہُمۡ لَا یُؤۡمِنُوۡنَ ﴿ۙ۲۱﴾", "english": " So what is the matter with them that they believe not,", "french": " Aussi, qu’ont-ils pour ne pas croire ?", "german": " Was also ist ihnen, dass sie nicht glauben,", "spanish": " Por tanto, ¿qué les ocurre que no creen,", "urdu": " اور ان کفار کو کیا ہوا ہے کہ ایمان نہیں لاتے۔"}, {"arabic": " وَ اِذَا قُرِئَ عَلَیۡہِمُ الۡقُرۡاٰنُ لَا یَسۡجُدُوۡنَ ﴿ؕٛ۲۲﴾", "english": " And when the Qur’an is recited unto them, they do not bow down in submission;", "french": " Et, lorsque le Coran leur est récité, ils ne se prosternent pas en soumission ?", "german": " und wenn ihnen der Qur-ân vorgetragen wird, sie sich nicht niederwerfen?", "spanish": " Y cuando se les recita el Corán, no se inclinan en sumisión?", "urdu": " اور جب ان کے سامنے قرآن پڑھا جائے‘ تو سجدہ نہیں کرتے۔"}, {"arabic": " بَلِ الَّذِیۡنَ کَفَرُوۡا یُکَذِّبُوۡنَ ﴿۫ۖ۲۳﴾", "english": " On the contrary, those who disbelieve reject it .", "french": " Au contraire, ceux qui ne croient pas, le rejettent.", "german": " Im Gegenteil, die da ungläubig sind, verwerfen (ihn).", "spanish": " Al contrario, los que no creen, lo rechazan.", "urdu": " بلکہ کافر اپنے کفر میں اتنے بڑھ گئے ہیں کہ وہ (قرآن کی سچائی کو) جھٹلانے لگ گئے ہیں۔"}, {"arabic": " وَ اللّٰہُ اَعۡلَمُ بِمَا یُوۡعُوۡنَ ﴿۫ۖ۲۴﴾", "english": " And Allah knows best what they keep hidden in their hearts .", "french": " Et Allāh sait le mieux ce qu’ils tiennent caché.", "german": " Und Allah weiß am besten, was sie verbergen.", "spanish": " Mas Al‑lah sabe muy bien lo que conservan oculto en sus cora­zones .", "urdu": " اور اللہ اسے جسے وہ (اپنے دلوں میں) چھپائے ہوئے ہیں خوب جانتا ہے۔"}, {"arabic": " فَبَشِّرۡہُمۡ بِعَذَابٍ اَلِیۡمٍ ﴿ۙ۲۵﴾", "english": " So give them tidings of a painful punishment.", "french": " Aussi, annonce-leur la nouvelle d’un châtiment douloureux.", "german": " Drum verkünde ihnen schmerzliche Strafe.", "spanish": " Dales, pues, la noticia de un castigo doloroso.", "urdu": " پس (ان کے مخفی خیالات اور ظاہر اعمال کی وجہ سے) انہیں دردناک عذاب کی خبر دے دے۔"}, {"arabic": " اِلَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ لَہُمۡ اَجۡرٌ غَیۡرُ مَمۡنُوۡنٍ ﴿٪۲۶﴾", "english": " But as to those who believe and do good works, theirs is an unending reward.", "french": " Mais quant à ceux qui croient et font de bonnes œuvres, il y a pour eux une récompense non interrompue.", "german": " Die aber, die glauben und gute Werke tun, ihrer ist unendlicher Lohn.", "spanish": " Sin embargo, los que crean y practiquen el bien, tendrán una recompensa inagotable.", "urdu": " مگر وہ (لوگ) جو ایمان لائے اور انہوں نے مناسب حال عمل کیے۔ انہیں ایک نہ ختم ہونے والا (نیک) اجر ملنے والا ہے۔"}], "Surah": 84}