{"Ayats": [{"arabic": " بَرَآءَۃٌ مِّنَ اللّٰہِ وَ رَسُوۡلِہٖۤ اِلَی الَّذِیۡنَ عٰہَدۡتُّمۡ مِّنَ الۡمُشۡرِکِیۡنَ ؕ﴿۱﴾", "english": " This is a declaration of complete absolution on the part of Allah and His Messenger from all obligation to the idolaters with whom you had made promises.", "french": " Ceci est une déclaration d’absolution complète, de la part d’Allāh et de Son Messager, aux idolâtres avec lesquels vous aviez fait un pacte .", "german": " Eine Lossprechung Allahs und Seines Gesandten (von jeglicher Verpflichtung) gegenüber den Götzendienern, denen ihr etwas versprochen habt.", "spanish": " Ésta es una declaración de completa absolución por parte de Al-lah y Su Mensajero de toda obligación para con los idólatras a quienes habéis hecho promesas.", "urdu": " اللہ اور اس کے رسول کی طرف سے (ان آیات میں) ان مشرکوں (کے الزام) سے برأ ت کا اعلان کیا جاتا ہے جن سے تم نے شرط باندھی تھی (کہ تمہاری فتح ہوگی اور ان کی شکست) ۔"}, {"arabic": " فَسِیۡحُوۡا فِی الۡاَرۡضِ اَرۡبَعَۃَ اَشۡہُرٍ وَّ اعۡلَمُوۡۤا اَنَّکُمۡ غَیۡرُ مُعۡجِزِی اللّٰہِ ۙ وَ اَنَّ اللّٰہَ مُخۡزِی الۡکٰفِرِیۡنَ ﴿۲﴾", "english": " So go about in the land for four months, and know that you cannot frustrate the plan of Allah and that Allah will humiliate the disbelievers.", "french": " Parcourez donc le pays pendant quatre mois, et sachez que vous n’êtes pas capables de déjouer le plan d ’Allāh et qu’Allāh humiliera les mécréants.", "german": " So zieht denn vier Monate lang im Lande umher und wisset, dass ihr Allahs (Plan) nicht zuschanden machen könnt und dass Allah die Ungläubigen demütigen wird.", "spanish": " Viajad, pues, por el país durante cuatro meses, y sabed que no podréis frustrar el plan de Al-lah y que Al-lah humillará a los incrédulos.", "urdu": " چنانچہ ملک عرب میں چار مہینے پھر کر دیکھ لو اور جان لو کہ تم اللہ کو ہرا نہیں سکتے اور یہ (بھی جان لو) کہ اللہ کفار کو رسوا کرکے چھوڑے گا۔"}, {"arabic": " وَ اَذَانٌ مِّنَ اللّٰہِ وَ رَسُوۡلِہٖۤ اِلَی النَّاسِ یَوۡمَ الۡحَجِّ الۡاَکۡبَرِ اَنَّ اللّٰہَ بَرِیۡٓءٌ مِّنَ الۡمُشۡرِکِیۡنَ ۬ۙ وَ رَسُوۡلُہٗ ؕ فَاِنۡ تُبۡتُمۡ فَہُوَ خَیۡرٌ لَّکُمۡ ۚ وَ اِنۡ تَوَلَّیۡتُمۡ فَاعۡلَمُوۡۤا اَنَّکُمۡ غَیۡرُ مُعۡجِزِی اللّٰہِ ؕ وَ بَشِّرِ الَّذِیۡنَ کَفَرُوۡا بِعَذَابٍ اَلِیۡمٍ ۙ﴿۳﴾", "english": " And this is a proclamation from Allah and His Messenger to the people on the day of the Greater Pilgrimage, that Allah is clear of the idolaters, and so is His Messenger. So if you repent, it will be better for you; but if you turn away, then know that you cannot frustrate the plan of Allah. And give tidings of a painful punishment to those who disbelieve,", "french": "", "german": "", "spanish": "", "urdu": ""}, {"arabic": " اِلَّا الَّذِیۡنَ عٰہَدۡتُّمۡ مِّنَ الۡمُشۡرِکِیۡنَ ثُمَّ لَمۡ یَنۡقُصُوۡکُمۡ شَیۡئًا وَّ لَمۡ یُظَاہِرُوۡا عَلَیۡکُمۡ اَحَدًا فَاَتِمُّوۡۤا اِلَیۡہِمۡ عَہۡدَہُمۡ اِلٰی مُدَّتِہِمۡ ؕ اِنَّ اللّٰہَ یُحِبُّ الۡمُتَّقِیۡنَ ﴿۴﴾", "english": " Excepting those of the idolaters with whom you have entered into a treaty and who have not subsequently failed you in anything nor aided anyone against you. So fulfil to these the treaty you have made with them till their term. Surely, Allah loves those who are righteous.", "french": " Sauf ceux des idolâtres avec qui vous avez conclu un traité, et qui n’ont failli aucunement dans l’accomplissement de leurs obligations envers vous, et qui n’ont soutenu personne contre vous. Remplissez donc l’engagement conclu avec ceux-là jusqu’au terme convenu. Assurément, Allāh aime ceux qui sont droits.", "german": " Mit Ausnahme jener Götzendiener, mit denen ihr einen Vertrag eingegangen seid, und die es euch nicht an etwas haben gebrechen lassen und nicht andere wider euch unterstützt haben. Diesen gegenüber haltet den Vertrag, bis zum Ablauf der Frist. Wahrlich, Allah liebt die Gerechten.", "spanish": " Exceptuados aquellos de los idólatras con los que habéis concluido un tratado y que no os hayan fallado en el cumplimiento de sus obligaciones ni ayudado a nadie contra vosotros. Cumplid pues estos tratados que habéis establecido con ellos hasta su término. En verdad, Al-lah ama a los justos.", "urdu": " ہاں مشرکوں میں سے جن سے تم نے عہد کیا ہے پھر انہوں نے تم سے (بالکل) عہد شکنی نہیں کی‘ اور تمہارے خلاف کسی کی مدد نہیں کی تم ان کے عہد کو ان (عہدوں) کی مدت (مقررہ) تک نباہو (اور ان کو ملک سے نہ نکالو) اللہ یقیناً متقیوں کو پسند کرتا ہے۔"}, {"arabic": " فَاِذَا انۡسَلَخَ الۡاَشۡہُرُ الۡحُرُمُ فَاقۡتُلُوا الۡمُشۡرِکِیۡنَ حَیۡثُ وَجَدۡتُّمُوۡہُمۡ وَ خُذُوۡہُمۡ وَ احۡصُرُوۡہُمۡ وَ اقۡعُدُوۡا لَہُمۡ کُلَّ مَرۡصَدٍ ۚ فَاِنۡ تَابُوۡا وَ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ فَخَلُّوۡا سَبِیۡلَہُمۡ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۵﴾", "english": " And when the forbidden months have passed, kill the idolaters wherever you find them and take them prisoners , and beleaguer them, and lie in wait for them at every place of ambush. But if they repent and observe Prayer and pay the Zakat, then leave their way free . Surely, Allah is Most Forgiving, Merciful.", "french": " Et quand les mois sacrés seront écoulés, tuez les idolâtres qui ont violé leur pacte où que vous les trouverez, et capturez-les et assiégez-les, et attendez-les au passage à tous les affûts. Mais s’ils se repentent et observent la Prière, et paient la Zakāt, alors laissez-leur le chemin libre, Assurément Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und wenn die verbotenen Monate verflossen sind, dann tötet die Götzendiener, wo ihr sie trefft, und ergreift sie, und belagert sie, und lauert ihnen auf in jedem Hinterhalt. Bereuen sie aber und verrichten das Gebet und zahlen die Zakât, dann gebt ihnen den Weg frei. Wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Y cuando hayan transcurrido los meses sagrados, matad a los dólatras dondequiera los encontréis, tomadlos como prisioneros, sitiadlos y permaneced a su espera emboscados en cualquier lugar. Pero si se arrepienten, cumplen la Oración y pagan el Zakat, dejadles que sigan libremente su camino. Al-lah, en verdad, es el Sumo Indulgente, Misericordioso.", "urdu": " پس جب وہ چار مہینے گزر جائیں جن میں (عرب کے کافروں سے اوپر کی آیات میں) لڑائی سے منع کیا گیا تھا (مگر پھر بھی وہ معاہدہ کی طرف راغب نہیں ہوئے حالانکہ وہ اس سے پہلے مسلمانوں سے لڑ رہے تھے) تو مشرکوں کے اس خاص گروہ کو جہاں بھی پاٶ قتل کرو۔ اور ان کو گرفتار کرلو اور ان کو (ان کے قلعوں میں) محصور کر دو اور ہر گھات کی جگہ پر ان کے لئے بیٹھو۔ پس اگر وہ توبہ کریں اور نماز قائم کریں اور زکٰوۃ دیں تو انکا راستہ کھول دو اللہ یقیناً بڑا بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ اِنۡ اَحَدٌ مِّنَ الۡمُشۡرِکِیۡنَ اسۡتَجَارَکَ فَاَجِرۡہُ حَتّٰی یَسۡمَعَ کَلٰمَ اللّٰہِ ثُمَّ اَبۡلِغۡہُ مَاۡمَنَہٗ ؕ ذٰلِکَ بِاَنَّہُمۡ قَوۡمٌ لَّا یَعۡلَمُوۡنَ ٪﴿۶﴾", "english": " And if anyone of the idolaters ask protection of thee, grant him protection so that he may hear the word of Allah; then convey him to his place of security. That is because they are a people who have no knowledge.", "french": " Et si quelqu’un d’entre les idolâtres te demande protection, accorde-lui la protection afin qu’il puisse entendre la parole d’Allāh ; ensuite, conduis-le à son lieu de sécurité. Et ce, parce que ce sont des gens qui ne savent pas.", "german": " Und wenn einer der Götzendiener bei dir Schutz sucht, dann gewähre ihm Schutz, bis er Allahs Wort vernehmen kann; hierauf lasse ihn die Stätte seiner Sicherheit erreichen. Dies weil sie ein unwissendes Volk sind.", "spanish": " Mas si alguno de los idólatras te pide protección, concédesela para que oiga la palabra de Al-lah. Llévalo después a su lugar seguro. Esto es porque se trata de gentes que no saben.", "urdu": " اور مشرکوں سے اگر کوئی تجھ سے پناہ مانگے تو اس کو پناہ دے یہاں تک کہ وہ اللہ کا کلام سن لے۔ پھر اس کو اس کے امن کی جگہ تک پہنچا دے۔ کیونکہ وہ ایسی قوم ہے جو (حقیقت کو) نہیں جانتی۔"}, {"arabic": " کَیۡفَ یَکُوۡنُ لِلۡمُشۡرِکِیۡنَ عَہۡدٌ عِنۡدَ اللّٰہِ وَ عِنۡدَ رَسُوۡلِہٖۤ اِلَّا الَّذِیۡنَ عٰہَدۡتُّمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَرَامِ ۚ فَمَا اسۡتَقَامُوۡا لَکُمۡ فَاسۡتَقِیۡمُوۡا لَہُمۡ ؕ اِنَّ اللّٰہَ یُحِبُّ الۡمُتَّقِیۡنَ ﴿۷﴾", "english": " How can there be a treaty of these idolaters with Allah and His Messenger, except those with whom you entered into a treaty at the Sacred Mosque? So, as long as they stand true to you, stand true to them. Surely, Allah loves those who are righteous.", "french": " Comment un traité pourrait-il être con­clu par Allāh et Son Messager avec les idolâtres, à part ceux avec qui vous avez conclu un traité prés de la Sainte Mosquée ? Alors, tant qu’ils sont droits envers vous, soyez droits envers eux. Allāh aime assurément ceux qui agissent avec droiture.", "german": " Wie kann es einen Vertrag geben zwischen den Götzendienern und Allah und Seinem Gesandten, die allein ausgenommen, mit denen ihr bei der Heiligen Moschee ein Bündnis einginget? Solange diese euch treu bleiben, haltet ihnen die Treue. Wahrlich, Allah liebt die Redlichen.", "spanish": " ¿Cómo puede haber un tratado entre estos idólatras y Al-lah y Su Mensajero, excepto con aquellos con quienes has cerrado un pacto en la Mezquita Sagrada? Por ello, mientras permanezcan sinceros con vosotros, sed sinceros con ellos. En verdad, Al-lah ama a los justos.", "urdu": " اللہ اور اس کے رسول مشرکوں سے کس طرح عہدوپیمان کر سکتے ہیں۔ سوائے ان (مشرکوں) کے جن کے ساتھ تم نے مسجد حرام کے پاس عہد کیا تھا۔ پس جب تک وہ (تمہارے مقابلہ پر) اپنے عہد پر قائم رہیں‘ تم بھی ان کے ساتھ معاہدہ پر قائم رہو۔ اللہ (عہد توڑنے سے) بچنے والوں کو ہی پسند کرتا ہے۔"}, {"arabic": " کَیۡفَ وَ اِنۡ یَّظۡہَرُوۡا عَلَیۡکُمۡ لَا یَرۡقُبُوۡا فِیۡکُمۡ اِلًّا وَّ لَا ذِمَّۃً ؕ یُرۡضُوۡنَکُمۡ بِاَفۡوَاہِہِمۡ وَ تَاۡبٰی قُلُوۡبُہُمۡ ۚ وَ اَکۡثَرُہُمۡ فٰسِقُوۡنَ ۚ﴿۸﴾", "english": " How can it be when, if they prevail against you, they would not observe any tie of relationship or covenant in respect of you? They would please you with their mouths, while their hearts refuse, and most of them are perfidious.", "french": " Comment cela se pourrait-il, alors que s’ils l’emportaient sur vous, ils ne voudraient respecter aucun lien de parenté ni aucune obligation à votre égard ? Ils vous feront plaisir par des paroles, tandis que leurs cœurs se refusent , et la plupart d’entre eux sont perfides.", "german": " Wie? Würden sie doch, wenn sie über euch obsiegten, weder ein Verwandtschaftsband noch einen Vertrag gegen euch achten! Sie würden euch mit dem Munde gefällig sein, indes ihre Herzen sich weigerten; und die meisten von ihnen sind tückisch.", "spanish": " ¿Cómo puede ser así si, en caso de venceros no respetarían ningún lazo de parentesco o pacto respecto a vosotros? Os agradarían con sus palabras pero sus corazones lo rechaza­rían, ya que la mayoría de ellos son pérfidos.", "urdu": " (ہاں اس قسم کے مشرکوں کو کوئی رعایت) کس طرح (دی جا سکتی ہے) کیونکہ وہ اگر تم پر غالب آجائیں تو تمہاری کسی رشتہ داری یا معاہدہ کی پروا نہیں کریں گے وہ تم کو اپنے منہ (کی باتوں) سے خوش رکھتے ہیں۔ حالانکہ ان کے دل (ان باتوں سے) انکار کرتے ہیں اور ان میں سے اکثر عہد و پیمان کو توڑنے والے ہوتے ہیں۔"}, {"arabic": " اِشۡتَرَوۡا بِاٰیٰتِ اللّٰہِ ثَمَنًا قَلِیۡلًا فَصَدُّوۡا عَنۡ سَبِیۡلِہٖ ؕ اِنَّہُمۡ سَآءَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۹﴾", "english": " They barter the Signs of Allah for a paltry price and turn men away from His way. Evil indeed is that which they do.", "french": " Ils ont troqué les Signes d’Allāh contre un vil prix et ont empêché les gens de suivre Sa voie. Ce qu’ils font est vraiment mauvais.", "german": " Sie verkaufen Allahs Zeichen um einen armseligen Preis und machen abwendig von Seinem Weg. Übel ist wahrlich, was sie tun.", "spanish": " Cambian a un precio ínfimo los Signos de Al-lah y apartan a los hombres de Su camino. ¡Qué malvado es en verdad lo que hacen!", "urdu": " انہوں نے اللہ کی آیات کے بدلہ میں ایک حقیر سی قیمت وصول کی ہے اور اس کے راستہ سے (لوگوں کو) روکا ہے۔ یقیناً ان کے اعمال بہت برے ہیں۔"}, {"arabic": " لَا یَرۡقُبُوۡنَ فِیۡ مُؤۡمِنٍ اِلًّا وَّ لَا ذِمَّۃً ؕ وَ اُولٰٓئِکَ ہُمُ الۡمُعۡتَدُوۡنَ ﴿۱۰﴾", "english": " They observe not any tie of relationship or covenant in respect of anyone who trusts them . And it is they who are transgressors.", "french": " Ils n’observent aucun lien de parenté ni aucune obligation à l’égard de quelque croyant . Et ceux-là sont les transgresseurs.", "german": " Sie achten kein Verwandtschaftsband und keinen Vertrag dem gegenüber, der (ihnen) traut, und sie, fürwahr, sind die Übertreter.", "spanish": " No respetan ningún lazo de parentesco o pacto respecto a quien confía en ellos . Son ellos los transgresores.", "urdu": " کسی مومن کے بارہ میں بھی وہ رشتہ داری کا لحاظ نہیں کرتے اور نہ عہدو پیمان کا۔ اور وہ حد سے بڑھے ہوئے ہیں۔"}, {"arabic": " فَاِنۡ تَابُوۡا وَ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ فَاِخۡوَانُکُمۡ فِی الدِّیۡنِ ؕ وَ نُفَصِّلُ الۡاٰیٰتِ لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۱۱﴾", "english": " But if they repent and observe Prayer and pay the Zakat, then they are your brethren in faith. And We explain the Signs for a people who have knowledge.", "french": " Mais s’ils se repentent, et observent la Prière, et paient la Zakāt, alors ils sont vos frères en religion. Et Nous expliquons les Signes pour des gens qui ont de la connaissance.", "german": " Bereuen sie aber und verrichten sie das Gebet und zahlen die Zakât, so sind sie eure Brüder im Glauben. Und Wir machen die Zeichen klar für ein wissendes Volk.", "spanish": " Pero si se arrepienten, cumplen la Oración y pagan el Zakat, entonces son vuestros hermanos en la fe. Pues explicamos los Signos a un pueblo que tiene conocimiento.", "urdu": " پس اگر وہ توبہ کر لیں‘ اور نمازوں کو قائم کریں اور زکٰوۃ دیں تو دین میں تمہارے بھائی ہیں اور ہم (اپنی) آیات کو علم والی قوم کے لئے کھول کھول کر بیان کرتے ہیں۔"}, {"arabic": " وَ اِنۡ نَّکَثُوۡۤا اَیۡمَانَہُمۡ مِّنۡۢ بَعۡدِ عَہۡدِہِمۡ وَ طَعَنُوۡا فِیۡ دِیۡنِکُمۡ فَقَاتِلُوۡۤا اَئِمَّۃَ الۡکُفۡرِ ۙ اِنَّہُمۡ لَاۤ اَیۡمَانَ لَہُمۡ لَعَلَّہُمۡ یَنۡتَہُوۡنَ ﴿۱۲﴾", "english": " And if they break their oaths after their covenant, and attack your religion, then fight these leaders of disbelief — surely, they have no regard for their oaths — that they may desist.", "french": " Et si après leur pacte, ils violent leurs serments et vilipendent votre religion, alors battez-vous contre ces chefs de la mécréance – assurément, ils ne respectent pas leurs serments – afin qu’ils y renoncent.", "german": " Wenn sie aber nach ihrem Vertrag ihre Eide brechen und euren Glauben schmähen, dann bekämpfet die Führer des Unglaubens – sie halten ja keine Eide –, auf dass sie ablassen.", "spanish": " Mas si violan sus juramentos después de su pacto, e injurian vuestra religión, entonces combatid a esos jefes de la incredulidad – en verdad, no respetan sus juramentos – para que desistan.", "urdu": " اور اگر (یہ لوگ) اپنے عہد و پیمان کے بعد اپنی قسموں کو توڑ دیں اور تمہارے دین پر طعنہ کریں‘ تو (ایسے) سردارانِ کفر سے لڑائی کرو۔ تا کہ وہ شرارتوں سے باز آجائیں کیونکہ ان کی قسموں کا کوئی اعتبار نہیں۔"}, {"arabic": " اَلَا تُقَاتِلُوۡنَ قَوۡمًا نَّکَثُوۡۤا اَیۡمَانَہُمۡ وَ ہَمُّوۡا بِاِخۡرَاجِ الرَّسُوۡلِ وَ ہُمۡ بَدَءُوۡکُمۡ اَوَّلَ مَرَّۃٍ ؕ اَتَخۡشَوۡنَہُمۡ ۚ فَاللّٰہُ اَحَقُّ اَنۡ تَخۡشَوۡہُ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۱۳﴾", "english": " Will you not fight a people who have broken their oaths, and who plotted to turn out the Messenger, and they were the first to commence hostilities against you? Do you fear them? Nay, Allah is most worthy that you should fear Him, if you are believers.", "french": " Ne combattrez-vous pas des hommes qui ont violé leurs serments et qui étaient déterminés à chasser le Messager, et qui furent les premiers à commencer les hostilités contre vous. Les craignez-vous ? Mais Allāh est plus digne que vous Le craigniez, si vous êtes croyants.", "german": " Wollt ihr nicht kämpfen wider ein Volk, das seine Eide gebrochen hat und das den Gesandten zu vertreiben plante – und sie waren es, die zuerst (den Streit) wider euch begannen? Fürchtet ihr sie etwa? Allah ist würdiger, dass ihr Ihn fürchtet, wenn ihr Gläubige seid.", "spanish": " ¿No combatiríais a gentes que han roto sus juramentos y que aquinaron para expulsar al Mensajero, y fueron los primeros en iniciar las hostilidades contra vosotros? ¿Les tenéis miedo? No, Al-lah es más digno de que Le temáis, si sois creyentes.", "urdu": " (اے مومنو)! کیا تم اس قوم سے نہیں لڑو گے جنہوں نے اپنی قسمیں توڑ دیں اور رسول کو (اس کے گھر سے) نکالنے کا فیصلہ کر لیا اور تم سے (جنگ چھیڑنے میں) انہوں نے (ہی) ابتدا کی کیا تم ان سے ڈرتے ہو؟ (اگر ایسا ہے تو) اگر تم مومن ہو تو سمجھ لو کہ اللہ اس بات کا زیادہ حق دار ہے کہ تم اس سے ڈرو۔"}, {"arabic": " قَاتِلُوۡہُمۡ یُعَذِّبۡہُمُ اللّٰہُ بِاَیۡدِیۡکُمۡ وَ یُخۡزِہِمۡ وَ یَنۡصُرۡکُمۡ عَلَیۡہِمۡ وَ یَشۡفِ صُدُوۡرَ قَوۡمٍ مُّؤۡمِنِیۡنَ ﴿ۙ۱۴﴾", "english": " Fight them, that Allah may punish them at your hands, and humiliate them, and help you to victory over them, and relieve the minds of a people who believe;", "french": " Combattez-les, afin que par vos mains, Allāh puisse les châtier et les humilier, et vous aider à remporter la victoire sur eux, et guérir la poitrine d’un peuple qui croit,", "german": " Bekämpfet sie; Allah wird sie strafen durch eure Hand und sie demütigen und euch helfen wider sie und Heilung bringen den Herzen eines gläubigen Volks;", "spanish": " Combatidlos, para que Al-lah los castigue por medio de vuestras manos; los humille, y os ayude a conseguir la victoria sobre ellos, y alivie las mentes de los hombres que creen;", "urdu": " ان سے لڑو۔ اللہ ان کو تمہارے ہاتھوں سے عذاب دلوائے گا اور ان کو رسوا کرے گا اور تمہیں ان پر غلبہ دے گا اور اس (ذریعہ) سے مومن قوم کے دلوں کو (صدمہ اور خوف سے) نجات دے گا۔"}, {"arabic": " وَ یُذۡہِبۡ غَیۡظَ قُلُوۡبِہِمۡ ؕ وَ یَتُوۡبُ اللّٰہُ عَلٰی مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۱۵﴾", "english": " And that He may take away the wrath of their hearts. And Allah turns with mercy to whomsoever He pleases. And Allah is All-Knowing, Wise.", "french": " Et afin qu’Il puisse enlever le courroux de leurs cœurs. Et Allāh Se tourne avec clémence vers qui Il veut. Et Allāh est Omniscient, Sage.", "german": " und Er wird den Zorn aus ihren Herzen bannen. Denn Allah kehrt Sich gnädig dem zu, den Er will. Und Allah ist allwissend, allweise.", "spanish": " Y para que expulse la cólera de sus corazones. Pues Al-lah se dirige con misericordia a quien Le place. Y Al-lah es Omnisciente, Sabio.", "urdu": " اور ان کے دلوں کے غصہ کو دور کر دے گا اور اللہ جس پر چاہتا ہے فضل کرتا ہے اور اللہ بہت جاننے والا (اور) بڑی حکمت والا ہے۔"}, {"arabic": " اَمۡ حَسِبۡتُمۡ اَنۡ تُتۡرَکُوۡا وَ لَمَّا یَعۡلَمِ اللّٰہُ الَّذِیۡنَ جٰہَدُوۡا مِنۡکُمۡ وَ لَمۡ یَتَّخِذُوۡا مِنۡ دُوۡنِ اللّٰہِ وَ لَا رَسُوۡلِہٖ وَ لَا الۡمُؤۡمِنِیۡنَ وَلِیۡجَۃً ؕ وَ اللّٰہُ خَبِیۡرٌۢ بِمَا تَعۡمَلُوۡنَ ﴿٪۱۶﴾", "english": " Do you think that you would be left alone, while Allah has not yet known those of you who strive in the cause of Allah and do not take anyone for an intimate friend beside Allah and His Messenger and the believers? Allah is well aware of what you do.", "french": " Pensez-vous que vous serez laissés tels quels , tandis qu’Allāh ne connaît pas encore ceux d’entre vous qui luttent pour Sa cause, et ne prennent personne comme ami intime hormis Allāh et Son Messager et les croyants ? Et Allāh est Très-Conscient de ce que vous faites.", "german": " Wähnt ihr etwa, ihr würdet verlassen sein, während Allah noch nicht jene von euch bezeichnet hat, die (in Seiner Sache) streiten und sich keinen zum vertrauten Freund nehmen außer Allah und Seinem Gesandten und den Gläubigen? Und Allah ist recht wohl dessen kundig, was ihr tut.", "spanish": " ¿Creéis que se os dejaría solos, cuando Al-lah aún no ha conocido a aquellos de vosotros que luchan por la causa de Al-lah y no toman a nadie por amigo íntimo salvo a Al-lah, a su Mensajero y a los creyentes? Al-lah se entera perfectamente lo que hacéis.", "urdu": " کیا تم خیال کرتے ہو کہ تم کو یونہی چھوڑ دیا جائے گا‘ حالانکہ اب تک اللہ نے ان لوگوں کو جنہوں نے تم میں سے جہاد کیا ہے (ان کے مقابلہ میں جنہوں نے جہاد نہیں کیا) ظاہر نہیں کیا۔ جو خدا اور اس کے رسول اور مومنوں کے مقابلہ میں کفار سے خفیہ جوڑ توڑ نہیں رکھتے اور اللہ تمہارے اعمال سے اچھی طرح واقف ہے۔"}, {"arabic": " مَا کَانَ لِلۡمُشۡرِکِیۡنَ اَنۡ یَّعۡمُرُوۡا مَسٰجِدَ اللّٰہِ شٰہِدِیۡنَ عَلٰۤی اَنۡفُسِہِمۡ بِالۡکُفۡرِ ؕ اُولٰٓئِکَ حَبِطَتۡ اَعۡمَالُہُمۡ ۚۖ وَ فِی النَّارِ ہُمۡ خٰلِدُوۡنَ ﴿۱۷﴾", "english": " The idolaters cannot keep the Mosques of Allah in a good and flourishing condition while they bear witness against themselves to disbelief. It is they whose works shall be vain, and in the Fire shall they abide.", "french": " Ce n’est pas aux idolâtres de maintenir les Mosquées d’Allāh et d’honorer les objectifs pour lesquels elles sont construites alors qu’ils sont témoins de leur propre mécréance. Voilà ceux dont les œuvres seront vaines, et c’est dans le Feu qu’ils demeureront longtemps.", "german": " Den Götzendienern steht es nicht zu, die Moscheen Allahs zu erhalten, solange sie gegen sich selbst zeugen durch den Unglauben. Sie sind es, deren Werke umsonst sein sollen, und im Feuer müssen sie bleiben.", "spanish": " No son los idolatras quienes hacen justicia a los objetivos por los que se construyen las mezquitas ni pueden mantenerlas adecuadamente mientras permanecen como testigos de su propia incredulidad. Son aquellos cuyas obras serán vanas y morarán en el Fuego.", "urdu": " (ایسے) مشرکوں کو (کوئی) حق نہیں پہنچتا کہ اللہ کی مسجدوں کو آباد کریں جبکہ وہ اپنی جانوں پر (خود) کفر کی گواہی دے رہے ہیں۔ یہی لوگ ہیں جن کے اعمال اکارت چلے گئے اور وہ آگ میں ایک لمبے عرصہ تک رہتے چلے جائیں گے۔"}, {"arabic": " اِنَّمَا یَعۡمُرُ مَسٰجِدَ اللّٰہِ مَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ اَقَامَ الصَّلٰوۃَ وَ اٰتَی الزَّکٰوۃَ وَ لَمۡ یَخۡشَ اِلَّا اللّٰہَ فَعَسٰۤی اُولٰٓئِکَ اَنۡ یَّکُوۡنُوۡا مِنَ الۡمُہۡتَدِیۡنَ ﴿۱۸﴾", "english": " He alone can keep the Mosques of Allah in a good and flourishing condition who believes in Allah, and the Last Day, and observes Prayer, and pays the Zakat, and fears none but Allah; so these it is who may be among those who reach the goal.", "french": " Assurément, celui-là seul est digne de maintenir les Mosquées d’Allāh qui croit en Allāh et au Jour Dernier, et observe la Prière, et paie la Zakāt, et qui ne craint nul autre qu’Allāh. Voilà donc ceux qui ont bien plus de chances d’être comptés parmi les bien- guidés.", "german": " Der allein vermag die Moscheen Allahs zu erhalten, der an Allah glaubt und an den Jüngsten Tag und das Gebet verrichtet und die Zakât zahlt und keinen fürchtet denn Allah: diese also mögen unter denen sein, welche den rechten Weg finden.", "spanish": " En verdad que sólo es digno de conservar las Mezquitas de Al-lah quien cree en Al-lah y en el Último Día, cumple la Oración, paga el Zakat y no teme a nadie sino a Al-lah; son éstos los que tienen la mayor posibilidad de contarse entre los guiados.", "urdu": " اللہ کی مسجدوں کو تو وہی آباد کرتا ہے جو اللہ اور یوم آخرت پر ایمان لاتا ہے۔ اور نمازوں کو قائم کرتا ہے اور زکٰوۃ دیتا ہے اور اللہ کے سوا کسی سے نہیں ڈرتا سو قریب ہے کہ ایسے لوگ کامیابی کی طرف لے جائے جائیں۔"}, {"arabic": " اَجَعَلۡتُمۡ سِقَایَۃَ الۡحَآجِّ وَ عِمَارَۃَ الۡمَسۡجِدِ الۡحَرَامِ کَمَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ جٰہَدَ فِیۡ سَبِیۡلِ اللّٰہِ ؕ لَا یَسۡتَوٗنَ عِنۡدَ اللّٰہِ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿ۘ۱۹﴾", "english": " Do you hold the giving of drink to the pilgrims, and the maintenance of the Sacred Mosque as equal to the works of him who believes in Allah and the Last Day and strives in the path of Allah? They are not at all equal in the sight of Allah. And Allah guides not the unjust people.", "french": " Considérez-vous que le fait de donner à boire aux pèlerins et d’entretenir la Sainte Mosquée soit comparable à l’œuvre de celui qui croit en Allāh et au Jour Dernier, et qui lutte dans la voie d’Allāh ? Aux yeux d’Allāh, ces actions ne sont nullement égales. Et Allāh ne guide pas les injustes.", "german": " Wollt ihr etwa die Tränkung der Pilger und die Erhaltung der Heiligen Moschee (den Werken) dessen gleichsetzen, der an Allah und an den Jüngsten Tag glaubt und in Allahs Pfad streitet? Vor Allah sind sie nicht gleich. Und Allah weist nicht dem sündigen Volk den Weg.", "spanish": " ¿Pensáis acaso que dar bebida a los peregrinos y mantener la Sagrada Mezquita es igual a las obras de quien cree en Al-lah en el Último Día y se esfuerza en el camino de Al-lah? Todos ellos no son iguales ante Al-lah. Y Al-lah no guía a los injustos.", "urdu": " کیا تم نے حاجیوں کو پانی پلانے اور خانہ کعبہ کو آباد رکھنے (کے کام) کو اس شخص (کے کام) کی طرح سمجھ لیا ہے جو اللہ اور یوم آخرت پر ایمان لایا اور اس نے اللہ کے راستہ میں جہاد کیا یہ (دونوں گروہ) اللہ کے نزدیک (ہرگز) برابر نہیں اور اللہ ظالم قوم کو ہرگز کامیابی کی طرف نہیں لے جاتا۔"}, {"arabic": " اَلَّذِیۡنَ اٰمَنُوۡا وَ ہَاجَرُوۡا وَ جٰہَدُوۡا فِیۡ سَبِیۡلِ اللّٰہِ بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ۙ اَعۡظَمُ دَرَجَۃً عِنۡدَ اللّٰہِ ؕ وَ اُولٰٓئِکَ ہُمُ الۡفَآئِزُوۡنَ ﴿۲۰﴾", "english": " Those who believe and emigrate from their homes for the sake of God and strive in the cause of Allah with their property and their persons have the highest rank in the sight of Allah. And it is they who shall triumph.", "french": " Ceux qui croient et abandonnent leur demeure , et qui luttent pour la cause d’Allāh par leurs biens et leurs personnes, ont, aux yeux d’Allāh, le rang le plus élevé. Et ceux-là qui triompheront.", "german": " Die, welche glauben und auswandern und mit ihrem Gut und ihrem Blut kämpfen für Allahs Sache, die nehmen den höchsten Rang ein bei Allah, und sie sind es, die Erfolg haben.", "spanish": " Quienes creen y emigran de sus casas por la causa de Dios y se esfuerzan en la causa de Al-lah con sus bienes y sus personas son los que ocupan el puesto más alto ante Al-lah. Son ellos quienes triunfarán.", "urdu": " (وہ لوگ) جو (کہ) ایمان لائے اور جنہوں نے ہجرت کی اور (پھر) اللہ کے راستہ میں اپنے مالوں (کے ذریعہ سے بھی) اور جانوں کے ذریعہ سے (بھی) جہاد کیا۔ اللہ کے نزدیک درجہ میں بہت بلند ہیں اور وہی لوگ کامیاب ہونے والے ہیں۔"}, {"arabic": " یُبَشِّرُہُمۡ رَبُّہُمۡ بِرَحۡمَۃٍ مِّنۡہُ وَ رِضۡوَانٍ وَّ جَنّٰتٍ لَّہُمۡ فِیۡہَا نَعِیۡمٌ مُّقِیۡمٌ ﴿ۙ۲۱﴾", "english": " Their Lord gives them glad tidings of mercy from Him, and of His pleasure, and of Gardens wherein there shall be lasting bliss for them;", "french": " Leur Seigneur leur annonce la bonne nouvelle de miséricorde et de plaisir de Sa part, et des Jardins où il y aura pour eux une félicité durable.", "german": " Ihr Herr verheißt ihnen Barmherzigkeit und Sein Wohlgefallen und Gärten, worin ihnen ewige Wonne zuteil wird.", "spanish": " Su Señor les da la buena noticia de Su misericordia y de Su agrado, y de los jardines en los que habrá una felicidad eterna para ellos;", "urdu": " ان کا رب ان کو اپنی عظیم الشان رحمت کی خبر دیتا ہے اور (اپنی) رضا مندی اور ایسی جنتوں کی بھی جن میں ان کے لئے دائمی نعمت ہوگی۔"}, {"arabic": " خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ؕ اِنَّ اللّٰہَ عِنۡدَہٗۤ اَجۡرٌ عَظِیۡمٌ ﴿۲۲﴾", "english": " They will abide therein for ever. Verily, with Allah there is a great reward.", "french": " Ils y demeureront éternellement. En vérité, auprès d’Allāh il y a une très grande récom­pense.", "german": " Dort werden sie ewig und immerdar weilen. Wahrlich, bei Allah ist großer Lohn.", "spanish": " Allí morarán para siempre. En verdad, junto a Al-lah está la recompensa más grande.", "urdu": " (وہ) ان میں بستے چلے جائیں گے (یاد رکھو کہ) اللہ کے پاس یقیناً بہت بڑا اجر ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَّخِذُوۡۤا اٰبَآءَکُمۡ وَ اِخۡوَانَکُمۡ اَوۡلِیَآءَ اِنِ اسۡتَحَبُّوا الۡکُفۡرَ عَلَی الۡاِیۡمَانِ ؕ وَ مَنۡ یَّتَوَلَّہُمۡ مِّنۡکُمۡ فَاُولٰٓئِکَ ہُمُ الظّٰلِمُوۡنَ ﴿۲۳﴾", "english": " O ye who believe! take not your fathers and your brothers for friends, if they prefer disbelief to faith. And whoso befriends them from among you, it is they that are wrongdoers.", "french": " Ô vous qui croyez ! Ne prenez pas comme amis vos pères et vos frères s’ils préfèrent la mécréance à la foi. Et ceux d’entre vous qui les prendront comme amis, ceux-là sont des transgresseurs.", "german": " O die ihr glaubt, nehmt nicht eure Väter und eure Brüder zu Freunden, wenn sie den Unglauben dem Glauben vorziehen. Und die von euch sie zu Freunden nehmen – das sind die Ungerechten.", "spanish": " ¡Oh vosotros, los que creéis! No toméis por amigos a vuestros padres o a vuestros hermanos, si prefieren la incredulidad a la fe. Pues aquellos de vosotros que se hagan amigos de ellos se contarán entre los inicuos.", "urdu": " اے مومنو! اپنے باپ دادوں اور بھائیوں کو (اپنا حقیقی) دوست نہ بناٶ اگر وہ ایمان کے مقابلہ میں کفر سے زیادہ محبت کرتے ہوں اور تم میں سے جو لوگ ان سے ایسی دوستی کریں گے وہ یقیناً ظالم ہوں گے۔"}, {"arabic": " قُلۡ اِنۡ کَانَ اٰبَآؤُکُمۡ وَ اَبۡنَآؤُکُمۡ وَ اِخۡوَانُکُمۡ وَ اَزۡوَاجُکُمۡ وَ عَشِیۡرَتُکُمۡ وَ اَمۡوَالُ ۣ اقۡتَرَفۡتُمُوۡہَا وَ تِجَارَۃٌ تَخۡشَوۡنَ کَسَادَہَا وَ مَسٰکِنُ تَرۡضَوۡنَہَاۤ اَحَبَّ اِلَیۡکُمۡ مِّنَ اللّٰہِ وَ رَسُوۡلِہٖ وَ جِہَادٍ فِیۡ سَبِیۡلِہٖ فَتَرَبَّصُوۡا حَتّٰی یَاۡتِیَ اللّٰہُ بِاَمۡرِہٖ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الۡفٰسِقِیۡنَ ﴿٪۲۴﴾", "english": " Say, if your fathers, and your sons, and your brethren, and your wives, and your kinsfolk, and the wealth you have acquired, and the trade whose dullness you fear, and the dwellings which you love are dearer to you than Allah and His Messenger and striving in His cause, then wait until Allah comes with His judgment; and Allah guides not the disobedient people.", "french": " Dis : « Si vos pères et vos fils et vos frères et vos femmes et vos clans et la richesse que vous avez acquise et le commerce dont vous craignez le marasme et les maisons que vous aimez, vous sont plus chers qu’Allāh et Son Messager et la lutte pour Sa cause, alors attendez qu’Allāh fasse venir Son jugement ; et Allāh ne guide pas le peuple désobéissant. »", "german": " Sprich: \"Wenn eure Väter und eure Söhne und eure Brüder und eure Frauen und eure Verwandten und das Vermögen, das ihr euch erworben, und der Handel dessen Niedergang ihr fürchtet, und die Wohnstätten, die ihr liebt, euch teurer sind als Allah und Sein Gesandter und das Streiten für Seine Sache, dann wartet, bis Allah mit Seinem Urteil kommt; und Allah weist dem ungehorsamen Volk nicht den Weg.\"", "spanish": " Diles: “Si vuestros padres, vuestros hijos y vuestros hermanos, vuestras mujeres y vuestras gentes, y la riqueza que habéis adquirido, y el negocio cuya ruina teméis y las viviendas que amáis os son más queridos que Al-lah y Su Mensajero y que los esfuerzos por Su causa, entonces esperad que Al-lah venga con Su juicio; pues Al-lah no guía a las gentes desobedientes.", "urdu": " تو (مومنوں سے) کہہ دے کہ اگر تمہارے باپ دادے اور تمہارے بیٹے اور تمہارے بھائی اور تمہاری بیویاں اور تمہارے (دوسرے) رشتہ دار اور وہ مال جو تم نے کمائے ہیں اور وہ تجارتیں جن کے نقصان سے تم ڈرتے ہو اور وہ مکان جن کو تم پسند کرتے ہو‘ تم کو اللہ اور اس کے رسول اور اس کے راستہ میں جہاد کرنے کی نسبت زیادہ پیارے ہیں تو تم انتظار کرو یہاں تک کہ اللہ اپنے فیصلہ کو ظاہر کردے اور اللہ اطاعت سے نکلنے والی قوم کو کبھی (کامیابی کا) راستہ نہیں دکھاتا۔"}, {"arabic": " لَقَدۡ نَصَرَکُمُ اللّٰہُ فِیۡ مَوَاطِنَ کَثِیۡرَۃٍ ۙ وَّ یَوۡمَ حُنَیۡنٍ ۙ اِذۡ اَعۡجَبَتۡکُمۡ کَثۡرَتُکُمۡ فَلَمۡ تُغۡنِ عَنۡکُمۡ شَیۡئًا وَّ ضَاقَتۡ عَلَیۡکُمُ الۡاَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّیۡتُمۡ مُّدۡبِرِیۡنَ ﴿ۚ۲۵﴾", "english": " Surely, Allah had helped you on many a battlefield, and on the Day of Hunain, when your great numbers made you proud, but they availed you nought; and the earth, with all its vastness, became straitened for you, and then you turned your backs retreating.", "french": " Assurément, Allāh vous a aidés sur maints champs de bataille, et au jour de Hunaïn lorsque vous vous êtes enorgueillis de votre grand nombre, et cela ne vous a servi à rien, et la terre malgré toute son immensité, s’est rétrécie pour vous ; et alors vous avez tourné le dos et battu en retraite.", "german": " Wahrlich, Allah half euch schon auf so manchem Schlachtfeld, und am Tage von Hunän, als eure große Zahl euch stolz machte – allein sie frommte euch nichts, und die Erde, in ihrer Weite, wurde euch eng; da wandtet ihr euch zur Flucht.", "spanish": " En verdad, Al-lah os ayudó en muchos campos de batalla y en el Día de Hunain, cuando vuestro gran número os hizo orgullosos pero no os sirvió de nada; y la tierra, con toda su amplitud se os quedó estrecha, y entonces volvisteis la espalda en retirada.", "urdu": " اللہ نے بہت سے مواقع پر تمہاری مدد کی ہے (خصوصاً) حنین (کی جنگ) کے دن جبکہ تمہاری کثرت نے تم کو متکبر بنا دیا تھا۔ پھر وہ (کثرت) تمہارے کسی کام نہ آئی اور زمین باوجود فراخی کے تم پر تنگ ہوگئی۔ اور تم نے پیٹھ دکھاتے ہوئے منہ پھیر لیا۔"}, {"arabic": " ثُمَّ اَنۡزَلَ اللّٰہُ سَکِیۡنَتَہٗ عَلٰی رَسُوۡلِہٖ وَ عَلَی الۡمُؤۡمِنِیۡنَ وَ اَنۡزَلَ جُنُوۡدًا لَّمۡ تَرَوۡہَا وَ عَذَّبَ الَّذِیۡنَ کَفَرُوۡا ؕ وَ ذٰلِکَ جَزَآءُ الۡکٰفِرِیۡنَ ﴿۲۶﴾", "english": " Then Allah sent down His peace upon His Messenger and upon the believers, and He sent down hosts which you did not see, and He punished those who disbelieved. And this is the reward of the disbelievers.", "french": " Alors, Allāh fit descendre Sa tranquillité sur Son Messager et sur les croyants, et Il fit descendre des troupes que vous n’avez pas vues ; et Il châtia ceux qui n’avaient pas cru. Voilà donc la récompense des mécréants.", "german": " Dann senkte Allah Seinen Frieden auf Seinen Gesandten und die Gläubigen und sandte Heerscharen hernieder, die ihr nicht sahet, und strafte jene, die ungläubig waren. Das ist der Lohn der Ungläubigen.", "spanish": " Entonces Al-lah hizo que la tranquilidad descendiera sobre Su Mensajero y sobre los creyentes, y envió huestes que vosotros no visteis y castigó a los incrédulos. Pues ésta es la recompensa de los incrédulos.", "urdu": " اور اللہ نے اپنی سکینت اپنے رسول اور مومنوں پر اتاری اور ایسے لشکر اتارے جن کو تم نہیں دیکھ رہے تھے اور کفار کو عذاب دیا اور کفار کی یہی جزا ہے۔"}, {"arabic": " ثُمَّ یَتُوۡبُ اللّٰہُ مِنۡۢ بَعۡدِ ذٰلِکَ عَلٰی مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۲۷﴾", "english": " Then will Allah, after that, turn with compassion to whomsoever He pleases; and Allah is Most Forgiving, Merciful.", "french": " Puis, après un tel châtiment, Allāh Se tournera avec clémence vers qui Il veut et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Doch hernach kehrt Sich Allah gnädig dem zu, dem Er gewogen; und Allah ist allverzeihend, barmherzig.", "spanish": " Después de eso, Al-lah se dirigirá con compasión a quien Le plazca; pues Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور اللہ ایسی سزا کے بعد جس پر چاہتا ہے رحم کر دیتا ہے اور اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنَّمَا الۡمُشۡرِکُوۡنَ نَجَسٌ فَلَا یَقۡرَبُوا الۡمَسۡجِدَ الۡحَرَامَ بَعۡدَ عَامِہِمۡ ہٰذَا ۚ وَ اِنۡ خِفۡتُمۡ عَیۡلَۃً فَسَوۡفَ یُغۡنِیۡکُمُ اللّٰہُ مِنۡ فَضۡلِہٖۤ اِنۡ شَآءَ ؕ اِنَّ اللّٰہَ عَلِیۡمٌ حَکِیۡمٌ ﴿۲۸﴾", "english": " O ye who believe! surely, the idolaters are unclean. So they shall not approach the Sacred Mosque after this year of theirs. And if you fear poverty, Allah will enrich you out of His bounty, if He pleases. Surely, Allah is All-Knowing, Wise.", "french": " Ô vous qui croyez ! Assurément, les idolâtres sont impurs. Aussi, après cette année qui est la leur, qu’ils ne s’approchent plus de la Sainte Mosquée. Et si vous craignez la misère, Allāh vous enrichira de Sa munificence, s’Il le veut. Assurément, Allāh est Omniscient, Sage.", "german": " O die ihr glaubt! wahrlich, die Götzendiener sind unrein. Drum sollen sie nach diesem ihrem Jahr sich der Heiligen Moschee nicht nähern. Und falls ihr Armut befürchtet, so wird euch Allah gewiss aus Seiner Fülle reich machen, wenn Er will. Wahrlich, Allah ist allwissend, allweise.", "spanish": " ¡Oh vosotros, los que creéis! En verdad los idólatras son impuros. Por ello, no se acercarán a la Sagrada Mezquita después de éste, su año. Y si teméis la pobreza, Al-lah os enriquecerá de Su magnanimidad, si Le place. En verdad, Al-lah es Omnisciente, Sabio.", "urdu": " اے مومنو! مشرک لوگ حقیقتاً گندے (اور ناپاک) ہیں پس وہ اس سال کے بعد مسجد حرام (یعنی خانہ کعبہ) کے قریب مت آئیں اور اگر تم کو غربت کا خطرہ ہو تو اللہ اگر اس نے ایسا چاہا تم کو اپنے فضل سے ضرور غنی بنا دے گا۔ اللہ یقیناً بہت جاننے والا (اور) بڑی حکمت والا ہے۔"}, {"arabic": " قَاتِلُوا الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِاللّٰہِ وَ لَا بِالۡیَوۡمِ الۡاٰخِرِ وَ لَا یُحَرِّمُوۡنَ مَا حَرَّمَ اللّٰہُ وَ رَسُوۡلُہٗ وَ لَا یَدِیۡنُوۡنَ دِیۡنَ الۡحَقِّ مِنَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ حَتّٰی یُعۡطُوا الۡجِزۡیَۃَ عَنۡ ‌یَّدٍ وَّ ہُمۡ صٰغِرُوۡنَ ﴿٪۲۹﴾", "english": " Fight those from among the People of the Book who believe not in Allah, nor in the Last Day, nor hold as unlawful what Allah and His Messenger have declared to be unlawful, nor follow the true religion, until they pay the tax with their own hand and acknowledge their subjection.", "french": " Combattez ceux des Gens du Livre qui ne croient pas en Allāh, ni au Jour Dernier et qui ne tiennent pas pour illicite ce qu’Allāh et Son Messager ont déclaré illicite, et qui ne suivent pas la religion de la Vérité, jusqu’à ce qu’ils paient la taxe docilement de leurs propres mains tout en reconnaissant leur état de soumission.", "german": " Kämpfet wider diejenigen aus dem Volk der Schrift, die nicht an Allah und an den Jüngsten Tag glauben und die nicht als unerlaubt erachten, was Allah und Sein Gesandter als unerlaubt erklärt haben, und die nicht dem wahren Bekenntnis folgen, bis sie aus freien Stücken den Tribut entrichten und ihre Unterwerfung anerkennen.", "spanish": " Combatid a aquellos de entre el Pueblo del Libro que no creen en Al-lah ni en el Último Día ni consideran ilícito lo que Al-lah y Su Mensajero han declarado ilícito, ni siguen la verdadera religión, hasta que paguen el tributo sumisamente, con su propia mano y reconozcan su estado de sometimiento.", "urdu": " جو لوگ اللہ پرایمان نہیں لاتے اور نہ یوم آخرت پر اور نہ اسے جسے اللہ اور اس کے رسول نے حرام قرار دیا ہے حرام قرار دیتے ہیں اور نہ سچے دین کو اختیار کرتے ہیں۔ یعنی وہ لوگ جن کو کتاب دی گئی ہے ان سے جنگ کرو جب تک کہ وہ اپنی مرضی سے جزیہ ادا نہ کریں اور وہ تمہارے ماتحت نہ آجائیں۔"}, {"arabic": " وَ قَالَتِ الۡیَہُوۡدُ عُزَیۡرُ ۣ ابۡنُ اللّٰہِ وَ قَالَتِ النَّصٰرَی الۡمَسِیۡحُ ابۡنُ اللّٰہِ ؕ ذٰلِکَ قَوۡلُہُمۡ بِاَفۡوَاہِہِمۡ ۚ یُضَاہِـُٔوۡنَ قَوۡلَ الَّذِیۡنَ کَفَرُوۡا مِنۡ قَبۡلُ ؕ قٰتَلَہُمُ اللّٰہُ ۚ۫ اَنّٰی یُؤۡفَکُوۡنَ ﴿۳۰﴾", "english": " And the Jews say, Ezra is the son of Allah, and the Christians say, the Messiah is the son of Allah; that is what they say with their mouths. They imitate the saying of those who disbelieved before them. Allah’s curse be on them! How are they turned away!", "french": " Et les Juifs disent ‘Ezra est le fils d’Allāh’, et les Chrétiens disent ‘Le Messie est le fils d’Allāh’. Ce ne sont que des paroles émanant de leurs bouches. Ils imitent les paroles de ceux qui n’ont pas cru avant eux . Que la malédiction d’Allāh tombe sur eux ! Comme ils sont détournés de la vérité !", "german": " Die Juden sagen, Esra sei Allahs Sohn, und die Christen sagen, der Messias sei Allahs Sohn. Das ist das Wort ihres Mundes. Sie ahmen die Rede derer nach, die vordem ungläubig waren. Allahs Fluch über sie! Wie sind sie irregeleitet!", "spanish": " Y los judíos dicen: “Esdrás es el hijo de Al-lah” y los cristianos dicen: “el Mesías es el hijo de Al-lah”; no son más que palabras de sus bocas. Imitan la afirmación de quienes no creyeron antes que ellos. ¡Que Al-lah los maldiga! ¡Qué lejos se han desviado!", "urdu": " اور یہودی کہتے ہیں کہ عزیر اللہ کا بیٹا ہے اور نصرانی کہتے ہیں کہ مسیح اللہ کا بیٹا ہے یہ (بات) صرف ان کے منہ کی لاف ہے وہ (صرف) اپنے سے پہلے کفار کی باتوں کی نقل کر رہے ہیں۔ اللہ ان کو ہلاک کرے وہ (حقیقت سے) کیسے دور جا رہے ہیں۔"}, {"arabic": " اِتَّخَذُوۡۤا اَحۡبَارَہُمۡ وَ رُہۡبَانَہُمۡ اَرۡبَابًا مِّنۡ دُوۡنِ اللّٰہِ وَ الۡمَسِیۡحَ ابۡنَ مَرۡیَمَ ۚ وَ مَاۤ اُمِرُوۡۤا اِلَّا لِیَعۡبُدُوۡۤا اِلٰـہًا وَّاحِدًا ۚ لَاۤ اِلٰہَ اِلَّا ہُوَ ؕ سُبۡحٰنَہٗ عَمَّا یُشۡرِکُوۡنَ ﴿۳۱﴾", "english": " They have taken their learned men and their monks for lords beside Allah. And so have they taken the Messiah, son of Mary. And they were not commanded but to worship the One God. There is no God but He. Too Holy is He for what they associate with Him !", "french": " Ils ont pris leurs savants et leurs moines comme seigneurs à part Allāh. Et de même ont-ils pris le Messie, fils de Marie. Et, on ne leur a commandé que d’adorer un Dieu Unique. Il n’y a de dieu que Lui. Il est Saint, bien au-dessus de ce qu’ils Lui associent .", "german": " Sie haben sich ihre Schriftgelehrten und Mönche zu Herren genommen neben Allah und den Messias, den Sohn der Maria. Und doch war ihnen geboten, allein den Einigen Gott anzubeten. Es ist kein Gott außer Ihm. Allzu heilig ist Er für das, was sie (Ihm) zur Seite stellen!", "spanish": " Han tomado a sus sabios y monjes como señores en lugar de Al-lah. Y de igual modo han tomado al Mesías, hijo de María. Mas sólo se les ordenó adorar al Único Dios. No hay otro Dios sino Él. ¡Santo es Él por encima de lo que Le asocian!", "urdu": " انہوں نے احبار اور رہبان کو اللہ کے سوا اپنا رب بنا لیا ہے۔ اسی طرح مسیح ابن مریم کو بھی۔ حالانکہ ان کو صرف یہ حکم دیا گیا تھا کہ وہ ایک خدا کی عبادت کریں‘ جس کے سوا کوئی معبود نہیں وہ ان کے شرک سے پاک ہے۔"}, {"arabic": " یُرِیۡدُوۡنَ اَنۡ یُّطۡفِـُٔوۡا نُوۡرَ اللّٰہِ بِاَفۡوَاہِہِمۡ وَ یَاۡبَی اللّٰہُ اِلَّاۤ اَنۡ یُّتِمَّ نُوۡرَہٗ وَ لَوۡ کَرِہَ الۡکٰفِرُوۡنَ ﴿۳۲﴾", "english": " They desire to extinguish the light of Allah with their mouths; but Allah will permit nothing except that He will perfect His light, though the disbelievers may dislike it .", "french": " Ils désirent éteindre la lumière d’Allāh avec leurs bouches ; mais Allāh ne permettra rien excepté qu’Il complètera Sa lumière, bien que les mécréants détestent cela .", "german": " Sie möchten gern Allahs Licht auslöschen mit ihrem Munde; jedoch Allah will nichts anderes, als Sein Licht vollkommen machen, mag es den Ungläubigen auch zuwider sein.", "spanish": " Desean apagar la luz de Al-lah con sus bocas; pero Al-lah no permitirá nada salvo el perfeccionamiento de Su luz, aunque no les guste a los incrédulos.", "urdu": " وہ چاہتے ہیں کہ اللہ کے نور کو اپنے منہ (کی پھونکوں) سے بجھا دیں اور اللہ اپنے نور کو پورا کرنے کے سوا دوسری ہر بات سے انکار کرتا ہے خواہ کفار کو کتنا ہی برا لگے۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَرۡسَلَ رَسُوۡلَہٗ بِالۡہُدٰی وَ دِیۡنِ الۡحَقِّ لِیُظۡہِرَہٗ عَلَی الدِّیۡنِ کُلِّہٖ ۙ وَ لَوۡ کَرِہَ الۡمُشۡرِکُوۡنَ ﴿۳۳﴾", "english": " He it is Who sent His Messenger with guidance and the religion of truth, that He may make it prevail over every other religion, even though the idolaters may dislike it.", "french": " C’est Lui Qui a envoyé Son Messager avec la direction et la religion de la Vérité, pour la faire prévaloir sur toutes les autres religions, bien que les idolâtres détestent cela .", "german": " Er ist es, Der Seinen Gesandten geschickt hat mit der Führung und dem wahren Glauben, auf dass Er ihn obsiegen lasse über alle (anderen) Glaubensbekenntnisse, mag es den Götzendienern auch zuwider sein.", "spanish": " Él es Quien envió a Su Mensajero con la guía y la religión de la verdad, para hacerla prevalecer sobre cualquier otra religión, aunque a los idólatras no les guste.", "urdu": " وہی ہے جس نے اپنے رسول کو ہدایت اور دین حق دے کر بھیجا تا کہ (باقی) تمام دینوں پر اسے غالب کر دے گو مشرکوں کو یہ بات بہت ہی بری لگے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنَّ کَثِیۡرًا مِّنَ الۡاَحۡبَارِ وَ الرُّہۡبَانِ لَیَاۡکُلُوۡنَ اَمۡوَالَ النَّاسِ بِالۡبَاطِلِ وَ یَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ وَ الَّذِیۡنَ یَکۡنِزُوۡنَ الذَّہَبَ وَ الۡفِضَّۃَ وَ لَا یُنۡفِقُوۡنَہَا فِیۡ سَبِیۡلِ اللّٰہِ ۙ فَبَشِّرۡہُمۡ بِعَذَابٍ اَلِیۡمٍ ﴿ۙ۳۴﴾", "english": " O ye who believe! surely, many of the priests and monks devour the wealth of men by false means and turn men away from the way of Allah. And those who hoard up gold and silver and spend it not in the way of Allah — give to them the tidings of a painful punishment,", "french": " Ô vous qui croyez ! Sûrement, un grand nombre de prêtres et de moines dévorent par des moyens perfides les biens des gens et empêchent les gens de suivre la voie d’Allāh. Et ceux qui amassent de l’or et de l’argent et ne les dépensent pas dans la voie d’Allāh, annonce-leur un châtiment douloureux.", "german": " O die ihr glaubt, wahrlich, viele der Schriftgelehrten und Mönche verzehren das Gut der Menschen durch Falsches und machen abwendig von Allahs Weg. Und jene, die Gold und Silber anhäufen und es nicht aufwenden auf Allahs Weg – ihnen verheiße schmerzliche Strafe.", "spanish": " ¡Oh vosotros, los que creéis! En verdad, muchos de los sacerdotes y onjes devoran las riquezas de los hombres con medios falsos y apartan a los hombres del camino de Al-lah. Pero a quienes atesoran el oro y la plata y no lo emplean en el camino de Al-lah, dales la noticia de un doloroso castigo.", "urdu": " اے مومنو! بہت سے احبار اور رہبان لوگوں کے مالوں کو ناواجب طور پر کھاتے ہیں اور (لوگوں کو) اللہ کے راستہ سے روکتے ہیں۔ اور وہ لوگ (بھی) جو سونے اور چاندی کو جمع رکھتے ہیں۔ اور اللہ کے راستہ میں خرچ نہیں کرتے۔ ان کو دردناک عذاب کی خبر دے۔"}, {"arabic": " یَّوۡمَ یُحۡمٰی عَلَیۡہَا فِیۡ نَارِ جَہَنَّمَ فَتُکۡوٰی بِہَا جِبَاہُہُمۡ وَ جُنُوۡبُہُمۡ وَ ظُہُوۡرُہُمۡ ؕ ہٰذَا مَا کَنَزۡتُمۡ لِاَنۡفُسِکُمۡ فَذُوۡقُوۡا مَا کُنۡتُمۡ تَکۡنِزُوۡنَ ﴿۳۵﴾", "english": " On the day when it shall be made hot in the fire of Hell, and their foreheads and their sides and their backs shall be branded therewith and it shall be said to them : ‘This is what you treasured up for yourselves; so now taste what you used to treasure up.’", "french": " . Le jour où cela sera chauffé au feu de l’Enfer, et qu’ils en auront le front, les côtés et le dos marqués, il leur sera dit : « Voici ce que vous avez amassé pour vous-mêmes ; goûtez maintenant ce que vous amassiez. »", "german": " An dem Tage, wo es erhitzt wird im Feuer der Hölle, und ihre Stirnen und ihre Seiten und ihre Rücken damit gebrandmarkt werden: \"Dies ist, was ihr angehäuft habt für euch selber; kostet nun, was ihr anzuhäufen pflegtet.\"", "spanish": " En el día en que se calentará el fuego del Infierno, y sus frentes, us costados y sus espaldas sean marcados con él, diciéndoseles: “esto es lo que atesorasteis para vosotros; probad ahora lo que habéis amontonado”.", "urdu": " (یہ عذاب) اس دن (ہوگا) جبکہ اس (جمع شدہ سونے اور چاندی) پر جہنم کی آگ بھڑکائی جائے گی پھر اس (سونے اور چاندی) سے ان کے ماتھوں اور پہلوٶں اور پیٹھوں کو داغ لگائے جائیں گے (اور کہا جائے گا کہ) یہ وہ چیز ہے جس کو تم اپنی جانوں کے لئے جمع کرتے تھے۔ پس جن چیزوں کو تم جمع کرتے تھے ان کے مزہ کو چکھو۔"}, {"arabic": " اِنَّ عِدَّۃَ الشُّہُوۡرِ عِنۡدَ اللّٰہِ اثۡنَا عَشَرَ شَہۡرًا فِیۡ کِتٰبِ اللّٰہِ یَوۡمَ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ مِنۡہَاۤ اَرۡبَعَۃٌ حُرُمٌ ؕ ذٰلِکَ الدِّیۡنُ الۡقَیِّمُ ۬ۙ فَلَا تَظۡلِمُوۡا فِیۡہِنَّ اَنۡفُسَکُمۡ وَ قَاتِلُوا الۡمُشۡرِکِیۡنَ کَآفَّۃً کَمَا یُقَاتِلُوۡنَکُمۡ کَآفَّۃً ؕ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ مَعَ الۡمُتَّقِیۡنَ ﴿۳۶﴾", "english": " The reckoning of months with Allah has been twelve months by Allah’s ordinance since the day when He created the heavens and the earth. Of these, four are sacred. That is the right creed. So wrong not yourselves therein. And fight the idolaters all together as they fight you all together; and know that Allah is with the righteous.", "french": " Suivant la prescription d’Allāh, le nombre des mois auprès d’Allāh a été de douze mois, depuis le jour où Il a créé les cieux et la terre. Quatre d’entre eux sont sacrés. C’est là la religion qui tient ferme. Ne vous faites pas de tort durant ces mois. Et tous ensemble combattez les idolâtres, tout comme tous ensemble ils vous combattent ; et sachez qu’Allāh est avec ceux qui Le craignent.", "german": " Siehe, die Anzahl der Monate bei Allah ist zwölf Monate nach dem Gesetz Allahs seit dem Tage, da Er die Himmel und die Erde erschuf. Von diesen sind vier heilig. Das ist der beständige Glaube. Drum versündigt euch nicht in ihnen. Und bekämpfet die Götzendiener insgesamt, wie sie euch bekämpfen insgesamt; und wisset, dass Allah mit den Gottesfürchtigen ist.", "spanish": " El recuento de los meses junto a Al-lah ha sido de doce meses, por decreto de Al-lah, desde el día en que creó los cielos y la tierra. De ellos, cuatro son sagrados. Ésta es la religión que permanece. No os perjudiquéis, pues, en ello. Combatid a los idólatras todos juntos como ellos os combaten unidos; y sabed que Al-lah está con el justo.", "urdu": " یقیناً مہینوں کی گنتی اللہ کے نزدیک بارہ مہینے (ہی) ہوتی ہے۔ یہ اللہ کا قانون ہے۔ اس دن سے کہ آسمانوں اور زمین کو اس نے پیدا کیا ہے ان (مہینوں) میں سے چار عزت کے مہینے (کہلاتے) ہیں۔ یہ مضبوط دین ہے۔ پس (چاہیے کہ) ان مہینوں میں اپنی جانوں پر ظلم نہ کیا کرو۔ اور تمام مشرکوں سے لڑو۔ جس طرح کہ وہ سب کے سب تم سے لڑتے ہیں اور یاد رکھو کہ اللہ متقیوں کے ساتھ ہے۔"}, {"arabic": " اِنَّمَا النَّسِیۡٓءُ زِیَادَۃٌ فِی الۡکُفۡرِ یُضَلُّ بِہِ الَّذِیۡنَ کَفَرُوۡا یُحِلُّوۡنَہٗ عَامًا وَّ یُحَرِّمُوۡنَہٗ عَامًا لِّیُوَاطِـُٔوۡا عِدَّۃَ مَا حَرَّمَ اللّٰہُ فَیُحِلُّوۡا مَا حَرَّمَ اللّٰہُ ؕ زُیِّنَ لَہُمۡ سُوۡٓءُ اَعۡمَالِہِمۡ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الۡکٰفِرِیۡنَ ﴿٪۳۷﴾", "english": " Surely, the postponement of a Sacred Month is an addition to disbelief. Those who disbelieve are led astray thereby. They allow it one year and forbid it another year, that they may agree in the number of the months which Allah has made sacred, and thus may make lawful what Allah has forbidden. The evil of their deeds is made to seem fair to them. And Allah guides not the disbelieving people.", "french": " Assurément, c’est un acte de mécréance supplémentaire que d’avancer ou de reporter un Mois Sacré . C’est par-là que ceux qui ne croient pas s’égarent. Une année, ils le rendent légal, et une autre année, ils le rendent illégal, pour pouvoir s’accorder sur le nombre de mois qu’Allāh a rendus sacrés, et ainsi rendre licite ce qu’Allāh leur a interdit. Ainsi leurs méfaits ont été rendus attrayants à leurs yeux. Et Allāh ne guide pas les incroyants.", "german": " Das Verschieben (eines Heiligen Monats) ist nur eine Mehrung des Unglaubens. Die Ungläubigen werden dadurch irregeführt. Sie erlauben es im einen Jahr und verbieten es in einem anderen Jahr, damit sie in der Anzahl (der Monate), die Allah heilig gemacht hat, übereinstimmen und so erlaubt machen, was Allah verwehrt hat. Das Böse ihrer Taten wird ihnen schön gemacht. Doch Allah weist dem ungläubigen Volk nicht den Weg.", "spanish": " En verdad, el aplazamiento de un mes sagrado es un aditamento para la incredulidad. Los que no creen se extravían con ello. Lo permiten un año y lo prohíben otro año para ponerse de acuerdo en el número de meses que Al-lah ha hecho sagrados, y poder hacer así lícito lo que Dios ha prohibido. La maldad de sus acciones se les hace parecer justa a sus ojos. Pues Al-lah no guía a las gentes incrédulas.", "urdu": " نَسِیْ ء صرف کفر کے زمانے کی زیادتی ہے جس کے ذریعہ سے کافر لوگ گمراہ ہوتے رہتے ہیں وہ اسے ایک سال حلال قرار دیتے ہیں اور دوسرے سال حرام قرار دیتے ہیں تا کہ وہ مہینوں کو سال کی مقررہ گنتی کے برابر کر دیں اور ان مہینوں کے مطابق کر دیں جن میں جنگ منع ہے (اور اپنی پیدا کردہ تبدیلی کی وجہ سے جو اختلاف ہو گیا ہے اسے پورا کردیں) ان اعمال کی خرابی (شیطان کی طرف سے) ان کو خوبصورت کرکے دکھا دی گئی ہے اور اللہ کافر قوم کو کامیابی کا راستہ نہیں دکھاتا۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا مَا لَکُمۡ اِذَا قِیۡلَ لَکُمُ انۡفِرُوۡا فِیۡ سَبِیۡلِ اللّٰہِ اثَّاقَلۡتُمۡ اِلَی الۡاَرۡضِ ؕ اَرَضِیۡتُمۡ بِالۡحَیٰوۃِ الدُّنۡیَا مِنَ الۡاٰخِرَۃِ ۚ فَمَا مَتَاعُ الۡحَیٰوۃِ الدُّنۡیَا فِی الۡاٰخِرَۃِ اِلَّا قَلِیۡلٌ ﴿۳۸﴾", "english": " O ye who believe! what is the matter with you that, when it is said to you, go forth in the way of Allah, you sink heavily towards the earth? Would you be contented with the present life in preference to the Hereafter? But the enjoyment of the present life is but little, as compared with the Hereafter.", "french": " Ô vous qui croyez ! Qu’avez-vous donc pour que, lorsqu’il vous est dit : « Partez au combat sur la voie d’Allāh, » vous vous affaissiez lourdement vers la terre ? Etes-vous contents de la vie d’ici-bas de préférence à celle de l’au-delà ? Mais le gain de cette vie-ci est bien peu de chose comparé à celui de l’au-delà.", "german": " O die ihr glaubt, was ist mit euch, dass ihr euch schwer zur Erde sinken lasset, wenn euch gesagt wird: \"Ziehet aus auf Allahs Weg\"? Würdet ihr euch denn mit dem Leben hienieden, statt mit jenem des Jenseits, zufrieden geben? Doch der Genuss des irdischen Lebens ist gar klein, verglichen mit dem künftigen.", "spanish": " ¡Oh vosotros, los que creéis! ¿Qué os ocurre cuando se os dice: “salid por la causa de Al-lah”, que os quedáis clavados en la tierra? ¿Os contentaréis con la vida presente, prefiriéndola al Más Allá? Mas la ganancia de la vida actual no parecerá sino pequeña e insignificante en el Más Allá.", "urdu": " اے مومنو! تم کو کیا ہو گیا ہے کہ جب تم سے کہا جاتا ہے کہ اللہ کے راستہ میں لڑنے کے لئے (سب مل کر) نکلو تو تم لوگ اپنے ملک (کی محبت) کی طرف جھک جاتے ہو کیا تم آخرت کے مقابلہ میں دنیا کی زندگی پسند کرتے ہو؟ (اگر ایسا ہے) تو یاد رکھو کہ دنیا کی زندگی کا سامان آخرت کے مقابلہ میں صرف ایک حقیر چیز ہے۔"}, {"arabic": " اِلَّا تَنۡفِرُوۡا یُعَذِّبۡکُمۡ عَذَابًا اَلِیۡمًا ۬ۙ وَّ یَسۡتَبۡدِلۡ قَوۡمًا غَیۡرَکُمۡ وَ لَا تَضُرُّوۡہُ شَیۡئًا ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۳۹﴾", "english": " If you do not go forth to fight , He will punish you with a painful punishment, and will choose in your stead a people other than you, and you shall do Him no harm at all. And Allah has full power over all things.", "french": " Si vous ne partez pas au combat pour la cause d’Allāh, Il vous infligera un châtiment douloureux, et amènera à votre place un autre peuple que vous, et vous ne Lui nuirez en aucune façon ; Et Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Wenn ihr nicht auszieht, wird Er euch strafen mit schmerzlicher Strafe und wird an eurer Stelle ein anderes Volk erwählen, und ihr werdet Ihm gewiss keinen Schaden tun. Und Allah hat Macht über alle Dinge.", "spanish": " Si no partís al combate, Él os castigará con un castigo doloroso, y elegirá en vuestro lugar a un pueblo distinto a vosotros, y no podréis perjudicarle en absoluto. Pues Al-lah tiene pleno poder sobre todas las cosas.", "urdu": " اگر تم (سب مل کر اللہ کے راستہ میں) لڑنے کے لئے نکلو گے تو وہ تم کو دردناک عذاب دے گا اور تمہارے سوا ایک اور قوم کو بدل کر لے آئے گا اور تم اسے (یعنی اللہ کو) کوئی نقصان نہیں پہنچا سکو گے اور اللہ ہر چیز پر (جس کے کرنے کا وہ ارادہ کرے) قادر ہے۔"}, {"arabic": " اِلَّا تَنۡصُرُوۡہُ فَقَدۡ نَصَرَہُ اللّٰہُ اِذۡ اَخۡرَجَہُ الَّذِیۡنَ کَفَرُوۡا ثَانِیَ اثۡنَیۡنِ اِذۡ ہُمَا فِی الۡغَارِ اِذۡ یَقُوۡلُ لِصَاحِبِہٖ لَا تَحۡزَنۡ اِنَّ اللّٰہَ مَعَنَا ۚ فَاَنۡزَلَ اللّٰہُ سَکِیۡنَتَہٗ عَلَیۡہِ وَ اَیَّدَہٗ بِجُنُوۡدٍ لَّمۡ تَرَوۡہَا وَ جَعَلَ کَلِمَۃَ الَّذِیۡنَ کَفَرُوا السُّفۡلٰی ؕ وَ کَلِمَۃُ اللّٰہِ ہِیَ الۡعُلۡیَا ؕ وَ اللّٰہُ عَزِیۡزٌ حَکِیۡمٌ ﴿۴۰﴾", "english": " If you help him not, then know that Allah helped him even when the disbelievers drove him forth while he was one of the two when they were both in the cave, when he said to his companion, ‘Grieve not, for Allah is with us.’ Then Allah sent down His peace on him, and strengthened him with hosts which you did not see, and humbled the word of those who disbelieved, and it is the word of Allah alone which is supreme. And Allah is Mighty, Wise.", "french": " Si vous ne lui venez pas en aide, alors sachez qu’ Allāh l’a aidé, même lorsque les mécréants l’ont chassé, et qu’il était l’un des deux quand ils étaient tous deux dans la grotte, quand il dit à son compagnon : « Ne t’afflige pas, assurément Allāh est avec nous. » Alors Allāh fit descendre Sa paix sur lui, et envoya à son secours des troupes que vous n’avez pas vues, et Il abaissa la parole des mécréants, et il n’y a que la parole d’Allāh qui soit suprême. Et Allāh est Puissant, Sage.", "german": " Wenn ihr ihm nicht helfet, so (wisset, dass) Allah ihm auch damals half, als die Ungläubigen ihn zu entweichen zwangen selbander – wie sie da beide in der Höhle waren, und er sprach zu seinem Begleiter: \"Traure nicht, denn Allah ist mit uns.\" Da senkte Allah Seinen Frieden auf ihn und stärkte ihn mit Heerscharen, die ihr nicht saht, und erniedrigte das Wort der Ungläubigen, und es ist Allahs Wort allein das höchste. Und Allah ist allmächtig, allweise.", "spanish": " Si no le ayudáis, sabed que Al-lah le ayudó incluso cuando los incrédulos lo desterraron, siendo uno de los dos que estaban en la caverna, cuando dijo a su compañero: “No te aflijas, pues Al-lah está con nosotros”. Entonces Al-lah le envió Su paz, y lo fortaleció con huestes que vosotros no visteis y humilló la palabra de los incrédulos, pues sólo la palabra de Al-lah es la que es suprema, ya que Al-lah es Poderoso, Sabio.", "urdu": " اگر تم اس رسول کی مدد نہ کرو تو (یاد رکھو کہ) اللہ اس کی اس وقت بھی مدد کر چکا ہے جبکہ اسے کافروں نے دو میں سے ایک کی صورت میں نکال دیا تھا جبکہ وہ دونوں غار میں تھے اور جبکہ وہ اپنے ساتھی (ابوبکر) سے کہہ رہا تھا کہ کسی گذشتہ بھول چوک پر غم نہ کرو۔ اللہ یقیناً ہمارے ساتھ ہے۔ پس اللہ نے اس پر اپنی سکینت نازل کی۔ اور اس کی ایسے لشکروں سے مدد کی جن کو تم نہیں دیکھتے تھے اور ان لوگوں کی بات کو نیچا کر دیا جنہوں نے کفر کیا تھا اور اللہ ہی کی بات اونچی ہو کر رہتی ہے اور اللہ بڑا غالب (اور) حکمت والا ہے۔"}, {"arabic": " اِنۡفِرُوۡا خِفَافًا وَّ ثِقَالًا وَّ جَاہِدُوۡا بِاَمۡوَالِکُمۡ وَ اَنۡفُسِکُمۡ فِیۡ سَبِیۡلِ اللّٰہِ ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۴۱﴾", "english": " Go forth, light and heavy, and strive with your property and your persons in the cause of Allah. That is better for you, if only you knew.", "french": " Partez, légers ou lourds, et combattez avec vos biens et vos personnes dans la voie d’Allāh. Cela vaut mieux pour vous, si seule­ment vous saviez.", "german": " Ziehet aus, leicht und schwer, und streitet mit eurem Gut und eurem Blut für Allahs Sache! Das ist besser für euch, wenn ihr es nur wüßtet!", "spanish": " Salid, ligeros y pesados, y esforzaos con vuestros bienes y vuestras personas por la causa de Al-lah. Esto es lo mejor para vosotros, ¡si lo supierais!", "urdu": " اے مومنو! جہاد کے لئے نکل کھڑے ہو خواہ تم بے سازوسامان ہو‘ یا باسازوسامان۔ اور اپنے مالوں اور اپنی جانوں کے ساتھ اللہ کے راستہ میں جہاد کرو۔ یہ تمہارے لئے اگر تم جانتے ہو بہت بہتر ہوگا۔"}, {"arabic": " لَوۡ کَانَ عَرَضًا قَرِیۡبًا وَّ سَفَرًا قَاصِدًا لَّاتَّبَعُوۡکَ وَ لٰکِنۡۢ بَعُدَتۡ عَلَیۡہِمُ الشُّقَّۃُ ؕ وَ سَیَحۡلِفُوۡنَ بِاللّٰہِ لَوِ اسۡتَطَعۡنَا لَخَرَجۡنَا مَعَکُمۡ ۚ یُہۡلِکُوۡنَ اَنۡفُسَہُمۡ ۚ وَ اللّٰہُ یَعۡلَمُ اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿٪۴۲﴾", "english": " If it had been an immediate gain and a short journey, they would certainly have followed thee, but the hard journey seemed too long to them. Yet they will swear by Allah, saying , ‘If we had been able, we would surely have gone forth with you.’ They ruin their souls; and Allah knows that they are liars.", "french": " S’il était question d’une distance courte et d’un voyage facile, ils t’auraient assurément suivi, mais le pénible voyage leur sembla trop long. Néanmoins, ils jureront par Allāh, en disant : « Si nous l’avions pu, nous serions assurément partis avec vous. » Ils détruisent eux-mêmes ; et Allāh sait que ce sont des menteurs.", "german": " Hätte es sich um einen nahen Gewinn und um eine kurze Reise gehandelt, sie wären dir gewiss gefolgt, doch die schwere Reise schien ihnen zu lang. Und doch werden sie bei Allah schwören: \"Hätten wir es vermocht, wir wären sicherlich mit euch ausgezogen\" Sie verderben ihre Seelen; und Allah weiß, dass sie Lügner sind.", "spanish": " Si hubiese habido una ganancia inmediata y un viaje corto, ciertamente te habrían seguido, pero el viaje duro les pareció demasiado largo. Sin embargo, jurarán por Al-lah diciendo: “Si hubiésemos podido, en verdad, hubiéramos avanzado contigo”. Arruinan sus almas, y Al-lah sabe que son mentirosos.", "urdu": " اگر قریب میں ملنے والا فائدہ ہوتا یا چھوٹا سفر ہوتا تو یہ لوگ تیرے پیچھے چل پڑتے لیکن انہیں مسافت دور معلوم ہوئی۔ لیکن (اب وہ تیری واپسی کے بعد) اللہ کی قسمیں کھا کر کہیں گے کہ اگر ہماری طاقت میں ہوتا تو ہم ضرور تمہارے ساتھ نکل کھڑے ہوتے (یہ لوگ) اپنی جانوں کو ہلاک کرتے ہیں اور اللہ جانتا ہے کہ یہ جھوٹے ہیں۔"}, {"arabic": " عَفَا اللّٰہُ عَنۡکَ ۚ لِمَ اَذِنۡتَ لَہُمۡ حَتّٰی یَتَبَیَّنَ لَکَ الَّذِیۡنَ صَدَقُوۡا وَ تَعۡلَمَ الۡکٰذِبِیۡنَ ﴿۴۳﴾", "english": " Allah remove thy cares . Why didst thou permit them to stay behind until those who spoke the truth had become known to thee and until thou hadst known the liars?", "french": " Qu’Allāh te soit indulgent ! Pourquoi leur as-tu permis de rester en arrière avant que tu ne puisses distinguer ceux qui disaient vrai et reconnaître les menteurs ?", "german": " Allah nehme deine (Sorgen) von dir! Warum erlaubtest du ihnen (zurückzubleiben), bis die, welche die Wahrheit sprachen, dir bekannt wurden und du die Lügner erkanntest?", "spanish": " Al-lah hace desaparecer tus preocupaciones . ¿Por qué les permitiste quedarse detrás hasta que los que dijeron la verdad fueron conocidos por ti y hasta que identificaste a los mentirosos?", "urdu": " اللہ نے تیری غلطی کے بداثر کو مٹا دیا اور تجھے عزت دی۔ لیکن آخر تم نے کیوں ان (اجازت مانگنے والوں) کو پیچھے رہنے کی اجازت دی تھی (تم ان کے جانے پر اصرار کرتے) یہاں تک کہ سچ بولنے والے تجھ پر ظاہر ہو جاتے اور تو جھوٹوں کو بھی جان لیتا۔"}, {"arabic": " لَا یَسۡتَاۡذِنُکَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ اَنۡ یُّجَاہِدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِالۡمُتَّقِیۡنَ ﴿۴۴﴾", "english": " Those who believe in Allah and the Last Day will not ask leave of thee to be exempted from striving with their property and their persons. And Allah well knows the righteous.", "french": " Ceux qui croient en Allāh et au Jour Dernier ne te demanderont pas la permission d’être exemptés de lutter avec leurs biens et leurs personnes ; et Allāh connaît très bien les gens droits.", "german": " Die an Allah und an den Jüngsten Tag glauben, bitten dich nicht um Erlaubnis, nicht zu streiten mit ihrem Gut und ihrem Blut; und Allah kennt recht wohl die Gottesfürchtigen.", "spanish": " Quienes creen en Al-lah y en el Último Día no te pedirán permiso para quedar exentos de esforzarse con sus bienes y sus personas. Pues Al-lah conoce perfectamente al justo.", "urdu": " جو اللہ اور یوم آخرت پر ایمان لاتے ہیں‘ وہ اپنے مالوں اور جانوں کے ساتھ جہاد کرنے سے بچنے کی اجازت نہیں مانگتے۔ اللہ متقیوں سے خوب واقف ہے۔"}, {"arabic": " اِنَّمَا یَسۡتَاۡذِنُکَ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ ارۡتَابَتۡ قُلُوۡبُہُمۡ فَہُمۡ فِیۡ رَیۡبِہِمۡ یَتَرَدَّدُوۡنَ ﴿۴۵﴾", "english": " Only those will ask leave of thee to be exempted who do not believe in Allah and the Last Day, and whose hearts are full of doubt, and in their doubt they waver.", "french": " Il n’y a que ceux qui ne croient pas en Allāh et au Jour Dernier, qui te demanderont cette exemption, ceux dont le cœur est rempli de doute et dans leur doute ils vacillent.", "german": " Nur die werden dich um Erlaubnis bitten, die nicht an Allah und an den Jüngsten Tag glauben und deren Herzen voll des Zweifels sind; und in ihrem Zweifel schwanken sie.", "spanish": " Sólo te pedirán permiso para quedar exentos quienes no creen en Al-lah y en el Último Día y cuyos corazones están llenos de dudas; y en su duda vacilan.", "urdu": " پیچھے رہنے کی اجازت صرف وہ مانگتے ہیں جو کہ اللہ اور یوم آخرت پر ایمان نہیں لاتے اور ان کے دلوں میں شبہات پیدا ہو گئے ہیں پس وہ اپنے شبہات کی وجہ سے کبھی ادھر ہوتے ہیں کبھی ادھر۔"}, {"arabic": " وَ لَوۡ اَرَادُوا الۡخُرُوۡجَ لَاَعَدُّوۡا لَہٗ عُدَّۃً وَّ لٰکِنۡ کَرِہَ اللّٰہُ انۡۢبِعَاثَہُمۡ فَثَبَّطَہُمۡ وَ قِیۡلَ اقۡعُدُوۡا مَعَ الۡقٰعِدِیۡنَ ﴿۴۶﴾", "english": " And if they had intended to go forth they would certainly have made some preparation for it; but Allah was averse to their marching forth. So He kept them back, and it was said: ‘Sit ye at home with those who sit.’", "french": " Et s’ils avaient vraiment voulu partir au combat , ils auraient assurément fait des préparatifs pour cela ; mais leur départ pour ce grand objectif –là aurait déplu à Allāh. Il les a donc retenus en arrière et il leur a été dit : « Restez assis chez vous avec ceux qui restent assis. »", "german": " Wären sie aber zum Ausmarsch entschlossen gewesen, sie hätten doch gewiss für ihn gerüstet; doch Allah war ihrem Ausziehen abgeneigt. So hielt Er sie zurück, und es ward gesagt: \"Sitzet (daheim) mit den Sitzenden.\"", "spanish": " Pues si hubiesen pensado acudir, ciertamente hubiesen hecho algunos preparativos para ello; pero Al-lah era contrario a su partida. Por ello los mantuvo atrás; y se les dijo: “Sentaos en casa con los que se sientan”.", "urdu": " اور اگر وہ (جنگ کے لئے) نکلنے کا پختہ ارادہ رکھتے تو اس کے لئے کوئی تیاری بھی کرتے۔ لیکن اللہ نے ان کے (جنگ کے لئے) نکلنے کو پسند نہیں کیا۔ پس ان کو اپنی جگہ پر ہی بٹھا دیا اور ان سے یہ کہہ دیا گیا (یعنی ان کے کافر دوستوں نے کہا) کہ جو لوگ بیٹھ رہے ہیں انہی کے ساتھ تم بھی بیٹھ رہو۔"}, {"arabic": " لَوۡ خَرَجُوۡا فِیۡکُمۡ مَّا زَادُوۡکُمۡ اِلَّا خَبَالًا وَّ لَا۠اَوۡضَعُوۡا خِلٰلَکُمۡ یَبۡغُوۡنَکُمُ الۡفِتۡنَۃَ ۚ وَ فِیۡکُمۡ سَمّٰعُوۡنَ لَہُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِالظّٰلِمِیۡنَ ﴿۴۷﴾", "english": " If they had gone forth with you, they would have added to you nothing but trouble, and would have hurried to and fro in your midst, seeking to create discord among you. And there are among you those who would listen to them. And Allah well knows the wrongdoers.", "french": " S’ils étaient partis avec vous, ils n’auraient fait qu’accroître vos ennuis, et ils n’auraient fait qu’aller et venir parmi vous, cherchant à semer la discorde entre vous. Et il y en a parmi vous qui ont l’habitude de les écouter. Et Allāh connaît très bien les transgresseurs.", "german": " Wären sie mit euch ausgezogen, sie hätten nur eure Sorgen gemehrt und wären hin und hergelaufen in eurer Mitte, Zwietracht unter euch erregend. Und unter euch sind manche, die auf sie gehört hätten, aber Allah kennt die Frevler wohl.", "spanish": " Si hubiesen avanzado contigo, no te ha­brían dado sino problemas, abrían avanzado y retrocedido en medio de los otros, intentando crear la discordia entre todos. Y entre vosotros hay algunos que suelen escucharles . Pero Al-lah conoce perfectamente a los malvados.", "urdu": " اگر وہ تمہارے ساتھ مل کر نکلتے تو خرابی پیدا کرنے کے سوا تمہاری کچھ مدد نہ کرتے اور وہ تمہارے درمیان (فساد کرنے کے لئے) خوب گھوڑے دوڑاتے پھرتے (اور) تمہارے اندر فتنہ پیدا کرنے کی خواہش کرتے اور تم میں (بھی) کچھ ایسے (لوگ پائے جاتے) ہیں جو ان تک پہنچانے کے لئے باتیں سنتے ہیں اور اللہ ظالموں کو خوب جانتا ہے۔"}, {"arabic": " لَقَدِ ابۡتَغَوُا الۡفِتۡنَۃَ مِنۡ قَبۡلُ وَ قَلَّبُوۡا لَکَ الۡاُمُوۡرَ حَتّٰی جَآءَ الۡحَقُّ وَ ظَہَرَ اَمۡرُ اللّٰہِ وَ ہُمۡ کٰرِہُوۡنَ ﴿۴۸﴾", "english": " They sought to create disorder even before this , and they devised plots against thee till the truth came and the purpose of Allah prevailed, though they did not like it.", "french": " Ils ont cherché à créer la sédition même avant ceci et t’ont présenté les choses d’une façon embrouillée jusqu’à ce que la vérité fût manifestée, et que l’objectif d’Allāh eût prévalu, en dépit de leur aversion.", "german": " Schon vorher trachteten sie nach Unordnung und schmiedeten Ränke wider dich, bis die Wahrheit kam und die Absicht Allahs obsiegte, wiewohl es ihnen zuwider war.", "spanish": " Intentaron crear el desorden incluso antes de esto, y prepararon maquinaciones contra ti hasta que llegó la verdad y prevaleció el designio de Al-lah, aunque a ellos no les gustó.", "urdu": " انہوں نے اس سے پہلے بھی فتنہ (پیدا کرنا) چاہا تھا اور تیرے لئے حالات کو کئی کئی طرح بدلا تھا۔ یہاں تک کہ حق آگیا اور اللہ کا فیصلہ ظاہر ہو گیا اور وہ (اس فیصلہ کو) ناپسند کرتے تھے۔"}, {"arabic": " وَ مِنۡہُمۡ مَّنۡ یَّقُوۡلُ ائۡذَنۡ لِّیۡ وَ لَا تَفۡتِنِّیۡ ؕ اَلَا فِی الۡفِتۡنَۃِ سَقَطُوۡا ؕ وَ اِنَّ جَہَنَّمَ لَمُحِیۡطَۃٌۢ بِالۡکٰفِرِیۡنَ ﴿۴۹﴾", "english": " And among them is he who says, ‘Permit me to stay behind and put me not to trial.’ Surely, they have already fallen into trial. And surely, Hell shall encompass the disbelievers.", "french": " Et parmi eux se trouve celui qui dit : « Permets-moi de rester en arrière et ne me mets pas à l’épreuve. » Assurément ils ont déjà suc­combé à l’épreuve. Et assurément, l’Enfer encerclera les mécréants.", "german": " Unter ihnen ist so mancher, der spricht: \"Erlaube mir (zurückzubleiben), und stelle mich nicht auf die Probe.\" Höret! ihre Probe hat sie ja schon ereilt. Und fürwahr, die Hölle wird die Ungläubigen einschließen.", "spanish": " Y entre ellos hay quien te dice: “Permíteme quedarme detrás y no me pongas a prueba”. En verdad, han caído ya en la prueba. Pues verdaderamente el Infierno rodeará a los incrédulos.", "urdu": " اور ان میں سے بعض (منافق) ایسے بھی ہیں جو کہتے ہیں کہ ہمیں (پیچھے رہنے کی) اجازت دیجئے اور ہم کو (جنگ پر جانے) کی آزمائش میں نہ ڈالیئے۔ سن رکھو۔ یہ لوگ فتنہ میں پہلے ہی سے پڑ چکے ہیں اور جہنم کافروں کو یقیناً تباہ کرنے والی ہے۔"}, {"arabic": " اِنۡ تُصِبۡکَ حَسَنَۃٌ تَسُؤۡہُمۡ ۚ وَ اِنۡ تُصِبۡکَ مُصِیۡبَۃٌ یَّقُوۡلُوۡا قَدۡ اَخَذۡنَاۤ اَمۡرَنَا مِنۡ قَبۡلُ وَ یَتَوَلَّوۡا وَّ ہُمۡ فَرِحُوۡنَ ﴿۵۰﴾", "english": " If good befall thee, it grieves them, but if a misfortune befall thee, they say, ‘We had indeed taken our precaution beforehand.’ And they turn away rejoicing.", "french": " Si un bonheur t’arrive, ils s’en chagri­nent, mais si un malheur t’accable, ils disent : « Nous avions assurément pris nos précautions d’avance. » Et ils tournent le dos en se réjouis­sant.", "german": " Trifft dich ein Heil, so betrübt es sie; doch wenn dich ein Unheil trifft, sagen sie: \"Wir hatten uns ja schon vorher gesichert.\" Und sie wenden sich ab und freuen sich.", "spanish": " Si te sucede algo bueno, eso les aflige, pero si te sucede una desgracia, dicen: “Habíamos tomado ya nuestras precauciones”. Y vuelven la espalda con regocijo.", "urdu": " اگر تجھے کوئی فائدہ پہنچے تو ان کو برا لگتا ہے اور اگر تجھ پر کوئی مصیبت آجائے تو وہ کہتے ہیں‘ ہم نے تو پہلے ہی سے اپنے پیش آنے والے دنوں کا انتظام کر لیا تھا اور وہ خوشی کے مارے پیٹھ پھیر کر چلے جاتے ہیں۔"}, {"arabic": " قُلۡ لَّنۡ یُّصِیۡبَنَاۤ اِلَّا مَا کَتَبَ اللّٰہُ لَنَا ۚ ہُوَ مَوۡلٰٮنَا ۚ وَ عَلَی اللّٰہِ فَلۡیَتَوَکَّلِ الۡمُؤۡمِنُوۡنَ ﴿۵۱﴾", "english": " Say, ‘Nothing shall befall us save that which Allah has ordained for us. He is our Protector. And in Allah then should the believers put their trust.’", "french": " Dis : « Aucun malheur ne nous surviendra sauf ce qu’Allāh a décrété pour nous. Il est notre Protecteur. Et c’est en Allāh que les croyants doivent mettre leur confiance. »", "german": " Sprich: \"Nichts kann uns treffen als das, was Allah uns bestimmt hat. Er ist unser Beschützer. Und auf Allah sollten die Gläubigen vertrauen.\"", "spanish": " Diles: “No nos sucederá nada salvo lo que Al-lah haya ordenado para nosotros. Él es nuestro Protector y en Al-lah deben, pues, poner su confianza los creyentes”.", "urdu": " تو (ان سے) کہہ دے‘ ہم کو تو وہی پہنچتا ہے جو اللہ نے ہمارے لئے مقرر کر چھوڑا ہے وہ ہمارا کارساز ہے اور مومنوں کو چاہیے کہ وہ اللہ پر ہی توکل رکھیں۔"}, {"arabic": " قُلۡ ہَلۡ تَرَبَّصُوۡنَ بِنَاۤ اِلَّاۤ اِحۡدَی الۡحُسۡنَیَیۡنِ ؕ وَ نَحۡنُ نَتَرَبَّصُ بِکُمۡ اَنۡ یُّصِیۡبَکُمُ اللّٰہُ بِعَذَابٍ مِّنۡ عِنۡدِہٖۤ اَوۡ بِاَیۡدِیۡنَا ۫ۖ فَتَرَبَّصُوۡۤا اِنَّا مَعَکُمۡ مُّتَرَبِّصُوۡنَ ﴿۵۲﴾", "english": " Say, ‘You do not await for us anything except one of the two good things; while as regards you, we await that Allah will afflict you with a punishment either from Himself or at our hands. Wait then; we also are waiting with you.’", "french": " Dis : « Vous n’attendez rien pour nous que l’une des deux bonnes choses, tandis que pour vous, nous attendons qu’Allāh vous inflige un châtiment de Sa part ou de nos mains. Attendez donc ; nous aussi nous attendons avec vous. »", "german": " Sprich: \"Ihr erwartet für uns nur eines der beiden guten Dinge, während wir, was euch betrifft, erwarten, dass Allah euch mit einer Strafe treffen wird, entweder durch Ihn Selbst oder durch unsere Hand. Wartet denn; wir warten mit euch.\"", "spanish": " Diles: “No esperáis nada para nosotros excepto una de las dos cosas buenas, mientras que para vosotros esperamos que Al-lah os aflija con n castigo Suyo o por nuestras manos. Esperad, pues, nosotros también esperamos con vosotros”.", "urdu": " تو (ان سے) کہدے کہ دو بھلائیوں میں سے ایک کے سوا تم ہمارے لئے کسی بات کا انتظار نہیں کرتے اور ہم تمہارے لئے صرف اس بات کا انتظار کرتے ہیں کہ اللہ تم کو اپنے پاس سے یا ہمارے ہاتھوں سے عذاب پہنچائے گا پس تم بھی انتظار کرو‘ ہم بھی تمہارے ساتھ انتظار کریں گے۔"}, {"arabic": " قُلۡ اَنۡفِقُوۡا طَوۡعًا اَوۡ کَرۡہًا لَّنۡ یُّتَقَبَّلَ مِنۡکُمۡ ؕ اِنَّکُمۡ کُنۡتُمۡ قَوۡمًا فٰسِقِیۡنَ ﴿۵۳﴾", "english": " Say, ‘Spend willingly or unwillingly, it shall not be accepted from you. You are indeed a disobedient people.’", "french": " Dis : « Dépensez de plein gré ou à contre-cœur ; rien ne sera accepté de votre part. Vous êtes en vérité un peuple désobéissant. »", "german": " Sprich: \"Spendet nur, willig oder unwillig, es wird von euch doch nicht angenommen. Denn wahrlich, ihr seid ein ungehorsames Volk.\"", "spanish": " Diles: “Aunque gastéis voluntaria o involuntariamente, no se os aceptará. Sois, en realidad, un pueblo desobediente”.", "urdu": " تو (ان سے) کہہ دے کہ خواہ خوشی سے خرچ کرو خواہ ناخوشی سے۔ تم سے کسی صورت میں (تمہارا صدقہ) قبول نہ کیا جائے گا کیونکہ تم تو اطاعت سے نکل جانے والی قوم ہو۔"}, {"arabic": " وَ مَا مَنَعَہُمۡ اَنۡ تُقۡبَلَ مِنۡہُمۡ نَفَقٰتُہُمۡ اِلَّاۤ اَنَّہُمۡ کَفَرُوۡا بِاللّٰہِ وَ بِرَسُوۡلِہٖ وَ لَا یَاۡتُوۡنَ الصَّلٰوۃَ اِلَّا وَ ہُمۡ کُسَالٰی وَ لَا یُنۡفِقُوۡنَ اِلَّا وَ ہُمۡ کٰرِہُوۡنَ ﴿۵۴﴾", "english": " And nothing has deprived them of the acceptance of their contributions save that they disbelieve in Allah and His Messenger. And they come not to Prayer except lazily and they make no contribution save reluctantly.", "french": " Et rien n’empêche leurs contributions d’être acceptées, sauf qu’ils ne croient pas en Allāh et en Son Messager. Et ils ne se rendent à la Prière que dans la paresse et ils ne donnent qu’à contre-cœur pour la cause d’Allāh.", "german": " Nichts anderes verhindert die Annahme ihrer Spenden, als dass sie nicht an Allah und an Seinen Gesandten glauben und nur mit Trägheit zum Gebet kommen und ihre Spenden nur widerwillig geben.", "spanish": " Y nada les ha privado de la aceptación de sus contribuciones excepto el no creer en Al-lah y en Su Mensajero. Pues sólo acuden a la Oración perezosamente y no hacen sus contribuciones sino a disgusto.", "urdu": " اور اللہ اور اس کے رسول کے انکار کرنے کے سوا اور اس بات کے سوا کہ وہ نماز بہت سستی سے پڑھتے تھے اور خدا کی راہ میں ناخوشی سے خرچ کرتے تھے ان کے صدقات کے قبول کرنے کو کس نے روکا ہے۔"}, {"arabic": " فَلَا تُعۡجِبۡکَ اَمۡوَالُہُمۡ وَ لَاۤ اَوۡلَادُہُمۡ ؕ اِنَّمَا یُرِیۡدُ اللّٰہُ لِیُعَذِّبَہُمۡ بِہَا فِی الۡحَیٰوۃِ الدُّنۡیَا وَ تَزۡہَقَ اَنۡفُسُہُمۡ وَ ہُمۡ کٰفِرُوۡنَ ﴿۵۵﴾", "english": " So let not their wealth nor their children excite thy wonder. Allah only intends to punish them therewith in the present life and that their souls may depart while they are disbelievers.", "french": " . Que leurs biens et leurs enfants ne t’émerveillent pas. Allāh ne veut par là que les châtier dans la vie présente et faire partir leur âme pendant qu’ils sont en état de mécréance.", "german": " Wundere dich weder über ihr Gut noch über ihre Kinder. Allah will sie damit nur strafen im irdischen Leben, und ihre Seelen sollen abscheiden, während sie Ungläubige sind.", "spanish": " Por tanto, que no te admiren ni sus riquezas ni sus hijos. Al-lah sólo pretende castigarlos con ellos en la vida presente y que sus almas expiren mientras siguen siendo incrédulos.", "urdu": " پس تجھے ان کے مال اور ان کی اولادیں تعجب میں نہ ڈالیں۔ اللہ صرف یہ چاہتا ہے کہ ان (مالوں اور اولادوں) کے ذریعہ سے ان کو اس دنیا کی زندگی میں عذاب دے اور یہ کہ ان کی جانیں ایسے وقت میں نکلیں کہ وہ منکر ہی ہوں۔"}, {"arabic": " وَ یَحۡلِفُوۡنَ بِاللّٰہِ اِنَّہُمۡ لَمِنۡکُمۡ ؕ وَ مَا ہُمۡ مِّنۡکُمۡ وَ لٰکِنَّہُمۡ قَوۡمٌ یَّفۡرَقُوۡنَ ﴿۵۶﴾", "english": " And they swear by Allah that they are indeed of you, while they are not of you, but they are a people who are timorous.", "french": " . Et ils jurent par Allāh qu’ils sont assurément des vôtres, alors qu’ils ne sont nullement des vôtres ; mais ce sont des gens lâches.", "german": " Und sie schwören bei Allah, dass sie wahrhaftig zu euch gehören, doch sie gehören nicht zu euch, sondern sie sind ein Volk von Furchtsamen.", "spanish": " Juran por Al-lah que son realmente de los vuestros, cuando no lo son, ya que son unas gentes cobardes.", "urdu": " اور وہ اس بات پر اللہ کی قسمیں کھاتے ہیں کہ وہ تم میں سے ہیں حالانکہ وہ تم میں سے نہیں ہیں بلکہ وہ ایک ایسی جماعت ہیں جو سخت بزدل ہے۔"}, {"arabic": " لَوۡ یَجِدُوۡنَ مَلۡجَاً اَوۡ مَغٰرٰتٍ اَوۡ مُدَّخَلًا لَّوَلَّوۡا اِلَیۡہِ وَ ہُمۡ یَجۡمَحُوۡنَ ﴿۵۷﴾", "english": " If they could find a place of refuge, or caves, or even a hole to enter, they would surely turn thereto, rushing uncontrollably.", "french": " . S’ils pouvaient trouver un refuge ou des cavernes ou même un trou pour y entrer, ils s’y dirigeraient assurément tout en se précipitant à corps perdu.", "german": " Könnten sie nur einen Zufluchtsort finden oder Höhlen oder ein Schlupfloch, sie würden sich gewiss in wilder Hast dorthin wenden.", "spanish": " Si pudieran encontrar un lugar en el que refugiarse, o cavernas, o incluso un agujero en el que entrar, ciertamente irían a él, corriendo a toda prisa.", "urdu": " اگر وہ کوئی پناہ کی جگہ یا چھپ رہنے کے لئے غار یا بیٹھ رہنے کے لئے کوئی ٹھکانہ پائیں تو وہ پیٹھ پھیر کر دوڑتے ہوئے ادھر چلے جائیں گے۔"}, {"arabic": " وَ مِنۡہُمۡ مَّنۡ یَّلۡمِزُکَ فِی الصَّدَقٰتِ ۚ فَاِنۡ اُعۡطُوۡا مِنۡہَا رَضُوۡا وَ اِنۡ لَّمۡ یُعۡطَوۡا مِنۡہَاۤ اِذَا ہُمۡ یَسۡخَطُوۡنَ ﴿۵۸﴾", "english": " And among them are those who find fault with thee in the matter of alms. If they are given thereof, they are content; but if they are not given thereof, behold! they are discontented.", "french": " . Et il en est parmi eux qui trouvent à redire contre toi au sujet du partage des aumônes. S’ils en reçoivent, ils sont contents ; mais s’ils n’en reçoivent pas, voilà qu’ils sont mécontents !", "german": " Unter ihnen sind jene, die dir wegen der Almosen Vorwürfe machen. Erhalten sie davon, so sind sie zufrieden; erhalten sie aber nicht davon, siehe, dann sind sie verdrossen.", "spanish": " Y entre ellos están quienes encuentran falta en ti en el asunto de las limosnas. Si se les da de ellas se sienten satisfechos; pero si no se les da, he ahí que se muestran descontentos.", "urdu": " اور ان میں سے کچھ (منافق) ایسے ہیں جو صدقات کے بارہ میں تجھ پر الزام لگاتے ہیں۔ اگر ان صدقات میں سے کچھ ان کو دے دیا جائے تو وہ راضی ہو جاتے ہیں‘ اور اگر ان میں سے انہیں کچھ نہ دیا جائے تو فوراً خفا ہو جاتے ہیں۔"}, {"arabic": " وَ لَوۡ اَنَّہُمۡ رَضُوۡا مَاۤ اٰتٰٮہُمُ اللّٰہُ وَ رَسُوۡلُہٗ ۙ وَ قَالُوۡا حَسۡبُنَا اللّٰہُ سَیُؤۡتِیۡنَا اللّٰہُ مِنۡ فَضۡلِہٖ وَ رَسُوۡلُہٗۤ ۙ اِنَّاۤ اِلَی اللّٰہِ رٰغِبُوۡنَ ﴿٪۵۹﴾", "english": " Had they but been content with what Allah and His Messenger had given them and said, ‘Sufficient for us is Allah; Allah will give us of His bounty, and so will His Messenger; to Allah do we turn in supplication,’ it would have been better for them .", "french": " . Si au moins ils s’étaient contentés de ce qu’Allāh et Son Messager leur avaient accordé et avaient dit : « Allāh, de même que Son Messager, nous suffit ; assurément Allāh nous accordera de Sa munificence ; c’est vers Allāh que nous nous tournons mûs d’un désir ardent, » cela aurait mieux valu pour eux.", "german": " Wären sie mit dem zufrieden gewesen, was Allah und Sein Gesandter ihnen gegeben, und hätten sie nur gesagt: \"Unsere Genüge ist Allah: Allah wird uns geben aus Seiner Fülle, und ebenso Sein Gesandter. Zu Allah kehren wir uns als Bittende!\"", "spanish": " Si hubiesen estado satisfechos con lo que Al-lah y Su Mensajero les dieron y dijeran: “Para nosotros nos basta con Al-lah y Su Mensajero; ciertamente Al-lah nos dará de Su magnanimidad; a Al-lah nos dirigimos suplicantes”, habría sido mejor para ellos.", "urdu": " اور اگر وہ اللہ اور اس کے رسول کی عطا پر خوش ہو جاتے اور یہ کہتے کہ اللہ ہی ہمارے لئے کافی ہے (اگر ہمیں تنگی ہوگی تو) اللہ اپنے فضل سے ہمیں دے گا اور (اسی طرح) اس کا رسول بھی۔ ہم تو اپنے اللہ کی طرف جھکنے والے ہیں (تو یہ ان کے لئے بہتر ہوتا)"}, {"arabic": " اِنَّمَا الصَّدَقٰتُ لِلۡفُقَرَآءِ وَ الۡمَسٰکِیۡنِ وَ الۡعٰمِلِیۡنَ عَلَیۡہَا وَ الۡمُؤَلَّفَۃِ قُلُوۡبُہُمۡ وَ فِی الرِّقَابِ وَ الۡغٰرِمِیۡنَ وَ فِیۡ سَبِیۡلِ اللّٰہِ وَ ابۡنِ السَّبِیۡلِ ؕ فَرِیۡضَۃً مِّنَ اللّٰہِ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۶۰﴾", "english": " The alms are only for the poor and the needy, and for those employed in connection therewith, and for those whose hearts are to be reconciled, and for the freeing of slaves, and for those in debt, and for the cause of Allah, and for the wayfarer — an ordinance from Allah. And Allah is All-Knowing, Wise.", "french": " Les aumônes ne sont que pour les pauvres et les nécessiteux, et pour les employés qui en sont chargés, et pour ceux dont le cœur a besoin de réconciliation, et pour l’affranchisse­ment des esclaves, et pour ceux qui ont des dettes, et pour la cause d’Allāh, et pour le voyageur – tel est le décret d’ Allāh. Et Allāh est Omniscient, Sage.", "german": " Die Almosen sind nur für die Armen und Bedürftigen und für die mit ihrer Verwaltung Beauftragten und für die, deren Herzen versöhnt werden sollen, für die (Befreiung von) Sklaven und für die Schuldner, für die Sache Allahs und für den Wanderer: eine Vorschrift von Allah. Und Allah ist allwissend, allweise.", "spanish": " Las limosnas son únicamente para los pobres y necesitados, para los empleados en relación con ellos, para aquellos cuyos corazones deben reconciliarse, para la liberación de los esclavos, para los que tienen deudas, para la causa de Al-lah y para el viajero: he aquí una orden de Al-lah. Pues Al-lah es el Omnisciente, Sabio.", "urdu": " صدقات تو صرف فقراء اور مساکین کے لئے ہیں اور ان کے لئے جو ان صدقات کے جمع کرنے کے لئے مقرر کیے گئے ہیں۔ نیز ان کے لئے جن کے دلوں کو (اپنے ساتھ) جوڑنا مطلوب ہو اور اسی طرح قیدیوں اور قرض داروں کے لئے اور (ان کے لئے جو) اللہ کے راستہ میں (جنگ کرتے ہیں) اور مسافروں کے لئے یہ فرض اللہ کا مقرر کردہ ہے اور اللہ بہت جاننے والا (اور) بڑی حکمت والا ہے۔"}, {"arabic": " وَ مِنۡہُمُ الَّذِیۡنَ یُؤۡذُوۡنَ النَّبِیَّ وَ یَقُوۡلُوۡنَ ہُوَ اُذُنٌ ؕ قُلۡ اُذُنُ خَیۡرٍ لَّکُمۡ یُؤۡمِنُ بِاللّٰہِ وَ یُؤۡمِنُ لِلۡمُؤۡمِنِیۡنَ وَ رَحۡمَۃٌ لِّلَّذِیۡنَ اٰمَنُوۡا مِنۡکُمۡ ؕ وَ الَّذِیۡنَ یُؤۡذُوۡنَ رَسُوۡلَ اللّٰہِ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۶۱﴾", "english": " And among them are those who annoy the Prophet and say, ‘He gives ear to all .’ Say, ‘ His giving ear to all is good for you; he believes in Allah and believes the Faithful, and is a mercy for those of you who believe.’ And those who annoy the Messenger of Allah shall have a grievous punishment.", "french": " Et parmi eux se trouvent ceux qui blessent le Prophète et disent, « Il est toute ouïe. » Dis : « Son inclination à écouter tout le monde est une bonne chose pour vous ; il croit en Allāh, et a confiance dans les croyants, et il est une miséricorde pour ceux d’entre vous qui croient. » Et ceux qui blessent le Messager d’Allāh auront un châtiment douloureux.", "german": " Und unter ihnen sind jene, die den Propheten kränken und sagen: \"Er ist ein Ohr.\" Sprich: \"Ein Ohr euch zum Guten: er glaubt an Allah und glaubt den Gläubigen und ist eine Barmherzigkeit denen unter euch, die gläubig sind.\" Und die den Gesandten Allahs kränken, denen wird schmerzliche Strafe.", "spanish": " Y entre ellos están quienes ofenden al Profeta, diciendo: “Él es todo oídos”. Diles: “Su disposición a escuchar a todos es excelente para vosotros: él cree en Al-lah y tiene confianza en los creyentes, y es una misericordia para aquellos de vosotros que creen”. Pero quienes molesten al Mensajero de Al-lah tendrán un doloroso castigo.", "urdu": " اور ان میں سے بعض ایسے (منافق) بھی ہیں جو نبی کو دکھ دیتے ہیں اور کہتے ہیں کہ وہ تو (کان ہی) کان ہے تو کہہ دے کہ وہ تمہارے لئے بھلائی سننے کے کان رکھتا ہے وہ اللہ پر ایمان لاتا ہے اور جو تم میں سے مومن ہوں ان (کے وعدوں) پر (بھی) یقین رکھتا ہے اور مومنوں کے لئے رحمت کا موجب ہے‘ اور وہ لوگ جو اللہ کے رسول کو دکھ پہنچاتے ہیں ان کے لئے دردناک عذاب ہے۔"}, {"arabic": " یَحۡلِفُوۡنَ بِاللّٰہِ لَکُمۡ لِیُرۡضُوۡکُمۡ ۚ وَ اللّٰہُ وَ رَسُوۡلُہٗۤ اَحَقُّ اَنۡ یُّرۡضُوۡہُ اِنۡ کَانُوۡا مُؤۡمِنِیۡنَ ﴿۶۲﴾", "english": " They swear by Allah to you to please you; but Allah and His Messenger are more worthy that they should please him and God , if they are believers.", "french": " Ils jurent par Allāh devant vous pour vous plaire ; mais Allāh et Son Messager sont plus dignes qu’ils lui plaisent et plaisent à Allāh s’ils sont croyants.", "german": " Sie schwören euch bei Allah, um euch zu gefallen; jedoch Allah und Sein Gesandter sind würdiger, so dass sie Ihm gefallen sollten, wenn sie Gläubige sind.", "spanish": " Os juran por Al-lah para complaceros; pero Al-lah y Su Mensajero son más dignos de que les agraden a él y a Dios, si son creyentes.", "urdu": " وہ تمہارے خوش کرنے کے لئے اللہ کی قسمیں کھاتے ہیں۔ حالانکہ اللہ بھی اور اس کا رسول بھی زیادہ حق دار ہیں کہ اس کو خوش کیا جائے۔ بشرطیکہ یہ (منافق) سچے مومن ہوں۔"}, {"arabic": " اَلَمۡ یَعۡلَمُوۡۤا اَنَّہٗ مَنۡ یُّحَادِدِ اللّٰہَ وَ رَسُوۡلَہٗ فَاَنَّ لَہٗ نَارَ جَہَنَّمَ خَالِدًا فِیۡہَا ؕ ذٰلِکَ الۡخِزۡیُ الۡعَظِیۡمُ ﴿۶۳﴾", "english": " Have they not known that whoso opposes Allah and His Messenger, for him is the fire of Hell, wherein he shall abide? That is the great humiliation.", "french": " Ignorent-ils que quiconque s’oppose à Allāh et à Son Messager aura le Feu de l’Enfer ? Il y restera longtemps. C’est là la grande humiliation.", "german": " Wissen sie denn nicht, dass für den, der Allah trotzt und Seinem Gesandten, das Feuer der Hölle ist, darin er bleiben muss? Das ist die tiefste Demütigung.", "spanish": " ¿No saben acaso que para quien se opone a Al-lah y a Su Mensajero, está el Fuego del Infierno, en donde morará? Ésa es la humillación más grande.", "urdu": " کیا ان کو معلوم نہیں کو جو کوئی اللہ اور اس کے رسول کی مخالفت کرتا ہے اس کے لئے جہنم کی آگ (مقدر) ہے وہ اس میں رہتا چلا جائے گا اور یہ بڑی بھاری رسوائی ہے۔"}, {"arabic": " یَحۡذَرُ الۡمُنٰفِقُوۡنَ اَنۡ تُنَزَّلَ عَلَیۡہِمۡ سُوۡرَۃٌ تُنَبِّئُہُمۡ بِمَا فِیۡ قُلُوۡبِہِمۡ ؕ قُلِ اسۡتَہۡزِءُوۡا ۚ اِنَّ اللّٰہَ مُخۡرِجٌ مَّا تَحۡذَرُوۡنَ ﴿۶۴﴾", "english": " The hypocrites fear lest a Surah should be revealed against them, informing them of what is in their hearts. Say, ‘Mock ye! surely, Allah will bring to light what you fear.’", "french": " Les hypocrites prétendent craindre qu’une sourate du Coran ne soit révélée à leur sujet, pour les informer de ce qu’ils ont au fond du cœur. Dis : « Moquez-vous donc ; assu­rément, Allāh dévoilera ce que vous prétendez craindre. »", "german": " Die Heuchler fürchten, es könnte gegen sie eine Sura herabgesandt werden, die ihnen ankündet, was in ihren Herzen ist. Sprich: \"Spottet nur! Allah wird es alles ans Licht bringen, wovor ihr euch fürchtet.\"", "spanish": " Los hipócritas muestran temor (fingido) de que se revele un Surah sobre ellos, comunicándoles lo que hay en sus corazones. Diles: “¡Burlaos! en verdad Al-lah sacará a plena luz lo que teméis”.", "urdu": " منافق (دکھاوے کے طور پر) ڈر کا اظہار کرتے ہیں کہ ان کے خلاف کوئی سورۃ نازل نہ ہو جائے جو انہیں (اور مسلمانوں کو) ان باتوں سے خبردار کردے جو ان کے دلوں میں ہیں۔ تو کہہ دے کہ ہنسی کرتے جاٶ۔ اللہ (حقیقتا) اس بات کو ظاہر کر دے گا۔ جس (کے ظاہر کرنے) سے تم (بناوٹ سے) ڈرتے ہو۔"}, {"arabic": " وَ لَئِنۡ سَاَلۡتَہُمۡ لَیَقُوۡلُنَّ اِنَّمَا کُنَّا نَخُوۡضُ وَ نَلۡعَبُ ؕ قُلۡ اَ بِاللّٰہِ وَ اٰیٰتِہٖ وَ رَسُوۡلِہٖ کُنۡتُمۡ تَسۡتَہۡزِءُوۡنَ ﴿۶۵﴾", "english": " And if thou question them, they will most surely say, ‘We were only talking idly and jesting.’ Say, ‘Was it Allah and His Signs and His Messenger that you mocked at?", "french": " Et si tu les interroges, ils te répondront assurément : « Nous ne faisions que bavarder, nous plaisantions. » Dis : « Vous moquiez-­vous d’Allāh, de Ses Signes et de Son Messager ? »", "german": " Und wenn du sie fragst, so werden sie ganz gewiss sagen: \"Wir plauderten nur und scherzten.\" Sprich: \"Galt euer Spott etwa Allah und Seinen Zeichen und Seinem Gesandten?</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=9:65&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=9:65&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic66\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic66\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/9:66' style='text-decoration:underline'>9:66</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(66)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control66\"></i></button> <audio id=\"player66\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">لَا تَعۡتَذِرُوۡا قَدۡ کَفَرۡتُمۡ بَعۡدَ اِیۡمَانِکُمۡ ؕ اِنۡ نَّعۡفُ عَنۡ طَآئِفَۃٍ مِّنۡکُمۡ نُعَذِّبۡ طَآئِفَۃًۢ بِاَنَّہُمۡ کَانُوۡا مُجۡرِمِیۡنَ ﴿٪۶۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Offer no excuse. You have certainly disbelieved after your believing. If We forgive a party from among you, a party shall We punish, for they have been guilty.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_9_66_b' href='#'>b</a>]</sup>‘Make ye no excuses. You certainly disbelieved after your believing. If We forgive a party from among you, a party shall We punish, for they are guilty. <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_9_66_b'>b</span></div> <div><div class='reference' data-id='ref_9_66_b' style='display:none'> <p><b>b.</b> <a href='/quran/56:8' target=_blank>56:8</a>. (<a href='javascript:void(0)' data-id='ref_9_66_b' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\"> کوئی عذر پیش نہ کرو۔ یقیناً تم اپنے ایمان لانے کے بعد کافر ہو چکے ہو۔ اگر ہم تم میں سے کسی ایک گروہ سے درگزر کریں تو کسی دوسرے گروہ کو عذاب بھی دے سکتے ہیں اس لئے کہ وہ یقیناً مجرم ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اب کوئی عذر نہ کرو۔ تم نے ایمان لاکر کفر کیا (پس اس کی سزا پاٶ) اگر ہم تم میں سے ایک گروہ کو معاف کر دیں اور ایک دوسرے گروہ کو عذاب دے دیں اس لئے کہ وہ مجرم تھے (تو یہ ہمارا کام ہے) </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">»Ne vous excusez pas. Maintenant il est certain que vous êtes devenus mécréants après avoir été croyants. Si Nous pardonnons à certains d’entre vous, Nous en châtierons d’autres, car ils sont coupables. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“No os excuséis. Ciertamente dejasteis de creer después de haber creído. Si perdonáramos a un grupo de vosotros, castigaremos a otro grupo, porque han sido culpables”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Versucht euch nicht zu entschuldigen. Ihr seid ungläubig geworden, nachdem ihr geglaubt. Wenn Wir einem Teile von euch vergeben und den anderen strafen, dann darum, weil sie schuldig waren.\"", "spanish": " Pero si los interrogas, seguramente dirán: “hablábamos de cosas frívolas y bromeábamos”. Diles: “¿Os burlabais de Al-lah, de Sus Signos y de Su Mensajero?", "urdu": " اور اگر تو ان سے پوچھے (کہ تم ایسی باتیں کیوں کرتے ہو) تو وہ ضرور یہی جواب دیں گے ہم تو صرف مذاق اور ہنسی کرتے تھے۔ تو ان کو جواب دیجیو کہ کیا اللہ اور اس کی آیات اور اس کے رسول سے مذاق اور ہنسی کرتے تھے۔"}, {"arabic": " اَلۡمُنٰفِقُوۡنَ وَ الۡمُنٰفِقٰتُ بَعۡضُہُمۡ مِّنۡۢ بَعۡضٍ ۘ یَاۡمُرُوۡنَ بِالۡمُنۡکَرِ وَ یَنۡہَوۡنَ عَنِ الۡمَعۡرُوۡفِ وَ یَقۡبِضُوۡنَ اَیۡدِیَہُمۡ ؕ نَسُوا اللّٰہَ فَنَسِیَہُمۡ ؕ اِنَّ الۡمُنٰفِقِیۡنَ ہُمُ الۡفٰسِقُوۡنَ ﴿۶۷﴾", "english": " The hypocrites, men and women, are all connected one with another. They enjoin evil and forbid good, and keep their hands closed. They neglected Allah, so He has neglected them. Surely, it is the hypocrites who are the disobedient.", "french": " Les hypocrites, hommes et femmes, sont tous liés entre eux. Ils enjoignent le mal, et interdisent le bien, et ils retiennent leurs mains de dépenser pour la cause d’Allāh. Ils ont oublié Allāh ; Il les a donc oubliés. Assurément, ce sont les hypocrites qui sont les désobéissants.", "german": " Die Heuchler und die Heuchlerinnen, sie halten zusammen. Sie gebieten das Böse und verbieten das Gute, und ihre Hände bleiben geschlossen. Sie haben Allah vergessen, so hat Er sie vergessen. Wahrlich, die Heuchler, das sind die Ungehorsamen.", "spanish": " Los hipócritas, hombres y mujeres, están todos ellos relacionados entre sí. Ordenan el mal y prohíben el bien, y mantienen la mano cerrada. Olvidaron a Al-lah, por lo que Él los ha olvidado. En verdad, los hipócritas son los desobedientes.", "urdu": " منافق مرد اور منافق عورتیں آپس میں ایک دوسرے کے ساتھ تعلق رکھتے ہیں وہ بری باتوں کا حکم دیتے ہیں اور اچھی باتوں کے خلاف تعلیم دیتے ہیں اور اپنے ہاتھوں کو (خدا کی راہ میں خرچ کرنے سے) روکتے ہیں۔ انہوں نے اللہ کو ترک کر دیا‘ سو اللہ نے بھی ان کو ترک کردیا۔ منافق یقیناً اطاعت سے نکلنے والے ہیں۔"}, {"arabic": " وَعَدَ اللّٰہُ الۡمُنٰفِقِیۡنَ وَ الۡمُنٰفِقٰتِ وَ الۡکُفَّارَ نَارَ جَہَنَّمَ خٰلِدِیۡنَ فِیۡہَا ؕ ہِیَ حَسۡبُہُمۡ ۚ وَ لَعَنَہُمُ اللّٰہُ ۚ وَ لَہُمۡ عَذَابٌ مُّقِیۡمٌ ﴿ۙ۶۸﴾", "english": " Allah promises the hypocrites, men and women, and the disbelievers the fire of Hell, wherein they shall abide. It will suffice them. And Allah has cursed them. And they shall have a lasting punishment,", "french": " Allāh a promis aux hypocrites, hommes et femmes et aux mécréants, le feu de l’Enfer où ils demeureront longtemps. Cela leur suffira. Et Allāh les a maudits. Et ils auront un châtiment de longue durée,", "german": " Allah hat den Heuchlern und Heuchlerinnen und den Ungläubigen das Feuer der Hölle verheißen, darin sie bleiben müssen. Das wird genug für sie sein. Allah hat sie verflucht, und ihnen wird eine dauernde Strafe:", "spanish": " Al-lah promete a los hipócritas -hombres y mujeres- y a los incrédulos, el Fuego del Infierno, en el que morarán. Eso les bastará. Pues Al-lah los ha maldecido y tendrán un castigo duradero.", "urdu": " اللہ نے منافق مردوں اور منافق عورتوں اور کفار سے جہنم کی آگ کا وعدہ کیا ہے‘ وہ اس میں رہتے چلے جائیں گے۔ وہی ان (کی پوری توجہ کھینچنے) کے لئے کافی ہے (اور اس کے علاوہ) اللہ نے ان کو (اپنی درگاہ سے) دھتکار بھی دیا ہے اور ان کے لئے ایک قائم رہنے والا عذاب (مقدر) ہے۔"}, {"arabic": " کَالَّذِیۡنَ مِنۡ قَبۡلِکُمۡ کَانُوۡۤا اَشَدَّ مِنۡکُمۡ قُوَّۃً وَّ اَکۡثَرَ اَمۡوَالًا وَّ اَوۡلَادًا ؕ فَاسۡتَمۡتَعُوۡا بِخَلَاقِہِمۡ فَاسۡتَمۡتَعۡتُمۡ بِخَلَاقِکُمۡ کَمَا اسۡتَمۡتَعَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ بِخَلَاقِہِمۡ وَ خُضۡتُمۡ کَالَّذِیۡ خَاضُوۡا ؕ اُولٰٓئِکَ حَبِطَتۡ اَعۡمَالُہُمۡ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۚ وَ اُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿۶۹﴾", "english": " Even as those before you. They were mightier than you in power and richer in possessions and children. They enjoyed their lot for a short time, so have you enjoyed your lot as those before you enjoyed their lot. And you indulged in idle talk as they indulged in idle talk. It is they whose works shall be of no avail in this world and the Hereafter. And it is they who are the losers.", "french": " Tout comme ceux qui étaient avant vous. Ils étaient plus puissants que vous, et plus riches en biens et en enfants. Ils ont joui pour un temps de leur part comme vous aussi avez joui de votre part comme vos devan­ciers ont joui de leur part. Et vous vous êtes livrés à des balivernes comme ils s’y livraient. Ce sont eux dont les œuvres ne serviront à rien ici-bas ni dans l’au-delà. Et ceux-là sont les perdants.", "german": " Wie jenen, die vor euch waren. Sie waren mächtiger als ihr an Kraft und reicher an Gut und Kindern. Sie erfreuten sich ihres Loses; auch ihr habt euch eures Loses erfreut, gerade so wie jene vor euch sich ihres Loses erfreuten. Und ihr ergötztet euch an müßiger Rede, wie jene sich an müßiger Rede ergötzten. Ihre Werke sollen ihnen nichts fruchten, weder in dieser Welt noch in der künftigen. Und sie sind die Verlorenen.", "spanish": " Al igual que los que os precedieron. Eran superiores a vosotros en poder y más ricos en posesiones e hijos. Disfrutaron de su suerte durante un breve tiempo y vosotros disfrutasteis de vuestra suerte como los que os precedieron disfrutaron de la suya. Y os dedicasteis a conversaciones inútiles igual que ellos se dedicaron al mismo tipo de conversaciones. Son aquellos cuyas obras no les servirán de nada en este mundo ni en el Más Allá. Ellos son los perdedores.", "urdu": " (اے منافقو! یہ عذاب) ان لوگوں (کی سزا) کی طرح (ہوگا) جو تم سے پہلے گذر چکے ہیں۔ وہ تم سے زیادہ طاقتور تھے وہ زیادہ مال دار (تھے) اور زیادہ اولاد رکھتے تھے پس انہوں نے اپنے حصہ کے مطابق فائدہ اٹھایا اور تم نے اپنے حصہ کے مطابق فائدہ اٹھایا۔ جس طرح کہ تم سے پہلے لوگوں نے اپنے حصہ کے مطابق فائدہ اٹھایا اور تم نے اسی طرح ہنسی مذاق کیا جس طرح ان لوگوں نے ہنسی مذاق کیا تھا۔ ان کے عمل دنیا کے متعلق بھی اور آخرت کے متعلق بھی ضائع ہو گئے اور وہ لوگ نقصان اٹھانے والے (لوگوں میں شامل) ہو گئے۔"}, {"arabic": " اَلَمۡ یَاۡتِہِمۡ نَبَاُ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ قَوۡمِ نُوۡحٍ وَّ عَادٍ وَّ ثَمُوۡدَ ۬ۙ وَ قَوۡمِ اِبۡرٰہِیۡمَ وَ اَصۡحٰبِ مَدۡیَنَ وَ الۡمُؤۡتَفِکٰتِ ؕ اَتَتۡہُمۡ رُسُلُہُمۡ بِالۡبَیِّنٰتِ ۚ فَمَا کَانَ اللّٰہُ لِیَظۡلِمَہُمۡ وَ لٰکِنۡ کَانُوۡۤا اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ﴿۷۰﴾", "english": " Has not the story reached them of those before them — the people of Noah, ‘Ad, and Thamud, and the people of Abraham, and the dwellers of Midian, and the cities which were overthrown? Their Messengers came to them with clear Signs. So Allah would not wrong them, but they wronged themselves.", "french": " L’histoire de leurs devanciers n’est-elle pas arrivée jusqu’à eux – du peuple de Noé, de ‘Ād, de Thamūd, et du peuple d’Abraham, et des gens de Madian, et des villes qui furent renversées. Leurs Messagers sont venus à eux avec des Signes manifestes. Ainsi Allāh ne voulait pas leur faire du tort, mais ils se sont fait du tort à eux-mêmes.", "german": " Hat sie nicht die Kunde erreicht von denen, die vor ihnen waren – vom Volke Noahs, und 'Âds, und Thamûds, und vom Volke Abrahams, und den Bewohnern Midians und der umgestürzten Städte? Ihre Gesandten kamen zu ihnen mit deutlichen Zeichen. Allah also wollte ihnen kein Unrecht tun, doch sie taten sich selber Unrecht.", "spanish": " ¿No les ha llegado noticia de los que los precedieron: el pueblo de Noé, Ad y Zamud, y el pueblo de Abraham, los habitantes de Madián y las ciudades que fueron destruidas? Sus Mensajeros llegaron a ellos con signos claros. Así pues, no fue Al-lah quien los perjudicó sino que se perjudicaron ellos mismos.", "urdu": " کیا ان کے پاس ان لوگوں کی خبریں نہیں آئیں جو ان سے پہلے گزر چکے ہیں (یعنی) نوح اور عاد کی (قوم کی) اور ثمود کی (قوم کی‘ جو صالح کی قوم تھے) اور ابراہیم کی قوم کی۔ اور مدین کے لوگوں کی۔ اور الٹائی گئی بستیوں کے لوگوں (یعنی لوط کی قوم) کی۔ ان کے پاس ان کے رسول کھلے نشان لے کر آئے تھے (مگر انہوں نے انکار کیا اور سزا پائی) اللہ نے ان پر ظلم نہیں کیا بلکہ وہ اپنی جانوں پر (خود) ظلم کر رہے تھے۔"}, {"arabic": " وَ الۡمُؤۡمِنُوۡنَ وَ الۡمُؤۡمِنٰتُ بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ۘ یَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَ یَنۡہَوۡنَ عَنِ الۡمُنۡکَرِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ یُؤۡتُوۡنَ الزَّکٰوۃَ وَ یُطِیۡعُوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ ؕ اُولٰٓئِکَ سَیَرۡحَمُہُمُ اللّٰہُ ؕ اِنَّ اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿۷۱﴾", "english": " And the believers, men and women, are friends one of another. They enjoin good and forbid evil and observe Prayer and pay the Zakat and obey Allah and His Messenger. It is these on whom Allah will have mercy. Surely, Allah is Mighty, Wise.", "french": " Et les croyants, hommes et femmes, sont amis les uns des autres. Ils enjoignent le bien et interdisent le mal, et observent la Prière, et paient la Zakāt, et obéissent à Allāh et à Son Messager. C’est à ceux-là qu’Allāh fera miséri­corde. Assurément, Allāh est Puissant et Sage.", "german": " Die gläubigen Männer und die gläubigen Frauen sind einer des anderen Freund. Sie gebieten das Gute und verbieten das Böse und verrichten das Gebet und zahlen die Zakât und gehorchen Allah und Seinem Gesandten. Sie sind es, deren Allah Sich erbarmen wird. Wahrlich, Allah ist allmächtig, allweise.", "spanish": " Y los creyentes, hombres y mujeres, son mutuamente amigos. Ordenan el bien y prohíben el mal, cumplen la Oración, pagan el Zakat y obedecen a Al-lah y a Su Mensajero. Con ellos es con quienes Al-lah tendrá misericordia. En verdad, Al-lah es Poderoso, Sabio.", "urdu": " اور مومن مرد اور مومن عورتیں آپس میں ایک دوسرے کے دوست ہیں۔ وہ نیک باتوں کا حکم دیتے ہیں اور بری باتوں سے روکتے ہیں۔ اور نماز کو قائم کرتے ہیں اور زکٰوۃ دیتے ہیں۔ اور اللہ اور اس کے رسول کی اطاعت کرتے ہیں۔ یہ ایسے لوگ ہیں کہ اللہ ضرور ان پر رحم کرے گا۔ اللہ غالب (اور) بڑی حکمت والا ہے۔"}, {"arabic": " وَعَدَ اللّٰہُ الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا وَ مَسٰکِنَ طَیِّبَۃً فِیۡ جَنّٰتِ عَدۡنٍ ؕ وَ رِضۡوَانٌ مِّنَ اللّٰہِ اَکۡبَرُ ؕ ذٰلِکَ ہُوَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿٪۷۲﴾", "english": " Allah has promised to believers, men and women, Gardens beneath which rivers flow, wherein they will abide, and delightful dwellingplaces in Gardens of Eternity. And the pleasure of Allah is the greatest of all. That is the supreme triumph.", "french": " Aux croyants, hommes et femmes, Allāh a promis des Jardins sous lesquels coulent des rivières, où ils demeureront pour toujours, et il y aura aussi des habi­tations pures dans les Jardins d’Eternité. Et le plaisir d’Allāh est le plus grand. C’est là le triomphe suprême.", "german": " Allah hat den gläubigen Männern und den gläubigen Frauen Gärten verheißen, die von Strömen durchflossen werden, immerdar darin zu weilen, und herrliche Wohnstätten in den Gärten der Ewigkeit. Allahs Wohlgefallen aber ist das Größte. Das ist die höchste Glückseligkeit.", "spanish": " Al-lah ha prometido a los creyentes, hombres y mujeres, Jardines por los que corren ríos, en los que habitarán; y moradas deliciosas en los Jardines de la Eternidad. Pero el agrado de Al-lah es lo más grande de todo. Es el triunfo supremo.", "urdu": " اللہ نے مومن مردوں اور مومن عورتوں سے ایسی جنات کے وعدے کیے ہیں جن کے نیچے نہریں بہتی ہیں وہ ان میں ہمیشہ رہیں گے اور ہمیشہ رہنے والی جنتوں میں پاک رہائش گاہوں کا (بھی وعدہ کیا ہے) اور ان کے علاوہ اللہ کی رضا مندی سب سے بڑا انعام ہے (جو ان کو ملے گا)۔ (اور) اس کا ملنا (بہت) بڑی کامیابی ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ جَاہِدِ الۡکُفَّارَ وَ الۡمُنٰفِقِیۡنَ وَ اغۡلُظۡ عَلَیۡہِمۡ ؕ وَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۷۳﴾", "english": " O Prophet, strive against the disbelievers and the hypocrites. And be severe to them. Their abode is Hell, and an evil destination it is.", "french": " Ô Prophète ! Lutte contre les mécréants et les hypocrites. Et sois sévère envers eux. L’Enfer sera leur habitation, et quelle mauvaise destination !", "german": " O Prophet, streite gegen die Ungläubigen und die Heuchler. Und sei streng mit ihnen. Ihr Aufenthalt ist die Hölle, und schlimm ist die Bestimmung!", "spanish": " ¡Oh, Profeta! esfuérzate contra los incrédulos y los hipócritas. Sé severo con ellos. Su morada es el Infierno, ¡qué horrible destino!", "urdu": " اے نبی! کفار اور منافقوں سے جہاد کرو۔ اور (پکا انتظام کرکے) ان پر سختی (سے حملہ) کرو۔ ان کا ٹھکانا جہنم ہے اور وہ (رہنے کے لحاظ سے) بہت بری جگہ ہے۔"}, {"arabic": " یَحۡلِفُوۡنَ بِاللّٰہِ مَا قَالُوۡا ؕ وَ لَقَدۡ قَالُوۡا کَلِمَۃَ الۡکُفۡرِ وَ کَفَرُوۡا بَعۡدَ اِسۡلَامِہِمۡ وَ ہَمُّوۡا بِمَا لَمۡ یَنَالُوۡا ۚ وَ مَا نَقَمُوۡۤا اِلَّاۤ اَنۡ اَغۡنٰہُمُ اللّٰہُ وَ رَسُوۡلُہٗ مِنۡ فَضۡلِہٖ ۚ فَاِنۡ یَّتُوۡبُوۡا یَکُ خَیۡرًا لَّہُمۡ ۚ وَ اِنۡ یَّتَوَلَّوۡا یُعَذِّبۡہُمُ اللّٰہُ عَذَابًا اَلِیۡمًا ۙ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۚ وَ مَا لَہُمۡ فِی الۡاَرۡضِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۷۴﴾", "english": " They swear by Allah that they said nothing, but they did certainly use blasphemous language, and disbelieved after they had embraced Islam. And they meditated that which they could not attain. And they cherished hatred only because Allah and His Messenger had enriched them out of His bounty. So if they repent, it will be better for them; but if they turn away, Allah will punish them with a grievous punishment in this world and the Hereafter, and they shall have neither friend nor helper in the earth.", "french": " Ils jurent par Allāh de n’avoir rien dit, mais ils ont assurément proféré des blasphèmes, et après avoir embrassé l’Islam, ils sont devenus mécréants. Et ils ont médité sur ce qu’ils n’ont pu atteindre par la suite . Et ils ont nourri de la haine à l’egard des croyants seulement parce qu’Allāh et Son Messager les avait enrichis de Sa munificence. Si donc ils se repentent, cela vaudra mieux pour eux. Mais s’ils se détournent, Allāh les châtiera d’un châtiment douloureux ici-bas et dans l’au-delà, et ils n’auront ni ami ni aide sur la terre.", "german": " Sie schwören bei Allah, dass sie nichts gesagt haben, doch sie führten unzweifelhaft lästerliche Rede und fielen in Unglauben zurück, nachdem sie den Islam angenommen hatten. Sie sannen auf das, was sie nicht erreichen konnten. Und sie nährten nur darum Hass, weil Allah und Sein Gesandter sie reich gemacht hatten aus Seiner Huld. Wenn sie bereuen, so würde es besser für sie sein; wenden sie sich jedoch ab, so wird Allah sie strafen mit schmerzlicher Strafe in dieser Welt und im Jenseits, und sie sollen auf Erden weder Freund noch Helfer finden.", "spanish": " Juran por Al-lah que no dijeron nada. Pero en verdad usaron un lenguaje blasfemo, y no creyeron después de haber abrazado el Islam. Meditaron sobre lo que posteriormente fracasaron en conseguir. Y alimentaron su odio únicamente porque Al-lah y Su Mensajero los habían enriquecido por su magnanimidad. Por tanto, si se arrepienten, mejor sería para ellos; pero si se apartan, Al-lah les inflingirá un castigo doloroso en este mundo y en el Más Allá, y no tendrán ni amigo ni abogado en la tierra.", "urdu": " وہ اللہ کی قسمیں کھاتے ہیں کہ انہوں نے کوئی (بری) بات نہیں کہی۔ حالانکہ انہوں نے کفر کی بات کہی ہے اور اسلام لانے کے بعد کفر کیا ہے۔ اور (اسلام کے خلاف) ایسی (مکروہ) باتوں کا ارادہ کیا ہے جن کو وہ حاصل نہیں کر سکتے اور انہوں نے مسلمانوں سے صرف اس لئے دشمنی کی کہ اللہ اور اس کے رسول نے ان کو اپنے فضل سے مال دار بنا دیا تھا۔ پس اگر وہ توبہ کریں تو ان کے لئے اچھا ہوگا اور اگر وہ پیٹھ پھیر کر چلے جائیں تو اللہ ان کو دنیا میں بھی اور آخرت میں (بھی) دردناک عذاب دے گا اور اس جہان میں نہ کوئی ان کا دوست ہوگا اور نہ مددگار۔"}, {"arabic": " وَ مِنۡہُمۡ مَّنۡ عٰہَدَ اللّٰہَ لَئِنۡ اٰتٰٮنَا مِنۡ فَضۡلِہٖ لَنَصَّدَّقَنَّ وَ لَنَکُوۡنَنَّ مِنَ الصّٰلِحِیۡنَ ﴿۷۵﴾", "english": " And among them there are those who made a covenant with Allah, saying , ‘If He give us of His bounty, we would most surely give alms and be of the virtuous.’", "french": " . Et il y a certains d’entre eux qui ont fait un pacte avec Allāh, en disant : « S’Il nous donne de Sa munificence, nous ferons assurément l’aumône, et nous serons du nombre des ver­tueux. »", "german": " Unter ihnen sind so manche, die Allah versprachen: \"Wenn Er uns aus Seiner Fülle gibt, dann wollen wir bestimmt Almosen geben und dann wollen wir rechtschaffen sein.\"", "spanish": " Entre ellos están quienes concluyeron un pacto con Al-lah, diciendo: “si Él nos da de Su magnanimidad, nosotros ciertamente daremos limosnas y seremos virtuosos”.", "urdu": " اور ان میں سے (کچھ افراد) ایسے بھی ہیں جو اللہ سے یہ عہد کرتے ہیں کہ اگر وہ (اللہ) ہمیں اپنے فضل سے کچھ دے گا تو ہم ضرور اس کی راہ میں صدقہ کریں گے اور ہم ضرور نیک بن جائیں گے۔"}, {"arabic": " فَلَمَّاۤ اٰتٰہُمۡ مِّنۡ فَضۡلِہٖ بَخِلُوۡا بِہٖ وَ تَوَلَّوۡا وَّ ہُمۡ مُّعۡرِضُوۡنَ ﴿۷۶﴾", "english": " But when He gave them of His bounty, they became niggardly of it, and they turned away in aversion.", "french": " Mais lorsqu’Il leur eut donné de Sa munificence, ils s’en montrèrent parcimonieux et ils se sont détournés de leur engagement avec répugnance.", "german": " Doch als Er ihnen dann aus Seiner Fülle gab, da wurden sie damit geizig und wandten sich weg in Abneigung.", "spanish": " Pero cuando Él les dio de Su magnanimidad, se hicieron avaros con ella, y volvieron la espalda, alejándose.", "urdu": " اور جب اس (خدا) نے ان کو اپنے فضل سے مال عطا فرمایا تو انہوں نے اس کی راہ میں اسے خرچ کرنے سے بخل کیا اور (اپنے پرانے طریقوں کی طرف) لوٹ گئے اور (خدا اور رسول کی باتوں سے) روگردانی کرتے ہوئے پیٹھ پھیر لی۔"}, {"arabic": " فَاَعۡقَبَہُمۡ نِفَاقًا فِیۡ قُلُوۡبِہِمۡ اِلٰی یَوۡمِ یَلۡقَوۡنَہٗ بِمَاۤ اَخۡلَفُوا اللّٰہَ مَا وَعَدُوۡہُ وَ بِمَا کَانُوۡا یَکۡذِبُوۡنَ ﴿۷۷﴾", "english": " So He requited them with hypocrisy which shall last in their hearts until the day when they shall meet Him, because they broke their promise to Allah, and because they lied.", "french": " Alors, comme punition, Il a fait entrer dans leur cœur l’hypocrisie qui durera jusqu’au jour où ils Le rencontreront, pour avoir violé la promesse qu’ils ont faite à Allāh et pour avoir menti.", "german": " So vergalt Er ihnen mit Heuchelei in ihren Herzen bis zum Tage, an dem sie Ihm begegnen werden, weil sie Allah nicht gehalten, was sie Ihm versprochen hatten, und weil sie logen.", "spanish": " Por ello, Él les castigó con la hipocresía que durará en sus corazones hasta el día que se reúnan con Él; por romper su promesa a Al-lah y por haber mentido.", "urdu": " پس (نتیجہ یہ ہوا کہ) اس نے ان کے دلوں میں اس دن تک کے لئے جب وہ اس سے ملیں گے نفاق کا سلسلہ چلا دیا کیونکہ انہوں نے جو خدا سے وعدہ کیا تھا اس کی خلاف ورزی کی۔ اور بوجہ اس کے کہ وہ جھوٹ بولتے تھے۔"}, {"arabic": " اَلَمۡ یَعۡلَمُوۡۤا اَنَّ اللّٰہَ یَعۡلَمُ سِرَّہُمۡ وَ نَجۡوٰٮہُمۡ وَ اَنَّ اللّٰہَ عَلَّامُ الۡغُیُوۡبِ ﴿ۚ۷۸﴾", "english": " Know they not that Allah knows their secrets as well as their private counsels and that Allah is the Best Knower of all unseen things?", "french": " Ne savent-ils donc pas qu’Allāh connaît leurs secrets ainsi que leurs conciliabules entre eux et qu’Allāh est le Meilleur Savant de toutes les choses cachées ?", "german": " Wussten sie denn nicht, dass Allah ihre Geheimnisse kennt und ihre vertraulichen Beratungen und dass Allah der beste Kenner des Verborgenen ist?", "spanish": " ¿No saben que Al-lah conoce sus secretos y sus deliberaciones encubiertas, y que Al-lah es Quien mejor conoce todo lo invisible?", "urdu": " کیا ان کو معلوم نہیں تھا کہ اللہ ان کے مخفی مشوروں (کو بھی جانتا ہے) اور ان کے کھلے مشوروں کو (بھی) جانتا ہے۔ اور یہ کہ اللہ پورے طور پر غیب کی باتوں سے واقف ہے۔"}, {"arabic": " اَلَّذِیۡنَ یَلۡمِزُوۡنَ الۡمُطَّوِّعِیۡنَ مِنَ الۡمُؤۡمِنِیۡنَ فِی الصَّدَقٰتِ وَ الَّذِیۡنَ لَا یَجِدُوۡنَ اِلَّا جُہۡدَہُمۡ فَیَسۡخَرُوۡنَ مِنۡہُمۡ ؕ سَخِرَ اللّٰہُ مِنۡہُمۡ ۫ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۷۹﴾", "english": " Those who find fault with such of the believers as give alms of their own free will and with such as find nothing to give save the earnings of their toil. They thus deride them. Allah shall requite them for their derision, and for them is a grievous punishment.", "french": " Ces hypocrites sont ceux qui trouvent à redire sur les croyants qui font l’aumône de leur plein gré, et sur ceux qui ne trouvent rien à donner que le fruit de leur labeur. C’est ainsi qu’ils les tournent en dérision. Allāh leur revaudra leur dérision et ils auront un châtiment douloureux.", "german": " Die da jene Gläubigen schelten, die freiwillig Almosen geben, wie auch jene, die nichts (zu geben) finden als (den Ertrag) ihrer Arbeit – und sie deswegen verhöhnen –, Allah wird ihnen ihren Hohn vergelten, und ihnen wird schmerzliche Strafe.", "spanish": " Aquellos que encuentran faltas en los creyentes que dan limosnas por su propia voluntad, y en los que no tienen nada para dar excepto lo que ganan con su propio esfuerzo. Se ríen de ellos. Al-lah los castigará por su burla, y para ellos habrá un doloroso castigo.", "urdu": " یہ (منافق ہی) ہیں جو مومنوں میں سے خوشی سے بڑھ بڑھ کر صدقے دینے والوں پر طنز کرتے ہیں اور ان پر بھی جو کہ سوائے اپنی (محنت کی) کمائی کے (کوئی) طاقت نہیں رکھتے۔ سو (باوجود اس قربانی کے) یہ (منافق) ان پر ہنسی کرتے ہیں۔ اللہ ان (میں سے اشد مخالفوں) کو ہنسی کی سزا دے گا اور ان کو دردناک عذاب پہنچے گا۔"}, {"arabic": " اِسۡتَغۡفِرۡ لَہُمۡ اَوۡ لَا تَسۡتَغۡفِرۡ لَہُمۡ ؕ اِنۡ تَسۡتَغۡفِرۡ لَہُمۡ سَبۡعِیۡنَ مَرَّۃً فَلَنۡ یَّغۡفِرَ اللّٰہُ لَہُمۡ ؕ ذٰلِکَ بِاَنَّہُمۡ کَفَرُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الۡفٰسِقِیۡنَ ﴿٪۸۰﴾", "english": " Ask thou forgiveness for them, or ask thou not forgiveness for them; even if thou ask forgiveness for them seventy times, Allah will never forgive them. That is because they disbelieved in Allah and His Messenger. And Allah guides not the perfidious people.", "french": " Que tu demandes pardon pour eux ou que tu ne demandes pas pardon pour eux ; même si tu deman­dais soixante-dix fois pardon pour eux, Allāh ne leur pardonnerait jamais. Et cela parce qu’ils n’ont pas voulu croire en Allāh et en Son Messager ; et Allāh ne guide pas le peuple perfide.", "german": " Bitte für sie um Verzeihung oder bitte nicht um Verzeihung für sie; ob du auch siebzigmal für sie um Verzeihung bittest, Allah wird ihnen niemals verzeihen. Dies, weil sie nicht an Allah und an Seinen Gesandten glaubten. Und Allah weist dem treulosen Volk nicht den Weg.", "spanish": " Implores o no el perdón para ellos, y aunque pidas perdón para ellos setenta veces, Al-lah nunca los perdonará. Eso es porque no creyeron en Al-lah ni en Su Mensajero. Y Al-lah no guía a las personas malvadas.", "urdu": " تو ان کے لئے استغفار کر یا نہ کر (ان کے لئے برابر ہے) اگر تو ان کے لئے ستر بار بھی استغفار کرے گا تو اللہ ان کو کبھی معاف نہیں کرے گا۔ یہ اس لئے ہوگا کہ انہوں نے اللہ اور اس کے رسول کا انکار کیا اور اللہ اطاعت سے نکل جانے والی قوم کو کبھی کامیابی کا راستہ نہیں دکھاتا۔"}, {"arabic": " فَرِحَ الۡمُخَلَّفُوۡنَ بِمَقۡعَدِہِمۡ خِلٰفَ رَسُوۡلِ اللّٰہِ وَ کَرِہُوۡۤا اَنۡ یُّجَاہِدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ فِیۡ سَبِیۡلِ اللّٰہِ وَ قَالُوۡا لَا تَنۡفِرُوۡا فِی الۡحَرِّ ؕ قُلۡ نَارُ جَہَنَّمَ اَشَدُّ حَرًّا ؕ لَوۡ کَانُوۡا یَفۡقَہُوۡنَ ﴿۸۱﴾", "english": " Those who were left behind rejoiced in their sitting at home behind the back of the Messenger of Allah, and were averse to striving with their property and their persons in the cause of Allah. And they said, ‘Go not forth in the heat.’ Say, ‘The fire of Hell is more intense in heat.’ Could they but understand!", "french": " Ceux qui s’arrangèrent pour être laissés en arrière se sont réjouis d’être restés derrière en contradiction au Messager d’Allāh, et ils répugnaient à lutter pour la cause d’Allāh avec leurs biens et leurs personnes. Et ils dirent : « Ne partez pas par cette chaleur. » Dis : « Le feu de l’Enfer est encore plus intense en chaleur. » Si seulement ils pouvaient comprendre !", "german": " Jene, die zurückgelassen worden waren, freuten sich ihres Daheimsitzens hinter dem (Rücken des) Gesandten Allahs und waren nicht geneigt, mit ihrem Gut und ihrem Blut für Allahs Sache zu streiten. Sie sprachen: \"Zieht doch nicht aus in der Hitze.\" Sprich: \"Das Feuer der Hölle ist stärker an Hitze.\" Wollten sie es doch verstehen!", "spanish": " Los que se las ingeniaron para quedarse atrás se alegraron por haberse quedado rezagados, contradiciendo al Mensajero de Al-lah, y se negaron a esforzarse con sus bienes y sus personas por la causa de Al-lah. Dijeron: “No salgáis durante el calor”. Diles: “El Fuego del Infierno tiene un calor más intenso”. ¡Si pudieran entender!", "urdu": " (جہاد سے) پیچھے چھوڑے ہوئے (منافق) اللہ کے رسول کے (حکم کے) خلاف (چل کر) اپنی جگہ بیٹھ رہنے پر بہت خوش ہیں اور انہوں نے اپنی جانوں اور اپنے مالوں کے ساتھ جہاد کرنے کو برا سمجھا تھا اور (ایک دوسرے سے) کہا تھا کہ ایسی (شدید) گرمی میں جنگ کے لئے (اکٹھے ہو کر) مت نکلو۔ تو (ان سے) کہہ دے کہ جہنم کی آگ (اس گرمی سے) زیادہ سخت ہے۔ کاش کہ وہ سمجھتے۔"}, {"arabic": " فَلۡیَضۡحَکُوۡا قَلِیۡلًا وَّ لۡیَبۡکُوۡا کَثِیۡرًا ۚ جَزَآءًۢ بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۸۲﴾", "english": " They must laugh little and weep much as a reward for that which they used to earn.", "french": " Il faudrait qu’ils rient peu et qu’ils pleurent beaucoup en récompense de ce qu’ils ont acquis.", "german": " Sie sollten wenig lachen und viel weinen über das, was sie sich erwarben.", "spanish": " Tendrán que reír poco y llorar mucho como recompensa por lo que ganaron.", "urdu": " پس چاہیے کہ (اپنی اس فریب دہی پر) وہ تھوڑا ہنسیں اور اپنے عمل کی جزا پر زیادہ روئیں۔"}, {"arabic": " فَاِنۡ رَّجَعَکَ اللّٰہُ اِلٰی طَآئِفَۃٍ مِّنۡہُمۡ فَاسۡتَاۡذَنُوۡکَ لِلۡخُرُوۡجِ فَقُلۡ لَّنۡ تَخۡرُجُوۡا مَعِیَ اَبَدًا وَّ لَنۡ تُقَاتِلُوۡا مَعِیَ عَدُوًّا ؕ اِنَّکُمۡ رَضِیۡتُمۡ بِالۡقُعُوۡدِ اَوَّلَ مَرَّۃٍ فَاقۡعُدُوۡا مَعَ الۡخٰلِفِیۡنَ ﴿۸۳﴾", "english": " And if Allah return thee to a party of them, and they ask of thee leave to go forth to fight , say then, ‘You shall never go forth with me and shall never fight an enemy with me. You chose to sit at home the first time, so sit now with those who remain behind.’", "french": " Et si Allāh te ramène auprès d’un groupe d’entre eux et qu’ils te demandent la permission de partir au combat, alors dis : « Vous ne partirez jamais au combat avec moi et vous ne combattrez jamais un ennemi avec moi. La première fois, vous avez préféré rester assis chez vous ; restez donc assis maintenant avec ceux qui restent en arrière. »", "german": " Und wenn Allah dich heimkehren lässt zu einer Anzahl von ihnen und sie bitten dich um Erlaubnis, auszuziehen, dann sprich: \"Nie soll ihr mit mir ausziehen und nie einen Feind bekämpfen an meiner Seite. Es gefiel euch, daheim zu sitzen das erste Mal, so sitzet nun mit denen, die zurückbleiben.\"", "spanish": " Y si Al-lah te devuelve a un grupo de ellos, y éstos te piden permiso para partir al combate, diles: “Nunca partiréis conmigo y jamás combatiréis a un enemigo conmigo. La primera vez optasteis por quedaros sentados en casa; permaneced ahora, por tanto, con los que se quedan detrás”.", "urdu": " پھر اگر اللہ تجھ کو ان میں سے ایک گروہ کی طرف لوٹا لائے۔ اور وہ لوگ (کسی آئندہ) جنگ کے لئے جانے کی تجھ سے اجازت مانگیں تو تو ان سے کہہ دے کہ تم کو کبھی بھی (آئندہ) میرے ساتھ (جنگ پر) جانے کی اجازت نہیں ہوگی اور کبھی بھی تم دشمن سے میرے ہمراہ ہو کر لڑنے نہیں پاٶ گے (کیونکہ) تم پہلی دفعہ (پیچھے) بیٹھ رہنے پر راضی ہو گئے تھے۔ پس (آئندہ ہمیشہ) پیچھے رہ جانے والوں کے ساتھ بیٹھ رہا کرو۔"}, {"arabic": " وَ لَا تُصَلِّ عَلٰۤی اَحَدٍ مِّنۡہُمۡ مَّاتَ اَبَدًا وَّ لَا تَقُمۡ عَلٰی قَبۡرِہٖ ؕ اِنَّہُمۡ کَفَرُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ وَ مَا تُوۡا وَ ہُمۡ فٰسِقُوۡنَ ﴿۸۴﴾", "english": " And never pray thou for any of them that dies, nor stand by his grave; for they disbelieved in Allah and His Messenger and died while they were disobedient.", "french": " N’offre jamais la prière sur aucun d’entre eux lorsqu’il meurt, et ne te tiens pas non plus auprès de sa tombe pour prier ; car ils n’ont pas cru en Allāh et en Son Messager et ils sont morts alors qu’ils étaient désobéissants.", "german": " Und bete nie für einen von ihnen, der stirbt, noch stehe an seinem Grabe; sie glaubten nicht an Allah und Seinen Gesandten, und sie starben im Ungehorsam.", "spanish": " Nunca reces por ninguno de ellos cuando muera, ni ores sobre sus tumbas, porque no creyeron en Al-lah ni en Su Mensajero y murieron en estado de desobediencia.", "urdu": " اور ان میں سے اگر کوئی مر جائے تو اس پر نماز (جنازہ) نہ پڑھا کر۔ اور نہ اس کی قبر پر (دعا کے لئے) کھڑا ہوا کر۔ کیوں کہ انہوں نے اللہ اور اس کے رسول کا انکار کیا اور ایسی حالت میں مرے ہیں‘ جب کہ وہ اطاعت سے خارج ہو رہے تھے۔"}, {"arabic": " وَ لَا تُعۡجِبۡکَ اَمۡوَالُہُمۡ وَ اَوۡلَادُہُمۡ ؕ اِنَّمَا یُرِیۡدُ اللّٰہُ اَنۡ یُّعَذِّبَہُمۡ بِہَا فِی الدُّنۡیَا وَ تَزۡہَقَ اَنۡفُسُہُمۡ وَ ہُمۡ کٰفِرُوۡنَ ﴿۸۵﴾", "english": " And their possessions and their children should not excite thy wonder; Allah only intends to punish them therewith in this world and that their souls may depart while they are disbelievers.", "french": " . Et ne te laisse pas éblouir par leurs biens et leurs enfants, Allāh ne veut que les châtier par ce moyen en ce monde, et faire que leur âme s’en aille pendant qu’ils sont des incroyants.", "german": " Wundere dich weder über ihr Gut noch über ihre Kinder; Allah will sie damit nur strafen in dieser Welt, und ihre Seelen sollen abscheiden, während sie Ungläubige sind.", "spanish": " No te dejes seducir por sus bienes ni por sus hijos; Al-lah sólo pretende castigarlos con ellos en este mundo y que sus almas se separen de ellos mientras son incrédulos.", "urdu": " پس تجھے ان کے مال اور ان کی اولادیں تعجب میں نہ ڈالیں۔ اللہ صرف یہ چاہتا ہے کہ ان (مالوں اور اولادوں) کے ذریعہ سے ان کو اس دنیا میں عذاب دے اور یہ کہ ان کی جانیں ایسے وقت میں نکلیں کہ وہ منکر ہی ہوں۔"}, {"arabic": " وَ اِذَاۤ اُنۡزِلَتۡ سُوۡرَۃٌ اَنۡ اٰمِنُوۡا بِاللّٰہِ وَ جَاہِدُوۡا مَعَ رَسُوۡلِہِ اسۡتَاۡذَنَکَ اُولُوا الطَّوۡلِ مِنۡہُمۡ وَ قَالُوۡا ذَرۡنَا نَکُنۡ مَّعَ الۡقٰعِدِیۡنَ ﴿۸۶﴾", "english": " And when a Surah is revealed, enjoining , ‘Believe in Allah and strive in the cause of Allah in company with His Messenger,’ those of them who possess affluence ask leave of thee and say, ‘Leave us that we be with those who sit at home .’", "french": " Et lorsqu’une sourate est révélée, enjoignant ceci : « Croyez en Allāh et luttez pour Sa cause en compagnie de Son Messager, » ceux d’entre eux qui sont opulents te demandent la permission et disent : « Laisse-nous rester en compagnie de ceux qui restent assis chez eux . »", "german": " Und wenn eine Sura hinabgesandt wird: \"Glaubet an Allah und streitet an der Seite Seines Gesandten\", dann bitten dich die Reichen unter ihnen um Erlaubnis und sagen: \"Lass uns mit denen sein, die daheim sitzen.\"", "spanish": " Y cuando se revela un Surah que ordena: “Creed en Al-lah y esforzaos por la causa de Al-lah en compañía de Su Mensajero” los más acomodados de entre ellos te piden permiso y dicen: “Déjanos estar con los que se quedan en casa”.", "urdu": " اور جب کوئی سورۃ (اس حکم کے ساتھ) نازل ہوتی ہے کہ اللہ پر ایمان لاٶ اور اس کے رسول کے ساتھ مل کر جہاد کرو۔ تو ان میں سے مال دار لوگ تجھ سے اجازت مانگنے لگ جاتے ہیں اور کہتے ہیں۔ ہمیں پیچھے چھوڑ جائیں تا کہ ہم ان لوگوں کے ساتھ رہیں جو کہ پیچھے بیٹھنے والے ہوں گے۔"}, {"arabic": " رَضُوۡا بِاَنۡ یَّکُوۡنُوۡا مَعَ الۡخَوَالِفِ وَ طُبِعَ عَلٰی قُلُوۡبِہِمۡ فَہُمۡ لَا یَفۡقَہُوۡنَ ﴿۸۷﴾", "english": " They are content to be with the womenfolk, and their hearts are sealed so that they understand not.", "french": " Ils préfèrent rester avec les femmes qui sont restées à l’arrière, et leurs cœurs sont scellés, de sorte qu’ils ne comprennent pas.", "german": " Sie sind es zufrieden, mit den zurückbleibenden (Stämmen) zu sein, und ihre Herzen sind versiegelt, so dass sie nicht begreifen.", "spanish": " Se alegran de estar con las mujeres que quedaron detrás, y sus corazones están sellados, de manera que no entienden.", "urdu": " وہ اس بات پر خوش ہیں کہ پیچھے بیٹھ رہنے والے قبائل میں شامل ہو جائیں اور ان کے دلوں پر مہر کر دی گئی ہے۔ پس وہ (اپنے بداعمال کی وجہ سے) سمجھتے نہیں۔"}, {"arabic": " لٰکِنِ الرَّسُوۡلُ وَ الَّذِیۡنَ اٰمَنُوۡا مَعَہٗ جٰہَدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ؕ وَ اُولٰٓئِکَ لَہُمُ الۡخَیۡرٰتُ ۫ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۸۸﴾", "english": " But the Messenger and those who believe with him strive in the cause of Allah with their property and their persons, and it is they who shall have good things, and it is they who shall prosper.", "french": " Mais le Messager et ceux qui croient avec lui luttent pour la cause d’Allāh avec leurs biens et leurs personnes, et ce sont eux qui auront des bienfaits et ce sont eux qui prospére­ront.", "german": " Jedoch der Gesandte und die Gläubigen mit ihm, die mit ihrem Gut und ihrem Blut streiten, sie sind es, denen Gutes zuteil werden soll, und sie sind es, die Erfolg haben werden.", "spanish": " Pero el Mensajero y quienes creen con él se esfuerzan por la causa de Al-lah con sus bienes y personas, y son ellos quienes recibirán cosas buenas, y quienes prosperarán.", "urdu": " لیکن یہ رسول (یعنی آنحضرت صلی اللہ علیہ وسلم) اور جو اس کے ساتھ ہو کر (خدا پر) ایمان لائے ہیں اور جنہوں نے اپنے مال اور اپنی جانوں کے ذریعہ سے جہاد کیا ہے۔ ان کے لئے ہر قسم کی بھلائیاں ہیں اور وہی (آخر) کامیاب ہونے والے ہیں۔"}, {"arabic": " اَعَدَّ اللّٰہُ لَہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿٪۸۹﴾", "english": " Allah has prepared for them Gardens underneath which flow rivers; therein they shall abide. That is the supreme triumph.", "french": " Allāh a préparé pour eux des Jardins sous lesquels coulent des rivières ; ils y demeure­ront éternellement. C’est là le triomphe suprême.", "german": " Allah hat Gärten für sie bereitet, durch welche Ströme fließen; darin sollen sie ewig weilen. Das ist die höchste Glückseligkeit.", "spanish": " Al-lah ha preparado para ellos Jardines por los que corren ríos; en ellos morarán. Ése es el triunfo supremo.", "urdu": " اللہ نے ان کے لئے ایسی جنتیں تیار کی ہیں‘ جن کے نیچے نہریں بہتی ہیں۔ وہ ان باغوں میں ہمیشہ رہتے چلے جائیں گے۔ یہ بہت بڑی کامیابی ہے۔"}, {"arabic": " وَ جَآءَ الۡمُعَذِّرُوۡنَ مِنَ الۡاَعۡرَابِ لِیُؤۡذَنَ لَہُمۡ وَ قَعَدَ الَّذِیۡنَ کَذَبُوا اللّٰہَ وَ رَسُوۡلَہٗ ؕ سَیُصِیۡبُ الَّذِیۡنَ کَفَرُوۡا مِنۡہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۹۰﴾", "english": " And those who make excuses from among the desert Arabs, came that exemption might be granted them. And those who were false to Allah and His Messenger stayed at home . A grievous punishment shall befall those of them who disbelieve.", "french": " Et ceux d’entre les Arabes du désert qui s’excusent se sont présentés en demandant que l’exemption leur soit accordée. Et ceux qui ont menti à Allāh et à Son Messager sont restés chez eux. Un châtiment douloureux frappera ceux d’entre eux qui ne croient pas.", "german": " Und es kamen solche Wüstenaraber, die Ausflüchte machten, dass sie ausgenommen würden; und jene, die falsch waren gegen Allah und Seinen Gesandten, blieben (daheim). Wahrlich, eine schmerzliche Strafe wird die unter ihnen ereilen, die ungläubig sind.", "spanish": " Quienes se excusan de entre los árabes del desierto, vinieron para que se le concediera la exención. Mas los falsos para Al-lah y Su Mensajero se quedaron en casa. Un penoso castigo caerá sobre los incrédulos.", "urdu": " اور مدینہ کے اردگرد جنگلوں (اور چھوٹے گاٶں) میں رہنے والے لوگوں میں سے بہانہ ساز (لوگ) آکر کہتے ہیں کہ انہیں (بھی) پیچھے رہنے کی اجازت دی جائے اور وہ لوگ جنہوں نے اللہ اور اس کے رسول سے جھوٹ بولا ہے (بغیر اجازت کے ہی) پیچھے ٹھہر گئے ہیں‘ ان میں سے جو کافر ہیں ان کو یقیناً دردناک عذاب پہنچے گا۔"}, {"arabic": " لَیۡسَ عَلَی الضُّعَفَآءِ وَ لَا عَلَی الۡمَرۡضٰی وَ لَا عَلَی الَّذِیۡنَ لَا یَجِدُوۡنَ مَا یُنۡفِقُوۡنَ حَرَجٌ اِذَا نَصَحُوۡا لِلّٰہِ وَ رَسُوۡلِہٖ ؕ مَا عَلَی الۡمُحۡسِنِیۡنَ مِنۡ سَبِیۡلٍ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿ۙ۹۱﴾", "english": " No blame lies on the weak, nor on the sick, nor on those who find naught to spend, if they are sincere to Allah and His Messenger. There is no cause of reproach against those who do good deeds; and Allah is Most Forgiving, Merciful.", "french": " Les faibles ne sont pas à blâmer, ni les malades, ni ceux qui ne trouvent rien à dépenser, s’ils sont sincères envers Allāh et Son Messager. Il n’y a rien à reprocher à ceux qui font de bonnes œuvres, et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Kein Tadel trifft die Schwachen und die Kranken und diejenigen, die nichts zum Ausgeben finden, wenn sie nur gegen Allah und Seinen Gesandten aufrichtig sind. Kein Vorwurf trifft jene, die Gutes tun – und Allah ist allverzeihend, barmherzig –,", "spanish": " No hay que reprochar nada a los débiles, a los enfermos, ni a los que no tienen nada que gastar, si son sinceros con Al-lah y Su Mensajero. No hay motivo de reproche contra los que hacen buenas obras; pues Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " (لیکن اے رسول)! جو واقعی کمزور ہیں اور مریض ہیں۔ اور جو لوگ زاد راہ نہیں پاتے ان پر (پیچھے رہ جانے کی وجہ سے) کوئی گرفت نہیں ہوگی۔ جبکہ وہ دلی طور پر اللہ اور اس کے رسول کے مخلص ہیں (یہ لوگ محسن ہیں) اور محسنوں پر کوئی الزام نہیں اور اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَّ لَا عَلَی الَّذِیۡنَ اِذَا مَاۤ اَتَوۡکَ لِتَحۡمِلَہُمۡ قُلۡتَ لَاۤ اَجِدُ مَاۤ اَحۡمِلُکُمۡ عَلَیۡہِ ۪ تَوَلَّوۡا وَّ اَعۡیُنُہُمۡ تَفِیۡضُ مِنَ الدَّمۡعِ حَزَنًا اَلَّا یَجِدُوۡا مَا یُنۡفِقُوۡنَ ﴿ؕ۹۲﴾", "english": " Nor against those to whom, when they came to thee that thou shouldst mount them, thou didst say, ‘I cannot find whereon I can mount you;’ they turned back, their eyes overflowing with tears, out of grief that they could not find what they might spend.", "french": " Ni à ceux qui quand ils sont venus à toi te demander de leur donner des montures, tu as répondu : « Je ne vous trouve pas de montures. » Ils s’ en sont retournés, les yeux débordant de larmes, désolés de ne pouvoir trouver de quoi dépenser.", "german": " noch jene, die zu dir kamen, dass du sie beritten machen möchtest, und (zu denen) du sprachest: \"Ich kann nichts finden, womit ich euch beritten machen könnte.\" Da kehrten sie um, während ihre Augen von Tränen überflossen aus Kummer darüber, dass sie nichts fanden, was sie hätten ausgeben können.", "spanish": " Tampoco contra aquellos que, cuando llegaron a ti para que les proporcionases una montura, les dijiste: “No puedo encontrar cabalgadura para vosotros”; se volvieron, con sus ojos inundados de lágrimas, por la pena de no poder encontrar nada que emplear.", "urdu": " اور نہ ان لوگوں پر (کوئی الزام ہے) جو تیرے پاس اس وقت آئے جب جنگ کا اعلان کیا گیا تھا۔ اس لئے کہ تو ان کو کوئی سواری مہیا کر دے۔ تو تو نے جواب دیا کہ میرے پاس کوئی چیز نہیں ہے جس پر تمہیں سوار کراٶں اور (یہ جواب سن کر) وہ چلے گئے اور (اس) غم سے ان کی آنکھوں سے آنسو بہ رہے تھے کہ افسوس ان کے پاس کچھ نہیں جسے (خدا کی راہ میں) خرچ کریں۔"}, {"arabic": " اِنَّمَا السَّبِیۡلُ عَلَی الَّذِیۡنَ یَسۡتَاۡذِنُوۡنَکَ وَ ہُمۡ اَغۡنِیَآءُ ۚ رَضُوۡا بِاَنۡ یَّکُوۡنُوۡا مَعَ الۡخَوَالِفِ ۙ وَ طَبَعَ اللّٰہُ عَلٰی قُلُوۡبِہِمۡ فَہُمۡ لَا یَعۡلَمُوۡنَ ﴿۹۳﴾", "english": " The cause of reproach is only against those who ask leave of thee, while they are rich. They are content to be with the womenfolk. And Allah has set a seal upon their hearts so that they know not.", "french": " Les reproches sont seulement à l’intention de ceux qui te demandent la permission d’être exemptés, alors qu’ils sont riches. Il leur plaît d’être avec les femmes qui sont restées à l’arrière. Et Allāh leur a scellé le cœur de sorte qu’ils ne savent pas.", "german": " Vorwurf trifft nur jene, die dich um Erlaubnis bitten, wiewohl sie reich sind. Sie sind es zufrieden, mit den zurückbleibenden (Stämmen) zu sein. Allah hat ein Siegel auf ihre Herzen gelegt, so dass sie nicht wissen.", "spanish": " Sólo hay motivo de reproche contra quienes te piden ser eximidos a pesar de ser ricos. Se sienten contentos de quedarse con las mujeres. Pero Al-lah ha puesto un sello en sus corazones para que no lo sepan.", "urdu": " الزام صرف ان لوگوں پر ہے جو اس حالت میں اجازت مانگتے ہیں کہ وہ مال دار ہوتے ہیں۔ وہ پیچھے بیٹھ رہنے والے قبائل کے ساتھ (بیٹھ رہنے پر) راضی ہو گئے اور اللہ نے ان کے دلوں پر مہر کر دی۔ مگر وہ (ایسے ہیں کہ) سمجھتے ہی نہیں۔"}, {"arabic": " یَعۡتَذِرُوۡنَ اِلَیۡکُمۡ اِذَا رَجَعۡتُمۡ اِلَیۡہِمۡ ؕ قُلۡ لَّا تَعۡتَذِرُوۡا لَنۡ نُّؤۡمِنَ لَکُمۡ قَدۡ نَبَّاَنَا اللّٰہُ مِنۡ اَخۡبَارِکُمۡ ؕ وَ سَیَرَی اللّٰہُ عَمَلَکُمۡ وَ رَسُوۡلُہٗ ثُمَّ تُرَدُّوۡنَ اِلٰی عٰلِمِ الۡغَیۡبِ وَ الشَّہَادَۃِ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۹۴﴾", "english": " They will make excuses to you when you return to them. Say, ‘Make no excuses; we will not believe you. Allah has already informed us of the facts about you. And Allah will observe your conduct, and also His Messenger; then you will be brought back to Him Who knows the unseen and the seen, and He will tell you all that you used to do.’", "french": " Ils vous feront des excuses quand vous reviendrez parmi eux. Dis : « Ne vous excusez point ; nous ne vous croirons pas. Allāh nous a déjà informés de vos nouvelles. Et Allāh observera votre conduite, et Son Messager aussi ; et ensuite, vous serez ramenés auprès de Celui Qui connaît l’invisible et le visible, et Il vous informera de ce que vous faisiez. »", "german": " Sie werden euch Entschuldigungen vorbringen, wenn ihr zu ihnen zurückkehrt. Sprich: \"Bringt keine Entschuldigungen vor; wir glauben euch doch nicht. Allah hat uns schon über eure Angelegenheit belehrt. Schauen wird Allah und Sein Gesandter auf euer Tun; dann werdet ihr zu dem Kenner des Verborgenen und des Offenbaren zurückgebracht werden, und Er wird euch alles verkünden, was ihr zu tun pflegtet.\"", "spanish": " Os presentarán excusas cuando volváis a ellos. Diles: “No os excuséis; no os creeremos. Al-lah nos ha informado ya de todo lo eferente a vosotros. Y Al-lah observará vuestra conducta, como también Su Mensajero; más tarde seréis devueltos a Él, a Quien conoce lo invisible y lo visible, y Él os dirá todo lo que solíais hacer”.", "urdu": " جب تم جنگ سے ان کی طرف واپس لوٹ کر آتے ہو تو وہ تمہارے پاس آکر (قسم قسم کے) عذر کرتے ہیں‘ تو ان سے کہہ دے کہ عذر نہ کرو۔ ہم (تمہارے عذروں کو) ہرگز تسلیم نہیں کریں گے۔ اللہ نے تمہارے حالات سے ہم کو خبر دے دی ہے اور اللہ اور اس کا رسول تمہارے عملوں کو بھانپتے رہیں گے۔ پھر تم حاضر و غائب کو جاننے والے خدا کے حضور لوٹائے جاٶ گے۔ پس وہ تمہارے عملوں کی حقیقت سے تم کو خبردار کرے گا۔"}, {"arabic": " سَیَحۡلِفُوۡنَ بِاللّٰہِ لَکُمۡ اِذَا انۡقَلَبۡتُمۡ اِلَیۡہِمۡ لِتُعۡرِضُوۡا عَنۡہُمۡ ؕ فَاَعۡرِضُوۡا عَنۡہُمۡ ؕ اِنَّہُمۡ رِجۡسٌ ۫ وَّ مَاۡوٰٮہُمۡ جَہَنَّمُ ۚ جَزَآءًۢ بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۹۵﴾", "english": " They will swear to you by Allah, when you return to them, that you may leave them alone. So leave them alone. Surely, they are an abomination, and their abode is Hell — a fit recompense for that which they used to earn.", "french": " . Ils vous jureront par Allāh quand vous reviendrez parmi eux, afin que vous les laissiez tranquilles. Laissez-les donc tranquilles. Assurément, ils sont infects, et leur habitation est l’Enfer - en rétribution de ce qu’ils ont acquis.", "german": " Sie werden euch bei Allah schwören, wenn ihr zu ihnen zurückkehrt, dass ihr sie sich selbst überlassen sollt. Überlasset sie also sich selbst. Sie sind ein Abscheu, und ihr Aufenthalt ist die Hölle, ein Entgelt für das, was sie sich selbst erwarben.", "spanish": " Os jurarán por Al-lah, cuando volváis a ellos, que podéis dejarlos solos. Dejadlos pues solos. En verdad, son indecentes y su morada es el Infierno, una recompensa adecuada para lo que solían ganar.", "urdu": " جب تم ان کی طرف لوٹو گے تو وہ تمہارے سامنے اللہ کی قسمیں کھائیں گے تا تم ان سے درگزر کرو (سو ہم بھی تم سے کہتے ہیں کہ) ان سے درگذر ہی کرو۔ کیونکہ وہ گندے ہیں اور ان کا ٹھکانا ان کے اعمال کے بدلہ میں پہلے ہی سے جہنم مقرر ہو چکا ہے۔"}, {"arabic": " یَحۡلِفُوۡنَ لَکُمۡ لِتَرۡضَوۡا عَنۡہُمۡ ۚ فَاِنۡ تَرۡضَوۡا عَنۡہُمۡ فَاِنَّ اللّٰہَ لَا یَرۡضٰی عَنِ الۡقَوۡمِ الۡفٰسِقِیۡنَ ﴿۹۶﴾", "english": " They will swear to you that you may be pleased with them. But even if you be pleased with them, Allah will not be pleased with the rebellious people.", "french": " Ils jureront afin que vous soyez contents d’eux. Mais même si vous êtes contents d’eux, Allāh ne sera pas content du peuple rebelle.", "german": " Sie werden euch schwören, dass ihr mit ihnen wohl zufrieden sein könnt. Doch wäret ihr auch mit ihnen zufrieden, Allah würde doch nicht zufrieden sein mit einem Volk von Frevlern.", "spanish": " Os jurarán para que estéis contentos con ellos. Pero aun cuando estuvierais contentos con ellos, Al-lah no lo estará con las gentes rebeldes.", "urdu": " وہ تمہارے سامنے قسمیں کھائیں گے کہ تم ان سے راضی ہو جاٶ۔ پس اگر تم ان سے راضی بھی ہو جاٶ تو اللہ اطاعت سے نکل جانے والے لوگوں سے راضی نہیں ہوگا۔"}, {"arabic": " اَلۡاَعۡرَابُ اَشَدُّ کُفۡرًا وَّ نِفَاقًا وَّ اَجۡدَرُ اَلَّا یَعۡلَمُوۡا حُدُوۡدَ مَاۤ اَنۡزَلَ اللّٰہُ عَلٰی رَسُوۡلِہٖ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۹۷﴾", "english": " The Arabs of the desert are the worst in disbelief and hypocrisy, and most apt not to know the ordinances of the Revelation which Allah has sent down to His Messenger. And Allah is All-Knowing, Wise.", "french": " Les Arabes du désert sont les pires en fait de mécréance et d’hypocrisie, et les plus portés à ignorer les décrets de la Révélation qu’Allāh a transmis à Son Messager ; et Allāh est Omnis­cient, Sage.", "german": " Die Wüstenaraber sind die Allerverstocktesten in Unglauben und Heuchelei und sind eher dazu geneigt, die Vorschriften nicht zu kennen, die Allah Seinem Gesandten offenbart hat. Und Allah ist allwissend, allweise.", "spanish": " Los moradores del desierto son los peores en incredulidad e ipocresía, y la mayoría no son aptos para conocer los decretos de la Revelación que Al-lah ha revelado a Su Mensajero. Pues Al-lah es el Omnisciente, Sabio.", "urdu": " دیہات (اور جنگلوں) میں رہنے والے عرب کفر اور نفاق میں (سب عربوں سے) بڑھے ہوئے ہیں۔ اور (جہالت کی وجہ سے) اس کے مستحق ہیں کہ جو اللہ نے اپنے رسول پر اتارا ہے اس کی حدود کو نہ پہچانیں اور اللہ بہت جاننے والا (اور) بڑی حکمت والا ہے۔"}, {"arabic": " وَ مِنَ الۡاَعۡرَابِ مَنۡ یَّتَّخِذُ مَا یُنۡفِقُ مَغۡرَمًا وَّ یَتَرَبَّصُ بِکُمُ الدَّوَآئِرَ ؕ عَلَیۡہِمۡ دَآئِرَۃُ السَّوۡءِ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۹۸﴾", "english": " And among the Arabs of the desert are those who regard that which they spend for God as a fine and they wait for calamities to befall you. On themselves shall fall an evil calamity. And Allah is All-Hearing, All-Knowing.", "french": " Et parmi les Bédouins se trouvent ceux qui considèrent ce qu’ils dépensent pour la cause d’Allāh comme une amende et attendent, un souhait ardent au cœur, que vous surviennent des malheurs. Au contraire , que la calamité fonde sur eux ! Et Allāh entend tout et sait tout.", "german": " Und unter den Wüstenarabern sind so manche, die das, was sie spenden, als eine erzwungene Buße ansehen, und sie warten nur auf Missgeschicke wider euch. Allein sie selbst wird ein unheilvolles Missgeschick treffen. Und Allah ist allhörend, allwissend.", "spanish": " Y entre los beduinos están quienes consideran lo que gastan a favor de Dios como un castigo y esperan ansiosamente que las desgracias caigan sobre vosotros. ¡Que el mal acaezca sobre ellos!. Pues Al-lah es Quien todo lo oye, el Omnisciente.", "urdu": " اور دیہاتیوں (اور جنگل کے رہنے والوں) میں سے کچھ لوگ ایسے بھی ہیں (جو) خدا کی راہ میں خرچ کئے ہوئے مال کو (ایک) چٹی سمجھتے ہیں اور تمہارے لئے (آسمانی) گردشوں کی انتظار میں رہتے ہیں۔ (سنو)! بری گردش انہی پر آئے گی اور اللہ خوب سننے والا (اور) جاننے والا ہے۔"}, {"arabic": " وَ مِنَ الۡاَعۡرَابِ مَنۡ یُّؤۡمِنُ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ یَتَّخِذُ مَا یُنۡفِقُ قُرُبٰتٍ عِنۡدَ اللّٰہِ وَ صَلَوٰتِ الرَّسُوۡلِ ؕ اَلَاۤ اِنَّہَا قُرۡبَۃٌ لَّہُمۡ ؕ سَیُدۡخِلُہُمُ اللّٰہُ فِیۡ رَحۡمَتِہٖ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿٪۹۹﴾", "english": " And among the Arabs of the desert are those who believe in Allah and the Last Day and regard that which they spend as means of drawing near to Allah and of receiving the blessings of the Prophet. Aye! it is for them certainly a means of drawing near to God . Allah will soon admit them to His mercy. Surely, Allah is Most Forgiving, Merciful.", "french": " Et il en est parmi les Arabes du désert qui croient en Allāh et au Jour Dernier, et qui considèrent ce qu’ils dépensent comme un moyen de s’approcher d’Allāh et d’avoir en leur faveur les prières du Prophète. C’est vrai ! C’est certaine­ment pour eux un moyen de s’approcher d’Allāh. Allāh ne tardera pas à les admettre dans Sa miséricorde. Assurément, Allāh est Très-Par­donnant, Miséricordieux.", "german": " Doch unter den Wüstenarabern sind auch solche, die an Allah und an den Jüngsten Tag glauben und die das, was sie spenden, als ein Mittel betrachten, sich Allah zu nähern und die Segnungen des Propheten (zu empfangen). Wahrlich, für sie ist es ein Mittel der Annäherung. Allah wird sie bald in Seine Barmherzigkeit einführen. Wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Y entre los moradores del Desierto están quienes creen en Al-lah y en el Último Día y consideran que lo que gastan es un medio para acercarse a Al-lah y recibir las bendiciones del Profeta. Sin duda que es para ellos un medio para acercarse a Dios. Al-lah muy pronto los recibirá en Su misericordia. En verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور دیہاتیوں اور (جنگل میں رہنے والے عربوں) میں سے کچھ لوگ ایسے بھی ہیں جو اللہ پر اور یوم آخرت پر (سچا) ایمان لاتے ہیں اور (خدا کی راہ میں) جو کچھ خرچ کرتے ہیں‘ اسے (خداتعالیٰ کی) قربت اور رسول کی دعاٶں کا ذریعہ سمجھتے ہیں۔ سنو! یہ فعل ضرور ان کے لئے (خدا کی) قربت کا ذریعہ ہوگا۔ اللہ ضرور ان کو اپنی رحمت میں داخل کرے گا کیونکہ اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ السّٰبِقُوۡنَ الۡاَوَّلُوۡنَ مِنَ الۡمُہٰجِرِیۡنَ وَ الۡاَنۡصَارِ وَ الَّذِیۡنَ اتَّبَعُوۡہُمۡ بِاِحۡسَانٍ ۙ رَّضِیَ اللّٰہُ عَنۡہُمۡ وَ رَضُوۡا عَنۡہُ وَ اَعَدَّ لَہُمۡ جَنّٰتٍ تَجۡرِیۡ تَحۡتَہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿۱۰۰﴾", "english": " And as for the foremost among the believers , the first of the Emigrants and the Helpers, and those who followed them in the best possible manner, Allah is well pleased with them and they are well pleased with Him; and He has prepared for them Gardens beneath which flow rivers. They will abide therein for ever. That is the supreme triumph.", "french": " Et quant à ceux qui sont plus en avant parmi les croyants, les premiers des Emigrés et des Ansārs, et ceux qui les ont suivis de façon excellente, Allāh est satisfait d’eux, et ils sont satisfaits de Lui ; et Il a préparé à leur intention des Jardins sous lesquels coulent des rivières. Ils y demeureront éternellement. C’est là le triomphe suprême", "german": " Die Vordersten, die ersten der Auswanderer (aus Mekka) und der Helfer (in Medina), und jene, die ihnen auf die beste Art gefolgt sind, mit ihnen ist Allah wohl zufrieden und sie sind wohl zufrieden mit Ihm; und Er hat ihnen Gärten bereitet, durch welche Ströme fließen. Darin sollen sie weilen ewig und immerdar. Das ist die höchste Glückseligkeit.", "spanish": " En cuanto a los más destacados de entre los creyentes, los primeros Emigrantes y Socorredores, y los que les siguieron de manera excelente, Al-lah se siente contento con ellos y ellos contentos con Él. Y Él les ha preparado Jardines por los que corren ríos. En ellos habitarán para siempre. Ése es el triunfo supremo.", "urdu": " اور جو مہاجرین اور انصار میں سے سبقت لے جانے والے ہیں اور وہ لوگ بھی جو کہ کامل اطاعت دکھاتے ہوئے ان کے پیچھے چلے۔ اللہ ان سے راضی ہو گیا اور وہ اللہ سے راضی ہو گئے۔ اس نے ان کے لئے ایسی جنتیں تیار کی ہیں جن کے نیچے نہریں بہتی ہیں وہ ان میں ہمیشہ رہتے چلے جائیں گے۔ یہ بہت بڑی کامیابی ہے۔"}, {"arabic": " وَ مِمَّنۡ حَوۡلَکُمۡ مِّنَ الۡاَعۡرَابِ مُنٰفِقُوۡنَ ؕۛ وَ مِنۡ اَہۡلِ الۡمَدِیۡنَۃِ ۟ۛؔ مَرَدُوۡا عَلَی النِّفَاقِ ۟ لَا تَعۡلَمُہُمۡ ؕ نَحۡنُ نَعۡلَمُہُمۡ ؕ سَنُعَذِّبُہُمۡ مَّرَّتَیۡنِ ثُمَّ یُرَدُّوۡنَ اِلٰی عَذَابٍ عَظِیۡمٍ ﴿۱۰۱﴾ۚ", "english": " And of the desert Arabs around you some are hypocrites; and of the people of Medina also . They persist in hypocrisy. Thou knowest them not; We know them. We will punish them twice; then shall they be given over to a great punishment.", "french": " Il en est aussi parmi les Arabes du désert, autour de vous, qui sont hypocrites ; et certains habitants de Médine aussi. Ils s’obsti­nent dans l’hypocrisie. Tu ne les connais pas ; Nous les connaissons. Nous les châtierons à deux reprises ; ensuite ils seront livrés à un très grand châtiment.", "german": " Unter den Wüstenarabern, die um euch wohnen, gibt es auch Heuchler, wie unter dem Volk von Medina. Sie sind verstockt in der Heuchelei. Du kennst sie nicht; Wir aber kennen sie. Wir werden sie zwiefach strafen; dann sollen sie einer schweren Pein überantwortet werden.", "spanish": " Y de entre los moradores del desierto que os rodean, algunos son hipócritas; y también los hay en las entes de Medina. Persisten en la hipocresía. Tú no los conoces pero Nosotros los conocemos. Los castigaremos dos veces; y después se les infligirá un gran castigo.", "urdu": " اور گنواروں (اور جنگل میں رہنے والوں) میں سے جو تمہارے اردگرد رہتے ہیں منافق بھی ہیں اور مدینہ کے رہنے والوں میں سے بھی (کچھ لوگ ایسے ہیں) جو نفاق پر مصر ہیں‘ تو ان کو نہیں جانتا مگر ہم ان کو جانتے ہیں‘ ہم ان کو دو دفعہ عذاب دیں گے‘ پھر وہ ایک بہت بڑے عذاب کی طرف لوٹائے جائیں گے۔"}, {"arabic": " وَ اٰخَرُوۡنَ اعۡتَرَفُوۡا بِذُنُوۡبِہِمۡ خَلَطُوۡا عَمَلًا صَالِحًا وَّ اٰخَرَ سَیِّئًا ؕ عَسَی اللّٰہُ اَنۡ یَّتُوۡبَ عَلَیۡہِمۡ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۰۲﴾", "english": " And there are others who have acknowledged their faults. They mixed a good work with another that was evil. It may be that Allah will turn to them with compassion. Surely, Allah is Most Forgiving, Merciful.", "french": " Et il en est d’autres qui ont avoué leurs offenses. Ils ont mêlé une bonne action avec une autre qui était mauvaise. Il se peut qu’Allāh se tourne vers eux avec compassion. Assurément, Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und es sind andere, die ihre Schuld bekannten. Sie vermischten eine gute Tat mit einer anderen, schlechten. Bald wird Allah Sich mit Erbarmen zu ihnen wenden; Allah ist Allverzeihend, Barmherzig.", "spanish": " Pero hay otros que han reconocido sus faltas. Mezclaron una buena obra con otra mala. Tal vez Al-lah vuelva a ellos con compasión. En verdad, Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور کچھ اور لوگ ہیں جنہوں نے اپنے گناہوں کا اقرار کیا انہوں نے نیک عملوں کو کچھ اور عملوں سے جو برے تھے ملا دیا تھا۔ قریب ہے کہ اللہ ان پر فضل کر دے اللہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " خُذۡ مِنۡ اَمۡوَالِہِمۡ صَدَقَۃً تُطَہِّرُہُمۡ وَ تُزَکِّیۡہِمۡ بِہَا وَ صَلِّ عَلَیۡہِمۡ ؕ اِنَّ صَلٰوتَکَ سَکَنٌ لَّہُمۡ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۱۰۳﴾", "english": " Take alms out of their wealth, so that thou mayest cleanse them and purify them thereby. And pray for them; thy prayer is indeed a source of tranquillity for them. And Allah is All-Hearing, All-Knowing.", "french": " Prends pour donner aux pauvres une partie de leurs biens en aumône, afin que par ce moyen tu les rends propres et tu les purifies. Et prie pour eux ; tes prières sont en vérité pour eux une source de tranquillité. Et Allāh entend tout et sait tout.", "german": " Nimm Almosen von ihrem Besitz, auf dass du sie dadurch reinigen und läutern mögest. Und bete für sie, denn dein Gebet ist ihnen Beruhigung. Und Allah ist allhörend, allwissend.", "spanish": " Toma limosnas de su riqueza para que los limpies y purifiques con llas. Y ora por ellos; tu oración es, en verdad, una fuente de tranquilidad para ellos. Pues Al-lah es Quien todo lo oye, el Omnisciente.", "urdu": " (اے رسول)! ان کے مالوں میں سے صدقہ لے تا کہ تو انہیں پاک کرے اور ان کی ترقی کے سامان مہیا کرے اور ان کے لئے دعائیں بھی کرتا رہ۔ کیونکہ تیری دعا ان کی تسکین کا موجب ہے اور اللہ تیری دعاٶں کو بہت سننے والا (اور حالات کو) جاننے والا ہے۔"}, {"arabic": " اَلَمۡ یَعۡلَمُوۡۤا اَنَّ اللّٰہَ ہُوَ یَقۡبَلُ التَّوۡبَۃَ عَنۡ عِبَادِہٖ وَ یَاۡخُذُ الصَّدَقٰتِ وَ اَنَّ اللّٰہَ ہُوَ التَّوَّابُ الرَّحِیۡمُ ﴿۱۰۴﴾", "english": " Know they not that Allah is He Who accepts repentance from His servants and takes alms, and that Allah is He Who is Oft-Returning with compassion , and is Merciful?", "french": " Ne savent-ils pas qu’Allāh est Celui Qui accepte le repentir de Ses serviteurs et Qui prend bonne note des aumônes, et qu’Allāh est Celui Qui revient sans cesse avec compassion, le Miséricordieux ?", "german": " Wissen sie denn nicht, dass Allah allein es ist, Der von Seinen Dienern Reue annimmt und Almosen anerkennt, und dass Allah der Allvergebende, der Barmherzige ist?", "spanish": " ¿No saben que Al-lah es el que acepta el arrepentimiento de Sus iervos y reconoce las limosnas, y que Al-lah es el Sumo Remisorio con compasión, y es Misericordioso?", "urdu": " کیا ان کو معلوم نہیں کہ اللہ ہی ہے‘ جو اپنے بندوں کی توبہ قبول کرتا اور ان کے صدقات لیتا ہے (رسول نہیں لیتا) اور اللہ ہی ہے جو بہت توبہ قبول کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ قُلِ اعۡمَلُوۡا فَسَیَرَی اللّٰہُ عَمَلَکُمۡ وَ رَسُوۡلُہٗ وَ الۡمُؤۡمِنُوۡنَ ؕ وَ سَتُرَدُّوۡنَ اِلٰی عٰلِمِ الۡغَیۡبِ وَ الشَّہَادَۃِ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۱۰۵﴾ۚ", "english": " And say, ‘Work, and Allah will surely see your work and also His Messenger and the believers. And you shall be brought back to Him Who knows the unseen and the seen; then He will tell you what you used to do.’", "french": " Et dis : « Faites tout ce que vous pouvez ; assurément, Allāh surveillera vos actes et Son Messager et les croyants feront de même . Et vous serez ramenés vers Celui Qui connaît l’invisible et le visible ; alors Il vous dira ce que vous aviez l’habitude de faire. »", "german": " Und sprich: \"Wirket! Allah wird euer Werk schauen, und so Sein Gesandter und die Gläubigen. Und zurück sollt ihr gebracht werden zu dem Kenner des Verborgenen und des Offenbaren; dann wird Er euch verkünden, was ihr zu tun pflegtet.\"", "spanish": " Diles: “Haced lo que podáis, Al-lah vigilará ciertamente vuestras obras, como también lo harán Su Mensajero y los creyentes. Y se os hará volver al Conocedor de lo visible y lo invisible; entonces Él os dirá lo que solíais hacer”.", "urdu": " اور (ان سے) کہہ دے کہ اپنی جگہ کام کرے جاٶ۔ اللہ اور اس کا رسول اور مومن ضرور تمہارے کاموں کی حقیقت کو دیکھتے رہیں گے اور تم ضرور حاضر و غائب جاننے والے خدا کی طرف لوٹائے جاٶ گے اور وہ تمہارے عملوں کی حقیقت تمہیں بتائے گا۔"}, {"arabic": " وَ اٰخَرُوۡنَ مُرۡجَوۡنَ لِاَمۡرِ اللّٰہِ اِمَّا یُعَذِّبُہُمۡ وَ اِمَّا یَتُوۡبُ عَلَیۡہِمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۱۰۶﴾", "english": " And there are others whose case has been postponed for the decree of Allah. He may punish them or He may turn to them with compassion. And Allah is All- Knowing, Wise.", "french": " Et il y en a d’autres qui durent attendre le décret d’Allāh. Il pourrait décider de les punir ou Il pourrait Se tourner vers eux avec compassion. Et Allāh est Omniscient, Sage.", "german": " Und es gibt andere, die auf Allahs Entscheid warten müssen. Er mag sie bestrafen, oder Er mag Sich zu ihnen wenden mit Erbarmen; denn Allah ist allwissend, allweise.", "spanish": " Pero hay otros a la espera del decreto de Al-lah. El decidirá si los castiga o si vuelve a ellos con compasión. Pues Al-lah es el Omnisciente, Sabio.", "urdu": " اور کچھ اور لوگ ہیں جو خدا کے حکم کی انتظار میں چھوڑے گئے ہیں (اس کو اختیار ہے کہ) خواہ انکو عذاب دے یا انکی توبہ قبول کرے اور اللہ جاننے والا (اور) حکمت والا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ اتَّخَذُوۡا مَسۡجِدًا ضِرَارًا وَّ کُفۡرًا وَّ تَفۡرِیۡقًۢا بَیۡنَ الۡمُؤۡمِنِیۡنَ وَ اِرۡصَادًا لِّمَنۡ حَارَبَ اللّٰہَ وَ رَسُوۡلَہٗ مِنۡ قَبۡلُ ؕ وَ لَیَحۡلِفُنَّ اِنۡ اَرَدۡنَاۤ اِلَّا الۡحُسۡنٰی ؕ وَ اللّٰہُ یَشۡہَدُ اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿۱۰۷﴾", "english": " And among the hypocrites are those who have built a mosque in order to injure Islam and help disbelief and cause a division among the believers, and prepare an ambush for him who warred against Allah and His Messenger before this . And they will surely swear: ‘We meant nothing but good;’ but Allah bears witness that they are certainly liars.", "french": " Et parmi les hypocrites se trouvent ceux qui ont construit une mosquée afin de nuire à l’Islam et de promouvoir la mécréance et afin de créer de la dissension parmi les croyants et de préparer un lieu de refuge pour ceux qui ont déjà fait la guerre contre Allāh et Son Messager. Et ils jureront certainement : « Nous n’étions mûs que par les meilleures intentions » ; mais Allāh témoigne qu’ils sont certainement des menteurs.", "german": " Und jene, die eine Moschee erbaut haben, um Unheil, Unglauben und Spaltung unter den Gläubigen anzustiften, und als einen Hinterhalt für den, der zuvor gegen Allah und Seinen Gesandten Krieg führte. Und sie werden sicherlich schwören: \"Wir bezweckten nur Gutes\"; doch Allah ist Zeuge, dass sie bloß Lügner sind.", "spanish": " Y entre los hipócritas hay quienes construyeron una mezquita para perjudicar al Islam, extender la incredulidad, crear la disensión entre los creyentes y proporcionar un lugar de ocultamiento a aquellos que hicieron la guerra a Al-lah y Su Mensajero. En verdad jurarán: “Sólo pretendíamos el bien”; pero Al-lah es testigo de que son realmente mentirosos.", "urdu": " اور وہ لوگ جنہوںنے ایک مسجد نقصان پہنچانے اور کفر کی تبلیغ کرنے اور مومنوں میں تفرقہ پیدا کرنے کے لئے بنائی ہے اور جو شخص اللہ اور اس کے رسول سے لڑ چکا ہے اس کے لئے کمین گاہ مہیا کرنے کے لئے۔ وہ ضرور قسم کھائیں گے (کہ) اس مسجد کے بنانے سے ہمارا ارادہ صرف نیکی کرنا تھا اور اللہ گواہی دیتا ہے کہ وہ یقیناً جھوٹ بول رہے ہیں۔"}, {"arabic": " لَا تَقُمۡ فِیۡہِ اَبَدًا ؕ لَمَسۡجِدٌ اُسِّسَ عَلَی التَّقۡوٰی مِنۡ اَوَّلِ یَوۡمٍ اَحَقُّ اَنۡ تَقُوۡمَ فِیۡہِ ؕ فِیۡہِ رِجَالٌ یُّحِبُّوۡنَ اَنۡ یَّتَطَہَّرُوۡا ؕ وَ اللّٰہُ یُحِبُّ الۡمُطَّہِّرِیۡنَ ﴿۱۰۸﴾", "english": " Never stand to pray therein. A mosque which was founded upon piety from the very first day is surely more worthy that thou shouldst stand to pray therein. In it are men who love to become purified, and Allah loves those who purify themselves.", "french": " Ne t’y tiens jamais pour prier. Une Mosquée fondée, dès le premier jour, sur la piété, est assurément plus digne que tu t’y tiennes pour prier. A l’intérieur, se trouvent des hommes qui désirent se purifier, et Allāh aime ceux qui se purifient.", "german": " Stehe nie darin (zum Gebet). Eine Moschee, die auf Frömmigkeit gegründet ward vom allerersten Tag an, ist wahrlich würdiger, dass du darin stehen solltest. In ihr sind Leute, die sich gerne reinigen, und Allah liebt die sich Reinigenden.", "spanish": " Nunca permanezcas allí para rezar. Una mezquita fundada en la piedad desde sus primeros días es más digna de que permanezcas en ella para orar. Allí hay hombres que desean ser purificados, y Al-lah ama a quienes se purifican a sí mismos.", "urdu": " (اے نبی)! تو اس (مسجد) میں (کبھی) کھڑا نہ ہو۔ وہ مسجد جس کی بنیاد پہلے دن سے تقویٰ پر رکھی گئی ہے زیادہ حقدار ہے کہ تو اس میں (جماعت کرانے کے لئے) کھڑا ہو۔ اس میں (آنے والے) ایسے لوگ ہیں جو خواہش رکھتے ہیں کہ بالکل پاک ہو جائیں۔ اور اللہ کامل پاکیزگی اختیار کرنے والوں کو پسند کرتا ہے۔"}, {"arabic": " اَفَمَنۡ اَسَّسَ بُنۡیَانَہٗ عَلٰی تَقۡوٰی مِنَ اللّٰہِ وَ رِضۡوَانٍ خَیۡرٌ اَمۡ مَّنۡ اَسَّسَ بُنۡیَانَہٗ عَلٰی شَفَا جُرُفٍ ہَارٍ فَانۡہَارَ بِہٖ فِیۡ نَارِ جَہَنَّمَ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿۱۰۹﴾", "english": " Is he, then, who founded his building on fear of Allah and His pleasure better or he who founded his building on the brink of a tottering water-worn bank which tumbled down with him into the fire of Hell? And Allah guides not the wrongdoing people.", "french": " Celui-là donc qui a jeté ses fondations sur la crainte d’Allāh et Son plaisir est-il meilleur ou celui qui a jeté ses fondations sur le bord d’une berge vacillante et rongée par les eaux, et qui s’est écroulée avec lui dans le feu de l’Enfer ? Et Allāh ne guide pas le peuple transgresseur.", "german": " Ist nun dieser besser, der sein Gebäude auf Allahs Furcht und Wohlgefallen gegründet hat, oder jener, der sein Gebäude auf den Rand einer wankenden, unterspülten Sandbank gründete, die mit ihm in das Feuer der Hölle gestürzt ist? Und Allah weist nicht dem frevelhaften Volk den Weg.", "spanish": " ¿No es, pues, mejor, quien fundó sus cimientos sobre el temor de Al-lah y buscando Su agrado, que quien fundó sus cimientos al borde de una orilla tambaleante, socavada por el agua, que se hundió con él en el fuego del infierno? Pues Al-lah no guía a los hombres transgresores.", "urdu": " کیا وہ شخص جو اپنی عمارت کی بنیاد اللہ کے تقویٰ اور رضامندی پر رکھتا ہے زیادہ اچھا ہے یا وہ جو اپنی عمارت کی بنیاد ایک پھسلنے والے کنارے پر رکھتا ہے جو گر رہا ہوتا ہے پھر وہ کنارہ اس عمارت سمیت جہنم کی آگ میں گر جاتا ہے اور اللہ ظالم قوم کو (کامیابی کا) راستہ نہیں دکھاتا۔"}, {"arabic": " لَا یَزَالُ بُنۡیَانُہُمُ الَّذِیۡ بَنَوۡا رِیۡبَۃً فِیۡ قُلُوۡبِہِمۡ اِلَّاۤ اَنۡ تَقَطَّعَ قُلُوۡبُہُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ حَکِیۡمٌ ﴿۱۱۰﴾٪", "english": " This building of theirs, which they have built, will ever continue to be a source of disquiet in their hearts, unless their hearts be torn to pieces. And Allah is All-Knowing, Wise.", "french": " Cet édifice des leurs qu’ils ont érigé, restera dans leurs cœurs comme autant de doutes et d’incertitudes à moins que leurs cœurs se fendent et se déchirent en morceaux par crainte d’Allāh . Et Allāh est Omniscient, Sage.", "german": " Ihr Gebäude, das sie sich errichtet, wird nicht aufhören, Zweifel in ihren Herzen zu erregen, bis ihre Herzen in Stücke gerissen sind. Und Allah ist allwissend, allweise.", "spanish": " Este edificio suyo, que han erigido, quedará siempre como fuente de recelo e incertidumbre en sus corazones, hasta que sus corazones se dividan y se partan en trozos. Pues Al-lah es el Omnisciente, Sabio.", "urdu": " وہ بنیاد جو انہوں نے بنائی تھی ہمیشہ ان کے دلوں میں خلش کا موجب رہے گی سوائے اس کے کہ ان کے دل ٹکڑے ٹکڑے ہو جائیں (اور وہ مر جائیں) اور اللہ بہت جاننے والا (اور) بڑی حکمت والا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ اشۡتَرٰی مِنَ الۡمُؤۡمِنِیۡنَ اَنۡفُسَہُمۡ وَ اَمۡوَالَہُمۡ بِاَنَّ لَہُمُ الۡجَنَّۃَ ؕ یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ فَیَقۡتُلُوۡنَ وَ یُقۡتَلُوۡنَ ۟ وَعۡدًا عَلَیۡہِ حَقًّا فِی التَّوۡرٰٮۃِ وَ الۡاِنۡجِیۡلِ وَ الۡقُرۡاٰنِ ؕ وَ مَنۡ اَوۡفٰی بِعَہۡدِہٖ مِنَ اللّٰہِ فَاسۡتَبۡشِرُوۡا بِبَیۡعِکُمُ الَّذِیۡ بَایَعۡتُمۡ بِہٖ ؕ وَ ذٰلِکَ ہُوَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿۱۱۱﴾", "english": " Surely, Allah has purchased of the believers their persons and their property in return for the Garden they shall have; they fight in the cause of Allah, and they slay and are slain — a promise that He has made incumbent on Himself in the Torah, and the Gospel, and the Qur’an. And who is more faithful to his promise than Allah? Rejoice, then, in your bargain which you have made with Him; and that it is which is the supreme triumph.", "french": " Assurément, Allāh a acheté des croyants, leurs personnes et leurs biens en échange du Jardin céleste qu’ils recevront ; ils combattent pour la cause d’Allāh et ils tuent et sont tués – c’est une promesse ferme dont Il est responsable, mentionné dans la Torah, et l’Evangile et le Coran. Et qui est plus fidèle qu’Allāh à Son engagement ? Réjouissez-vous donc du marché que vous avez conclu avec Lui. Et c’est là le triomphe suprême !", "german": " Allah hat von den Gläubigen ihr Leben und ihr Gut für den Garten erkauft: sie kämpfen für Allahs Sache, sie töten und fallen – eine Verheißung, bindend für Ihn, in der Thora und im Evangelium und im Qur-ân. Und wer hält seine Verheißung getreuer als Allah? So freut euch eures Handels mit Ihm; denn dies fürwahr ist die höchste Glückseligkeit.", "spanish": " En verdad, Al-lah ha adquirido de los creyentes sus personas y sus bienes a cambio del Jardín que tendrán; combaten por la causa de Al-lah, matan y son matados: una promesa que Él ha hecho suya en la Torah, el Evangelio y el Corán. Mas ¿quién es más fiel a su promesa que Al-lah? Alegraos, pues, del trato que habéis concluido con Él; en eso está el triunfo supremo.", "urdu": " اللہ نے مومنوں سے ان کی جانوں اور ان کے مالوں کو (اس وعدہ کے ساتھ) خرید لیا ہے کہ ان کو جنت ملے گی (کیونکہ) وہ اللہ کے راستہ میں لڑتے ہیں۔ پس (یا تو وہ) اپنے دشمنوں کو مار لیتے ہیں یا خود مارے جاتے ہیں یہ ایک ایسا وعدہ ہے جو اس پر لازم ہے (اور) تورات اور انجیل (میں بھی بیان کیا گیا ہے) اور قرآن میں (بھی) اور اللہ سے زیادہ اپنے وعدہ کو پورا کرنے والا کون ہے پس (اے مومنو)! اپنے اس سودے پر خوش ہو جاٶ جو تم نے کیا ہے اور یہی وہ بڑی کامیابی ہے (جس کا مومنوں کو وعدہ دیا گیا ہے۔)"}, {"arabic": " اَلتَّآئِبُوۡنَ الۡعٰبِدُوۡنَ الۡحٰمِدُوۡنَ السَّآئِحُوۡنَ الرّٰکِعُوۡنَ السّٰجِدُوۡنَ الۡاٰمِرُوۡنَ بِالۡمَعۡرُوۡفِ وَ النَّاہُوۡنَ عَنِ الۡمُنۡکَرِ وَ الۡحٰفِظُوۡنَ لِحُدُوۡدِ اللّٰہِ ؕ وَ بَشِّرِ الۡمُؤۡمِنِیۡنَ ﴿۱۱۲﴾", "english": " They are the ones who turn to God in repentance , who worship Him , who praise Him , who go about in the land serving Him , who bow down to God , who prostrate themselves in prayer , who enjoin good and forbid evil, and who watch the limits set by Allah. And give glad tidings to those who believe.", "french": " Ceux qui se tournent vers Allāh avec repentir, ceux qui L ’adorent, ceux qui Le louent, ceux qui voyagent dans le pays en Le servant, ceux qui s’inclinent devant Lui , ceux qui se prosternent en Prière , ceux qui enjoignent le bien et qui interdisent le mal, et ceux qui respectent les limites fixées par Allāh ; tous sont des vrais croyants. Et annonce la bonne nouvelle aux croyants.", "german": " Die sich in Reue (zu Gott) wenden, (Ihn) anbeten, (Ihn) lobpreisen, die (in Seiner Sache) wandern, die sich beugen und niederwerfen, die das Gute gebieten und das Böse verbieten, und die Schranken Allahs achten – verkünde (diesen) Gläubigen frohe Botschaft.", "spanish": " Son quienes se vuelven a Dios con arrepentimiento, Lo adoran, Lo alaban, ayunan, se inclinan ante El, se postran en la Oración, ordenan el bien y prohíben el mal y respetan el límite establecido por Al-lah. Y da buenas noticias a los creyentes.", "urdu": " جو (لوگ) توبہ کرنے والے ہیں‘ عبادت کرنے والے ہیں (خدا کی) حمد کرنے والے ہیں (خدا کی راہ میں) سفر کرنے والے ہیں‘ رکوع کرنے والے ہیں‘ سجدہ کرنے والے ہیں نیک باتوں کا حکم دینے والے ہیں اور ُبری باتوں سے روکنے والے ہیں اور اللہ کی حدود کی حفاظت کرنے والے ہیں۔ ایسے مومنوں کو تو بشارت دے دے۔"}, {"arabic": " مَا کَانَ لِلنَّبِیِّ وَ الَّذِیۡنَ اٰمَنُوۡۤا اَنۡ یَّسۡتَغۡفِرُوۡا لِلۡمُشۡرِکِیۡنَ وَ لَوۡ کَانُوۡۤا اُولِیۡ قُرۡبٰی مِنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُمۡ اَنَّہُمۡ اَصۡحٰبُ الۡجَحِیۡمِ ﴿۱۱۳﴾", "english": " It is not for the Prophet and those who believe that they should ask of God forgiveness for the idolaters, even though they may be kinsmen, after it has become plain to them that they are the people of Hell.", "french": " Il ne convient pas au Prophète ni aux croyants d’implorer le pardon d’Allāh pour les idolâtres, fussent-ils des parents, après qu’il leur est devenu manifeste qu’ils sont les habitants de l’Enfer.", "german": " Es kommt dem Propheten und den Gläubigen nicht zu, dass sie (von Gott) für die Götzendiener Verzeihung erflehen sollten, und wären es selbst ihre nächsten Angehörigen, nachdem ihnen deutlich kund geworden, dass jene der Hölle Bewohner sind.", "spanish": " No corresponde al Profeta y a quienes creen, pedir a Dios perdón por los idólatras, aunque sean sus parientes, después de ver claramente que son los moradores del Infierno.", "urdu": " نبی اور مومنوں کی شان کے خلاف تھا کہ مشرکوں کے لئے استغفار کرتے‘ خواہ وہ قریبی رشتہ دار کیوں نہ ہوں بعد اس کے کہ ان پر ظاہر ہو گیا کہ وہ دوزخی ہیں۔"}, {"arabic": " وَ مَا کَانَ اسۡتِغۡفَارُ اِبۡرٰہِیۡمَ لِاَبِیۡہِ اِلَّا عَنۡ مَّوۡعِدَۃٍ وَّعَدَہَاۤ اِیَّاہُ ۚ فَلَمَّا تَبَیَّنَ لَہٗۤ اَنَّہٗ عَدُوٌّ لِّلّٰہِ تَبَرَّاَ مِنۡہُ ؕ اِنَّ اِبۡرٰہِیۡمَ لَاَوَّاہٌ حَلِیۡمٌ ﴿۱۱۴﴾", "english": " And Abraham’s asking forgiveness for his father was only because of a promise he had made to him, but when it became clear to him that he was an enemy to Allah, he dissociated himself from him. Surely, Abraham was most tender-hearted, forbearing.", "french": " Et Abraham n’a prié pour le pardon de son père qu’à cause d’une promesse qu’il lui avait faite ; mais lorsqu’il lui devint manifeste que son père était un ennemi d’Allāh, il le désavoua. Assurément, Abraham avait un cœur très sensible, et était tolérant.", "german": " Dass Abraham für seinen Vater um Verzeihung bat, war nur wegen eines Versprechens, das er ihm gegeben hatte, doch als ihm klar wurde, dass jener ein Feind Allahs sei, sagte er sich von ihm los. Abraham war doch gewiss zärtlichen Herzens, sanftmütig.", "spanish": " Y si Abraham pidió el perdón para su padre fue únicamente por una promesa que él le había hecho, pero cuando vio con claridad que era enemigo de Al-lah, se separó de él. En verdad, Abraham era sumamente compasivo y tolerante.", "urdu": " اور ابراہیم کا استغفار اپنے باپ کے لئے صرف اس وجہ سے تھا کہ اس نے اس سے ایک وعدہ کیا تھا۔ مگر جب اس پر ظاہر ہو گیا کہ وہ اللہ کا دشمن ہے تو وہ اس وعدہ سے پوری طرح دست بردار ہو گیا۔ ابراہیم بہت ہی نرم دل اور عقل مند تھا۔"}, {"arabic": " وَ مَا کَانَ اللّٰہُ لِیُضِلَّ قَوۡمًۢا بَعۡدَ اِذۡ ہَدٰٮہُمۡ حَتّٰی یُبَیِّنَ لَہُمۡ مَّا یَتَّقُوۡنَ ؕ اِنَّ اللّٰہَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۱۱۵﴾", "english": " And it is not for Allah to cause a people to go astray after He has guided them until He makes clear to them that which they ought to guard against. Surely, Allah knows all things full well.", "french": " Et Allāh n’est pas Tel à juger un peuple comme étant égaré après l’avoir guidé, avant qu’Il ne lui fasse clairement comprendre ce dont il devrait se garder. Assurément, Allāh connaît très bien toutes les choses .", "german": " Es ist nicht Allahs Weise, ein Volk irregehen zu lassen, nachdem Er ihm der Weg gewiesen hat, Er hätte ihm denn zuvor klar gemacht, wovor es sich zu hüten habe. Wahrlich, Allah weiß alle Dinge wohl.", "spanish": " Y no corresponde a Al-lah hacer que un pueblo se pierda después de que Él los haya guiado mientras no les haya explicado claramente de lo que deben guardarse. En verdad, Al-lah conoce perfectamente todas las cosas.", "urdu": " اور یہ اللہ کی شان کے خلاف ہے کہ کسی قوم کو ہدایت دینے کے بعد اسے گمراہ قرار دے جب تک کہ وہ ان کے سامنے وہ (امور) نہ بیان کر دے جن سے ان کو بچنا چاہیے اللہ ہر ایک چیز کو جانتا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ لَہٗ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ یُحۡیٖ وَ یُمِیۡتُ ؕ وَ مَا لَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۱۱۶﴾", "english": " Surely, it is Allah to Whom belongs the kingdom of the heavens and the earth. He gives life and causes death. And you have no friend nor helper beside Allah.", "french": " Assurément, c’est à Allāh qu’appar­tient le Royaume des cieux et de la terre. Il donne la vie, et Il donne la mort ; et vous n’avez ni ami ni aide hormis Allāh.", "german": " Allah ist es, Dem das Königreich der Himmel und der Erde gehört. Er gibt Leben und sendet Tod. Und ihr habt keinen Freund noch Helfer außer Allah.", "spanish": " Ciertamente, es a Al-lah a Quien pertenece el Reino de los cielos y de la tierra. Él da la vida y causa la muerte. No tenéis amigo ni abogado fuera de Al-lah.", "urdu": " آسمانوں اور زمین کی بادشاہت یقیناً اللہ کی ہے۔ وہ زندہ بھی کرتاہے اور مارتا بھی ہے اور اللہ کے سوا نہ کوئی تمہارا دوست ہے اور نہ مددگار۔"}, {"arabic": " لَقَدۡ تَّابَ اللّٰہُ عَلَی النَّبِیِّ وَ الۡمُہٰجِرِیۡنَ وَ الۡاَنۡصَارِ الَّذِیۡنَ اتَّبَعُوۡہُ فِیۡ سَاعَۃِ الۡعُسۡرَۃِ مِنۡۢ بَعۡدِ مَا کَادَ یَزِیۡغُ قُلُوۡبُ فَرِیۡقٍ مِّنۡہُمۡ ثُمَّ تَابَ عَلَیۡہِمۡ ؕ اِنَّہٗ بِہِمۡ رَءُوۡفٌ رَّحِیۡمٌ ﴿۱۱۷﴾ۙ", "english": " Allah has certainly turned with mercy to the Prophet and to the Emigrants and the Helpers who followed him in the hour of distress after the hearts of a party of them had well-nigh swerved. He again turned to them with mercy. Surely, He is to them Compassionate, Merciful.", "french": " Allāh S’est tourné certainement avec clémence vers le Prophète et vers les Emigrés et les Ansars qui l’ont suivi à l’heure de la détresse, après que le cœur d’une partie d’entre eux se soit presque dévié. Il s’est tourné de nouveau vers eux avec clémence. Assuré­ment, Il est Compatissant, Miséricordieux envers eux.", "german": " Allah hat Sich wahrlich gnadenvoll dem Propheten zugewandt und den Auswanderern (aus Mekka) und Helfern (in Medina), die ihm in der Stunde der Not gefolgt sind, nachdem die Herzen eines Teils von ihnen fast gewankt hätten. Er aber wandte Sich ihnen abermals mit Erbarmen zu. Wahrlich, Er ist gegen sie gütig, barmherzig.", "spanish": " Al-lah se ha vuelto en verdad con misericordia hacia el Profeta y hacia los Emigrantes y Socorredores que lo siguieron en la hora de angustia, después de que los corazones de un grupo de ellos estuvieran a punto de desfallecer. Y de nuevo volvió a ellos con misericordia. En verdad, es para ellos Compasivo, Misericordioso.", "urdu": " اللہ نے نبی اور مہاجرین اور انصار پر بڑا فضل کیا ہے (یعنی ان لوگوں پر) جنہوں نے اس (نبی) کی تکلیف کی گھڑی میں جبکہ ان میں سے ایک گروہ کے دل کسی قدر شک میں پڑ گئے تھے اتباع کی۔ پھر اس نے ان (کمزوروں) پر بھی فضل کر دیا۔ وہ ان (مومنوں) سے یقیناً محبت کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَّ عَلَی الثَّلٰثَۃِ الَّذِیۡنَ خُلِّفُوۡا ؕ حَتّٰۤی اِذَا ضَاقَتۡ عَلَیۡہِمُ الۡاَرۡضُ بِمَا رَحُبَتۡ وَ ضَاقَتۡ عَلَیۡہِمۡ اَنۡفُسُہُمۡ وَ ظَنُّوۡۤا اَنۡ لَّا مَلۡجَاَ مِنَ اللّٰہِ اِلَّاۤ اِلَیۡہِ ؕ ثُمَّ تَابَ عَلَیۡہِمۡ لِیَتُوۡبُوۡا ؕ اِنَّ اللّٰہَ ہُوَ التَّوَّابُ الرَّحِیۡمُ ﴿۱۱۸﴾٪", "english": " And He has turned with mercy to the three whose case was deferred, until the earth became too strait for them with all its vastness, and their souls were also straitened for them, and they became convinced that there was no refuge from Allah save unto Himself. Then He turned to them with mercy that they might turn to Him . Surely, it is Allah Who is Oft-Returning with compassion and is Merciful.", "french": " Et Allāh S’est tourné avec clémence vers les trois qui par leurs agissements se retrouvèrent à l’arrière, jusqu’à ce que la terre, malgré toute son immensité, leur sembla un lieu trop étroit, et leurs âmes furent aussi rétrécies pour eux, et ils devinrent convaincus qu’il n’y avait de refuge de la part d’Allāh sauf d’aller vers Lui-Même. Alors, Il Se tourna vers eux avec clémence afin qu’ils fassent le repentir . Assurément, c’est Allāh Qui est Celui Qui revient sans cesse avec clémence et Qui est le Miséricordieux.", "german": " Und auch den dreien, die zurückgeblieben waren, bis die Erde ihnen zu eng wurde in ihrer Weite und ihre Seelen ihnen zu eng wurden und sie wussten, dass es keine Zuflucht gibt vor Allah, es sei denn zu Ihm. Da kehrte Er Sich ihnen mit Erbarmen zu, auf dass sie sich bekehren möchten. Wahrlich, Allah ist der langmütig Vergebende, der Barmherzige.", "spanish": " Y a los tres que permanecieron atrás hasta que la tierra les pareció demasiado estrecha a pesar de toda su extensión, y sus almas les fueron también constreñidas , quedando convencidos de que no había refugio ante Al-lah salvo en Él mismo. ntonces volvió a ellos con misericordia para que pudieran retornar a Él. En verdad, Al-lah es Remisorio con compasión y es Misericordioso.", "urdu": " اسی طرح ان تینوں پر بھی (اس نے فضل کیا) جو کہ پیچھے چھوڑے گئے تھے‘ یہاں تک کہ جب زمین باوجود فراخی کے ان پر تنگ ہو گئی اور ان کے اپنے نفس بھی ان پر بار بن گئے اور انہوں نے خیال کیا کہ اللہ کے غضب سے بچنے کے لئے سوائے اس کے اور کوئی پناہ نہیں تو ان کی حالت دیکھ کر اللہ نے ان پر فضل کیا تا کہ وہ بھی توبہ کریں۔ اللہ یقیناً باربار توبہ قبول کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ وَ کُوۡنُوۡا مَعَ الصّٰدِقِیۡنَ ﴿۱۱۹﴾", "english": " O ye who believe! fear Allah and be with the truthful.", "french": " Ô vous qui croyez ! Craignez Allāh et soyez avec les véridiques.", "german": " O die ihr glaubt, fürchtet Allah und seid mit den Wahrhaftigen.", "spanish": " ¡Oh vosotros, los que creéis! temed a Al-lah y permaneced entre los veraces.", "urdu": " اے مومنو! اللہ کا تقویٰ اختیار کرو اور صادقوں (کی جماعت) کے ساتھ شامل ہو جاٶ۔"}, {"arabic": " مَا کَانَ لِاَہۡلِ الۡمَدِیۡنَۃِ وَ مَنۡ حَوۡلَہُمۡ مِّنَ الۡاَعۡرَابِ اَنۡ یَّتَخَلَّفُوۡا عَنۡ رَّسُوۡلِ اللّٰہِ وَ لَا یَرۡغَبُوۡا بِاَنۡفُسِہِمۡ عَنۡ نَّفۡسِہٖ ؕ ذٰلِکَ بِاَنَّہُمۡ لَا یُصِیۡبُہُمۡ ظَمَاٌ وَّ لَا نَصَبٌ وَّ لَا مَخۡمَصَۃٌ فِیۡ سَبِیۡلِ اللّٰہِ وَ لَا یَطَـُٔوۡنَ مَوۡطِئًا یَّغِیۡظُ الۡکُفَّارَ وَ لَا یَنَالُوۡنَ مِنۡ عَدُوٍّ نَّیۡلًا اِلَّا کُتِبَ لَہُمۡ بِہٖ عَمَلٌ صَالِحٌ ؕ اِنَّ اللّٰہَ لَا یُضِیۡعُ اَجۡرَ الۡمُحۡسِنِیۡنَ ﴿۱۲۰﴾ۙ", "english": " It was not proper for the people of Medina and those around them from among the Arabs of the desert that they should have remained behind the Messenger of Allah or that they should have preferred their own lives to his. That is because there distresses them neither thirst nor fatigue nor hunger in the way of Allah, nor do they tread a track which enrages the disbelievers, nor do they cause an enemy any injury whatsoever, but there is written down for them a good work on account of it. Surely, Allah suffers not the reward of those who do good to be lost.", "french": " Il ne convenait pas aux habitants de Médine et à ceux des Bédouins qui habitaient autour, qu’ils restent derrière, laissant partir le Messager d’Allāh ou qu’ils préfèrent leurs propres vies à la sienne. La raison en est que dans la voie d’Allāh, ni la soif, ni les fatigues, ni la faim ne les accablent, et qu’ils ne foulent aucune piste qui fasse enrager les mécréants, et qu’ils n’obtiennent aucun avantage sur l’ennemi, sans qu’une bonne œuvre ne soit consignée par écrit en leur faveur pour cela. Assurément, Allāh ne laisse pas perdre la récompense de ceux qui font le bien.", "german": " Es ziemte sich nicht für die Bewohner von Medina noch für die um sie wohnenden Wüstenaraber, dass sie hinter dem Gesandten Allahs zurückbleiben und ihr Leben dem seinigen vorziehen sollten. Dies, weil weder Durst noch Mühsal noch Hunger sie auf Allahs Weg bedrängt, noch betreten sie einen Pfad, der die Ungläubigen erzürnt, noch fügen sie einem Feinde Leid zu, wofür ihnen nicht ein verdienstliches Werk angeschrieben würde. Allah lässt den Lohn derer, die Gutes tun, nicht verloren gehen.", "spanish": " No había razón para que las gentes de Medina y de sus alrededores de entre los moradores del desierto permanecieran detrás del Mensajero de Al-lah, o que hubieran preferido sus propias vidas a la de él. Esto es porque en el camino de Al-lah no les aflige la sed, la fatiga o el hambre, ni toman una senda que moleste a los incrédulos, ni ganan ventaja al enemigo, sin que se les contara como una buena obra en razón de todo ello. En verdad, Al-lah no permite que se pierda la recompensa de los que hacen el bien.", "urdu": " اہل مدینہ اور جو ان کے ارد گرد دیہاتی (اورجنگلی) رہتے ہیں ان کو مناسب نہ تھا کہ اللہ کے رسول کو (اکیلا) چھوڑ کر آپ پیچھے رہ جاتے اور نہ (یہ کہ) اس کی جان سے بے پرواہ ہو کر اپنی جانوں کی فکر میں لگ جاتے۔ یہ (فیصلہ) اس لئے (کیا جاتا) ہے کہ کوئی پیاس یا تھکان یا بھوک کی گھڑی ان پر اللہ کے رستہ میں نہیں آتی اور نہ وہ کسی زمین پر قدم مارتے ہیں جو کفار کو غصہ دلاتا ہو اور نہ وہ دشمن پر کوئی فتح پاتے ہیں کہ ان کے لئے اس کے بدلہ میں نیک عمل نہ لکھا جاتا ہو۔ اللہ محسنوں کا اجر کبھی ضائع نہیں کرتا۔"}, {"arabic": " وَ لَا یُنۡفِقُوۡنَ نَفَقَۃً صَغِیۡرَۃً وَّ لَا کَبِیۡرَۃً وَّ لَا یَقۡطَعُوۡنَ وَادِیًا اِلَّا کُتِبَ لَہُمۡ لِیَجۡزِیَہُمُ اللّٰہُ اَحۡسَنَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۲۱﴾", "english": " And they spend not any sum, small or great, nor do they traverse a valley, but it is written down for them, that Allah may give them the best reward for what they did.", "french": " Et ils ne dépensent aucune somme, petite ou grosse, ni ne traversent aucune vallée, sans que leur action ne soit inscrite à leur avantage, afin qu’Allāh puisse les récompenser selon la meilleure de leurs oeuvres.", "german": " Und sie spenden keine Summe, sei sie groß oder klein, und sie durchziehen kein Tal, ohne dass es ihnen angeschrieben würde, auf dass Allah ihnen den besten Lohn gebe für das, was sie getan.", "spanish": " Pues no gastan ninguna suma, grande o pequeña, ni atraviesan un valle, sin que quede escrito para ellos, para que Al-lah pueda darles la mejor de las recompensas por lo que hicieron.", "urdu": " اور وہ اللہ کی راہ میں کوئی چھوٹا سا خرچ بھی نہیں کرتے اور نہ بڑا اور نہ کسی وادی کو طے کرتے ہیں مگر (معاً ان کے اعمال میں وہ نیک کام) لکھ لیا جاتا ہے تا کہ اللہ ان کے عملوں کا (اعلیٰ سے) اعلیٰ بدلہ دے۔"}, {"arabic": " وَ مَا کَانَ الۡمُؤۡمِنُوۡنَ لِیَنۡفِرُوۡا کَآفَّۃً ؕ فَلَوۡ لَا نَفَرَ مِنۡ کُلِّ فِرۡقَۃٍ مِّنۡہُمۡ طَآئِفَۃٌ لِّیَتَفَقَّہُوۡا فِی الدِّیۡنِ وَ لِیُنۡذِرُوۡا قَوۡمَہُمۡ اِذَا رَجَعُوۡۤا اِلَیۡہِمۡ لَعَلَّہُمۡ یَحۡذَرُوۡنَ ﴿۱۲۲﴾٪", "english": " It is not possible for the believers to go forth all together. Why, then, does not a party from every section of them go forth that they may become well versed in religion, and that they may warn their people when they return to them, so that they may guard against evil ?", "french": " Il n’est pas possible aux croyants de partir de l’avant tous à la fois. Pourquoi donc un groupe de chaque section d’entre eux ne partirait-il pas de l’avant, afin qu’ils puissent obtenir une meilleure compréhension de la religion, et afin qu’ils puissent avertir leur peuple quand ils retournent parmi eux, pour qu’ils se prémunissent contre le mal ?", "german": " Es ist für die Gläubigen nicht möglich, alle zusammen auszuziehen. Warum zieht denn nicht aus einer jeden Schar eine Gruppe aus, auf dass sie wohl bewandert würden in Glaubensdingen und nach ihrer Rückkehr zu ihrem Volk es warnen könnten, dass es sich vor Übel hüten mag?", "spanish": " No es posible para los creyentes partir todos juntos. ¿Por qué, pues, no parte un grupo de cada sección de ellos para que consigan un mejor conocimiento de la religión y puedan advertir a su pueblo cuando vuelvan a ellos, a fin de que puedan guardarse del mal?", "urdu": " اور مومنوں کے لئے ممکن نہ تھا کہ وہ سب کے سب (اکٹھے ہو کر تعلیم دین کے لئے) نکل پڑیں۔ پس کیوں نہ ہوا کہ ان کی جماعت میں سے ایک گروہ نکل پڑتا۔ تا کہ وہ دین پوری طرح سیکھتے اور اپنی قوم کو واپس لوٹ کر (بے دینی سے) ہوشیار کرتے۔ تا کہ وہ (گمراہی سے) ڈرنے لگیں۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا قَاتِلُوا الَّذِیۡنَ یَلُوۡنَکُمۡ مِّنَ الۡکُفَّارِ وَ لۡیَجِدُوۡا فِیۡکُمۡ غِلۡظَۃً ؕ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ مَعَ الۡمُتَّقِیۡنَ ﴿۱۲۳﴾", "english": " O ye who believe! fight such of the disbelievers as are near to you and let them find hardness in you; and know that Allah is with the righteous.", "french": " Ô vous qui croyez ! Combattez ceux des mécréants qui sont proches de vous, et qu’ils trouvent une fermeté intransigeante en vous ; et sachez qu’Allāh Se range du côté des vertueux.", "german": " O die ihr glaubt, kämpfet wider jene der Ungläubigen, die euch benachbart sind, und lasst sie kompromisslose Festigkeit in euch finden; und wisset, dass Allah mit den Gottesfürchtigen ist.", "spanish": " ¡Oh vosotros, los que creéis! Combatid a los incrédulos que estén cerca de vosotros y haced que encuentren una firmeza inquebrantable en vosotros; y sabed que Al-lah está con los justos.", "urdu": " اے مومنو! ان کفار سے جنگ کرو جو تمہارے پہلو میں رہتے ہیں اور چاہیے کہ وہ تم میں پختگی محسوس کریں۔ اور جان لو کہ اللہ متقیوں کے ساتھ ہے۔"}, {"arabic": " وَ اِذَا مَاۤ اُنۡزِلَتۡ سُوۡرَۃٌ فَمِنۡہُمۡ مَّنۡ یَّقُوۡلُ اَیُّکُمۡ زَادَتۡہُ ہٰذِہٖۤ اِیۡمَانًا ۚ فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا فَزَادَتۡہُمۡ اِیۡمَانًا وَّ ہُمۡ یَسۡتَبۡشِرُوۡنَ ﴿۱۲۴﴾", "english": " And whenever a Surah is sent down, there are some of them who say: ‘Which of you has this Surah increased in faith?’ But, as to those who believe, it increases their faith and they rejoice.", "french": " Et toutes les fois qu’une sourate est révélée, certains d’entre eux disent : « Quel est celui d’entre vous dont elle augmente la foi ? » Mais pour ceux qui croient, elle augmente leur foi et ils s’ en réjouissent.", "german": " Sooft eine Sura herabgesandt wird, gibt es unter ihnen welche, die sprechen: \"Wen von euch hat sie im Glauben bestärkt?\" Die aber gläubig sind, die stärkt sie in ihrem Glauben, und sie freuen sich dessen.", "spanish": " Pues siempre que se revela un Surah, hay alguno de ellos que dice: “¿A cuál de vosotros ha aumentado en la fe este Surah? Pero en lo que respecta a los creyentes, aumenta su fe y se alegran por ello.", "urdu": " اور جب کبھی کوئی سورۃ نازل ہوتی ہے تو ان میں سے بعض (منافق) کہتے ہیں کہ اس (سورۃ) نے تم میں سے کس کا ایمان بڑھایا ہے؟ سو (یاد رکھو کہ) جو لوگ مومن ہیں (ان کے پہلے ایمان کے نتیجہ میں) ان کے ایمان کو اس (سورۃ) نے بڑھایا ہے اور وہ خوشی حاصل کر رہے ہیں۔"}, {"arabic": " وَ اَمَّا الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ فَزَادَتۡہُمۡ رِجۡسًا اِلٰی رِجۡسِہِمۡ وَ مَا تُوۡا وَ ہُمۡ کٰفِرُوۡنَ ﴿۱۲۵﴾", "english": " But as for those in whose hearts is a disease, it adds further filth to their present filth, and they die while they are disbelievers.", "french": " Mais quant à ceux qui ont au cœur une maladie, elle n’ajoute qu’impureté à leur im­pureté présente et ils meurent en état de mécréance.", "german": " Jenen aber, in deren Herzen Krankheit ist, fügt sie ihrem Schmutz nur Schmutz hinzu, und sie sterben als Ungläubige.", "spanish": " Pero para quienes tienen sus corazones enfermos, añade una nueva inmundicia a su inmundicia actual , y mueren como incrédulos.", "urdu": " اور جن کے دل میں بیماری ہے اس (سورۃ) نے ان کے (پہلے) گند پر اور گند چڑھا دیا ہے۔ یہاں تک کہ وہ ایسی حالت میںمریں گے کہ وہ کافر ہوں گے۔"}, {"arabic": " اَوَ لَا یَرَوۡنَ اَنَّہُمۡ یُفۡتَنُوۡنَ فِیۡ کُلِّ عَامٍ مَّرَّۃً اَوۡ مَرَّتَیۡنِ ثُمَّ لَا یَتُوۡبُوۡنَ وَ لَا ہُمۡ یَذَّکَّرُوۡنَ ﴿۱۲۶﴾", "english": " Do they not see that they are tried every year once or twice? Yet they do not repent, nor would they be admonished.", "french": " Ne se rendent-ils pas compte que cha­que année, ils sont mis à l’épreuve une fois ou deux ? Cependant, ils ne se repentent pas et ils ne veulent pas être avertis.", "german": " Sehen sie denn nicht, dass sie in jedem Jahr einmal, zweimal geprüft werden? Dennoch bereuen sie nicht und lassen sich nicht mahnen.", "spanish": " ¿Acaso no ven que son puestos a prueba una o dos veces al año? Y sin embargo no se arrepienten ni quieren ser advertidos.", "urdu": " کیا وہ دیکھتے نہیں کہ ان کی ہر سال میں ایک یا دو دفعہ آزمائش کی جاتی ہے‘ پھر بھی وہ توبہ نہیں کرتے اور نہ نصیحت حاصل کرتے ہیں۔"}, {"arabic": " وَ اِذَا مَاۤ اُنۡزِلَتۡ سُوۡرَۃٌ نَّظَرَ بَعۡضُہُمۡ اِلٰی بَعۡضٍ ؕ ہَلۡ یَرٰٮکُمۡ مِّنۡ اَحَدٍ ثُمَّ انۡصَرَفُوۡا ؕ صَرَفَ اللّٰہُ قُلُوۡبَہُمۡ بِاَنَّہُمۡ قَوۡمٌ لَّا یَفۡقَہُوۡنَ ﴿۱۲۷﴾", "english": " And whenever a Surah is sent down, they look at one another, saying, ‘Does any one see you?’ Then they turn away. Allah has turned away their hearts because they are a people who would not understand.", "french": " Et toutes les fois qu’une sourate est révélée, ils se regardent les uns les autres, en disant : « Est-ce que quelqu’un vous voit ? » Puis ils se détournent. Allāh a détourné leurs cœurs parce que ce sont des gens qui ne veulent pas comprendre.", "german": " Und sooft eine Sura herabgesandt wird, schauen sie einander an: \"Sieht euch jemand?\" Dann wenden sie sich ab. Allah hat ihre Herzen abwendig gemacht, weil sie ein Volk sind, das nicht begreifen will.", "spanish": " Cuando se revela un Surah, se miran entre sí, diciéndose: “¿Os ve alguien?”. Luego se retiran. Al-lah ha hecho que sus corazones se alejen porque son un pueblo que no quiere entender.", "urdu": " اور جب کوئی سورۃ نازل ہوتی ہے تو ان میں سے کچھ لوگ دوسروں کی طرف دیکھنے لگتے ہیں تا معلوم کریں کہ کیا کوئی شخص تم کو دیکھ تو نہیں رہا۔ پھر (تسلی کرکے) یہ (لوگ مجلس سے) چلے جاتے ہیں اللہ نے ان کے دلوں کو پھیر دیا ہے کیونکہ وہ ایسے لوگ ہیں جو سمجھتے نہیں۔"}, {"arabic": " لَقَدۡ جَآءَکُمۡ رَسُوۡلٌ مِّنۡ اَنۡفُسِکُمۡ عَزِیۡزٌ عَلَیۡہِ مَا عَنِتُّمۡ حَرِیۡصٌ عَلَیۡکُمۡ بِالۡمُؤۡمِنِیۡنَ رَءُوۡفٌ رَّحِیۡمٌ ﴿۱۲۸﴾", "english": " Surely, a Messenger has come unto you from among yourselves; grievous to him is that you should fall into trouble; he is ardently desirous of your welfare ; and to the believers he is compassionate, merciful.", "french": " Assurément, un Messager de parmi vous-mêmes est venu à vous, qui s’afflige de vous voir en difficultés ; qui est plein de sollicitude à votre égard , qui est particulièrement compatissant et miséricordieux envers les croyants.", "german": " Wahrlich, ein Gesandter ist zu euch gekommen aus eurer Mitte; schmerzlich ist es ihm, dass ihr in Unheil geraten solltet; eure Wohlfahrt begehrt er eifrig; gegen die Gläubigen ist er gütig, barmherzig.", "spanish": " En verdad, os ha llegado un Mensajero de entre vosotros; es penoso ara él que sufráis el infortunio; desea ardientemente vuestro bienestar; y es compasivo y misericordioso con los creyentes.", "urdu": " (اے مومنو)! تمہارے پاس تمہاری ہی قوم کا ایک فرد رسول ہو کر آیا ہے تمہارا تکلیف میں پڑنا اس پر شاق گذرتا ہے اور وہ تمہارے لئے خیر کا بہت بھوکا ہے۔ اور مومنوں کے ساتھ محبت کرنے والا (اور) بہت کرم کرنے والا ہے۔"}, {"arabic": " فَاِنۡ تَوَلَّوۡا فَقُلۡ حَسۡبِیَ اللّٰہُ ۫٭ۖ لَاۤ اِلٰہَ اِلَّا ہُوَ ؕ عَلَیۡہِ تَوَکَّلۡتُ وَ ہُوَ رَبُّ الۡعَرۡشِ الۡعَظِیۡمِ ﴿۱۲۹﴾٪", "english": " But if they turn away, say, ‘Allah is sufficient for me. There is no God but He. In Him do I put my trust, and He is the Lord of the mighty Throne.", "french": " Mais s’ils se détournent, dis : « Allāh me suffit. Il n’y a de dieu que Lui. En Lui je place ma confiance, et c’est Lui le Seigneur du Trône puissant. »", "german": " Doch wenn sie sich abwenden, so sprich: \"Allah ist meine Genüge. Es gibt keinen Gott außer Ihm. Auf Ihn vertraue ich, und Er ist der Herr des mächtigen Throns.\"", "spanish": " Mas si ellos se alejan, diles: “Al-lah me basta. No hay Dios sino Él. En Él pongo mi confianza, y Él es el Señor del Trono poderoso”.", "urdu": " پس اگر وہ پھر جائیں تو تو کہہ دے کہ اللہ میرے لئے کافی ہے اس کے سوا کوئی معبود نہیں۔ میں اسی پر توکل کرتا ہوں اور وہ عرش عظیم کا رب ہے۔"}], "Surah": 9}