{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَیۡلٌ لِّلۡمُطَفِّفِیۡنَ ۙ﴿۲﴾", "english": " Woe unto those who give short measure;", "french": " Malheur à ceux qui donnent courte mesure ;", "german": " Wehe den kurzes Maß Gebenden!", "spanish": " ¡Ay de los que dan una me­dida escasa!;", "urdu": " سودا سلف میں وزن کم کرکے دینے والوں کے لئے عذاب (ہی عذاب) ہے۔"}, {"arabic": " الَّذِیۡنَ اِذَا اکۡتَالُوۡا عَلَی النَّاسِ یَسۡتَوۡفُوۡنَ ۫﴿ۖ۳﴾", "english": " Those who, when they take by measure from other people, take it full;", "french": " Ceux qui, lorsqu’ils prennent des autres exigent la pleine mesure,", "german": " Die, wenn sie sich von den Leuten zumessen lassen, volles Maß verlangen;", "spanish": " Aquellos que, cuando toman la medida de los demás, colman la medida;", "urdu": " (ان کے لئے) جو تول کر لیتے ہیں تو خوب پورا کرکے لیتے ہیں۔"}, {"arabic": " وَ اِذَا کَالُوۡہُمۡ اَوۡ وَّزَنُوۡہُمۡ یُخۡسِرُوۡنَ ﴿ؕ۴﴾", "english": " But when they give by measure to others or weigh to them, they give them less.", "french": " Mais lorsqu’ils donnent aux autres par mesure ou pèsent pour eux, ils leur donnent moins.", "german": " wenn sie ihnen jedoch ausmessen oder auswägen, dann verkürzen sie es.", "spanish": " Pero cuando miden a otros o les pesan, les dan de menos.", "urdu": " اور جب (کوئی چیز) دوسروں کو تول کر دیتے ہیں تو پھر وزن میں کمی کر دیتے ہیں۔"}, {"arabic": " اَلَا یَظُنُّ اُولٰٓئِکَ اَنَّہُمۡ مَّبۡعُوۡثُوۡنَ ۙ﴿۵﴾", "english": " Do not such people know that they will be raised again", "french": " Ceux-là ne savent-ils pas qu’ils seront ressuscités,", "german": " Wissen solche nicht, dass sie auferweckt werden sollen", "spanish": " ¿Esos hombres no saben que serán resucitados,", "urdu": " کیا یہ لوگ یقین نہیں کرتے کہ وہ (زندہ کرکے) اٹھائے جائیں گے۔"}, {"arabic": " لِیَوۡمٍ عَظِیۡمٍ ۙ﴿۶﴾", "english": " Unto a terrible day,", "french": " Un Jour Énorme,", "german": " zu einem Großen Tag,", "spanish": " En un día terrible,", "urdu": " اس عظیم الشان وقت (کا فیصلہ دیکھنے) کے لئے۔"}, {"arabic": " یَّوۡمَ یَقُوۡمُ النَّاسُ لِرَبِّ الۡعٰلَمِیۡنَ ؕ﴿۷﴾", "english": " The day when mankind will stand before the Lord of the worlds?", "french": " Le jour où l’humanité sera debout devant le Seigneur des mondes !", "german": " dem Tag, da die Menschheit vor dem Herrn der Welten stehen wird?", "spanish": " El día en el que la humanidad comparecerá ante el Señor de los mundos?", "urdu": " جس وقت (تمام) لوگ سب جہانوں کے رب (کا فیصلہ سننے) کے لئے کھڑے ہوں گے۔"}, {"arabic": " کَلَّاۤ اِنَّ کِتٰبَ الۡفُجَّارِ لَفِیۡ سِجِّیۡنٍ ؕ﴿۸﴾", "english": " Nay! the record of the wicked is in Sijjin.", "french": " Non , mais le dossier des impies est dans Sijjīn.", "german": " Nein! das (Sünden-)Verzeichnis der Frevler ist in Sidschîn.", "spanish": " ¡No! El registro de los mal­vados está en Siyyin?", "urdu": " ایسا نہیں (جو یہ سمجھتے ہیں) بدکاروں (کی جزا) کا حکم یقیناً ایک دائمی کتاب میں ہے۔"}, {"arabic": " وَ مَاۤ اَدۡرٰٮکَ مَا سِجِّیۡنٌ ؕ﴿۹﴾", "english": " And what should make thee know what Sijjin is?", "french": " Et qu’est-ce qui te ferait savoir ce que c’est que Sijjīn ?", "german": " Und was lehrt dich wissen, was Sidschîn ist? –", "spanish": " Y ¿qué podría darte a conocer lo que es Siyyin?", "urdu": " اور تجھے کس نے بتایا ہے کہ سجین کیا ہے؟"}, {"arabic": " کِتٰبٌ مَّرۡقُوۡمٌ ؕ﴿۱۰﴾", "english": " It is a Book written comprehensively .", "french": " C’est un Livre écrit d’une manière détaillée et complète .", "german": " Ein geschriebenes Buch.", "spanish": " Es un Libro escrito de forma íntegra .", "urdu": " وہ ایسا حکم ہے جو (ازل سے) لکھا ہوا ہے۔"}, {"arabic": " وَیۡلٌ یَّوۡمَئِذٍ لِّلۡمُکَذِّبِیۡنَ ﴿ۙ۱۱﴾", "english": " Woe, on that day, unto those who reject,", "french": " Malheur, ce jour-là, à ceux qui rejettent,", "german": " Wehe an jenem Tage den Leugnern!", "spanish": " ¡Ay, en ese día, a quienes rechazan,", "urdu": " اس دن جھٹلانے والوں کے لئے عذاب (ہی عذاب) ہوگا۔"}, {"arabic": " الَّذِیۡنَ یُکَذِّبُوۡنَ بِیَوۡمِ الدِّیۡنِ ﴿ؕ۱۲﴾", "english": " Who deny the Day of Judgment.", "french": " Qui nient le jour du Jugement.", "german": " Die den Tag des Gerichts leugnen.", "spanish": " A quienes niegan el Día del Juicio!", "urdu": " ان (ایسے جھٹلانے والوں) کے لئے جو جزا سزا کے دن کا انکار کرتے ہیں۔"}, {"arabic": " وَ مَا یُکَذِّبُ بِہٖۤ اِلَّا کُلُّ مُعۡتَدٍ اَثِیۡمٍ ﴿ۙ۱۳﴾", "english": " And none denies it save every sinful transgressor,", "french": " Et nul ne le nie, sauf chaque transgresseur pécheur,", "german": " Und es leugnet ihn keiner als ein jeder sündhafter Übertreter,", "spanish": " Mas nadie lo niega salvo todo trasgresor pecador,", "urdu": " اور اس کا انکار نہیں کر سکتا مگر وہی جو حد سے نکلا ہوا (اور) سخت گنہگار ہے۔"}, {"arabic": " اِذَا تُتۡلٰی عَلَیۡہِ اٰیٰتُنَا قَالَ اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿ؕ۱۴﴾", "english": " Who , when Our Signs are recited unto him, says: ‘Fables of the ancients!’", "french": " Qui , lorsque Nos Signes lui sont récités, dit : « Des fables des anciens ! »", "german": " (der) wenn ihm Unsere Zeichen vorgetragen werden, spricht: \"Fabeln der Alten!\"", "spanish": " Al que, cuando se le recitan Nuestros Signos, dice: “¡Fábulas de los antiguos!”", "urdu": " جب ایسے لوگوں کے سامنے ہمارے نشانات پڑھے جائیں تو وہ کہہ دیتے ہیں کہ یہ تو پہلے لوگوں کی نقل کردہ باتیں ہیں۔"}, {"arabic": " کَلَّا بَلۡ ٜ رَانَ عَلٰی قُلُوۡبِہِمۡ مَّا کَانُوۡا یَکۡسِبُوۡنَ ﴿۱۵﴾", "english": " Nay, but that which they have earned has rusted their hearts.", "french": " Non , mais ce qu’ils ont gagné par leurs actions leur a rouillé le cœur.", "german": " Nein, jedoch das, was sie zu wirken pflegten, hat auf ihre Herzen Rost gelegt.", "spanish": " No es así, pero lo que han ganado ha corroído sus corazones.", "urdu": " ہرگز (ایسا) نہیں (جیسے وہ کہتے ہیں) بلکہ (اصل بات یہ ہے کہ) ان کے دلوں پر اس نے جو وہ کما چکے ہیں زنگ لگا دیا ہے۔"}, {"arabic": " کَلَّاۤ اِنَّہُمۡ عَنۡ رَّبِّہِمۡ یَوۡمَئِذٍ لَّمَحۡجُوۡبُوۡنَ ﴿ؕ۱۶﴾", "english": " Nay, they will surely be debarred from seeing their Lord on that day.", "french": " Non , mais ce jour-là ils seront assurément privés de la vue de leur Seigneur.", "german": " Nein, sie werden an jenem Tage gewiss von ihrem Herrn getrennt sein.", "spanish": " ¡No!, en verdad se les impedirá la visión de su Señor en ese día.", "urdu": " بلکہ یوں کہو کہ اس دن وہ اپنے رب کے سامنے آنے سے یقیناً روکے جائیں گے۔"}, {"arabic": " ثُمَّ اِنَّہُمۡ لَصَالُوا الۡجَحِیۡمِ ﴿ؕ۱۷﴾", "english": " Then, verily, they will burn in Hell,", "french": " Puis, en vérité, ils brûleront dans la Fournaise de l’Enfer .", "german": " Dann werden sie fürwahr in die Hölle eingehen.", "spanish": " Entonces, arderán ciertamente en el Infierno,", "urdu": " پھر وہ ضرور جہنم میں داخل ہوں گے۔"}, {"arabic": " ثُمَّ یُقَالُ ہٰذَا الَّذِیۡ کُنۡتُمۡ بِہٖ تُکَذِّبُوۡنَ ﴿ؕ۱۸﴾", "english": " Then it will be said to them , ‘This is what you used to reject.’", "french": " Puis il leur sera dit : « Ceci est ce que vous aviez l’habitude de rejeter. »", "german": " Und es wird gesprochen werden: \"Dies ist´s, was ihr zu leugnen pflegtet!\"", "spanish": " Y se les dirá: “Esto es lo que solíais rechazar.”", "urdu": " پھر ان سے کہا جائے گا‘ یہی تو وہ (انجام) ہے جس کا تم انکار کیا کرتے تھے۔"}, {"arabic": " کَلَّاۤ اِنَّ کِتٰبَ الۡاَبۡرَارِ لَفِیۡ عِلِّیِّیۡنَ ﴿ؕ۱۹﴾", "english": " Nay! but the record of the virtuous is surely in ‘Illiyyin.", "french": " Non , mais le dossier des vertueux est assurément dans ‘Illiyyīn.", "german": " Nein! das Verzeichnis der Rechtschaffenen ist gewisslich in ´Illijun.", "spanish": " ¡No! Mas el registro del vir­tuoso está ciertamente en Il-liyyin.", "urdu": " تمہارے خیالات کے خلاف ابرار (کی جزا) کا حکم یقیناً علیین میں ہے۔"}, {"arabic": " وَ مَاۤ اَدۡرٰٮکَ مَا عِلِّیُّوۡنَ ﴿ؕ۲۰﴾", "english": " And what should make thee know what ‘Illiyyun is?", "french": " Et qu’est-ce qui te ferait savoir ce qu’est ‘Illiyyīn ?", "german": " Und was lehrt dich wissen, was ´Illijun ist?", "spanish": " Y ¿qué te dará a conocer lo que es Il-liyun?", "urdu": " اور تجھے کس نے بتایا ہے کہ علیون کیا ہے؟"}, {"arabic": " کِتٰبٌ مَّرۡقُوۡمٌ ﴿ۙ۲۱﴾", "english": " It is a Book written comprehensively .", "french": " C’est un Livre écrit d’une manière détaillée et complète .", "german": " Ein geschriebenes Buch.", "spanish": " Es un Libro escrito de manera completa .", "urdu": " وہ ایک لکھا ہوا حکم ہے۔"}, {"arabic": " یَّشۡہَدُہُ الۡمُقَرَّبُوۡنَ ﴿ؕ۲۲﴾", "english": " The chosen ones of God will witness it.", "french": " Les élus d’Allāh en seront les témoins.", "german": " Die Erwählten (Gottes) werden es schauen.", "spanish": " Los elegidos de Dios serán sus testigos.", "urdu": " جسے مقرب لوگ (خود اپنی آنکھوں سے) دیکھیں گے۔"}, {"arabic": " اِنَّ الۡاَبۡرَارَ لَفِیۡ نَعِیۡمٍ ﴿ۙ۲۳﴾", "english": " Surely the virtuous will be in bliss,", "french": " Assurément, les vertueux seront dans la Félicité,", "german": " Wahrlich, die Tugendhaften werden in Wonne sein.", "spanish": " En verdad, los virtuosos es­tarán en la dicha,", "urdu": " نیکی میں بڑھے ہوئے لوگ یقیناً نعمت (کے مقام) میں رکھے جائیں گے۔"}, {"arabic": " عَلَی الۡاَرَآئِکِ یَنۡظُرُوۡنَ ﴿ۙ۲۴﴾", "english": " Seated on couches, gazing.", "french": " Assis sur des canapés, et observant.", "german": " Auf hohen Pfühlen werden sie zuschauen.", "spanish": " Recostados en lechos, observando.", "urdu": " چھپرکھٹوں پر (بیٹھے سب حال) دیکھ رہے ہوں گے۔"}, {"arabic": " تَعۡرِفُ فِیۡ وُجُوۡہِہِمۡ نَضۡرَۃَ النَّعِیۡمِ ﴿ۚ۲۵﴾", "english": " Thou wilt find in their faces the freshness of bliss.", "french": " Tu reconnaîtras sur leurs visages la fraîcheur de la béatitude.", "german": " Erkennen wirst du auf ihren Gesichtern den Glanz der Seligkeit.", "spanish": " Encontrarás en sus rostros la frescura de la felicidad.", "urdu": " تو (اگر انہیں دیکھے تو) ان کے چہروں میں نعمت کی شادابی محسوس کرے گا۔"}, {"arabic": " یُسۡقَوۡنَ مِنۡ رَّحِیۡقٍ مَّخۡتُوۡمٍ ﴿ۙ۲۶﴾", "english": " They will be given to drink of a pure sealed beverage,", "french": " On leur donnera à boire d’une boisson pure, cachetée.", "german": " Ihnen wird gegeben ein reiner, versiegelter Trank,", "spanish": " Se les dará de beber de una bebida pura, sellada,", "urdu": " انہیں خالص سر بمہر شراب پلائی جائے گی۔"}, {"arabic": " خِتٰمُہٗ مِسۡکٌ ؕ وَ فِیۡ ذٰلِکَ فَلۡیَتَنَافَسِ الۡمُتَنَافِسُوۡنَ ﴿ؕ۲۷﴾", "english": " The sealing of it will be with musk — for this let the aspirants aspire —", "french": " Le cachet en sera de musc. Que les convoitants y aspirent à qui mieux mieux !", "german": " dessen Siegel Moschus ist – und dies mögen die Begehrenden erstreben –,", "spanish": " Cuyo sello se hará con al mizcle ‑que aspiren esto los aspirantes‑", "urdu": " اس کے آخر میں مشک ہوگا۔ اور چاہیے کہ خواہش رکھنے والا (انسان) ایسی (ہی) چیز کی خواہش کریں۔"}, {"arabic": " وَ مِزَاجُہٗ مِنۡ تَسۡنِیۡمٍ ﴿ۙ۲۸﴾", "english": " And it will be tempered with the water of Tasnim,", "french": " Et elle sera tempérée de l’eau de Tasnīm,", "german": " und es wird ihm Tasnîm beigemischt sein:", "spanish": " Y estará suavizada con el agua de Tasním,", "urdu": " اور اس میں تسنیم کی آمیزش ہوگی۔"}, {"arabic": " عَیۡنًا یَّشۡرَبُ بِہَا الۡمُقَرَّبُوۡنَ ﴿ؕ۲۹﴾", "english": " A spring of which the chosen ones will drink.", "french": " Une fontaine de laquelle boiront les élus.", "german": " Ein Quell, aus dem die Erwählten trinken werden.", "spanish": " De cuyo manantial beberán los elegidos.", "urdu": " (ہماری مراد اس) چشمہ (سے) ہے جس سے مقرب لوگ پیئیں گے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ اَجۡرَمُوۡا کَانُوۡا مِنَ الَّذِیۡنَ اٰمَنُوۡا یَضۡحَکُوۡنَ ﴿۫ۖ۳۰﴾", "english": " Those who were guilty used to laugh at those who believed;", "french": " Ceux qui étaient coupables avaient habitude de se moquer de ceux qui croyaient,", "german": " Die Sünder pflegten über die zu lachen, die glaubten;", "spanish": " Los culpables solían burlarse de los creyentes;", "urdu": " وہ لوگ جو مجرم ہوئے‘ یقیناً مومنوں سے ہنسی (ٹھٹھا) کیا کرتے تھے۔"}, {"arabic": " وَ اِذَا مَرُّوۡا بِہِمۡ یَتَغَامَزُوۡنَ ﴿۫ۖ۳۱﴾", "english": " And when they passed by them, they winked at one another.", "french": " Et lorsqu’ils passaient près d’eux, ils se faisaient des clins d’oeil les uns aux autres,", "german": " und wenn sie an ihnen vorübergingen, blinzelten sie einander zu;", "spanish": " Y cuando pasaban cerca de ellos, se hacían señas uno al otro.", "urdu": " اور جب ان کے پاس سے گذرتے تھے تو ایک دوسرے کو آنکھ سے اشارے کیا کرتے تھے۔"}, {"arabic": " وَ اِذَا انۡقَلَبُوۡۤا اِلٰۤی اَہۡلِہِمُ انۡقَلَبُوۡا فَکِہِیۡنَ ﴿۫ۖ۳۲﴾", "english": " And when they returned to their families they returned exulting;", "french": " Et lorsqu’ils retournaient dans leurs familles, ils y retournaient en exultant ;", "german": " und wenn sie zu den Ihren zurückkehrten, kehrten sie frohlockend zurück;", "spanish": " Y cuando volvían con sus familias, regresaban exultantes;", "urdu": " اور جب اپنے گھر والوں کی طرف لوٹتے تھے تو (مسلمانوں کے خلاف) خوب باتیں بناتے ہوئے لوٹتے تھے۔"}, {"arabic": " وَ اِذَا رَاَوۡہُمۡ قَالُوۡۤا اِنَّ ہٰۤؤُلَآءِ لَضَآلُّوۡنَ ﴿ۙ۳۳﴾", "english": " And when they saw them they said, ‘These indeed are the lost ones!’", "french": " Et lorsqu’ils les voyaient, ils disaient : « Ceux-là sont en vérité les égarés. »", "german": " und wenn sie sie sahen, sprachen sie: \"Das sind fürwahr die Irregegangenen!\"", "spanish": " Y cuando los veían, comen­taban: “¡Estos son, en verdad, los extraviados!”", "urdu": " اور جب (بھی) انہیں دیکھتے تھے کہتے تھے کہ یہ لوگ تو بالکل گمراہ ہیں۔"}, {"arabic": " وَ مَاۤ اُرۡسِلُوۡا عَلَیۡہِمۡ حٰفِظِیۡنَ ﴿ؕ۳۴﴾", "english": " But they were not sent as keepers over them.", "french": " Mais ils n’avaient pas été envoyés pour être gardiens sur eux.", "german": " Aber sie sind nicht als Wächter über sie gesandt.", "spanish": " Aunque no fueron enviados como guardianes suyos.", "urdu": " اور حق یہ ہے کہ وہ ان پر نگران بنا کر نہیں بھیجے گئے تھے۔"}, {"arabic": " فَالۡیَوۡمَ الَّذِیۡنَ اٰمَنُوۡا مِنَ الۡکُفَّارِ یَضۡحَکُوۡنَ ﴿ۙ۳۵﴾", "english": " This day, therefore, it is the believers who will laugh at the disbelievers,", "french": " Donc, ce jour, ce sont les croyants qui riront aux dépens des mécréants,", "german": " Heute drum sind es die Gläubigen, die über die Ungläubigen lachen werden.", "spanish": " En este día, pues, serán los creyentes quienes se reirán de los incrédulos,", "urdu": " پس جو ایمان لائے (وہ) اس (جزا سزا کے) دن کفار پر ہنسیں گے۔"}, {"arabic": " عَلَی الۡاَرَآئِکِ ۙ یَنۡظُرُوۡنَ ﴿ؕ۳۶﴾", "english": " Seated on couches, gazing.", "french": " Assis sur des canapés, observant.", "german": " Auf hohen Pfählen werden sie zuschauen.", "spanish": " Sentados en lechos, contemplando.", "urdu": " چھپرکھٹوں پر بیٹھے ہوئے (ان کا سب حال) دیکھ رہے ہوں گے۔"}, {"arabic": " ہَلۡ ثُوِّبَ الۡکُفَّارُ مَا کَانُوۡا یَفۡعَلُوۡنَ ﴿٪۳۷﴾", "english": " Are not the disbelievers duly paid for what they did?", "french": " Les mécréants ne sont-ils pas dûment payés pour ce qu’ils avaient l'habitude de faire ?", "german": " Wird den Ungläubigen nicht vergolten, was sie zu tun pflegten?", "spanish": " ¿Acaso no están debidamente pagados los incrédulos por lo que hicieron?", "urdu": " (اور آپس میں کہیں گے کہ) کیا کافروں کو جو کچھ وہ کیا کرتے تھے (اس کا) پورا بدلہ مل گیا (یا نہیں؟)"}], "Surah": 83}