{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente y Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)۔"}, {"arabic": " حٰمٓ ۚ﴿۲﴾", "english": " Ha Mim.", "french": " Ḥā Mīm (Le Très-Louable, le Seigneur de l’Honneur).", "german": " Hâ Mîm.", "spanish": " Ha Mim.", "urdu": " حمید و مجید (خدا اس سورۃ کو نازل کرنے والا ہے) ۔"}, {"arabic": " تَنۡزِیۡلُ الۡکِتٰبِ مِنَ اللّٰہِ الۡعَزِیۡزِ الۡحَکِیۡمِ ﴿۳﴾", "english": " The revelation of this Book is from Allah, the Mighty, the Wise.", "french": " La révélation de ce Livre provient d’Allāh, le Puissant, le Sage.", "german": " Die Offenbarung des Buches ist von Allah, dem Allmächtigen, dem Allweisen.", "spanish": " La revelación de este Libro procede de Al-lah, el Poderoso, el Sabio.", "urdu": " اللہ (یعنی) غالب اور حکمت والی ہستی کی طرف سے اس کتاب (مجید) کو اتارا گیا ہے۔"}, {"arabic": " مَا خَلَقۡنَا السَّمٰوٰتِ وَ الۡاَرۡضَ وَ مَا بَیۡنَہُمَاۤ اِلَّا بِالۡحَقِّ وَ اَجَلٍ مُّسَمًّی ؕ وَ الَّذِیۡنَ کَفَرُوۡا عَمَّاۤ اُنۡذِرُوۡا مُعۡرِضُوۡنَ ﴿۴﴾", "english": " We have not created the heavens and the earth, and all that is between them, but with truth, and for an appointed term; but those who disbelieve turn away from that of which they have been warned.", "french": " Nous n’avons créé les cieux et la terre, et tout ce qui se trouve entre eux qu’en toute vérité, et pour un terme déterminé ; mais ceux qui refusent de croire se détournent de ce dont ils ont été avertis.", "german": " Wir haben die Himmel und die Erde und das, was zwischen beiden ist, nicht anders erschaffen als in Weisheit und auf eine bestimmte Zeit; die aber nicht daran glauben, wovor sie gewarnt wurden, sie wenden sich ab.", "spanish": " No hemos creado los cielos y la tierra, y todo lo que hay entre ellos, sino con la verdad, y para un plazo fijado; mas los incrédulos se apartan de aquello de lo que han sido advertidos.", "urdu": " (اور وہ کہتا ہے کہ) ہم نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے بلاوجہ پیدا نہیں کیا اور نہ بغیر کوئی مدت مقرر کرنے کے پیدا کیا ہے اور وہ لوگ جنہوں نے انکار کیا ہے وہ اس بات سے اعراض کر رہے ہیں جس سے وہ ڈرائے گئے ہیں۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ مَّا تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ اَرُوۡنِیۡ مَاذَا خَلَقُوۡا مِنَ الۡاَرۡضِ اَمۡ لَہُمۡ شِرۡکٌ فِی السَّمٰوٰتِ ؕ اِیۡتُوۡنِیۡ بِکِتٰبٍ مِّنۡ قَبۡلِ ہٰذَاۤ اَوۡ اَثٰرَۃٍ مِّنۡ عِلۡمٍ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۵﴾", "english": " Say, ‘Do you know what it is you call on beside Allah? Show me what they have created of the earth. Or have they a share in the creation of the heavens? Bring me a Book revealed before this or some vestige of knowledge in your support , if you indeed speak the truth.’", "french": " Dis : « Savez-vous ce que c’est que vous invoquez en dehors d'Allāh ? Montrez-moi ce qu’ils ont créé de la terre. Ou ont-ils une part à la création des cieux ? Apportez-moi un Livre révélé avant celui-ci, ou quelque trace de connaissance à votre appui , si vous êtes véridiques. »", "german": " Sprich: \"Wisst ihr, was das ist, was ihr anruft statt Allah? Zeigt mir, was sie von der Erde erschaffen haben. Oder haben sie einen Anteil an den Himmeln? Bringt mir ein Buch herbei, das vor diesem (offenbart worden), oder eine Spur von Wissen, wenn ihr wahrhaftig seid.\"", "spanish": " Diles: “¿Sabéis qué es lo que invocáis aparte de Al-lah? Mostradme o que han creado en la tierra. ¿Acaso han participado en la creación de los cielos? Traedme un Libro revelado ntes de éste o algún vestigio de conocimiento en apoyo vuestro, si en verdad decís la verdad”.", "urdu": " تو (ان سے) کہہ دے کہ مجھے بتاٶ تو سہی کہ جن کو تم خدا کے سوا پکارتے ہو‘ انہوں نے زمین کی کون کون سی چیز پیدا کی ہے؟ یا ان کا آسمان کی پیدائش میں کوئی دخل ہے۔ اگر تم اس دعویٰ میں سچے ہو‘ تو اس سے پہلے کی کسی کتاب کی دلیل پیش کرو۔ یا اگر (کوئی کتاب نہیں اور) تم سچے ہو‘ تو کوئی علمی دلیل ہی پیش کرو۔"}, {"arabic": " وَ مَنۡ اَضَلُّ مِمَّنۡ یَّدۡعُوۡا مِنۡ دُوۡنِ اللّٰہِ مَنۡ لَّا یَسۡتَجِیۡبُ لَہٗۤ اِلٰی یَوۡمِ الۡقِیٰمَۃِ وَ ہُمۡ عَنۡ دُعَآئِہِمۡ غٰفِلُوۡنَ ﴿۶﴾", "english": " And who is more astray than those who, instead of Allah, pray unto such as will not answer them till the Day of Resurrection, and they are even unconscious of their prayer?", "french": " Et qui est plus égaré que celui qui, au lieu de prier Allāh, prie ceux qui, jusqu’au jour de la Résurrection, ne lui répondront pas, et ils sont même ignorants de leur prière ?", "german": " Und wer ist irrender als jene, die statt zu Allah zu solchen beten, die sie nicht erhören werden bis zum Tage der Auferstehung und die ihres Gebets nicht achten?", "spanish": " ¿Quién está más extraviado que los que, en lugar de Al-lah, imploran a quienes no les responderán hasta el Día de la Resurrección, y ni siquiera prestan atención a su plegaria?", "urdu": " اور اس سے زیادہ گمراہ کون ہو سکتا ہے جو اللہ کے سوا ان (ہستیوں) کو پکارتا ہے جو قیامت تک اس کی کوئی دعا قبول نہیں کر سکتیں‘ بلکہ وہ (ہستیاں) ان کی دعاٶں سے بالکل بے علم ہیں۔"}, {"arabic": " وَ اِذَا حُشِرَ النَّاسُ کَانُوۡا لَہُمۡ اَعۡدَآءً وَّ کَانُوۡا بِعِبَادَتِہِمۡ کٰفِرِیۡنَ ﴿۷﴾", "english": " And when mankind are gathered together they will become enemies to them, and will deny their worship.", "french": " Et lorsque les hommes seront rassemblés, ces soi-disant divinités deviendront leurs ennemies, et désavoueront leur adoration.", "german": " Und wenn die Menschen versammelt werden, werden sie ihre Feinde sein und ihre Anbetung verleugnen.", "spanish": " Mas cuando los humanos sean reunidos juntos, se harán enemigos suyos, y negarán su adoración.", "urdu": " اور جب لوگوں کو دوبارہ زندہ کرکے اٹھایا جائے گا وہ (جھوٹے بنائے ہوئے معبود) ان کے دشمن ہوں گے اور ان کی عبادت کا انکار کریں گے۔"}, {"arabic": " وَ اِذَا تُتۡلٰی عَلَیۡہِمۡ اٰیٰتُنَا بَیِّنٰتٍ قَالَ الَّذِیۡنَ کَفَرُوۡا لِلۡحَقِّ لَمَّا جَآءَہُمۡ ۙ ہٰذَا سِحۡرٌ مُّبِیۡنٌ ؕ﴿۸﴾", "english": " And when Our clear Signs are recited unto them, those who disbelieve say of the truth when it comes to them, ‘This is manifest sorcery.’", "french": " Et lorsque Nos Signes clairs leur sont récités, ceux qui refusent de croire disent de la vérité quand elle vient à eux, « Ceci est de la magie manifeste. »", "german": " Und wenn ihnen Unsere deutlichen Zeichen vorgetragen werden, sagen die Ungläubigen von der Wahrheit, wenn sie zu ihnen kommt: \"Das ist offenkundige Zauberei.\"", "spanish": " Cuando se les recitan Nuestros Signos evidentes, los incrédulos dicen de la verdad cuando les llega: “Es brujería manifiesta”.", "urdu": " اور جب ان کو ہماری کھلی کھلی آیات سنائی جاتی ہیں تو کفار حق کی بات سن کر کہتے ہیں۔ کہ یہ تو ایک کھلا کھلا جادو ہے (پھر ہم اسے کیونکر مانیں) ۔"}, {"arabic": " اَمۡ یَقُوۡلُوۡنَ افۡتَرٰٮہُ ؕ قُلۡ اِنِ افۡتَرَیۡتُہٗ فَلَا تَمۡلِکُوۡنَ لِیۡ مِنَ اللّٰہِ شَیۡئًا ؕ ہُوَ اَعۡلَمُ بِمَا تُفِیۡضُوۡنَ فِیۡہِ ؕ کَفٰی بِہٖ شَہِیۡدًۢا بَیۡنِیۡ وَ بَیۡنَکُمۡ ؕ وَ ہُوَ الۡغَفُوۡرُ الرَّحِیۡمُ ﴿۹﴾", "english": " Do they say, ‘He has forged it?’ Say, ‘If I have forged it, you cannot avail me aught against Allah. He knows best what mischievous talk you indulge in. Sufficient is He for a Witness between me and you. And He is the Most Forgiving, the Merciful.’", "french": " Disent-ils : « Il l’a inventé ! » ? Dis : « Si je l’ai inventé, vous ne pouvez m’être d’aucun secours contre Allāh. Il sait mieux que quiconque ce dont vous discutez vainement. Il suffit comme Témoin entre moi et vous. Et Il est le Très-Pardonnant, le Miséricordieux. »", "german": " Sagen sie: \"Er hat es erdichtet?\" Sprich: \"Wenn ich es erdichtet habe, ihr könnt mir nichts nützen wider Allah. Er weiß am besten, in was für Reden ihr euch ergeht. Er genügt als Zeuge zwischen mir und euch. Und Er ist der Allverzeihende, der Barmherzige.\"", "spanish": " ¿Acaso dicen: “Él lo ha inventado?”. Diles: “Si yo lo hubiera inventado, no podríais servirme de nada contra Al-lah. Él conoce mejor que nadie las conversaciones maliciosas a que os dedicáis. Él basta como Testigo entre vosotros y yo. Pues Él es el Sumo Indulgente, el Misericordioso”.", "urdu": " کیا وہ یہ کہتے ہیں کہ یہ (قرآن) اس نے اپنے پاس سے بنا لیا ہے تو ان سے کہدے کہ اگر میں نے اس کو اپنے پاس سے بنا لیا ہے تو (میں خدا کی سزا کا مستحق ہوں اور) تم مجھے خدا کے عذاب کے کسی حصہ سے بھی بچا نہیں سکتے وہ ان باتوں کو خوب جانتا ہے جو تم بے مطلب کرتے رہتے ہو‘ وہ تمہارے اور میرے درمیان گواہ کے طور پر کافی ہے اور وہ بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " قُلۡ مَا کُنۡتُ بِدۡعًا مِّنَ الرُّسُلِ وَ مَاۤ اَدۡرِیۡ مَا یُفۡعَلُ بِیۡ وَ لَا بِکُمۡ ؕ اِنۡ اَتَّبِعُ اِلَّا مَا یُوۡحٰۤی اِلَیَّ وَ مَاۤ اَنَا اِلَّا نَذِیۡرٌ مُّبِیۡنٌ ﴿۱۰﴾", "english": " Say, ‘I am no new Messenger, nor do I know what will be done with me or with you in this life . I do but follow what is revealed to me; and I am but a plain Warner.’", "french": " Dis : « Je ne suis pas une nouveauté parmi les Messagers, et je ne sais pas non plus ce qui sera fait de moi ni de vous. Je ne fais que suivre ce qui m’est révélé ; et je ne suis qu’un Avertisseur qui avertit clairement. »", "german": " Sprich: \"Ich bin keine neue Erscheinung unter den Gesandten, und ich weiß nicht, was mit mir oder mit euch geschehen wird. Ich folge bloß dem, was mir offenbart ward; und ich bin nur ein aufklärender Warner.\"", "spanish": " Diles: “No soy ningún Mensajero nuevo, ni sé lo que se hará conmigo o con vosotros en esta vida. No hago más que seguir lo que me ha sido revelado, y no soy más que un simple Amonestador”.", "urdu": " تو ان سے کہہ دے کہ میں دنیا میں پہلا رسول تو نہیں آیا (مجھ سے پہلے اور کئی رسول گذر چکے ہیں) اور میں نہیں جانتا کہ میرے ساتھ خدا کیا معاملہ کرے گا۔ اور نہ یہ جانتا ہوں کہ تمہارے ساتھ کیا معاملہ کرے گا میں تو صرف اس وحی کی اتباع کرتا ہوں جو مجھ پر نازل ہوئی ہے اور میں تو صرف ایک کھلا کھلا ڈرانے والا ہوں۔"}, {"arabic": " قُلۡ اَرَءَیۡتُمۡ اِنۡ کَانَ مِنۡ عِنۡدِ اللّٰہِ وَ کَفَرۡتُمۡ بِہٖ وَ شَہِدَ شَاہِدٌ مِّنۡۢ بَنِیۡۤ اِسۡرَآءِیۡلَ عَلٰی مِثۡلِہٖ فَاٰمَنَ وَ اسۡتَکۡبَرۡتُمۡ ؕ اِنَّ اللّٰہَ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿٪۱۱﴾", "english": " Say, ‘Tell me, if this is from Allah and you disbelieve therein, and a witness from among the children of Israel bears witness to the advent of one like him, and he believed, but you are too proud, how should you fare ?’ Verily, Allah guides not the wrongdoing people.", "french": " Dis : « Dites-moi, si ce Livre -çi provient d’Allāh et que vous refusiez d’y croire, et qu’un témoin d’entre les Enfants d’lsraël témoigne de l’avènement de quelqu’un de semblable à lui, et qu’il a cru, et que vous faites preuve d’orgueil, quel sera votre sort ? » En vérité, Allāh ne guide pas le peuple injuste.", "german": " Sprich: \"Saget mir, wenn dies von Allah ist, und ihr lehnt es ab, und ein Zeuge von den Kindern Israels hat Zeugnis abgelegt von jemandem wie er. Er hat geglaubt, ihr aber seid allzu hoffärtig!\" Allah weist dem ungerechten Volk nicht den Weg.", "spanish": " Diles: “Decidme; si esto procede de Al-lah y no creéis en ello, y n testigo de entre los hijos de Israel da testimonio de la aparición de uno como él, y creyó, pero vosotros sois demasiado orgullosos, ¿qué será de vosotros?” . En verdad, Al-lah no guía a los hombres que practican la injusticia.", "urdu": " تو کہدے‘ مجھے بتاٶ تو سہی کہ اگر میری وحی خدا کی طرف سے ہوئی اور تم نے اس کا انکار کر دیا‘ باوجود اس کے کہ بنی اسرائیل میں سے ایک گواہ (یعنی موسیٰ) گواہی دے چکا ہے کہ اس کی مانند ایک شخص ظاہر ہوگا (تو کیا یہ عجیب بات نہیں ہوگی کہ وہ جو پہلے گذرا تھا) وہ تو ایمان لے آیا اور تم (جن کے زمانہ میں وہ آیا ہے) تکبر سے کام لے رہے ہو اللہ ظلم کرنے والوں کو کبھی راہ ہدایت نہیں دکھاتا۔"}, {"arabic": " وَ قَالَ الَّذِیۡنَ کَفَرُوۡا لِلَّذِیۡنَ اٰمَنُوۡا لَوۡ کَانَ خَیۡرًا مَّا سَبَقُوۡنَاۤ اِلَیۡہِ ؕ وَ اِذۡ لَمۡ یَہۡتَدُوۡا بِہٖ فَسَیَقُوۡلُوۡنَ ہٰذَاۤ اِفۡکٌ قَدِیۡمٌ ﴿۱۲﴾", "english": " And those who disbelieve say of those who believe: ‘If it were any good, they could not have been ahead of us in attaining it.’ And since they have not been guided thereby, they will say, ‘This is an old lie.’", "french": " Et ceux qui refusent de croire disent de ceux qui croient : « Si cela était un bien, ils n’auraient pas pu nous avoir dépassés pour l’ accepter . » Et puisqu’ils n’ont pas été guidés par là, ils diront : « Ceci est un vieux mensonge. »", "german": " Und die Ungläubigen sagen von den Gläubigen: \"Wäre er (der Qur-ân) etwas Gutes, sie hätten ihn nicht vor uns erlangt.\" Und da sie sich nicht leiten lassen durch ihn, sagen sie: \"Dies ist eine alte Lüge.\"", "spanish": " Mas quienes no creen dicen de los creyentes: “Si fuese algo bueno, no se nos habrían adelantado para conseguirlo”. Y al no haber sido guiados por ello, dirán: “Esto es una mentira antigua”.", "urdu": " اور کفار مومنوں سے کہتے ہیں کہ اگر قرآن کوئی اچھی تعلیم ہوتا تو یہ (مومن) ہم سے پہلے اس پر ایمان نہ لاتے اور چونکہ ان (کفار) پر اس کی صداقت نہیں کھلی وہ (نامرادی اور غصہ سے یہی بات) کہیں گے کہ یہ تو ایک پرانا جھوٹ ہے (جو پہلے لوگ بھی خدا کے متعلق بولتے آئے ہیں) ۔"}, {"arabic": " وَ مِنۡ قَبۡلِہٖ کِتٰبُ مُوۡسٰۤی اِمَامًا وَّ رَحۡمَۃً ؕ وَ ہٰذَا کِتٰبٌ مُّصَدِّقٌ لِّسَانًا عَرَبِیًّا لِّیُنۡذِرَ الَّذِیۡنَ ظَلَمُوۡا ٭ۖ وَ بُشۡرٰی لِلۡمُحۡسِنِیۡنَ ﴿ۚ۱۳﴾", "english": " And before it there was the Book of Moses, a guide and a mercy; and this is a Book in the Arabic language fulfilling previous prophecies , that it may warn those who do wrong; and as glad tidings to those who do good.", "french": " Et avant ceci, il y a eu le Livre de Moïse, une direction et une miséricorde ; et celui-ci est un Livre en arabe accomplissant les prophéties antérieures afin qu’il avertisse ceux qui font le mal, et est une bonne nouvelle pour ceux qui font le bien.", "german": " Und vor ihm war schon das Buch Mose, Führung und Barmherzigkeit; und dies hier ist ein Buch der Bestätigung in arabischer Sprache, die zu warnen, die freveln, und eine frohe Botschaft denen, die Gutes tun -", "spanish": " Y antes de él estuvo el Libro de Moisés, guía y misericordia; y ste es un Libro en idioma árabe que cumple las profecías anteriores, para amonestar a quienes obran mal; y como buena nueva para quienes hacen el bien.", "urdu": " حالانکہ اس سے پہلے موسیٰ کی کتاب گذر چکی ہے جو راہنمائی کرنے والی بھی تھی اور رحمت بھی تھی۔ اور یہ (قرآن) ایک ایسی کتاب ہے جو اپنے سے پہلی کتابوں کی تصدیق کرتی ہے اور عربی زبان میں ہے تا کہ جنہوں نے ظلم کیا ہے ان کو ڈرائے اور جو لوگ خدائی حکم کے مطابق کام کرتے ہیں ان کو بشارت دے۔"}, {"arabic": " اِنَّ الَّذِیۡنَ قَالُوۡا رَبُّنَا اللّٰہُ ثُمَّ اسۡتَقَامُوۡا فَلَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿ۚ۱۴﴾", "english": " Verily, those who say, ‘Our Lord is Allah,’ and then remain steadfast — no fear shall come upon them, nor shall they grieve.", "french": " En vérité, ceux qui disent : « Notre Seigneur est Allāh, » et qui ensuite restent fermes – aucune crainte ne descendra sur eux, et ils ne seront pas affligés non plus.", "german": " die da sprechen: \"Unser Herr ist Allah\", und danach fest bleiben – keine Furcht soll über sie kommen, noch sollen sie trauern.", "spanish": " En verdad, quienes dicen: “Nuestro Señor es Al-lah” y luego permanecen perseverantes; ningún temor caerá sobre ellos, ni serán afligidos.", "urdu": " (یعنی) وہ لوگ جو یہ کہتے ہیں کہ اللہ ہی ہمارا رب ہے پھر وہ اس دعویٰ پر مضبوطی سے قائم ہو جاتے ہیں سو ایسے لوگوں کو نہ تو کسی آئندہ بات کا ڈر ہوگا اور نہ پچھلے زمانہ کی کسی کوتاہی کا غم ہوگا۔"}, {"arabic": " اُولٰٓئِکَ اَصۡحٰبُ الۡجَنَّۃِ خٰلِدِیۡنَ فِیۡہَا ۚ جَزَآءًۢ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۵﴾", "english": " These are the dwellers of the Garden; they shall abide therein — a recompense for what they did.", "french": " Ceux-là sont les habitants du Jardin ; ils y demeureront éternellement – une récompense pour ce qu’ils faisaient.", "german": " Sie sind des Gartens Bewohner; darin sollen sie weilen auf immer: eine Belohnung für das, was sie zu tun pflegten.", "spanish": " Éstos son los moradores del Jardín. En él habitarán: una recompensa por lo que hicieron.", "urdu": " یہ لوگ جنت میں جانے والے ہیں وہ اس میں اپنے گذشتہ اعمال کے بدلہ کے طور پر رہتے چلے جائیں گے۔"}, {"arabic": " وَ وَصَّیۡنَا الۡاِنۡسَانَ بِوَالِدَیۡہِ اِحۡسٰنًا ؕ حَمَلَتۡہُ اُمُّہٗ کُرۡہًا وَّ وَضَعَتۡہُ کُرۡہًا ؕ وَ حَمۡلُہٗ وَ فِصٰلُہٗ ثَلٰثُوۡنَ شَہۡرًا ؕ حَتّٰۤی اِذَا بَلَغَ اَشُدَّہٗ وَ بَلَغَ اَرۡبَعِیۡنَ سَنَۃً ۙ قَالَ رَبِّ اَوۡزِعۡنِیۡۤ اَنۡ اَشۡکُرَ نِعۡمَتَکَ الَّتِیۡۤ اَنۡعَمۡتَ عَلَیَّ وَ عَلٰی وَالِدَیَّ وَ اَنۡ اَعۡمَلَ صَالِحًا تَرۡضٰہُ وَ اَصۡلِحۡ لِیۡ فِیۡ ذُرِّیَّتِیۡ ۚؕ اِنِّیۡ تُبۡتُ اِلَیۡکَ وَ اِنِّیۡ مِنَ الۡمُسۡلِمِیۡنَ ﴿۱۶﴾", "english": " And We have enjoined on man to be good to his parents. His mother bears him with pain, and brings him forth with pain. And the bearing of him and his weaning takes thirty months, till, when he attains his full maturity and reaches the age of forty years, he says, ‘My Lord, grant me the power that I may be grateful for Thy favour which Thou hast bestowed upon me and upon my parents, and that I may do such good works as may please Thee. And make my seed righteous for me. I do turn to Thee; and, truly, I am of those who submit to Thee .’", "french": " Et Nous avons enjoint à l’homme la bienveillance envers ses parents. Sa mère le porte avec douleur, et le met au monde avec douleur. Et sa gestation et son sevrage durent trente mois, jusqu’à ce qu’étant arrivé à sa pleine maturité, et ayant atteint l’âge de quarante ans, il dise : « Mon Seigneur, donne-moi la capacité d’être reconnaissant pour Ta grâce que Tu m’as accordée, ainsi qu’à mes parents, et de faire de telles bonnes œuvres qui Te plaisent. Et rends mes descendants pieux pour moi. Je me tourne certainement vers Toi avec repentir ; et, en vérité, je suis de ceux qui se soumettent à Toi . »", "german": " Wir haben dem Menschen Güte gegen seine Eltern zur Pflicht gemacht. Seine Mutter trug ihn mit Schmerzen, und mit Schmerzen gebar sie ihn. Und ihn zu tragen und ihn zu entwöhnen erfordert dreißig Monate, bis dann, wenn er seine Vollkraft erlangt und vierzig Jahre erreicht hat, er spricht: \"Mein Herr, sporne mich an, dankbar zu sein für Deine Gnade, die Du mir und meinen Eltern erwiesen hast, und Rechtes zu wirken, das Dir wohlgefallen mag. Und lass mir meine Nachkommenschaft rechtschaffen sein. Siehe, ich wende mich zu Dir; und ich bin einer der Gottergebenen.\"", "spanish": " Hemos ordenado al hombre que sea bueno con sus padres. Su madre lo lleva con incomodidad y lo pare con dolor. Su parto y lactancia dura treinta meses hasta que, cuando alcanza la plena madurez, y cumple cuarenta años, dice: “Señor mío, concédeme el poder para ser agradecido por el favor que me has concedido a mí y a mis padres y para que practique el bien para complacerte. Haz que mi descendencia sea justa. Yo vuelvo ciertamente a Ti y, en verdad, soy de quienes se someten a Tu voluntad.", "urdu": " اور ہم نے انسان کو اپنے والدین سے احسان کی تعلیم دی تھی کیونکہ اس کی ماں نے اس کو تکلیف کے ساتھ پیٹ میں اٹھایا تھا اور پھر تکلیف کے ساتھ اس کو جنا تھا اور اس کے اٹھانے اور اس کے دودھ چھڑانے پر تیس مہینے لگے تھے۔ پھر جب یہ انسان اپنی کامل جوانی یعنی چالیس سال کو پہنچ گیا تو اس نے کہا۔ اے میرے رب! مجھے اس بات کی توفیق دے کہ میں تیری اس نعمت کا شکریہ ادا کروں جو تو نے مجھ پر اور میرے ماں باپ پر کی ہے اور (اس بات کی بھی توفیق دے) کہ میں ایسے اچھے اعمال کروں جن کو تو پسند کرے اور میری اولاد میں بھی نیکی کی بنیاد قائم کر۔ میں تیری طرف جھکتا ہوں اور میں تیرے فرمانبردار بندوں میں سے ہوں۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ نَتَقَبَّلُ عَنۡہُمۡ اَحۡسَنَ مَا عَمِلُوۡا وَ نَتَجَاوَزُ عَنۡ سَیِّاٰتِہِمۡ فِیۡۤ اَصۡحٰبِ الۡجَنَّۃِ ؕ وَعۡدَ الصِّدۡقِ الَّذِیۡ کَانُوۡا یُوۡعَدُوۡنَ ﴿۱۷﴾", "english": " Those are they from whom We accept their good works and overlook their ill deeds. They shall be among the inmates of the Garden, in fulfilment of the true promise which was made to them.", "french": " De ceux-là mêmes que Nous acceptons les meilleures de leurs œuvres ; et Nous passons sur leurs mauvaises actions. Ils seront parmi les habitants du Jardin, selon la vraie promesse qui leur fut faite.", "german": " Das sind die, von denen Wir die guten Werke annehmen, die sie getan, und deren üble Werke Wir übersehen – unter den Bewohnern des Gartens, in Erfüllung der wahrhaftigen Verheißung, die ihnen verheißen ward.", "spanish": " Éstos son de quienes aceptamos sus buenas obras y perdonamos sus alas acciones. Estarán entre los moradores del Jardín, en cumplimiento de la verdadera promesa que se les hizo.", "urdu": " (جو لوگ ایسا کریں گے) وہی لوگ ایسے ہونگے جن کے اچھے اعمال ہم قبول کریں گے اور ان کی بدیوں سے ہم درگذر کریں گے۔ یہ لوگ جنت میں جائیں گے۔ یہ ایک سچا وعدہ ہے۔ جو شروع (پیدائش آدم) سے مومنوں سے کیا جا رہا ہے۔"}, {"arabic": " وَ الَّذِیۡ قَالَ لِوَالِدَیۡہِ اُفٍّ لَّکُمَاۤ اَتَعِدٰنِنِیۡۤ اَنۡ اُخۡرَجَ وَ قَدۡ خَلَتِ الۡقُرُوۡنُ مِنۡ قَبۡلِیۡ ۚ وَ ہُمَا یَسۡتَغِیۡثٰنِ اللّٰہَ وَیۡلَکَ اٰمِنۡ ٭ۖ اِنَّ وَعۡدَ اللّٰہِ حَقٌّ ۚۖ فَیَقُوۡلُ مَا ہٰذَاۤ اِلَّاۤ اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿۱۸﴾", "english": " But the one who says to his parents, ‘Fie on you both! do you threaten me that I shall be brought forth again , when generations have already passed away before me?’ And they both cry unto Allah for help and say to him : ‘Woe unto thee! believe; for the promise of Allah is true.’ But he says, ‘This is nothing but the fables of the ancients.’", "french": " Mais celui qui dit à ses parents : « Fi donc de vous deux ! Me menacez-vous en disant que je serai ramené à la vie, alors que des générations ont déjà disparu avant moi ? » Et tous deux appellent Allāh à leur secours et disent à leur fils : « Malheur à toi ! Crois, car la promesse d’Allāh est vraie. » Mais il dit : « Ce ne sont que des fables des anciens ! »", "german": " Der aber zu seinen Eltern spricht: \"Pfui über euch! Verkündet ihr mir, dass ich auferstehen soll, obwohl Geschlechter schon vor mir dahingegangen sind?\" Und sie rufen beide zu Allah um Hilfe (und sprechen): \"Wehe dir, glaube! denn die Verheißung Allahs ist wahr.\" Er aber antwortet: \"Das sind nichts als Fabeln der Alten.\"", "spanish": " Pero hay quien dice a sus padres: “¡Vergüenza para vosotros! ¿Me amenazáis con que naceré de nuevo , cuando ya han desaparecido eneraciones antes de mí?”. Y ambos invocan a Al-lah pidiendo ayuda y le dicen : “¡Ay de ti! ¡Cree!, pues la promesa de Al-lah es verdadera”. Pero responde: “Esto no es más que fábulas de los antiguos”.", "urdu": " اور (ایک) ایسا شخص (بھی ہوتا ہے) جو اپنے والدین سے کہتا ہے تم پر افسوس! کیا تم مجھے یہ خبر پختہ طور پر دیتے ہو کہ مجھے زندہ کرکے زمین سے نکالا جائے گا‘ اور صدی پر صدی پہلے گذر چکی ہے (لیکن ان میں سے کوئی شخص زندہ ہو کر نہیں آیا) اور (اس کے) دونوں (ماں باپ) اللہ سے فریاد کرتے ہوئے کہتے ہیں۔ اے بچے! تجھ پر افسوس! خدا پر ایمان لا‘ اللہ کا وعدہ ضرور پورا ہو کر رہے گا اس پر وہ انہیں جواب دیتا ہے یہ تو صرف پہلوں کی کہانیاں ہیں۔"}, {"arabic": " اُولٰٓئِکَ الَّذِیۡنَ حَقَّ عَلَیۡہِمُ الۡقَوۡلُ فِیۡۤ اُمَمٍ قَدۡ خَلَتۡ مِنۡ قَبۡلِہِمۡ مِّنَ الۡجِنِّ وَ الۡاِنۡسِ ؕ اِنَّہُمۡ کَانُوۡا خٰسِرِیۡنَ ﴿۱۹﴾", "english": " These are they against whom the sentence of punishment became due, along with the communities of the Jinn and mankind that had gone before them. Indeed, they were the losers.", "french": " Ce sont ceux-là contre qui la condamnation au châtiment est venue à échéance tout comme , avec les communautés des djinns et des hommes qui les avaient devancés. En vérité, ils étaient les perdants.", "german": " So sind die, gegen welche der Spruch (der Strafe) fällig ward, zusammen mit den Scharen der Jinn und der Menschen, die vor ihnen hingingen. Fürwahr, sie sind die Verlierenden gewesen.", "spanish": " Son éstos contra quienes se dictó la sentencia del castigo , junto con los grupos de Yinn y de hombres que les precedieron. En verdad, fueron los perdedores.", "urdu": " ایسے ہی لوگ ہیں جن پر ان امتوں میں سے جو ان سے پہلے گذر چکی ہیں خواہ جنوں میں سے تھیں یا انسانوں میں سے عذاب کی پیشگوئی پوری ہوگئی۔ وہ لوگ گھاٹا پانے والے تھے۔"}, {"arabic": " وَ لِکُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوۡا ۚ وَ لِیُوَفِّیَہُمۡ اَعۡمَالَہُمۡ وَ ہُمۡ لَا یُظۡلَمُوۡنَ ﴿۲۰﴾", "english": " And for all are degrees of rank according to what they did, and that Allah may fully repay them for their deeds; and they shall not be wronged.", "french": " Et pour tous il y a des grades selon ce qu’ils faisaient, et afin qu’ Allāh puisse les récompenser intégralement pour leurs œuvres ; et ils ne seront pas injustement traités.", "german": " Und für alle sind Stufen gemäß dem, was sie tun, auf dass Er ihnen ihre Taten voll vergelte; und kein Unrecht soll ihnen widerfahren.", "spanish": " Y para todos hay grados de medida según lo que hicieron, para que Al-lah les retribuya plenamente por sus acciones; y no serán perjudicados.", "urdu": " اور ان سب کو ان کے اعمال کے مطابق درجات ملیں گے اور یہ اس لئے ہوگا کہ اللہ ان کو ان کے اعمال کا پورا بدلہ دے اور ان پر ظلم نہ کیا جائے۔"}, {"arabic": " وَ یَوۡمَ یُعۡرَضُ الَّذِیۡنَ کَفَرُوۡا عَلَی النَّارِ ؕ اَذۡہَبۡتُمۡ طَیِّبٰتِکُمۡ فِیۡ حَیَاتِکُمُ الدُّنۡیَا وَ اسۡتَمۡتَعۡتُمۡ بِہَا ۚ فَالۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ الۡہُوۡنِ بِمَا کُنۡتُمۡ تَسۡتَکۡبِرُوۡنَ فِی الۡاَرۡضِ بِغَیۡرِ الۡحَقِّ وَ بِمَا کُنۡتُمۡ تَفۡسُقُوۡنَ ﴿٪۲۱﴾", "english": " And on the day when those who disbelieve will be brought before the Fire, it will be said to them , ‘You exhausted your good things in the life of the world, and you fully enjoyed them. Now this day you shall be requited with ignominious punishment because you were arrogant in the earth without justification, and because you acted rebelliously.’", "french": " Et le jour où ceux qui refusent de croire seront présentés au Feu, il leur sera dit : « Vous avez épuisé vos bonnes choses dans votre vie du monde, et vous en avez tiré des bénéfices temporaires. Aujourd’hui, vous serez payés du châtiment ignominieux, parce que, sans raison, vous avez été arrogants sur la terre, et que vous vous êtes rebellés. »", "german": " Und an dem Tage, wenn die Ungläubigen dem Feuer ausgesetzt werden: \"Ihr habt eure guten Dinge im Leben hienieden aufgezehrt, und ihr hattet Genuss daran. Heute nun sollt ihr mit der Strafe der Schmach belohnt werden, weil ihr hoffärtig wart auf Erden ohne alles Recht, und weil ihr Empörer wart.\"", "spanish": " Mas en el día en que los incrédulos sean llevados ante el Fuego, se les dirá: “Agotasteis vuestras cosas buenas en la vida del mundo y disfrutasteis plenamente de ellas. Ahora, en este día, seréis retribuidos con un castigo vergonzoso, porque fuisteis arrogantes en la tierra sin justificación, y actuasteis con rebeldía”.", "urdu": " اور جس دن کافروں کو دوزخ کے سامنے پیش کیا جائے گا (اور کہا جائے گا) تم دنیا کی زندگی میں اپنے سب انعامات ختم کر چکے ہو اور دنیا کی زندگی سے جتنا فائدہ اٹھانا تھا اٹھا چکے ہو۔ پس آج تم کو زمین میں بغیر حق کے تکبر کرنے اور نافرمانی کرنے کی وجہ سے رسوائی کا عذاب دیا جائے گا۔"}, {"arabic": " وَ اذۡکُرۡ اَخَا عَادٍ ؕ اِذۡ اَنۡذَرَ قَوۡمَہٗ بِالۡاَحۡقَافِ وَ قَدۡ خَلَتِ النُّذُرُ مِنۡۢ بَیۡنِ یَدَیۡہِ وَ مِنۡ خَلۡفِہٖۤ اَلَّا تَعۡبُدُوۡۤا اِلَّا اللّٰہَ ؕ اِنِّیۡۤ اَخَافُ عَلَیۡکُمۡ عَذَابَ یَوۡمٍ عَظِیۡمٍ ﴿۲۲﴾", "english": " And make mention of the brother of ‘Ad, when he warned his people among the sand-hills — and Warners there have been before him and after him — saying , ‘Worship none but Allah. I fear for you the punishment of a great day.’", "french": " Et rappelle-toi le frère des ‘Ād, lorsqu’il avertit son peuple parmi les dunes – et ceux qui avertissent vinrent avant lui et après lui – en disant : « N’adorez qu’Allāh ; je crains pour vous le châtiment d’un Jour Énorme. »", "german": " Und gedenke des Bruders der ´Âd, da er sein Volk warnte bei den windgewellten Sandhügeln – und Warner sind schon vor ihm gewesen und nach ihm – (und sprach): \"Dienet Allah allein, denn ich fürchte für euch die Strafe am Großen Tag.\"", "spanish": " Mencionad al hermano de Ad, cuando amonestó a su pueblo entre las unas – aunque hubo amonestadores antes y después de él – diciéndoles: “No adoréis sino a Al-lah. Temo para vosotros el castigo de un gran día”.", "urdu": " اور (اے نبی)! عاد کے بھائی (ہود) کو بھی یاد کر جب اس نے اپنی قوم کو احقاف میں ڈرایا تھا اور اس (ہود) سے پہلے بھی کئی نبی گذر چکے تھے اور اس کے بعد بھی ظاہر ہوئے اور ان میں سے ہر ایک یہ تعلیم دیتا تھا کہ اللہ کے سوا کسی کی پرستش نہ کرو۔ میں تم پر ایک بڑے دن کے عذاب کے آنے سے ڈرتا ہوں۔"}, {"arabic": " قَالُوۡۤا اَجِئۡتَنَا لِتَاۡفِکَنَا عَنۡ اٰلِہَتِنَا ۚ فَاۡتِنَا بِمَا تَعِدُنَاۤ اِنۡ کُنۡتَ مِنَ الصّٰدِقِیۡنَ ﴿۲۳﴾", "english": " They said, ‘Hast thou come to us to turn us away from our gods? Bring us then that with which thou dost threaten us, if indeed thou art of the truthful.’", "french": " Ils dirent : « Es-tu venu auprès de nous pour nous détourner de nos dieux ? Apporte-nous donc ce dont tu nous menaces, si tu es vraiment des véridiques. »", "german": " Sie sprachen: \"Bist du zu uns gekommen, um uns von unseren Göttern abwendig zu machen? So bring über uns, was du uns androhst, wenn du der Wahrhaftigen einer bist.\"", "spanish": " Dijeron: “¿Has venido para apartarnos de nuestros dioses? Tráenos, pues, aquello con lo que nos amenazas, si en verdad eres de los veraces”.", "urdu": " ان لوگوں نے کہا کیا تو ہمارے پاس اس لئے آیا ہے کہ ہمیں اپنے معبودوں سے ہٹا دے اگر اسی طرح ہے تو اپنے سچا ہونے کی صورت میں جس چیز کا تو ہم سے وعدہ کرتا ہے اسے ہمارے پاس لے آ۔"}, {"arabic": " قَالَ اِنَّمَا الۡعِلۡمُ عِنۡدَ اللّٰہِ ۫ۖ وَ اُبَلِّغُکُمۡ مَّاۤ اُرۡسِلۡتُ بِہٖ وَ لٰکِنِّیۡۤ اَرٰٮکُمۡ قَوۡمًا تَجۡہَلُوۡنَ ﴿۲۴﴾", "english": " He said, ‘The knowledge thereof is only with Allah. And I convey to you what I have been sent with, but I see you to be a very ignorant people.’", "french": " Il dit : « C’est Allāh Seul Qui en a la connaissance. Et je vous transmets ce avec quoi j’ai été envoyé, mais je vois que vous êtes un peuple très ignorant. »", "german": " Er sprach: \"Das Wissen (darüber) ist einzig bei Allah. Ich richte euch nur das aus, womit ich gesandt ward, jedoch ich sehe, ihr seid ein unwissendes Volk.\"", "spanish": " Dijo: “ Su conocimiento corresponde sólo a Al-lah. Yo os transmito aquello con lo que se me ha enviado, pero veo que sois un pueblo muy ignorante”.", "urdu": " (ہود نے) کہا کہ حقیقی علم تو اللہ کے پاس ہے اور میں تو صرف وہ تعلیم تم تک پہنچاتا ہوں جس کے پہنچانے کی ذمہ داری خدا نے مجھ پر ڈالی ہے لیکن میں دیکھتا ہوں کہ تم ایک جاہل قوم ہو۔"}, {"arabic": " فَلَمَّا رَاَوۡہُ عَارِضًا مُّسۡتَقۡبِلَ اَوۡدِیَتِہِمۡ ۙ قَالُوۡا ہٰذَا عَارِضٌ مُّمۡطِرُنَا ؕ بَلۡ ہُوَ مَا اسۡتَعۡجَلۡتُمۡ بِہٖ ؕ رِیۡحٌ فِیۡہَا عَذَابٌ اَلِیۡمٌ ﴿ۙ۲۵﴾", "english": " Then, when they saw it coming towards their valleys as a cloud, they said, ‘This is a cloud which will give us rain.’ ‘Nay, but it is that which you sought to hasten — a wind wherein is a grievous punishment.", "french": " Puis, lorsqu’ils le virent s’avancer - le châtiment - vers leurs vallées sous la forme d’un nuage, ils dirent : « Ceci est un nuage qui nous donnera de la pluie. » « Non , mais c’est ce que vous avez cherché à hâter : un vent dans lequel il y a un châtiment douloureux.", "german": " Dann aber, als sie sahen, wie es sich ihren Tälern näherte gleich einer Wolke, sprachen sie: \"Das ist eine Wolke, die uns Regen geben wird.\" \"Nein, es ist vielmehr das, was ihr zu beschleunigen trachtetet – ein Wind, in dem eine schmerzliche Strafe ist.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=46:25&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=46:25&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic26\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic26\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/46:26' style='text-decoration:underline'>46:26</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(26)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control26\"></i></button> <audio id=\"player26\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">تُدَمِّرُ کُلَّ شَیۡءٍۭ بِاَمۡرِ رَبِّہَا فَاَصۡبَحُوۡا لَا یُرٰۤی اِلَّا مَسٰکِنُہُمۡ ؕ کَذٰلِکَ نَجۡزِی الۡقَوۡمَ الۡمُجۡرِمِیۡنَ ﴿۲۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘It will destroy everything by the command of its Lord.’ And they became such that there was nothing left to be seen, except their dwellings. Thus do We requite the guilty people.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘It will destroy everything by the command of its Lord.’ By morning there was nothing to be seen, except their dwellings. Thus do We requite the guilty people. </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">تباہ کر دیتا ہے ہر چیز کو اپنے ربّ کے حکم سے۔ پس وہ ایسے (تباہ) ہوگئے کہ ان کے گھروں کے سوا کچھ دکھائی نہ دیتا تھا۔ اسی طرح ہم مجرم قوم کو جزا دیا کرتے ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">یہ ہوا اپنے رب کے حکم سے ہر چیز کو تباہ کرتی جائے گی۔ پس نتیجہ یہ ہوا کہ ان پر صبح ایسے وقت میں آئی کہ صرف ان کے گھر ہی نظر آتے تھے (سب قوم ریت میں دب گئی) اسی طرح ہم مجرم قوم کو جزا دیا کرتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Il détruira tout par le commandement de son Seigneur. » Et ils devinrent tels qu’il n’y eut plus rien à voir, excepté leurs habitations. C’est ainsi que Nous rétribuons le peuple coupable.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Que destruirá todo por mandato de su Señor”. Y así sucedió, hasta tal punto, que no quedó nada por ver, excepto sus viviendas. Así retribuimos a los culpables.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Er wird alles zerstören nach dem Befehl seines Herrn.\" Und am Morgen wurden sie so, dass nichts mehr blieb als ihre Wohnungen. Also belohnen Wir das schuldige Volk.", "spanish": " Entonces, cuando lo vieron acercándose hacia sus valles como una nube, dijeron: “Es una nube que nos dará la lluvia”. “No, no es sino lo que queríais apresurar: un viento que lleva un severo castigo”.", "urdu": " پس جب اس کی قوم نے اس عذاب کو ایک بادل کی صورت میں اپنی وادیوں کی طرف بڑھتے ہوئے دیکھا تو انہوں نے کہا یہ ایک بادل ہے جو ہم پر بارش برسائے گا (ہم نے کہا) نہیں‘ یہ وہ (عذاب) ہے جس کو تم جلدی مانگتے تھے (یہ) ایک ہوا ہے‘ جس میں دردناک عذاب پوشیدہ ہے۔"}, {"arabic": " وَ لَقَدۡ مَکَّنّٰہُمۡ فِیۡمَاۤ اِنۡ مَّکَّنّٰکُمۡ فِیۡہِ وَ جَعَلۡنَا لَہُمۡ سَمۡعًا وَّ اَبۡصَارًا وَّ اَفۡـِٕدَۃً ۫ۖ فَمَاۤ اَغۡنٰی عَنۡہُمۡ سَمۡعُہُمۡ وَ لَاۤ اَبۡصَارُہُمۡ وَ لَاۤ اَفۡـِٕدَتُہُمۡ مِّنۡ شَیۡءٍ اِذۡ کَانُوۡا یَجۡحَدُوۡنَ ۙ بِاٰیٰتِ اللّٰہِ وَ حَاقَ بِہِمۡ مَّا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿٪۲۷﴾", "english": " And We had established them in what We have established you not; and We gave them ears and eyes and hearts. But their ears and their eyes and their hearts availed them naught since they denied the Signs of Allah; and that at which they used to mock encompassed them.", "french": " Et Nous les avions établis d’une façon meilleure que celle dont Nous vous avons établis, et Nous leur avions donné des oreilles et des yeux et des cœurs. Mais ni leurs oreilles, ni leurs yeux, ni leurs cœurs ne leur furent d’aucun recours, puisqu’ils nièrent les Signes d’Allāh ; et ce dont ils se moquaient les a cernés.", "german": " Wir hatten ihnen Gewalt gegeben über das, worüber Wir euch keine gegeben haben; und Wir hatten ihnen Ohren und Augen und Herzen gegeben. Aber weder ihre Ohren noch ihre Augen noch ihre Herzen nützten ihnen im geringsten, da sie die Zeichen Allahs leugneten; und das, worüber sie zu spotten pflegten, fiel auf sie.", "spanish": " Los habíamos establecido en lo que no os establecimos a vosotros; les dimos oídos, ojos y corazones. Mas sus oídos, sus ojos y sus corazones no les sirvieron de nada puesto que negaron los Signos de Al-lah; y aquello de lo que solían burlarse les rodeó.", "urdu": " اور ہم نے ان کو وہ طاقت بخشی تھی۔ جو طاقت تم کو نہیں بخشی اور ہم نے ان کو تمہاری طرح کان اور آنکھیں اور دل بھی دئے تھے (مگر انہوں نے بھی تمہاری طرح ان چیزوں سے کام نہ لیا) سو ان کے کانوں اور آنکھوں اور دلوں نے ان کو کوئی نفع نہ دیا کیونکہ وہ اللہ کی آیتوں کے انکار پر اصرار کرتے تھے اور جس عذاب سے وہ ٹھٹھا کرتے تھے‘ اسی نے ان کو چاروں طرف سے گھیر لیا۔"}, {"arabic": " وَ لَقَدۡ اَہۡلَکۡنَا مَا حَوۡلَکُمۡ مِّنَ الۡقُرٰی وَ صَرَّفۡنَا الۡاٰیٰتِ لَعَلَّہُمۡ یَرۡجِعُوۡنَ ﴿۲۸﴾", "english": " And We did destroy townships round about you; and We have varied the Signs, that they might turn to Us .", "french": " Et Nous avons sûrement détruit des villes tout autour de vous et Nous avons varié les Signes, afin qu’ils se tournent vers Nous.", "german": " Wir haben bereits Städte rings um euch zerstört; und Wir haben die Zeichen von allen Seiten gezeigt, damit sie sich bekehren.", "spanish": " Destruimos las ciudades que os rodean; y variamos los Signos para que acudieran a Nosotros.", "urdu": " اور ہم ان بستیوں کو بھی ہلاک کر چکے ہیں جو تمہارے اردگرد ہیں۔ اور ہم نے نشانات کو کھول کھول کر بیان کر دیا ہے تا کہ (ان آیات کے مخاطب) اپنی ضد سے باز آئیں۔"}, {"arabic": " فَلَوۡ لَا نَصَرَہُمُ الَّذِیۡنَ اتَّخَذُوۡا مِنۡ دُوۡنِ اللّٰہِ قُرۡبَانًا اٰلِـہَۃً ؕ بَلۡ ضَلُّوۡا عَنۡہُمۡ ۚ وَ ذٰلِکَ اِفۡکُہُمۡ وَ مَا کَانُوۡا یَفۡتَرُوۡنَ ﴿۲۹﴾", "english": " Why, then, did not those help them whom they had taken for gods beside Allah, seeking His nearness through them ? Nay, they were lost to them. That was the result of their lie, and of what they fabricated.", "french": " Pourquoi donc, ne les ont-ils pas aidés, ceux qu’ils avaient pris pour dieux en dehors d’Allāh, afin de s’approcher de Lui ? Non , mais ils leur ont été d’aucun recours. C’était là le résultat de leur mensonge, et de ce qu’ils avaient inventé.", "german": " Warum haben ihnen denn die nicht geholfen, die sie sich zu Göttern genommen hatten statt Allah (und die sie Ihm) nahe bringen sollten? Nein, sie entglitten ihnen. Das war ihre Lüge und was sie zu erfinden pflegten.", "spanish": " ¿Por qué, pues, no les ayudaron aquellos que habían tomado por dioses, buscando Su cercanía a través suyo ? No, se les perdieron. Ese fue el resultado de su mentira y de lo que tramaron.", "urdu": " پھر کیوں نہ ان لوگوں نے جن کو انہوں نے اللہ کے سوا اس لئے معبود بنا رکھا تھا کہ وہ ان کو خدا کے قریب کر دیں ان کی مدد کی‘ بلکہ وہ موقع پر ان (کی آنکھوں) سے غائب ہو گئے اور یہ ان کے جھوٹ اور افترا کا نتیجہ ہے۔"}, {"arabic": " وَ اِذۡ صَرَفۡنَاۤ اِلَیۡکَ نَفَرًا مِّنَ الۡجِنِّ یَسۡتَمِعُوۡنَ الۡقُرۡاٰنَ ۚ فَلَمَّا حَضَرُوۡہُ قَالُوۡۤا اَنۡصِتُوۡا ۚ فَلَمَّا قُضِیَ وَلَّوۡا اِلٰی قَوۡمِہِمۡ مُّنۡذِرِیۡنَ ﴿۳۰﴾", "english": " And remember when We turned towards thee a party of the Jinn who wished to hear the Qur’an and, when they were present at its recitation , they said to one another , ‘Be silent and listen ,’ and, when it was finished, they went back to their people, warning them .", "french": " Et souviens-toi quand Nous avons envoyé vers toi un groupe de djinns, qui voulaient entendre réciter le Coran, et quand ils furent présents à sa récitation , ils se dirent entre eux : « Demeurez silencieux et écoutez, » et quand ce fut terminé, ils retournèrent auprès de leur peuple, en avertisseurs.", "german": " Und (gedenke der Zeit) da Wir eine Schar Jinn dir zuwandten, die den Qur-ân zu vernehmen wünschten; und als sie in seiner Gegenwart waren, sprachen sie: \"Schweiget (und höret zu)\", und als er zu Ende war, kehrten sie warnend zurück zu ihrem Volk.", "spanish": " Acuérdate de cuando dirigimos hacia ti un grupo de los inn que deseaba oír el Corán y, cuando estaban presentes en su recitación, se dijeron mutuamente: “Estad en silencio y escuchad” y, cuando terminó, volvieron a sus gentes, advirtiéndo les.", "urdu": " اور جب ہم جنوں میں سے کچھ لوگوں کو تیری طرف پھیر کر لے آئے جو قرآن سننے کی خواہش رکھتے تھے۔ پس جب وہ (مجلس قرآن خوانی میں) حاضر ہوئے تو انہوں نے ایک دوسرے سے کہا چپ ہو جاٶ۔ پھر جب قرآن کی تلاوت ختم ہو گئی تو وہ اپنی قوم کی طرف واپس چلے گئے اور ان میں جاکر اسلام کی اشاعت شروع کر دی۔"}, {"arabic": " قَالُوۡا یٰقَوۡمَنَاۤ اِنَّا سَمِعۡنَا کِتٰبًا اُنۡزِلَ مِنۡۢ بَعۡدِ مُوۡسٰی مُصَدِّقًا لِّمَا بَیۡنَ یَدَیۡہِ یَہۡدِیۡۤ اِلَی الۡحَقِّ وَ اِلٰی طَرِیۡقٍ مُّسۡتَقِیۡمٍ ﴿۳۱﴾", "english": " They said, ‘O our people, we have heard a Book, which has been sent down after Moses, fulfilling that which is before it; it guides to the truth, and to the right path.", "french": " Ils dirent : « Ô notre peuple, nous avons entendu un Livre, qui a été révélé après Moïse, accomplissant ce qui le précède ; il guide vers la vérité et vers un droit chemin.", "german": " Sie sprachen: \"O unser Volk, wir haben ein Buch gehört, das nach Moses herabgesandt ward, das bestätigend, was schon vor ihm da ist; es leitet zur Wahrheit und zu dem geraden Weg.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=46:31&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=46:31&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic32\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic32\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/46:32' style='text-decoration:underline'>46:32</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(32)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control32\"></i></button> <audio id=\"player32\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">یٰقَوۡمَنَاۤ اَجِیۡبُوۡا دَاعِیَ اللّٰہِ وَ اٰمِنُوۡا بِہٖ یَغۡفِرۡ لَکُمۡ مِّنۡ ذُنُوۡبِکُمۡ وَ یُجِرۡکُمۡ مِّنۡ عَذَابٍ اَلِیۡمٍ ﴿۳۲﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘O our people, respond to Allah’s Summoner and believe in Him. He will forgive you your sins, and protect you from a painful punishment.</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘O our people, respond to Allah’s summoner and believe in Him. He will forgive you your sins, and protect you from a painful punishment,’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اے ہماری قوم! اللہ کی طرف بلانے والے کو لبّیک کہو اور اُس پر ایمان لے آؤ۔ وہ تمہارے گناہ بخش دے گا اور تمہیں دردناک عذاب سے بچائے گا۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اے ہماری قوم! اللہ کی طرف سے نئی کتاب کے لانے والے شخص کی پکار کو قبول کرو اور اس پر ایمان لے آٶ‘ نتیجہ یہ ہوگا کہ اللہ تمہارے گناہوں کو معاف کر دے گا اور تم کو آنے والے دردناک عذاب سے پناہ دے گا۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Ô notre peuple, répondez à celui qui appelle vers Allāh, et croyez en Lui. Il vous pardonnera vos péchés, et vous protégera contre un châtiment douloureux.</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡Oh pueblo nuestro! Responded a quien os emplaza a Al-lah y creed en Él. Él os perdonará vuestros pecados y os protegerá de un doloroso castigo.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">O unser Volk, höret auf Allahs Rufer und glaubet an Ihn. Er wird euch eure Sünden vergeben und euch vor qualvoller Strafe schützen.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=46:32&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=46:32&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic33\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic33\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/46:33' style='text-decoration:underline'>46:33</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(33)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control33\"></i></button> <audio id=\"player33\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ مَنۡ لَّا یُجِبۡ دَاعِیَ اللّٰہِ فَلَیۡسَ بِمُعۡجِزٍ فِی الۡاَرۡضِ وَ لَیۡسَ لَہٗ مِنۡ دُوۡنِہٖۤ اَوۡلِیَآءُ ؕ اُولٰٓئِکَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۳۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘And whoso does not respond to Allah’s Summoner, he cannot escape <em>Him </em>in the earth, nor can he have any protector beside Him. Such are in manifest error.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘And whoso does not respond to Allah’s summoner, he cannot escape <i>Him </i>in the earth, nor can he have any protector beside Him. Such are in manifest error.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\"> اور جو اللہ کی طرف بلانے والے کو لبیک نہیں کہتا تو وہ زمین میں عاجز کرنے والا نہیں بن سکتا اور اُس کے مقابل پر اُس کے کوئی سرپرست نہیں ہوتے۔ یہی وہ لوگ ہیں جو کھلی کھلی گمراہی میں ہیں۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور جو اللہ کی طرف بلانے والے کی بات کو قبول نہیں کرتا وہ اسے دنیا میں ہرا نہیں سکتا اور خدا کے سوا اس کو پناہ دینے والے وجود کہیں نہیں‘ ایسے لوگ کھلی گمراہی میں مبتلا ہوتے ہیں۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Et quiconque ne répond pas au Héraut d’Allāh, ne peut faire échouer <em> Ses plans</em> sur la terre, et ne peut non plus avoir de protecteur en dehors de Lui. Ceux-là sont dans une erreur manifeste. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Mas quien no responda al Invitador a Al-lah, no podrá frustrar Su designio en la tierra ni tener protector fuera de Él. Éstos están en un error evidente”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Und wer nicht auf Allahs Rufer hört, der kann nicht auf Erden entrinnen, noch kann er Beschützer haben außer Ihm. Solche sind in offenkundigem Irrtum.\"", "spanish": " Dijeron: “¡Oh pueblo nuestro! Hemos oído un Libro que ha sido revelado después de Moisés, que cumple todo lo que le precede; guía a la verdad y al camino recto.", "urdu": " (اور) اپنی قوم سے کہا‘ اے ہماری قوم! ہم نے ایک ایسی کتاب کو سنا ہے جو موسیٰ کے بعد اتاری گئی ہے اور جو کتابیں اس سے پہلے اتری ہیں ان کی تصدیق کرتی ہے اور سچ کی طرف اور سیدھے راستہ کی طرف راہنمائی کرتی ہے۔"}, {"arabic": " اَوَ لَمۡ یَرَوۡا اَنَّ اللّٰہَ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ لَمۡ یَعۡیَ بِخَلۡقِہِنَّ بِقٰدِرٍ عَلٰۤی اَنۡ یُّحۡیِۦَ الۡمَوۡتٰی ؕ بَلٰۤی اِنَّہٗ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۳۴﴾", "english": " Have they not seen that Allah, Who created the heavens and the earth and was not wearied by their creation, has the power to give life to the dead? Yea, verily, He has power over all things.", "french": " N’ont-ils pas vu qu’Allāh, Qui a créé les cieux et la terre, et Qui n’a pas été fatigué par leur création, a le pouvoir de donner la vie aux morts ? Oui, en vérité, Il a le pouvoir de faire tout ce qu’Il veut.", "german": " Haben sie nicht gesehen, dass Allah, Der die Himmel und die Erde erschuf und nicht müde ward durch ihre Erschaffung, auch vermag, die Toten lebendig zu machen? Ja, wahrlich, Er vermag alle Dinge zu tun.", "spanish": " ¿No han visto acaso que Al-lah, que creó los cielos y la tierra y no se cansó con su creación, tiene el poder de dar vida a los muertos? Sí, en verdad, Él tiene poder sobre todas las cosas.", "urdu": " کیا وہ نہیں دیکھتے کہ وہ خدا جس نے آسمانوں اور زمینوں کو پیدا کیا ہے اور ان کی پیدائش سے تھکا نہیں وہ اس پر بھی قادر ہے کہ مردوں کو زندہ کرے وہ اپنے ہر ارادہ کو پورا کرنے پر قادر ہے۔"}, {"arabic": " وَ یَوۡمَ یُعۡرَضُ الَّذِیۡنَ کَفَرُوۡا عَلَی النَّارِ ؕ اَلَیۡسَ ہٰذَا بِالۡحَقِّ ؕ قَالُوۡا بَلٰی وَ رَبِّنَا ؕ قَالَ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ تَکۡفُرُوۡنَ ﴿۳۵﴾", "english": " And on the day when those who disbelieve will be brought before the Fire, it will be said to them , ‘Is not this the truth?’ They will say, ‘Aye, by our Lord.’ He will say, ‘Then taste the punishment, because you disbelieved.’", "french": " Et le jour où ceux qui refusent de croire seront présentés au Feu, il leur sera dit : « Ceci n’est-il pas la vérité ? » lls diront : « Mais si, par notre Seigneur ! » Il dira : « Alors goûtez le châtiment, parce que vous avez refusé de croire. »", "german": " Und an dem Tage, wenn die Ungläubigen dem Feuer ausgesetzt werden: \"Ist dies nicht die Wahrheit?\" Sie werden sprechen: \"Ja, bei unserem Herrn.\" Er wird sprechen: \"So kostet nun die Strafe dafür, dass ihr ungläubig wart.\"", "spanish": " En el día en que los incrédulos sean llevados ante el Fuego, se les dirá: “¿No es ésta la verdad?”. Ellos responderán: “Sí, por nuestro Señor”. Él dirá: “Probad, pues, el castigo, por no haber creído”.", "urdu": " اور جس دن کافروں کو آگ کے سامنے پیش کیا جائے گا اور کہا جائے گا کیا یہ حق نہیں؟ وہ کہیں گے ہاں ہاں! ہمیں اپنے رب کی قسم! (یہ بالکل سچ ہے) تب (اللہ) فرمائے گا‘ اچھا تم اپنے کفر کی وجہ سے عذاب کو چکھو۔"}, {"arabic": " فَاصۡبِرۡ کَمَا صَبَرَ اُولُوا الۡعَزۡمِ مِنَ الرُّسُلِ وَ لَا تَسۡتَعۡجِلۡ لَّہُمۡ ؕ کَاَنَّہُمۡ یَوۡمَ یَرَوۡنَ مَا یُوۡعَدُوۡنَ ۙ لَمۡ یَلۡبَثُوۡۤا اِلَّا سَاعَۃً مِّنۡ نَّہَارٍ ؕ بَلٰغٌ ۚ فَہَلۡ یُہۡلَکُ اِلَّا الۡقَوۡمُ الۡفٰسِقُوۡنَ ﴿٪۳۶﴾", "english": " Have patience, then, as had the Messengers of strong determination; and be in no haste about them. On the day when they see that with which they are threatened, it will appear to them as though they had not tarried save for an hour of a day. This warning has been conveyed; and none but the disobedient people shall be destroyed.", "french": " Aie donc de la patience, comme en ont eu les Messagers qui étaient des hommes de grande détermination ; et ne sois pas pressé en ce qui les concerne ; le jour où ils verront ce dont ils sont menacés, il leur semblera n’être restés dans le monde que pendant une heure d’une journée. Le Message a été transmis ; et ne sera anéanti que le peuple rebelle, n'est-ce pas ?", "german": " Gedulde dich denn, wie es die Gesandten taten, die standhaft waren und hochgesinnt; und sei nicht in Hast ihretwegen. An dem Tage, an dem sie das schauen, was ihnen angedroht ward, wird ihnen sein, als hätten sie nur eine Stunde von einem Tag verweilt. Eine Ermahnung! und niemand soll vernichtet werden als das frevelnde Volk.", "spanish": " Ten, pues, paciencia, como lo tuvieron los Mensajeros dotados de fuerte decisión, y no te apresures respecto a ellos. El día en que vean aquello con lo que se les amenaza, les parecerá como si sólo hubiesen permanecido una hora de un día. Esta advertencia ha sido comunicada; y nadie salvo los hombres desobedientes serán destruidos.", "urdu": " پس (اے نبی)! تو بھی (اسی طرح) صبر کر جس طرح پختہ ارادے والے رسول (تجھ سے پہلے) صبر کر چکے ہیں اور ان کے لئے یہ دعا نہ کر کہ ان پر جلدی عذاب آجائے جس دن وہ اپنے موعود عذاب کو دیکھیں گے ان کی حالت ایسی ہوگی کہ گویا وہ اس دنیا میں بہت تھوڑا سا وقت رہے ہیں یہ بات (ان کفار کے لئے) محض ایک نصیحت کے طور پر کہی گئی ہے۔ اور فاسق قوم کے سوا کسی کو ہلاک نہیں کیا جا سکتا۔"}], "Surah": 46}