{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ النَّجۡمِ اِذَا ہَوٰی ۙ﴿۲﴾", "english": " By the stemless plant when it falls,", "french": " Par l’étoile lorsqu’elle tombe,", "german": " Beim Siebengestirn, wenn es sinkt,", "spanish": " Por la estrella cuando cae,", "urdu": " میں ثریا ستارہ کو جب وہ معنوی طور پر نیچے آجائے گا اس امر کی شہادت کے لئے پیش کرتا ہوں۔"}, {"arabic": " مَا ضَلَّ صَاحِبُکُمۡ وَ مَا غَوٰی ۚ﴿۳﴾", "english": " Your companion has neither erred, nor has he gone astray,", "french": " Votre compagnon n’a ni erré, ni ne s’est-il égaré,", "german": " euer Gefährte (Muhammad) ist weder verirrt, noch ist er im Unrecht,", "spanish": " Vuestro compañero no ha errado ni se ha extraviado,", "urdu": " کہ تمہارا ساتھی نہ رستہ بھولا ہے نہ گمراہ ہوا ہے۔"}, {"arabic": " وَ مَا یَنۡطِقُ عَنِ الۡہَوٰی ؕ﴿۴﴾", "english": " Nor does he speak out of his own desire.", "french": " Et ni ne parle-t-il selon son propre désir.", "german": " noch spricht er aus Begierde.", "spanish": " Ni tampoco habla por su propio capricho.", "urdu": " اور وہ اپنی خواہش نفسانی سے کلام نہیں کرتا۔"}, {"arabic": " اِنۡ ہُوَ اِلَّا وَحۡیٌ یُّوۡحٰی ۙ﴿۵﴾", "english": " It is nothing but pure revelation that has been revealed by God .", "french": " Ce n’est rien d’autre que de la révélation pure , révélée par Allāh .", "german": " Nichts als (reine) Offenbarung ist es, was offenbart wird.", "spanish": " No es sino una revelación pura la revelada por Dios.", "urdu": " بلکہ وہ (یعنی اس کا پیش کردہ کلام قرآن مجید) صرف خدا کی طرف سے نازل ہونے والی وحی ہے۔"}, {"arabic": " عَلَّمَہٗ شَدِیۡدُ الۡقُوٰی ۙ﴿۶﴾", "english": " The Lord of mighty powers has taught him,", "french": " Le Seigneur de grands pouvoirs l’a instruit,", "german": " Der an Kräften Mächtige hat ihn gelehrt,", "spanish": " El Señor de grandes fuerzas le ha enseñado,", "urdu": " اس کو (یہ کلام) بڑی قوتوں والے (خدا) نے سکھایا ہے۔"}, {"arabic": " ذُوۡ مِرَّۃٍ ؕ فَاسۡتَوٰی ۙ﴿۷﴾", "english": " The One Possessor of strength. So He manifested His ascendance over everything ,", "french": " Possesseur de Sagacité. Ainsi S’est-Il établi sur Son Trône ,", "german": " dessen Macht sich wiederholt offenbart; sodann setzte Er Sich (auf den Thron);", "spanish": " El del Gran Poder. Quien después se estableció sobre Su Trono.", "urdu": " جس کی قوتیں باربار ظاہر ہونے والی ہیں اور جو اس وقت اپنی طاقتوں کے اظہار کے لئے اپنے عرش پر مضبوطی سے قائم ہو گیا ہے۔"}, {"arabic": " وَ ہُوَ بِالۡاُفُقِ الۡاَعۡلٰی ؕ﴿۸﴾", "english": " And He revealed His Word when he was on the uppermost horizon,", "french": " Il a révélé Sa parole, alors qu'Il était sur l’horizon le plus élevé,", "german": " und er ist am obersten Horizont.", "spanish": " Y reveló Su Palabra cuando se encontraba en el Horizonte más elevado,", "urdu": " اور ہر بالغ نظر والے کو آسمان کے کناروں پر اس کے ظہور کی علامتیں نظر آرہی ہیں۔"}, {"arabic": " ثُمَّ دَنَا فَتَدَلّٰی ۙ﴿۹﴾", "english": " Then he drew nearer to God ; then he came down to mankind ,", "french": " Puis le prophète se rapprocha d’Allāh ; ensuite Il descendit vers l’humanité .", "german": " Dann näherte er sich (Gott); dann stieg Er herab (zu dem Propheten),", "spanish": " Luego se aproximó más a Dios; y más tarde descendió a la humanidad,", "urdu": " اور وہ (یعنی محمد رسول اللہ صلی اللہ علیہ وسلم بندوں کے اس اضطراب کو دیکھ کر اور ان پر رحم کرکے خدا سے ملنے کے لئے) اس کے قریب ہوئے اور وہ (خدا) بھی (محمد رسول اللہ صلعم کی ملاقات کے شوق میں) اوپر سے نیچے آگیا۔"}, {"arabic": " فَکَانَ قَابَ قَوۡسَیۡنِ اَوۡ اَدۡنٰی ۚ﴿۱۰﴾", "english": " So that he became, as it were , one chord to two bows or closer still.", "french": " De sorte qu’il devint comme une corde pour deux arcs, ou encore plus proche.", "german": " so dass er zur Sehne von zwei Bogen wurde oder noch näher.", "spanish": " De modo que quedó, por así decirlo, como una cuerda de dos arcos o aún más cerca.", "urdu": " اور وہ دونوں دو کمانوں کے متحدہ و ترکی شکل میں تبدیل ہو گئے۔ اور ہوتے ہوتے اس سے بھی زیادہ قرب کی صورت اختیار کر لی۔"}, {"arabic": " فَاَوۡحٰۤی اِلٰی عَبۡدِہٖ مَاۤ اَوۡحٰی ﴿ؕ۱۱﴾", "english": " Then He revealed to His servant that which He revealed.", "french": " Alors Il révéla à Son serviteur ce qu’Il révéla.", "german": " Und Er offenbarte Seinem Diener, was Er offenbarte.", "spanish": " Entonces reveló a Su siervo lo que reveló.", "urdu": " پس اس نے اپنے بندے کی طرف وہی وحی نازل کی جس کا وہ فیصلہ کر چکا تھا۔"}, {"arabic": " مَا کَذَبَ الۡفُؤَادُ مَا رَاٰی ﴿۱۲﴾", "english": " The heart of the Prophet was not untrue to that which he saw.", "french": " Le cœur du Prophète ne le trompa pas sur ce qu’il vit.", "german": " Das Herz (des Propheten) hielt Wahrheit dem, was er sah.", "spanish": " El corazón del Profeta no mintió respecto a lo que vio.", "urdu": " (محمد رسول اللہ صلی اللہ علیہ وسلم کے) دل نے جو کچھ دیکھا تھا وہی بیان کیا۔"}, {"arabic": " اَفَتُمٰرُوۡنَہٗ عَلٰی مَا یَرٰی ﴿۱۳﴾", "english": " Will you then dispute with him about what he saw?", "french": " Voulez-vous donc discuter avec lui au sujet de ce qu’il vit ?", "german": " Wollt ihr da mit ihm streiten über das, was er sah?", "spanish": " ¿Disputaréis, pues, con él, respecto a lo que vio?", "urdu": " کیا تم اس سے اس (نظارہ) کے بارہ میں جھگڑتے ہو جو اس (یعنی محمد رسول اللہ) نے (آسمان پر) دیکھا تھا۔"}, {"arabic": " وَ لَقَدۡ رَاٰہُ نَزۡلَۃً اُخۡرٰی ﴿ۙ۱۴﴾", "english": " And certainly, he saw Him a second time also ,", "french": " Et certainement, il Le vit une seconde fois.", "german": " Und er sah es (auch) bei einem anderen Herabsteigen,", "spanish": " Pues ciertamente, Le vio también una segunda vez,", "urdu": " حالانکہ اس نے یہ (نظارہ) ایک دفعہ نہیں دیکھا بلکہ دو دفعہ دیکھا ہے (یعنی ایک اس وقت جب آپ خدا کے قریب ہونے کی کوشش کر رہے تھے اور دوسرے اس وقت جب خدا نے آپ کی طرف نزول فرمایا) ۔"}, {"arabic": " عِنۡدَ سِدۡرَۃِ الۡمُنۡتَہٰی ﴿۱۵﴾", "english": " Near the farthest Lote-tree,", "french": " Près du Jujubier situé à l’extrême limite,", "german": " beim fernsten Lotusbaum,", "spanish": " Junto al árbol del Loto más alejado,", "urdu": " (یعنی) ایک ایسی بیری کے پاس جو انتہائی مقام پر ہے۔"}, {"arabic": " عِنۡدَہَا جَنَّۃُ الۡمَاۡوٰی ﴿ؕ۱۶﴾", "english": " Near which is the Garden of Eternal Abode.", "french": " Près duquel se trouve le Jardin de la Demeure Eternelle.", "german": " neben dem der Garten der Wohnstatt ist.", "spanish": " Cerca del cual está el Jardín de la Morada Eterna.", "urdu": " اسی کے پاس جنت الماویٰ ہے۔"}, {"arabic": " اِذۡ یَغۡشَی السِّدۡرَۃَ مَا یَغۡشٰی ﴿ۙ۱۷﴾", "english": " This was when that which covers covered the Lote-tree.", "french": " Ceci fut lorsque ce qui couvre, couvrit le Jujubier.", "german": " Als den Lotusbaum überflutete, was (ihn) überflutete,", "spanish": " Esto fue cuando lo que cubre cubrió el Loto.", "urdu": " اور یہ نظارہ دیکھا بھی اس وقت تھا جب بیری کو اس چیز نے ڈھانک لیا تھا جو ایسے وقت میں ڈھانکا کرتی ہے (یعنی تجلی الٰہی نے) ۔"}, {"arabic": " مَا زَاغَ الۡبَصَرُ وَ مَا طَغٰی ﴿۱۸﴾", "english": " The eye deviated not, nor did it wander.", "french": " Le regard ne s’est pas détourné ni ne s’est-il égaré.", "german": " da wankte der Blick nicht, noch schweifte er ab.", "spanish": " El ojo no se desvió ni se extralimitó.", "urdu": " نہ تو اس کی آنکھ اس وقت کج ہوئی نہ آگے نکل گئی۔"}, {"arabic": " لَقَدۡ رَاٰی مِنۡ اٰیٰتِ رَبِّہِ الۡکُبۡرٰی ﴿۱۹﴾", "english": " Surely, he saw the greatest of the Signs of his Lord.", "french": " Assurément, il vit le plus grand des Signes de son Seigneur.", "german": " Wahrlich, er hatte eines der größten Zeichen seines Herrn gesehen.", "spanish": " En verdad, él vio el mayor de los Signos de su Señor.", "urdu": " اس وقت اس نے اپنے رب کی بڑی نشانیوں میں سے ایک بڑی نشانی دیکھی۔"}, {"arabic": " اَفَرَءَیۡتُمُ اللّٰتَ وَ الۡعُزّٰی ﴿ۙ۲۰﴾", "english": " Now tell me about Lat and ‘Uzza,", "french": " Alors, avez-vous vu vos divinités Lāt et ‘Uzzā,", "german": " „Ihr aber, habt ihr Lât und Uzzâ betrachtet,", "spanish": " Háblame ahora de Lat y Uzza,", "urdu": " تم بھی ذرا لات اور عزیٰ کا حال سناٶ (کیا ان کی بھی یہی شان ہے؟) ۔"}, {"arabic": " وَ مَنٰوۃَ الثَّالِثَۃَ الۡاُخۡرٰی ﴿۲۱﴾", "english": " And Manat, the third one, another goddess !", "french": " Et Manāt,cette troisième autre !", "german": " und Manât, die dritte, die eine andere ist?", "spanish": " Y de Manat, la tercera, ¡otra diosa!", "urdu": " اور تیسرے منات کا بھی جو ان کے علاوہ ہے۔"}, {"arabic": " اَلَکُمُ الذَّکَرُ وَ لَہُ الۡاُنۡثٰی ﴿۲۲﴾", "english": " ‘What! for you the males and for Him the females!’", "french": " Comment ! Pour vous les mâles, et pour Lui les femelles !", "german": " Wie! sollten euch die Knaben sein und Ihm die Mädchen?", "spanish": " “¡Cómo! ¿Para vosotros los varones y para Él las hembras?”.", "urdu": " کیا تمہارے لئے تو بیٹے ہیں اور خدا کے لئے لڑکیاں؟"}, {"arabic": " تِلۡکَ اِذًا قِسۡمَۃٌ ضِیۡزٰی ﴿۲۳﴾", "english": " That indeed is an unfair division.", "french": " En vérité, cela est un partage inéquitable.", "german": " Das wäre wahrhaftig eine unbillige Verteilung.", "spanish": " En verdad, es un reparto injusto.", "urdu": " یہ تو نہایت ہی ناقص تقسیم ہے۔"}, {"arabic": " اِنۡ ہِیَ اِلَّاۤ اَسۡمَآءٌ سَمَّیۡتُمُوۡہَاۤ اَنۡتُمۡ وَ اٰبَآؤُکُمۡ مَّاۤ اَنۡزَلَ اللّٰہُ بِہَا مِنۡ سُلۡطٰنٍ ؕ اِنۡ یَّتَّبِعُوۡنَ اِلَّا الظَّنَّ وَ مَا تَہۡوَی الۡاَنۡفُسُ ۚ وَ لَقَدۡ جَآءَہُمۡ مِّنۡ رَّبِّہِمُ الۡہُدٰی ﴿ؕ۲۴﴾", "english": " ‘These are but names which you have named — you and your fathers — for which Allah has sent down no authority.’ They follow naught but conjecture and what their souls desire, while there has already come to them guidance from their Lord.", "french": " Ce ne sont là que des noms que vous avez inventés – vous et vos ancêtres – ce pour quoi Allāh n’a fait descendre aucune autorité. Ils ne suivent que la conjecture et ce que leurs âmes désirent alors que la direction leur est déjà venue de la part de leur Seigneur.", "german": "", "spanish": " “Éstos no son más que nombres que les habéis dado –vosotros y vuestros padres– para los que Al-lah no ha concedido autoridad alguna”. No siguen más que a conjeturas y a lo que desean sus almas, aunque ya les ha llegado la guía de su Señor.", "urdu": " یہ تو کچھ نام ہیں جو تم نے اور تمہارے باپ دادا نے رکھ لئے ہیں (ورنہ ان میں حقیقت کچھ بھی نہیں) اللہ نے ان (بتوں) کے لئے کوئی دلیل نہیں اتاری۔ وہ صرف ایک وہم کی اور خواہش نفسانی کی پیروی کر رہے ہیں۔ اور ان کے پاس ان کے رب کی طرف سے ہدایت آچکی ہے (مگر پھر بھی نہیں سمجھتے)"}, {"arabic": " اَمۡ لِلۡاِنۡسَانِ مَا تَمَنّٰی ﴿۫ۖ۲۵﴾", "english": " Can man have whatever he desires?", "french": " L’homme peut-il avoir tout ce qu’il désire ?", "german": " Kann der Mensch denn haben, was er nur wünscht?", "spanish": " ¿Existe para el hombre todo lo que desea?", "urdu": " کیا انسان جو خواہش کرے اسے مل جاتی ہے؟"}, {"arabic": " فَلِلّٰہِ الۡاٰخِرَۃُ وَ الۡاُوۡلٰی ﴿٪۲۶﴾", "english": " Nay, to Allah belong the Hereafter and this world .", "french": " Non, à Allāh appartient la conclusion de toute chose ainsi que tout ce qui la précède.", "german": " Aber Allahs ist die künftige und diese Welt.", "spanish": " No; a Al-lah pertenecen el fin de cada cosa y todo lo que la precede.", "urdu": " سو یاد رہے کہ آخرت اور دنیا کی نعمتیں اللہ ہی کے قبضہ میں ہیں۔"}, {"arabic": " وَ کَمۡ مِّنۡ مَّلَکٍ فِی السَّمٰوٰتِ لَا تُغۡنِیۡ شَفَاعَتُہُمۡ شَیۡئًا اِلَّا مِنۡۢ بَعۡدِ اَنۡ یَّاۡذَنَ اللّٰہُ لِمَنۡ یَّشَآءُ وَ یَرۡضٰی ﴿۲۷﴾", "english": " And how many an angel is there in the heavens, but their intercession shall be of no avail, except after Allah has given permission to whomsoever He wills and pleases.", "french": " Et combien d’anges il y a aux cieux, mais leur intercession ne servira à rien, sauf après qu’Allāh aura accordé la permission en faveur de celui qu’Il veut et qu’Il agrée.", "german": " Und so mancher Engel ist in den Himmeln, dessen Fürbitte nichts nützen wird, es sei denn, nachdem Allah Erlaubnis gegeben hat, wem Er will und wer Ihm beliebt.", "spanish": " Y cuántos ángeles hay en los cielos cuya intercesión no valdrá de nada, salvo después de que Al-lah lo haya permitido, a quien Le plazca y Le agrade.", "urdu": " اور آسمان میں بہت سے فرشتے ہیں کہ ان کی شفاعت (کسی کو) کوئی فائدہ نہیں پہنچاتی۔ سوائے اس کے کہ اللہ ایسا کرنے کی اس شخص کے متعلق اجازت دے‘ جس کو وہ اپنی مرضی کے مطابق پاتا ہو اور پسند کرتا ہو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ لَیُسَمُّوۡنَ الۡمَلٰٓئِکَۃَ تَسۡمِیَۃَ الۡاُنۡثٰی ﴿۲۸﴾", "english": " Those who believe not in the Hereafter name the angels with names of females;", "french": " En vérité, ceux qui ne croient pas à l’au-delà donnent aux anges des noms de femelles ;", "german": " Solche, die nicht ans Jenseits glauben, die benennen die Engel mit weiblichen Namen;", "spanish": " Quienes no creen en el Más Allá dan a los ángeles nombres femeninos;", "urdu": " جو لوگ آخرت پر ایمان نہیں لاتے‘ وہ فرشتوں کے عورتوں جیسے نام رکھتے ہیں۔"}, {"arabic": " وَ مَا لَہُمۡ بِہٖ مِنۡ عِلۡمٍ ؕ اِنۡ یَّتَّبِعُوۡنَ اِلَّا الظَّنَّ ۚ وَ اِنَّ الظَّنَّ لَا یُغۡنِیۡ مِنَ الۡحَقِّ شَیۡئًا ﴿ۚ۲۹﴾", "english": " But they have no knowledge thereof. They follow nothing but conjecture; and conjecture avails naught against truth.", "french": " Mais ils n’en ont aucune connaissance. Ils ne suivent rien d’autre que des conjectures ; et les conjectures ne servent à rien contre la vérité.", "german": " jedoch sie haben kein Wissen hiervon. Sie folgen einem bloßen Wahn; und der Wahn vermag nichts gegen die Wahrheit.", "spanish": " Mas carecen de conocimiento al respecto. No hacen sino seguir las conjeturas; y la conjetura no sirve de nada frente a la verdad.", "urdu": " اور اُن کو اس بارہ میں کوئی بھی علم نہیں‘ وہ صرف ایک وہم میں مبتلا ہیں اور وہم حق کے مقابلہ میں کچھ بھی فائدہ نہیں دیتا۔"}, {"arabic": " فَاَعۡرِضۡ عَنۡ مَّنۡ تَوَلّٰی ۬ۙ عَنۡ ذِکۡرِنَا وَ لَمۡ یُرِدۡ اِلَّا الۡحَیٰوۃَ الدُّنۡیَا ﴿ؕ۳۰﴾", "english": " So turn aside from him who turns away from Our remembrance, and seeks nothing but the life of this world.", "french": " Détourne-toi donc de celui qui se détourne du souvenir de Nous, et qui ne recherche que la vie de ce monde.", "german": " Drum wende dich ab von dem, der Unserer Ermahnung den Rücken kehrt und nichts begehrt als das Leben in dieser Welt.", "spanish": " Apártate, pues, de quien vuelve la espalda ante Nuestro recuerdo y sólo busca la vida de este mundo.", "urdu": " اور جو شخص ہمارے ذکر سے منہ پھیر لیتا ہے اور سوائے دنیا کی زندگی کے اور کچھ نہیں چاہتا تو بھی اس کی طرف سے منہ پھیر لے اور اس کی پیروی نہ کر۔"}, {"arabic": " ذٰلِکَ مَبۡلَغُہُمۡ مِّنَ الۡعِلۡمِ ؕ اِنَّ رَبَّکَ ہُوَ اَعۡلَمُ بِمَنۡ ضَلَّ عَنۡ سَبِیۡلِہٖ ۙ وَ ہُوَ اَعۡلَمُ بِمَنِ اہۡتَدٰی ﴿۳۱﴾", "english": " That is the utmost limit of their knowledge. Verily, thy Lord knows him best who strays from His way, and He knows him best who follows guidance.", "french": " C’est là la limite extrême de leurs connaissances. En vérité, ton Seigneur connaît le mieux celui qui s’égare de Son chemin, et Il connaît le mieux celui qui suit la bonne direction.", "german": " Das ist die Summe ihres Wissens. Wahrlich, dein Herr kennt den recht wohl, der von Seinem Wege abirrt, und Er kennt auch jenen wohl, der den Weg befolgt.", "spanish": " Esto es a lo más que llega su conocimiento. En verdad, tu Señor conoce muy bien a quien se extravía de Su camino, y conoce muy bien a quien sigue la guía.", "urdu": " یہ ان لوگوں کے علم کی انتہا ہے۔ تیرا رب یقیناً اس شخص کو خوب جانتا ہے جو اس کے راستہ سے بھٹک جاتا ہے اور اس کو بھی خوب جانتا ہے۔ جو سیدھے راستے کو اختیار کر لیتا ہے۔"}, {"arabic": " وَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ۙ لِیَجۡزِیَ الَّذِیۡنَ اَسَآءُوۡا بِمَا عَمِلُوۡا وَ یَجۡزِیَ الَّذِیۡنَ اَحۡسَنُوۡا بِالۡحُسۡنٰی ﴿ۚ۳۲﴾", "english": " And to Allah belongs whatever is in the heavens and whatever is in the earth, that He may requite those who do evil for what they have wrought, and that He may reward with what is best those who do good.", "french": " Et à Allāh appartiennent tout ce qui est dans les cieux et tout ce qui est sur la terre, afin qu’Il puisse rétribuer ceux qui font le mal selon ce qu’ils ont fait, et afin qu’Il puisse récompenser avec ce qu’il y a de mieux ceux qui font le bien.", "german": " Und Allahs ist, was in den Himmeln und was auf Erden ist, auf dass Er denen, die Böses tun, ihren Lohn gebe für das, was sie gewirkt, und dass Er die, die Gutes tun, mit dem Allerbesten belohne,", "spanish": " Pues a Al-lah pertenece cuanto hay en los cielos y cuanto hay en la tierra, para retribuir a los que hacen el mal por lo que forjaron, y recompensar con lo mejor a quienes practican el bien.", "urdu": " اور آسمانوں اور زمین میں جو کچھ ہے سب اللہ کے قبضہ میں ہے اس کا یہ نتیجہ ہوتا ہے کہ جنہوں نے بدی کی وہ اس کے عمل کے مطابق ان کو بدلہ دیتا ہے اور جنہوں نے نیکی کی ان کو نیک بدلے دیتا ہے۔"}, {"arabic": " اَلَّذِیۡنَ یَجۡتَنِبُوۡنَ کَبٰٓئِرَ الۡاِثۡمِ وَ الۡفَوَاحِشَ اِلَّا اللَّمَمَ ؕ اِنَّ رَبَّکَ وَاسِعُ الۡمَغۡفِرَۃِ ؕ ہُوَ اَعۡلَمُ بِکُمۡ اِذۡ اَنۡشَاَکُمۡ مِّنَ الۡاَرۡضِ وَ اِذۡ اَنۡتُمۡ اَجِنَّۃٌ فِیۡ بُطُوۡنِ اُمَّہٰتِکُمۡ ۚ فَلَا تُزَکُّوۡۤا اَنۡفُسَکُمۡ ؕ ہُوَ اَعۡلَمُ بِمَنِ اتَّقٰی ٪﴿۳۳﴾", "english": " Those who shun the grave sins and immoral actions except minor faults — verily, thy Lord is very liberal in forgiving. He knows you full well from the time when He created you from the earth, and when you were embryos in the bellies of your mothers. So ascribe not purity to yourselves. He knows him best who is truly righteous.", "french": " Ceux qui fuient les péchés graves et toutes les indécences sauf les fautes légères – en vérité, ton Seigneur est Prodigue de Son pardon. Il vous connaît mieux que quiconque quand Il vous a créés de la terre, et aussi quand vous n’étiez que des embryons dans le ventre de votre mère. Ne vous attribuez donc pas la pureté. Il connaît le mieux celui qui est vraiment pieux.", "german": " jene, die die schlimmsten Sünden und Schändlichkeiten meiden, bis auf leichte Vergehen – wahrlich, deines Herrn Verzeihung ist weitumfassend. Er kennt euch sehr wohl (von der Zeit her), da Er euch aus der Erde hervorbrachte und da ihr Keimlinge wart in eurer Mütter Schoß. Drum erklärt euch nicht selber als rein. Ihm ist am besten kund, wer sich vor Bösem hütet.", "spanish": " Quienes se abstienen de los pecados mayores y de la indecencia, -salvo los errores menores-; en verdad, tu Señor es generoso en la indulgencia. Él os conoce muy bien desde el momento en que os creó de la tierra y cuando erais embriones en los vientres de vuestras madres. No os adjudiquéis, pues, la pureza a vosotros mismos. Él sabe mejor que nadie quién es el verdaderamente justo.", "urdu": " (یعنی) ایسے لوگ جو بڑے بڑے گناہوں اور کھلی بدکاریوں سے بچتے رہتے ہیں مگر یہ کہ ذرا سا (گناہ کو) چھو جائیں (پھر پچھتانے لگیں) تیرا رب بڑی وسیع مغفرت والا ہے۔ وہ اس وقت سے تم کو خوب جانتا ہے جب اس نے تم کو زمین میں پیدا کیا اور جبکہ تم اپنی ماٶں کے پیٹ میں پوشیدہ تھے۔ پس اپنی جانوں کو پاک مت قرار دو۔ متقیوں کو اللہ ہی خوب جانتا ہے۔"}, {"arabic": " اَفَرَءَیۡتَ الَّذِیۡ تَوَلّٰی ﴿ۙ۳۴﴾", "english": " Dost thou see him who turns away,", "french": " Vois-tu celui qui se détourne,", "german": " Siehst du den, der sich abkehrt", "spanish": " ¿Ves acaso a quien se aleja,", "urdu": " کیا تو اس شخص کو جانتا ہے جس نے (تیری وحی سے) منہ پھیر لیا۔"}, {"arabic": " وَ اَعۡطٰی قَلِیۡلًا وَّ اَکۡدٰی ﴿۳۵﴾", "english": " And gives a little, and does it grudgingly?", "french": " Et qui donne peu, et cela aussi à contre cœur ?", "german": " und wenig gibt und kargt?", "spanish": " Y da muy poco, y lo hace a regañadientes?", "urdu": " اور (خدا کے رستہ میں) تھوڑا سا دیا اور پھر بخل سے کام لینے لگ گیا۔"}, {"arabic": " اَعِنۡدَہٗ عِلۡمُ الۡغَیۡبِ فَہُوَ یَرٰی ﴿۳۶﴾", "english": " Has he the knowledge of the unseen so that he can see?", "french": " A-t-il la connaissance de l’invisible, de sorte qu’il peut voir ?", "german": " Hat er wohl Kenntnis des Verborgenen, dass er es sehen könnte?", "spanish": " ¿Tiene acaso el conocimiento de lo invisible para poder ver?", "urdu": " کیا اس کے پاس علم غیب ہے؟ اور وہ (اپنا انجام) دیکھ رہا ہے۔"}, {"arabic": " اَمۡ لَمۡ یُنَبَّاۡ بِمَا فِیۡ صُحُفِ مُوۡسٰی ﴿ۙ۳۷﴾", "english": " Has he not been informed of what is in the Scriptures of Moses", "french": " N’a-t-il pas été informé de ce qu’il y a dans les Ecritures de Moïse,", "german": " Oder ist ihm nicht erzählt worden, was in den Büchern Mose steht,", "spanish": " ¿No ha sido informado de lo que hay en las Escrituras de Moisés,", "urdu": " کیا اسے موسیٰ اور وفادار ابراہیم کی کتابوں میں جو کچھ ہے‘ اس کا علم نہیں دیا گیا؟"}, {"arabic": " وَ اِبۡرٰہِیۡمَ الَّذِیۡ وَفّٰۤی ﴿ۙ۳۸﴾", "english": " And of Abraham who fulfilled the commandments ? —", "french": " Et d ’Abraham qui fut fidèle à son engagement ? –", "german": " und Abrahams, der (die Gebote) hielt?", "spanish": " Y de Abraham, quien cumplió los mandamientos?", "urdu": " کیا اسے موسیٰ اور وفادار ابراہیم کی کتابوں میں جو کچھ ہے‘ اس کا علم نہیں دیا گیا؟"}, {"arabic": " اَلَّا تَزِرُ وَازِرَۃٌ وِّزۡرَ اُخۡرٰی ﴿ۙ۳۹﴾", "english": " That no bearer of burden shall bear the burden of another;", "french": " Qu’aucun porteur de fardeau ne portera le fardeau d’un autre ;", "german": " Dass keine Lasttragende die Last einer anderen tragen soll,", "spanish": " –Que ningún portador de carga llevará la carga de otro-;", "urdu": " (جو یہ ہے کہ) کہ کوئی بوجھ اٹھانے والی جان دوسرے کا بوجھ نہیں اٹھا سکتی۔"}, {"arabic": " وَ اَنۡ لَّیۡسَ لِلۡاِنۡسَانِ اِلَّا مَا سَعٰی ﴿ۙ۴۰﴾", "english": " And that man will have nothing but what he strives for;", "french": " Et que l’homme n’aura rien que le fruit de ses efforts ;", "german": " und dass der Mensch nichts empfangen soll, als was er erstrebt,", "spanish": " Y que no hay nada para el hombre sino el fruto de sus afanes;", "urdu": " اور انسان کو وہی ملتا ہے جس کی وہ کوشش کرتا ہے۔"}, {"arabic": " وَ اَنَّ سَعۡیَہٗ سَوۡفَ یُرٰی ﴿۪۴۱﴾", "english": " And that his striving shall soon be seen;", "french": " Et que son effort sera bientôt reconnu ;", "german": " und dass sein Streben bald gesehen werden wird.", "spanish": " Y que su esfuerzo será pronto reconocido.", "urdu": " (نیز ان صحف میں لکھا ہے کہ) وہ (انسان) اپنی کوشش کا نتیجہ ضرور دیکھ لے گا۔"}, {"arabic": " ثُمَّ یُجۡزٰٮہُ الۡجَزَآءَ الۡاَوۡفٰی ﴿ۙ۴۲﴾", "english": " Then will he be rewarded for it with the fullest reward;", "french": " Alors il en sera récompensé avec la récompense intégrale ;", "german": " Dann wird er dafür belohnt werden mit dem vollsten Lohn.", "spanish": " Después, será gratificado con la recompensa más completa;", "urdu": " اور اس کو پوری جزا مل جائے گی۔"}, {"arabic": " وَ اَنَّ اِلٰی رَبِّکَ الۡمُنۡتَہٰی ﴿ۙ۴۳﴾", "english": " And that to thy Lord do all things ultimately go;", "french": " Et que finalement tout doit parvenir auprès de ton Seigneur ;", "german": " Und dass zu deinem Herrn die endgültige Heimkehr ist,", "spanish": " Pues todo culmina con tu Señor.", "urdu": " اور یہ بھی کہ (گزشتہ اور موجودہ تمام قوموں کا) آخری فیصلہ تیرے رب کے ہاتھ میں ہی ہے۔"}, {"arabic": " وَ اَنَّہٗ ہُوَ اَضۡحَکَ وَ اَبۡکٰی ﴿ۙ۴۴﴾", "english": " And that it is He Who makes men laugh and makes them weep;", "french": " Et que c’est Lui Qui fait rire les gens et Qui les fait pleurer ;", "german": " und dass Er es ist, Der lachen macht und weinen,", "spanish": " Y Él es quien hace reír a los hombres y les hace llorar;", "urdu": " اور یہ کہ وہی ہنساتا ہے اور وہی رلاتا ہے۔"}, {"arabic": " وَ اَنَّہٗ ہُوَ اَمَاتَ وَ اَحۡیَا ﴿ۙ۴۵﴾", "english": " And that it is He Who causes death and gives life;", "french": " Et que c’est Lui Qui cause la mort et Qui donne la vie ;", "german": " und dass Er es ist, Der Tod und Leben gibt,", "spanish": " Él es Quien causa la muerte y da la vida;", "urdu": " اور وہی مارتا ہے اور وہی زندہ کرتا ہے۔"}, {"arabic": " وَ اَنَّہٗ خَلَقَ الزَّوۡجَیۡنِ الذَّکَرَ وَ الۡاُنۡثٰی ﴿ۙ۴۶﴾", "english": " And that He creates the pairs, male and female,", "french": " Et qu’Il crée les paires, mâle et femelle,", "german": " und dass Er die zwei Geschlechter schafft, männlich und weiblich,", "spanish": " Quien crea las parejas, macho y hembra,", "urdu": " اور اسی نے نطفہ سے جبکہ وہ (ماں کے پیٹ میں) گرایا جاتا ہے (تمام جانداروں کو) نر اور مادہ کی صورت میں پیدا کیا ہے۔"}, {"arabic": " مِنۡ نُّطۡفَۃٍ اِذَا تُمۡنٰی ﴿۪۴۷﴾", "english": " From a sperm-drop when it is poured forth;", "french": " D’une goutte de sperme lorsqu’elle est émise ;", "german": " aus einem Samentropfen, da er vergossen wird,", "spanish": " De una gota de esperma cuando es eyaculada;", "urdu": " اور اسی نے نطفہ سے جبکہ وہ (ماں کے پیٹ میں) گرایا جاتا ہے"}, {"arabic": " وَ اَنَّ عَلَیۡہِ النَّشۡاَۃَ الۡاُخۡرٰی ﴿ۙ۴۸﴾", "english": " And that it is for Him to bring forth the second creation;", "french": " Et que c’est à Lui qu’il appartient de réaliser la seconde création ;", "german": " und dass Ihm eine zweite Schöpfung obliegt,", "spanish": " Y a Él corresponde producir la segunda creación;", "urdu": " اور یہ کہ دوبارہ پیدا کرنا بھی اسی کے ذمہ ہے۔"}, {"arabic": " وَ اَنَّہٗ ہُوَ اَغۡنٰی وَ اَقۡنٰی ﴿ۙ۴۹﴾", "english": " And that it is He Who enriches and grants wealth to one ’ s satisfaction;", "french": " Et que c’est Lui Qui enrichit et accorde des biens jusqu’à pleine satisfaction.", "german": " und dass Er allein reich macht und arm macht,", "spanish": " Él es Quien enriquece y concede posesiones para satisfacción de cada cual ;", "urdu": " اور یہ کہ وہی غنی بناتا ہے اور وہی غریب بناتا ہے۔"}, {"arabic": " وَ اَنَّہٗ ہُوَ رَبُّ الشِّعۡرٰی ﴿ۙ۵۰﴾", "english": " And that He is the Lord of Sirius;", "french": " Et que c’est Lui le Seigneur de Sirius ;", "german": " und dass Er der Herr des Sirius ist,", "spanish": " Él es el Señor de Sirio;", "urdu": " اور وہی شعریٰ (ستارے) کا مالک ہے۔"}, {"arabic": " وَ اَنَّہٗۤ اَہۡلَکَ عَادَ اۨ الۡاُوۡلٰی ﴿ۙ۵۱﴾", "english": " And that He destroyed the first tribe of ‘Ad,", "french": " Et que c’est Lui Qui a anéanti les premiers ‘Ād", "german": " und dass Er die einstigen ´Âd vernichtete", "spanish": " Él es Quien destruyó la primera tribu de Ad,", "urdu": " اور اسی نے سب سے پہلی عاد قوم کو ہلاک کیا تھا۔"}, {"arabic": " وَ ثَمُوۡدَا۠ فَمَاۤ اَبۡقٰی ﴿ۙ۵۲﴾", "english": " And the tribe of Thamud, and He spared not any of them ,", "french": " Et les Thamūd, et Il n’en a rien épargné.", "german": " und die Thamûd, und keinen verschonte;", "spanish": " Y la tribu de Zamud, sin dejar a ninguno de ellos,", "urdu": " اور ان کے بعد ثمود کو بھی (جو عاد ہی کی قوم کا ایک حصہ تھے) اور (عذاب نے) ان کا کچھ نہیں چھوڑا تھا۔"}, {"arabic": " وَ قَوۡمَ نُوۡحٍ مِّنۡ قَبۡلُ ؕ اِنَّہُمۡ کَانُوۡا ہُمۡ اَظۡلَمَ وَ اَطۡغٰی ﴿ؕ۵۳﴾", "english": " And He destroyed the people of Noah before them — verily, they were most unjust and most rebellious —", "french": " Et Il a détruit le peuple de Noé avant eux – en vérité, ils étaient plus injustes et plus rebelles –", "german": " und vordem das Volk Noahs – fürwahr, sie waren höchst ungerecht und widerspenstig –,", "spanish": " Y destruyó al pueblo de Noé antes que ellos – en verdad, fueron de los más injustos y rebeldes–", "urdu": " اور ان سے پہلے نوح کی قوم کو بھی۔ وہ بڑا ظلم کرتے تھے اور بڑے سرکش تھے۔"}, {"arabic": " وَ الۡمُؤۡتَفِکَۃَ اَہۡوٰی ﴿ۙ۵۴﴾", "english": " And He overthrew the subverted cities of the people of Lot ,", "french": " Et Il renversa les villes corrompues du peuple de Lot,", "german": " und Er stürzte die verderbten Städte (des Volkes von Lot) um,", "spanish": " Y derribó las ciudades nefastas del pueblo de Lot,", "urdu": " اور الٹائی ہوئی بستیوں کو بھی اس نے اوپر سے نیچے گرایا تھا۔"}, {"arabic": " فَغَشّٰہَا مَا غَشّٰی ﴿ۚ۵۵﴾", "english": " So that there covered them that which was to cover.", "french": " De sorte que les couvrit ce qui devait couvrir.", "german": " dass sie bedeckte, was (sie) bedeckte.", "spanish": " De forma que quedaron cubiertas con lo que las cubrió.", "urdu": " پھر ان کو اس چیز نے ڈھانک لیا تھا جو ایسے موقعوں پر ڈھانک لیا کرتی ہے۔"}, {"arabic": " فَبِاَیِّ اٰلَآءِ رَبِّکَ تَتَمَارٰی ﴿۵۶﴾", "english": " Which then, O man , of the bounties of thy Lord wilt thou dispute?", "french": " Lequel donc, ô homme , des bienfaits de ton Seigneur veux-tu contester ?", "german": " Welche von deines Herrn Wohltaten willst du denn bestreiten?", "spanish": " ¿Cuál, pues, ¡oh! hombre, de los favores de tu Señor dudarás?", "urdu": " پس تو اپنے رب کی نعمتوں میں سے کس کس نعمت پر شک کرے گا۔"}, {"arabic": " ہٰذَا نَذِیۡرٌ مِّنَ النُّذُرِ الۡاُوۡلٰی ﴿۵۷﴾", "english": " This is a Warner from among the class of the Warners of old.", "french": " Celui-ci est un Avertisseur du genre des Avertisseurs de jadis.", "german": " Dies ist ein Warner von der gleichen Art wie die früheren Warner.", "spanish": " He aquí un Amonestador de el grupo de los Amonestadores antiguos.", "urdu": " یہ ہمارا رسول بھی پہلے رسولوں کی طرز کا ایک رسول ہے۔"}, {"arabic": " اَزِفَتِ الۡاٰزِفَۃُ ﴿ۚ۵۸﴾", "english": " The Hour that was to come has come nigh,", "french": " . L’Heure qui devait arriver, s’est rapprochée,", "german": " Die \"Stunde\" naht.", "spanish": " La Hora que debía venir se ha acercado,", "urdu": " (اس قوم کے فیصلہ کی) ساعت قریب آگئی ہے۔"}, {"arabic": " لَیۡسَ لَہَا مِنۡ دُوۡنِ اللّٰہِ کَاشِفَۃٌ ﴿ؕ۵۹﴾", "english": " None but Allah can avert it.", "french": " Nul, sauf Allāh, ne peut la détourner.", "german": " Keiner außer Allah kann sie abwenden.", "spanish": " Nadie fuera de Al-lah puede evitarla.", "urdu": " اللہ کے سوا کوئی (ہستی بھی) اس کو ٹلا نہیں سکتی۔"}, {"arabic": " اَفَمِنۡ ہٰذَا الۡحَدِیۡثِ تَعۡجَبُوۡنَ ﴿ۙ۶۰﴾", "english": " Do you then wonder at this announcement?", "french": " Vous étonnez-vous donc de cette annonce ?", "german": " Wundert ihr euch gar über diese Ankündigung?", "spanish": " ¿Os asombráis, pues, de este anuncio?", "urdu": " کیا تم اس بات پر تعجب کرتے ہو؟"}, {"arabic": " وَ تَضۡحَکُوۡنَ وَ لَا تَبۡکُوۡنَ ﴿ۙ۶۱﴾", "english": " And do you laugh, and weep not?", "french": " Et vous riez et vous ne pleurez pas ?", "german": " Und lacht ihr und weint nicht?", "spanish": " ¿Reís, en lugar de llorar?", "urdu": " اور ہنستے ہو اور روتے نہیں۔"}, {"arabic": " وَ اَنۡتُمۡ سٰمِدُوۡنَ ﴿۶۲﴾", "english": " And will you remain proudly heedless?", "french": " Alors que vous êtes orgueilleusement insouciants ?", "german": " Und wollt ihr achtlos bleiben?", "spanish": " ¿Seguiréis siendo arrogantes?", "urdu": " اور تم حیران کھڑے ہو (کوئی صحیح فیصلہ کرنے پر قادر نہیں)"}, {"arabic": " فَاسۡجُدُوۡا لِلّٰہِ وَ اعۡبُدُوۡا ﴿٪ٛ۶۳﴾", "english": " So prostrate yourselves before Allah, and worship Him .", "french": " Prosternez-vous donc devant Allāh, et adorez- Le .", "german": " Fallt lieber nieder vor Allah und verehret (Ihn).", "spanish": " Postraos, pues, ante Al-lah y adoradle.", "urdu": " (سو اٹھو) اور اللہ کے آگے سجدہ کرو اور اس کی عبادت کرو۔"}], "Surah": 53}