{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (۔میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " یُسَبِّحُ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ الۡمَلِکِ الۡقُدُّوۡسِ الۡعَزِیۡزِ الۡحَکِیۡمِ ﴿۲﴾", "english": " Whatever is in the heavens and whatever is in the earth glorifies Allah, the Sovereign, the Holy, the Mighty, the Wise.", "french": " Tout ce qui est dans les cieux et tout ce qui est sur la terre glorifient Allāh, le Souverain, le Très-Saint, le Puissant, le Sage.", "german": " Was in den Himmeln ist und was auf Erden, preist Allah, den Herrscher, den Heiligen, den Allmächtigen, den Allweisen.", "spanish": " Cuanto hay en los cielos y en la tierra glorifica a Al-lah, el Soberano, el Santo, el Poderoso, el Sabio.", "urdu": " آسمانوں اور زمین میں جو کچھ بھی ہے وہ اللہ کی تسبیح کرتا ہے اس (اللہ) کی جو بادشاہ بھی ہے اور پاک (بھی ہے اور سب خوبیوں کا جامع) ہے اور غالب (اور) حکمت والا ہے۔"}, {"arabic": " ہُوَ الَّذِیۡ بَعَثَ فِی الۡاُمِّیّٖنَ رَسُوۡلًا مِّنۡہُمۡ یَتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِہٖ وَ یُزَکِّیۡہِمۡ وَ یُعَلِّمُہُمُ الۡکِتٰبَ وَ الۡحِکۡمَۃَ ٭ وَ اِنۡ کَانُوۡا مِنۡ قَبۡلُ لَفِیۡ ضَلٰلٍ مُّبِیۡنٍ ۙ﴿۳﴾", "english": " He it is Who has raised among the Unlettered people a Messenger from among themselves who recites unto them His Signs, and purifies them, and teaches them the Book and wisdom, although they had been, before, in manifest misguidance;", "french": " C’est Lui Qui a suscité parmi les Illettrés un Messager qui est des leurs, qui leur récite Ses Signes, et les purifie, et leur enseigne le Livre et la Sagesse, bien qu’ils eussent été auparavant dans un égarement manifeste.", "german": " Er ist es, Der unter den Analphabeten einen Gesandten erweckt hat aus ihrer Mitte, ihnen Seine Zeichen vorzutragen und sie zu reinigen und sie die Schrift und die Weisheit zu lehren, wiewohl sie zuvor in offenkundigem Irrtum gewesen waren,", "spanish": " Él es Quien suscitó entre el pueblo inculto un Mensajero de entre ellos que les recita Sus Signos, los purifica y les enseña el Libro y la Sabiduría, aunque previamente habían estado en un evidente extravío;", "urdu": " وہی خدا ہے جس نے ایک ان پڑھ قوم کی طرف انہی میں سے ایک شخص کو رسول بنا کر بھیجا جو ان کو خدا کے احکام سناتا ہے اور ان کو پاک کرتا ہے اور ان کو کتاب اور حکمت سکھاتا ہے گو وہ اس سے پہلے بڑی بھول میں تھے۔"}, {"arabic": " وَّ اٰخَرِیۡنَ مِنۡہُمۡ لَمَّا یَلۡحَقُوۡا بِہِمۡ ؕ وَ ہُوَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۴﴾", "english": " And among others from among them who have not yet joined them. He is the Mighty, the Wise.", "french": " Et Il le suscitera parmi d’autres des leurs qui ne se sont pas encore joints à eux. Il est le Puissant, le Sage.", "german": " und unter den anderen von ihnen, die sich ihnen noch nicht zugesellt haben. Er ist der Allmächtige, der Allweise.", "spanish": " Y entre otros de aquellos que aún no se les han unido. Él es el Poderoso, el Sabio.", "urdu": " اور ان کے سوا ایک دوسری قوم میں بھی (وہ اسے بھیجے گا) جو ابھی تک ان سے ملی نہیں اور وہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " ذٰلِکَ فَضۡلُ اللّٰہِ یُؤۡتِیۡہِ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿۵﴾", "english": " That is Allah’s grace; He bestows it on whom He pleases; and Allah is the Master of immense grace.", "french": " C’est là la grâce d’Allāh ; Il l’accorde à qui Il veut ; et Allāh est le Maître de la grâce immense.", "german": " Das ist Allahs Huld; Er gewährt sie, wem Er will; und Allah ist der Herr großer Huld.", "spanish": " Ésa es la gracia de Al-lah; Él la concede a quien Le place; pues Al-lah es el Señor de la inmensa gracia.", "urdu": " یہ اللہ کا فضل ہے جس کو چاہتا ہے دیتا ہے۔ اور اللہ بڑے فضل والا ہے۔"}, {"arabic": " مَثَلُ الَّذِیۡنَ حُمِّلُوا التَّوۡرٰٮۃَ ثُمَّ لَمۡ یَحۡمِلُوۡہَا کَمَثَلِ الۡحِمَارِ یَحۡمِلُ اَسۡفَارًا ؕ بِئۡسَ مَثَلُ الۡقَوۡمِ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِ اللّٰہِ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿۶﴾", "english": " The likeness of those who were made to bear the law of Torah, but would not bear it, is as the likeness of an ass carrying a load of books. Evil is the likeness of the people who reject the Signs of Allah. And Allah guides not the wrongdoing people.", "french": " L’exemple de ceux qui étaient chargés de la loi de la Torah mais ne l’observaient pas, est pareil à l’exemple d’un âne chargé de livres. Mauvais est l’exemple des hommes qui rejettent les Signes d’Allāh, et Allāh ne guide pas le peuple qui agit injustement.", "german": " Das Gleichnis derer, denen die Thora auferlegt wurde, und die ihr dann nicht nachlebten, ist wie das Gleichnis eines Esels, der Bücher trägt. Übel steht es um Leute, die Allahs Zeichen leugnen. Und Allah weist dem Volk der Frevler nicht den Weg.", "spanish": " Aquellos a los que se les encomendó la ley del Torah, pero o la observaron, son semejantes a un asno que lleva una carga de libros. Pésimo es el ejemplo de los hombres que rechazan los Signos de Al-lah. Pues Al-lah no guía los pueblos inicuos.", "urdu": " جن لوگوں پر تورات کی اطاعت واجب کی گئی ہے مگر باوجود اس کے انہوں نے اس پر عمل نہیں کیا‘ ان کی مثال گدھے کی ہے‘ جس نے بہت سی کتابیں اٹھائی ہوتی ہیں (مگر جانتا کچھ نہیں) اللہ کے احکام کا انکار کرنے والی قوم کی حالت بہت بری ہوتی ہے اور اللہ ظالم قوم کو کبھی کامیابی کا منہ نہیں دکھاتا۔"}, {"arabic": " قُلۡ یٰۤاَیُّہَا الَّذِیۡنَ ہَادُوۡۤا اِنۡ زَعَمۡتُمۡ اَنَّکُمۡ اَوۡلِیَآءُ لِلّٰہِ مِنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۷﴾", "english": " Say, ‘O ye who are Jews, if you think you are the friends of Allah to the exclusion of all other people, then wish for Death, if indeed you are truthful.’", "french": " Dis : « Ô vous qui êtes Juifs, si vous croyez être les amis d’Allāh à l’exclusion de tous les autres hommes, alors, souhaitez la mort si vous êtes vraiment véridiques. »", "german": " Sprich: \"O die ihr Juden seid, wenn ihr meint, ihr wäret die Freunde Allahs unter Ausschluss der anderen Menschen, dann wünschet euch den Tod, wenn ihr wahrhaftig seid.\"", "spanish": " Diles: “Oh vosotros, los judíos, si pensáis que sois los amigos de Al-lah excluyendo a todos los demás pueblos, desead entonces la muerte, si de cierto sois veraces”.", "urdu": " تو کہہ دے‘ اے یہودیو! اگر تمہارا یہ دعویٰ ہے کہ تم باقی دنیا کو چھوڑ کر اللہ کے دوست ہو اور اس کی پناہ میں ہو تو اگر تم (اس دعویٰ میں) سچے ہو‘ تو موت کی تمنا کرو۔ (یعنی رسول کریم صلی اللہ علیہ وسلم سے مباہلہ کرو)"}, {"arabic": " وَ لَا یَتَمَنَّوۡنَہٗۤ اَبَدًۢا بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِالظّٰلِمِیۡنَ ﴿۸﴾", "english": " But they will never wish for it, because of that which their hands have sent on before them . And Allah knows full well those who do wrong.", "french": " Mais ils ne la souhaiteront jamais, à cause de ce que leurs mains ont envoyé devant eux . Et Allāh connaît très bien les injustes.", "german": " Doch sie werden sich ihn niemals wünschen, um dessentwillen, was ihre Hände ihnen vorausgeschickt haben. Und Allah kennt die Frevler recht wohl.", "spanish": " Pero nunca la desearán por lo que sus manos cometieron con anterioridad. Mas Al-lah conoce muy bien a los que practican la iniquidad.", "urdu": " مگر وہ اپنے گذشتہ اعمال کی وجہ سے کبھی بھی مباہلہ کے لئے تیار نہ ہوں گے اور اللہ ظالموں سے خوب واقف ہے۔"}, {"arabic": " قُلۡ اِنَّ الۡمَوۡتَ الَّذِیۡ تَفِرُّوۡنَ مِنۡہُ فَاِنَّہٗ مُلٰقِیۡکُمۡ ثُمَّ تُرَدُّوۡنَ اِلٰی عٰلِمِ الۡغَیۡبِ وَ الشَّہَادَۃِ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ٪﴿۹﴾", "english": " Say, ‘The Death from which you flee will surely meet you. Then will you be returned unto Him Who knows the unseen and the seen, and He will inform you of what you had been doing.’", "french": " Dis : « La mort que vous fuyez vous rattrapera sûrement. Alors vous serez ramenés à Celui Qui connaît l’invisible et le visible, et Il vous informera de ce que vous faisiez. »", "german": " Sprich: \"Der Tod, vor dem ihr flieht, wird euch sicherlich ereilen. Dann werdet ihr zu Dem zurückgebracht werden, Der das Verborgene und das Sichtbare kennt, und Er wird euch verkünden, was ihr zu tun pflegtet.\"", "spanish": " Diles: “La Muerte de la que huís ciertamente os alcanzará. Entonces seréis retornados a Aquel que conoce lo invisible y lo visible, y Él os informará de lo que estuvisteis haciendo”.", "urdu": " تو کہہ دے کہ وہ موت جس سے تم بھاگتے ہو‘ ایک دن یقیناً تم کو آپکڑے گی۔ پھر تم پوشیدہ اور ظاہر کے جاننے والے خدا کی طرف لوٹائے جاٶ گے اور وہ تم کو تمہارے اعمال کی خبر دے گا۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا نُوۡدِیَ لِلصَّلٰوۃِ مِنۡ یَّوۡمِ الۡجُمُعَۃِ فَاسۡعَوۡا اِلٰی ذِکۡرِ اللّٰہِ وَ ذَرُوا الۡبَیۡعَ ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ اِنۡ کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۱۰﴾", "english": " O ye who believe! when the call is made for Prayer on Friday, hasten to the remembrance of Allah, and leave off all business. That is better for you, if you only knew.", "french": " Ô vous qui croyez ! lorsque l’appel à la Prière est fait le vendredi, hâtez-vous vers le souvenir d’Allāh, et laissez de côté toute autre affaire. Cela vaut mieux pour vous, si seulement vous saviez.", "german": " O die ihr glaubt, wenn der Ruf zum Gebet am Freitag erschallt, dann eilet zum Gedenken Allahs und lasset den Handel ruhn. Das ist besser für euch, wenn ihr es nur wüsstet.", "spanish": " ¡Oh vosotros, los creyentes! Cuando se haga la llamada a la Oración del Viernes, apresuraos al recuerdo de Al-lah y dejad todos los negocios. Esto es lo mejor para vosotros, si lo supierais.", "urdu": " اے مومنو! جب تم کو جمعہ کے دن نماز کے لئے بلایا جائے (یعنی نماز جمعہ کے لئے) تو اللہ کے ذکر کے لئے جلدی جلدی جایا کرو۔ اور (خرید اور) فروخت کو چھوڑ دیا کرو‘ اگر تم کچھ بھی علم رکھتے ہو تو یہ تمہارے لئے اچھی بات ہے۔"}, {"arabic": " فَاِذَا قُضِیَتِ الصَّلٰوۃُ فَانۡتَشِرُوۡا فِی الۡاَرۡضِ وَ ابۡتَغُوۡا مِنۡ فَضۡلِ اللّٰہِ وَ اذۡکُرُوا اللّٰہَ کَثِیۡرًا لَّعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿۱۱﴾", "english": " And when the Prayer is finished, then disperse in the land and seek of Allah’s grace, and remember Allah much, that you may prosper.", "french": " Et lorsque la Prière est terminée, alors dispersez-vous dans le pays, et recherchez quelque grâce de la part d’Allāh, et souvenez-vous beaucoup d’Allāh, afin que vous prospériez.", "german": " Und wenn das Gebet beendet ist, dann zerstreut euch im Land und trachtet nach Allahs Gnadenfülle und gedenket Allahs häufig, auf dass ihr Erfolg habt.", "spanish": " Y cuando haya terminado la oración, dispersaos por la tierra y buscad la gracia de Al-lah, recordando mucho a Al-lah para que prosperéis.", "urdu": " اور جب نماز ختم ہو جائے تو زمین میں پھیل جایا کرو‘ اور اللہ کا فضل تلاش کیا کرو‘ اور اللہ کو بہت یاد کیا کرو‘ تا کہ تم کامیاب ہو جاٶ۔"}, {"arabic": " وَ اِذَا رَاَوۡا تِجَارَۃً اَوۡ لَہۡوَاۨ انۡفَضُّوۡۤا اِلَیۡہَا وَ تَرَکُوۡکَ قَآئِمًا ؕ قُلۡ مَا عِنۡدَ اللّٰہِ خَیۡرٌ مِّنَ اللَّہۡوِ وَ مِنَ التِّجَارَۃِ ؕ وَ اللّٰہُ خَیۡرُ الرّٰزِقِیۡنَ ﴿٪۱۲﴾", "english": " But when they see some merchandise or some amusement, they break up for it, and leave thee standing. Say, ‘That which is with Allah is better than amusement and merchandise, and Allah is the Best Provider.’", "french": " Mais lorsqu’ils voient quelque commerce ou divertissement, ils s'y précipitent et te laissent debout seul . Dis : « Ce qui est avec Allāh vaut mieux que le divertissement et le commerce, et Allāh est le Meilleur des pourvoyeurs. »", "german": " Doch wenn sie eine Ware sehen oder ein Spiel, dann brechen sie sogleich dazu auf und lassen dich stehen. Sprich: \"Was bei Allah ist, das ist besser als Spiel und Ware, und Allah ist der beste Versorger.\"", "spanish": " Pero cuando ven alguna mercancía o una diversión, se dispersan en su busca y te dejan de pie. Diles: “Lo que está junto a Al-lah es mejor que la diversión y la mercancía, y Al-lah es el Mejor de los Aprovisionadores”.", "urdu": " اور جب یہ لوگ تجارت یا کھیل کی بات دیکھتے ہیں تو تجھ سے الگ ہو کر اس کی طرف چلے جاتے ہیں اور تجھ کو اکیلا چھوڑ دیتے ہیں۔ تو ان سے کہدے جو کچھ اللہ کے پاس ہے وہ کھیل کی بات بلکہ تجارت سے بھی اچھا ہے اور اللہ بہتر رزق دینے والا ہے۔"}], "Surah": 62}