{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ التِّیۡنِ وَ الزَّیۡتُوۡنِ ۙ﴿۲﴾", "english": " By the Fig and the Olive,", "french": " Par la Figue et l’Olive,", "german": " Bei der Feige und dem Ölbaum,", "spanish": " Por la Higuera y el Olivo,", "urdu": " میں انجیر کو اور زیتون کو شہادت کے طور پر پیش کرتا ہوں۔"}, {"arabic": " وَ طُوۡرِ سِیۡنِیۡنَ ۙ﴿۳﴾", "english": " And by Mount Sinai,", "french": " Et par le Mont Sinaï,", "german": " und bei dem Berg Sinai,", "spanish": " Por el Monte Sinaí,", "urdu": " اور اسی طرح سینین کے پہاڑ کو۔"}, {"arabic": " وَ ہٰذَا الۡبَلَدِ الۡاَمِیۡنِ ۙ﴿۴﴾", "english": " And by this Town of Security,", "french": " Et par cette Ville, lieu de paix,", "german": " und bei dieser Stadt des Friedens.", "spanish": " Y por esta Ciudad, la morada de la Paz,", "urdu": " اور اس امن والے شہر (مکہ) کو بھی۔"}, {"arabic": " لَقَدۡ خَلَقۡنَا الۡاِنۡسَانَ فِیۡۤ اَحۡسَنِ تَقۡوِیۡمٍ ۫﴿۵﴾", "english": " Surely, We have created man in the best make;", "french": " Assurément, Nous avons créé l’homme selon le meilleur plan de création,", "german": " Wahrlich, Wir haben den Menschen in schönstem Ebenmaß erschaffen.", "spanish": " En verdad, hemos creado al hombre con el mejor de los planes creadores;", "urdu": " (یہ ساری شہادتیں ثابت کرتی ہیں کہ) یقیناً ہم نے انسان کو موزوں سے موزوں حالت میں پیدا کیا ہے۔"}, {"arabic": " ثُمَّ رَدَدۡنٰہُ اَسۡفَلَ سٰفِلِیۡنَ ۙ﴿۶﴾", "english": " Then, if he works iniquity , We reject him as the lowest of the low,", "french": " Ensuite, Nous l’avons fait retourner à l’état du plus bas des bas,", "german": " (Wirkt er) dann aber (Böses), so verwerfen Wir ihn als den Niedrigsten der Niedrigen.", "spanish": " Luego, le retornamos a lo más bajo de lo bajo.", "urdu": " پھر ہم نے اس کو ادنیٰ درجوں سے (بھی) بدتر درجہ کی طرف لوٹا دیا۔"}, {"arabic": " اِلَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فَلَہُمۡ اَجۡرٌ غَیۡرُ مَمۡنُوۡنٍ ؕ﴿۷﴾", "english": " Except those who believe and do good works; so for them is an unending reward.", "french": " Excepté ceux qui croient et font de bonnes œuvres ; alors pour eux, il y a une récompense non interrompue.", "german": " Doch so sind die nicht, die glauben und gute Werke üben; denn ihrer ist unendlicher Lohn.", "spanish": " Salvo a quienes creen y prac­tican el bien; pues para ellos hay una recompensa interminable.", "urdu": " باستثنا ان لوگوں کے جو ایمان لائے اور جنہوں نے مناسب حال عمل کیے سو ان کے لئے ایک نہ ختم ہونے والا نیک بدلہ ہوگا۔"}, {"arabic": " فَمَا یُکَذِّبُکَ بَعۡدُ بِالدِّیۡنِ ؕ﴿۸﴾", "english": " Then what is there to give the lie to thee after this with regard to the Judgment?", "french": " Après ceci, qu’est-ce qui peut donc te démentir au sujet du Jugement ?", "german": " Wer kann also dich leugnen nach (diesem Wort) über das Weltgericht?", "spanish": " Así pues, ¿qué es lo que te hace desmentir, en lo que se refiere al Juicio, después de esto?", "urdu": " پس اس (حقیقت کے کھل جانے) کے بعد کونسی چیز تجھ کو جزا سزا کے معاملے میں جھٹلاتی ہے۔"}, {"arabic": " اَلَیۡسَ اللّٰہُ بِاَحۡکَمِ الۡحٰکِمِیۡنَ ٪﴿۹﴾", "english": " Is not Allah the Best of judges?", "french": " Allāh n’est-Il pas le Meilleur Juge des juges ?", "german": " Ist Allah nicht der Größte der Richter?", "spanish": " ¿Acaso no es Al-lah el Mejor de los Jueces?", "urdu": " کیا (اب بھی کوئی خیال کر سکتا ہے کہ) اللہ سب حاکموں سے بڑا حاکم نہیں؟"}], "Surah": 95}