{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " تَبَّتۡ یَدَاۤ اَبِیۡ لَہَبٍ وَّ تَبَّ ؕ﴿۲﴾", "english": " Perished be the two hands of Abu Lahab, and he will perish.", "french": " Que périssent les deux mains d’Abu Lahab, et qu’il périsse lui-même .", "german": " Die beiden Hände von Abû Lahab werden vergehen, und er wird vergehen.", "spanish": " ¡Perezcan ambas manos de Abu Lahab, e igualmente él!.", "urdu": " شعلہ کے باپ کے دونوں ہاتھ ہی شل ہو گئے ہیں اور وہ (خود) بھی شل ہو کر رہ گیا ہے۔"}, {"arabic": " مَاۤ اَغۡنٰی عَنۡہُ مَالُہٗ وَ مَا کَسَبَ ؕ﴿۳﴾", "english": " His wealth and what he has earned shall avail him not.", "french": " Sa richesse et ce qu’il a gagné ne lui serviront à rien.", "german": " Sein Reichtum und was er erworben hat, soll ihm nichts nützen.", "spanish": " Su riqueza y lo que ha ga­nado no le servirá de nada.", "urdu": " اس کے مال نے اسے کوئی فائدہ نہیں دیا اور نہ اس کی کوششوں نے (کوئی فائدہ) دیا ہے۔"}, {"arabic": " سَیَصۡلٰی نَارًا ذَاتَ لَہَبٍ ۚ﴿ۖ۴﴾", "english": " Soon shall he enter into a blazing fire;", "french": " Bientôt il entrera dans un feu flambant ;", "german": " Bald wird er in ein flammendes Feuer eingehen;", "spanish": " Pronto entrará en un fuego llameante;", "urdu": " وہ ضرور آگ میں پڑے گا جو (اسی کی طرح) شعلے مارنے والی ہوگی۔"}, {"arabic": " وَّ امۡرَاَتُہٗ ؕ حَمَّالَۃَ الۡحَطَبِ ۚ﴿۵﴾", "english": " And his wife too , who goes about slandering.", "french": " Et sa femme aussi , la colporteuse de bois à brûler.", "german": " und sein Weib (ebenfalls), die arge Verleumderin.", "spanish": " Como también su mujer, que dará vueltas acarreando el combustible.", "urdu": " اور اس کی بیوی بھی جو ایندھن اٹھا اٹھا کر لاتی ہے (آگ میں پڑے گی)"}, {"arabic": " فِیۡ جِیۡدِہَا حَبۡلٌ مِّنۡ مَّسَدٍ ٪﴿۶﴾", "english": " Round her neck shall be a halter of twisted palm-fibre.", "french": " Autour du cou, elle aura un licou de fibres de palmier tressées.", "german": " Um ihren Hals wird ein Strick von gewundenen Palmenfasern sein.", "spanish": " Alrededor de su cuello habrá una soga de fibra de palmera tren­zada.", "urdu": " اس کی (بیوی کی) گردن میں کھجور کا سخت بٹا ہوا رسا باندھا جائے گا۔"}], "Surah": 111}