{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " اِقۡتَرَبَتِ السَّاعَۃُ وَ انۡشَقَّ الۡقَمَرُ ﴿۲﴾", "english": " The Hour has drawn nigh, and the moon is rent asunder.", "french": " L’Heure s’est rapprochée, et la lune est fendue.", "german": " Die \"Stunde\" ist nah, und der Mond ist entzwei gespalten.", "spanish": " La Hora se ha acercado y la luna se rompió en pedazos.", "urdu": " (عرب کی) تباہی کی گھڑی آگئی ہے اور چاند پھٹ گیا ہے۔"}, {"arabic": " وَ اِنۡ یَّرَوۡا اٰیَۃً یُّعۡرِضُوۡا وَ یَقُوۡلُوۡا سِحۡرٌ مُّسۡتَمِرٌّ ﴿۳﴾", "english": " And if they see a Sign, they turn away and say, ‘A passing feat of magic.’", "french": " Et s’ils voient un Signe, ils s’ en détournent et disent : « Une magie pratiquée de tout temps. »", "german": " Doch wenn sie ein Zeichen sehen, wenden sie sich ab und sagen: \"Ein ewiges Zauberwerk.\"", "spanish": " Mas si ven un Signo, se alejan y dicen: “Una hazaña pasajera de magia”.", "urdu": " اور اگر وہ کوئی نشان دیکھیں گے تو ضرور اعراض کر جائیں گے اور کہہ دیں گے کہ یہ محض ایک دھوکا ہے جو ہمیشہ سے چلا آتا ہے۔"}, {"arabic": " وَ کَذَّبُوۡا وَ اتَّبَعُوۡۤا اَہۡوَآءَہُمۡ وَ کُلُّ اَمۡرٍ مُّسۡتَقِرٌّ ﴿۴﴾", "english": " They reject the truth and follow their own fancies. But every decree of God shall certainly come to pass.", "french": " Ils rejettent la vérité et suivent leurs propres caprices. Mais chaque décret d’Allāh s’accomplira.", "german": " Sie leugnen und folgen ihren bösen Gelüsten. Doch jedem Ding ist eine Zeit bestimmt.", "spanish": " Rechazan la verdad y siguen sus propias fantasías. Pero cada decreto de Dios se cumplirá ciertamente.", "urdu": " اور انہوں نے جھٹلا دیا اور اپنی خواہشات کے پیچھے چل پڑے اور ہر کام کے لئے ایک وقت مقرر ہے۔"}, {"arabic": " وَ لَقَدۡ جَآءَہُمۡ مِّنَ الۡاَنۡۢبَآءِ مَا فِیۡہِ مُزۡدَجَرٌ ۙ﴿۵﴾", "english": " And there has already come to them the great news wherein is a warning —", "french": " Et il leur est déjà parvenu des nouvelles contenant un avertissement –", "german": " Und schon kamen zu ihnen Botschaften, worin eine Warnung war –", "spanish": " Ya se les ha hablado de profecías en las que ha habido sombrías advertencias,", "urdu": " اور ان کے پاس ایسے حالات پہنچ چکے ہیں جن میں تنبیہ کا سامان موجود تھا۔"}, {"arabic": " حِکۡمَۃٌۢ بَالِغَۃٌ فَمَا تُغۡنِ النُّذُرُ ۙ﴿۶﴾", "english": " Consummate wisdom; but the warnings profit them not.", "french": " Sagesse consommée ; mais les avertissements ne leur sont d’aucun profit.", "german": " vollendete Weisheit; allein selbst die Warnungen richteten (bei ihnen) nichts aus.", "spanish": " Sabiduría consumada; pero las advertencias no les sirven de nada.", "urdu": " نیز ایسی حکمت کی باتیں بھی تھیں جو اثر کرنے والی تھیں۔ مگر (افسوس کہ) ڈرانے والے نے ان کو کوئی فائدہ نہیں دیا۔"}, {"arabic": " فَتَوَلَّ عَنۡہُمۡ ۘ یَوۡمَ یَدۡعُ الدَّاعِ اِلٰی شَیۡءٍ نُّکُرٍ ۙ﴿۷﴾", "english": " Therefore turn thou away from them. The day when the Summoner will summon them to a disagreeable thing,", "french": " Aussi détourne-toi d’eux. Le jour où le Convocateur les convoquera à une chose désagréable,", "german": " Drum wende dich ab von ihnen. Am Tage, da der Rufer (sie) rufen wird zu schlimmem Geschehen.", "spanish": " Apártate, pues, de ellos. El día en que el Convocador les anuncie algo desagradable,", "urdu": " پس تو ان سے منہ پھیر لے اور اس وقت کا انتظار کر کہ ایک پکارنے والا ناپسندیدہ چیز (یعنی عذاب) کی طرف ان کو پکارے گا۔"}, {"arabic": " خُشَّعًا اَبۡصَارُہُمۡ یَخۡرُجُوۡنَ مِنَ الۡاَجۡدَاثِ کَاَنَّہُمۡ جَرَادٌ مُّنۡتَشِرٌ ۙ﴿۸﴾", "english": " While their eyes will be cast down and they will come forth from their graves as though they were locusts scattered about,", "french": " Les regards baissés, ils sortiront de leurs tombes, comme s’ils étaient des sauterelles éparpillées de tous côtés ,", "german": " Da werden sie hervorkommen aus den Gräbern mit niedergeschlagenen Blicken, als wären sie weithin zerstreute Heuschrecken,", "spanish": " Mientras que con sus ojos bajados salgan de sus tumbas como si fuesen langostas esparcidas,", "urdu": " ان کی آنکھیں جھکی ہوئی ہوں گی۔ وہ قبروں سے نکلیں گے اس طرح کہ گویا پراگندہ ٹڈیاں ہیں۔"}, {"arabic": " مُّہۡطِعِیۡنَ اِلَی الدَّاعِ ؕ یَقُوۡلُ الۡکٰفِرُوۡنَ ہٰذَا یَوۡمٌ عَسِرٌ ﴿۹﴾", "english": " Hastening towards the Summoner. The disbelievers will say, ‘This is a hard day.’", "french": " Se hâtant vers le Convocateur. Les mécréants diront : « Ceci est un jour pénible. »", "german": " entgegenhastend dem Rufer. Die Ungläubigen werden sprechen: \"Das ist ein schrecklicher Tag.\"", "spanish": " Apresurándose hacia el Convocador. Los incrédulos dirán: “Éste es un día difícil”.", "urdu": " پکارنے والے کی طرف بھاگے جا رہے ہوں گے اور کافر یہ بھی کہتے جائیں گے کہ یہ تو بڑی تکلیف کا دن ہے۔"}, {"arabic": " کَذَّبَتۡ قَبۡلَہُمۡ قَوۡمُ نُوۡحٍ فَکَذَّبُوۡا عَبۡدَنَا وَ قَالُوۡا مَجۡنُوۡنٌ وَّ ازۡدُجِرَ ﴿۱۰﴾", "english": " The people of Noah rejected the truth before them; aye, they rejected Our servant and said, ‘A madman and one who is spurned.’", "french": " Le peuple de Noé rejeta la vérité avant eux ; ainsi ils traitèrent Notre serviteur de menteur et dirent : « Un insensé et un rejeté ! »", "german": " Vor ihnen schon leugnete das Volk Noahs; ja, sie leugneten Unseren Diener und sprachen: \"Ein Wahnsinniger, verstoßen!\"", "spanish": " El pueblo de Noé rechazó la verdad antes que ellos; ¡ay!, rechazaron a Nuestro siervo y dijeron: “Un loco y un hombre despreciable”.", "urdu": " ان سے پہلے نوح کی قوم نے جھٹلایا‘ اور ہمارے بندے کی تکذیب کی اور کہا کہ یہ مجنون ہے اور (ہمارے بتوں کی طرف سے) اس پر پھٹکار ڈالی گئی ہے۔"}, {"arabic": " فَدَعَا رَبَّہٗۤ اَنِّیۡ مَغۡلُوۡبٌ فَانۡتَصِرۡ ﴿۱۱﴾", "english": " He therefore prayed to his Lord saying , ‘I am overcome, so come Thou to my help!’", "french": " Alors, il pria son Seigneur ainsi : « Je suis accablé, accorde- moi Ton aide ! »", "german": " Da betete er zu seinem Herrn: \"Ich bin überwältigt, so hilf Du (mir).\"", "spanish": " Por tanto, invocó a su Señor diciendo : “Estoy vencido, ¡ Ven, Tú pues, en mi ayuda!”.", "urdu": " آخر اس نے اپنے رب سے دعا کی اور کہا‘ مجھے دشمن نے مغلوب کر لیا ہے‘ پس تو میرا بدلہ لے۔"}, {"arabic": " فَفَتَحۡنَاۤ اَبۡوَابَ السَّمَآءِ بِمَآءٍ مُّنۡہَمِرٍ ﴿۫ۖ۱۲﴾", "english": " Thereupon We opened the gates of heaven, with water pouring down;", "french": " Là-dessus, Nous ouvrîmes les portes du ciel pour que tombe une eau torrentielle ;", "german": " So öffneten Wir die Tore des Himmels dem sich ergießenden Wasser,", "spanish": " Al punto abrimos las puertas del cielo, vertiendo un agua torrencial;", "urdu": " جس پر ہم نے بادل کے دروازے ایک جوش سے بہنے والے پانی کے ذریعہ سے کھول دئیے۔"}, {"arabic": " وَّ فَجَّرۡنَا الۡاَرۡضَ عُیُوۡنًا فَالۡتَقَی الۡمَآءُ عَلٰۤی اَمۡرٍ قَدۡ قُدِرَ ﴿ۚ۱۳﴾", "english": " And We caused the earth to burst forth with springs, so the two waters met for a purpose that was decreed.", "french": " Et Nous fîmes jaillir de la terre des sources, de sorte que les deux eaux se rencontrèrent dans un but qui avait été décrété.", "german": " und aus der Erde ließen Wir Quellen hervorbrechen, so begegneten sich die Gewässer zu einem beschlossenen Zweck,", "spanish": " E hicimos que la tierra se abriera en muchos manantiales, para que se unieran las dos aguas para el fin decretado.", "urdu": " اور زمین میں بھی ہم نے چشمے پھوڑ دئیے۔ پس (آسمان کا) پانی (زمین کے پانی کے ساتھ) ایک ایسی بات کے لئے اکٹھا ہو گیا‘ جس کا فیصلہ ہو چکا تھا۔"}, {"arabic": " وَ حَمَلۡنٰہُ عَلٰی ذَاتِ اَلۡوَاحٍ وَّ دُسُرٍ ﴿ۙ۱۴﴾", "english": " And We carried him upon that which was made of planks and nails.", "french": " Et Nous le transportâmes sur ce qui avait été fait de planches et de clous.", "german": " und Wir trugen ihn auf einem Gefüge aus Planken und Nägeln.", "spanish": " Y le transportamos en aquello que estaba hecho de tablones y clavos.", "urdu": " اور ہم نے اس (نوح) کو ایک تختوں اور کیلوں والی چیز (یعنی کشتی) پر اٹھالیا۔"}, {"arabic": " تَجۡرِیۡ بِاَعۡیُنِنَا ۚ جَزَآءً لِّمَنۡ کَانَ کُفِرَ ﴿۱۵﴾", "english": " It floated on under Our eyes: a reward for him who had been rejected.", "french": " Qui vogua sous Nos yeux ; une récompense pour celui qui avait été rejeté.", "german": " Es trieb dahin unter Unseren Augen: eine Belohnung für ihn, der verworfen worden war.", "spanish": " Flotó ante Nuestra mirada: una recompensa para quien había sido rechazado.", "urdu": " وہ ہماری آنکھوں کے سامنے (ہماری نگرانی میں) چلتی تھی۔ یہ اس شخص کی جزا تھی جس کا انکار کیا گیا تھا۔"}, {"arabic": " وَ لَقَدۡ تَّرَکۡنٰہَاۤ اٰیَۃً فَہَلۡ مِنۡ مُّدَّکِرٍ ﴿۱۶﴾", "english": " And We left it as a Sign for the coming generations ; but is there anyone who would receive admonition?", "french": " Et en vérité, Nous en avons fait un Signe pour les générations à venir ; mais y a-t-il quelqu’un qui voudrait être admonesté ?", "german": " Und Wir machten es zu einem Zeichen für alle Zeit. Ist also einer, der ermahnt sein mag?", "spanish": " Y lo dejamos como un Signo para las generaciones futuras; mas ¿hay alguien que quiera recibir la advertencia?", "urdu": " اور ہم نے اس واقعہ کو ایک نشان کے طور پر (پچھلی اقوام کے لئے) چھوڑا۔ پس کیا کوئی نصیحت حاصل کرنے والا ہے؟"}, {"arabic": " فَکَیۡفَ کَانَ عَذَابِیۡ وَ نُذُرِ ﴿۱۷﴾", "english": " How terrible then was My punishment and My warning!", "french": " Alors combien terribles furent mon châtiment et Mes avertissements !", "german": " Wie war dann Meine Strafe und Meine Warnung!", "spanish": " ¡Cuán terribles fueron, pues, Mi castigo y Mi advertencia!", "urdu": " اور دیکھو! میرا عذاب اور میرا ڈرانا کیسا (سخت اور درست) تھا۔"}, {"arabic": " وَ لَقَدۡ یَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّکۡرِ فَہَلۡ مِنۡ مُّدَّکِرٍ ﴿۱۸﴾", "english": " And indeed We have made the Qur’an easy to understand and to remember. But is there anyone who would receive admonition?", "french": " Et, en vérité, Nous avons rendu le Coran facile à comprendre et à suivre. Mais y a-t-il quelqu’un qui voudrait être admonesté ?", "german": " Wir haben den Qur-ân leicht gemacht, danach zu handeln. Ist also einer, der ermahnt sein mag?", "spanish": " En verdad hemos hecho el Corán fácil de entender y recordar. Mas ¿hay alguien que quiera recibir la amonestación?", "urdu": " ہم نے قرآن کو عمل کے لئے آسان بنایا ہے۔ پس کیا کوئی نصیحت حاصل کرنے والا ہے؟"}, {"arabic": " کَذَّبَتۡ عَادٌ فَکَیۡفَ کَانَ عَذَابِیۡ وَ نُذُرِ ﴿۱۹﴾", "english": " The tribe of ‘Ad rejected the truth . How terrible then was My punishment and My warning!", "french": " Les ‘Ād rejetèrent la vérité . Alors, combien terribles furent Mon châtiment et Mes avertissements !", "german": " Die ´Âd leugneten. Wie war dann Meine Strafe und Meine Warnung!", "spanish": " La tribu de Ad rechazó la verdad. ¡Qué terrible fue, pues, Mi castigo y Mi advertencia!", "urdu": " عاد ؔنے بھی (اپنے رسول کا) انکار کیا تھا‘ پھر دیکھو میرا عذاب اور میرا ڈرانا کیسا تھا؟ (یعنی عذاب کیسا سخت تھا اور ڈرانا کیسا سچا تھا) ۔"}, {"arabic": " اِنَّاۤ اَرۡسَلۡنَا عَلَیۡہِمۡ رِیۡحًا صَرۡصَرًا فِیۡ یَوۡمِ نَحۡسٍ مُّسۡتَمِرٍّ ﴿ۙ۲۰﴾", "english": " We sent against them a furious wind on a day of unending ill luck,", "french": " En vérité, Nous envoyâmes contre eux un vent furieux par un jour de malheur interminable,", "german": " Wir sandten wider sie einen wütenden Sturmwind zu einer unseligen, unvergesslichen Zeit,", "spanish": " Enviamos contra ellos un viento furioso en el día nefasto e interminable,", "urdu": " ہم نے ان پر ایک ایسی ہوا بھیجی‘ جو تیز چلنے والی تھی اور ایک دیر تک رہنے والے منحوس وقت میں چلائی گئی تھی۔"}, {"arabic": " تَنۡزِعُ النَّاسَ ۙ کَاَنَّہُمۡ اَعۡجَازُ نَخۡلٍ مُّنۡقَعِرٍ ﴿۲۱﴾", "english": " Tearing people away as though they were the trunks of uprooted palm-trees.", "french": " Arrachant les hommes comme s’ils étaient des troncs de dattiers déracinés.", "german": " der Menschen fortriss, als wären sie Schäfte von schon entwurzelten Palmen.", "spanish": " Que arrastraba a los hombres como si fuesen los troncos de palmeras desgajadas.", "urdu": " وہ لوگوں کو اس طرح اکھیڑ پھینکتی تھی۔ گویا وہ کھجور کے ایسے تنے ہیں جن کے اندر کا گودا کھایا ہوا تھا۔"}, {"arabic": " فَکَیۡفَ کَانَ عَذَابِیۡ وَ نُذُرِ ﴿۲۲﴾", "english": " How terrible then was My punishment and My warning!", "french": " Alors, combien terribles furent Mon châtiment et Mes avertissements !", "german": " Ja, wie war Meine Strafe und Meine Warnung!", "spanish": " ¡Qué terrible fue, pues, Mi castigo y Mi advertencia!", "urdu": " پس دیکھو کہ میرا عذاب (کیسا سخت) اور میرا ڈرانا کیسا (سچا) تھا۔"}, {"arabic": " وَ لَقَدۡ یَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّکۡرِ فَہَلۡ مِنۡ مُّدَّکِرٍ ﴿٪۲۳﴾", "english": " And indeed We have made the Qur’an easy to understand and to remember. But is there anyone who would receive admonition?", "french": " Et, en vérité, Nous avons rendu le Coran facile en guise d’admonestation. Mais, y a-t-il quelqu’un qui voudrait être admonesté ?", "german": " Wir haben den Qur-ân leicht gemacht, danach zu handeln. Ist also einer, der ermahnt sein mag?", "spanish": " En verdad hemos hecho el Corán fácil de entender y recordar. Mas ¿hay alguien que quiera recibir la admonición?", "urdu": " اور ہم نے قرآن کو عمل کرنے کے لئے آسان بنایا ہے پس کیا کوئی نصیحت حاصل کرنے والا ہے؟"}, {"arabic": " کَذَّبَتۡ ثَمُوۡدُ بِالنُّذُرِ ﴿۲۴﴾", "english": " The tribe of Thamud also rejected the Warners.", "french": " Les Thamūd aussi rejetèrent les Avertisseurs.", "german": " Die Thamûd verleugneten (ebenfalls) die Warner.", "spanish": " La tribu de Zamud rechazó también a los Amonestadores.", "urdu": " ثمود نے بھی نبیوں کا انکار کیا تھا۔"}, {"arabic": " فَقَالُوۡۤا اَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُہٗۤ ۙ اِنَّاۤ اِذًا لَّفِیۡ ضَلٰلٍ وَّ سُعُرٍ ﴿۲۵﴾", "english": " And they said, ‘What! a man, from among ourselves, a single individual! Shall we follow him? Then indeed we would be in manifest error, and would be mad.", "french": " Et ils dirent : « Comment ! Un homme, d’entre nous-mêmes, un homme tout seul, devons-nous le suivre ? Alors, en vérité, nous serions dans l’erreur et dans la folie.", "german": " Und sie sprachen: \"Wie! ein Mensch aus unserer Mitte, ein Einzelner, dem sollen wir folgen? Dann wären wir wahrlich im Irrtum und in brennender Pein.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=54:25&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=54:25&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic26\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic26\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/54:26' style='text-decoration:underline'>54:26</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(26)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control26\"></i></button> <audio id=\"player26\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">ءَاُلۡقِیَ الذِّکۡرُ عَلَیۡہِ مِنۡۢ بَیۡنِنَا بَلۡ ہُوَ کَذَّابٌ اَشِرٌ ﴿۲۶﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Has the Reminder been revealed to him <em>alone </em>of all of us? Nay, he is a boastful liar.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> <sup class='ref'>[<a class='ref' data-id='ref_54_26_a' href='#'>a</a>]</sup>Has the Reminder been revealed to him <i>alone </i>of all of us? Nay, he is an impudent liar.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_54_26_a'>a</span></div> <div><div class='reference' data-id='ref_54_26_a' style='display:none'> <p><b>a.</b> <a href='/quran/38:9' target=_blank>38:9</a>. (<a href='javascript:void(0)' data-id='ref_54_26_a' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">کیا ہمارے درمیان سے ایک اسی پر ذکر اُتارا گیا؟ نہیں! بلکہ یہ تو سخت جھوٹا (اور) شیخی بگھارنے والا ہے؟</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">کیا خدا کی وحی ہم میں سے (صرف) اس پر نازل کی گئی ہے؟ حقیقت یہ ہے کہ وہ سخت جھوٹا اور متکبر ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Le Rappel a-t-il été révélé à lui <em>seul</em> d’entre nous tous ? <em>Non</em>, mais c’est un grand menteur plein d’orgueil. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¿Acaso el Recordatorio le ha sido revelado <em>sólo</em> a él entre todos nosotros? No, no es más que un embustero insolente”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Ist die Ermahnung ihm (allein) gegeben worden von uns allen? Nein, er ist ein prahlerischer Lügner.\"", "spanish": " Dijeron: “¡Cómo! ¡Un hombre, de entre nosotros, una simple persona! ¿Debemos seguirlo? En ese caso, caeríamos, en verdad, en el error y estaríamos afligidos por la locura.", "urdu": " اور کہا تھا کہ کیا ہم اپنے میں سے ہی ایک آدمی کی (جو ہماری طرف بھیج دیا گیا ہے) اتباع کریں؟ اگر ہم ایسا کریں گے تو بڑی گمراہی اور جلنے والے عذاب میں پڑ جائیں گے۔"}, {"arabic": " سَیَعۡلَمُوۡنَ غَدًا مَّنِ الۡکَذَّابُ الۡاَشِرُ ﴿۲۷﴾", "english": " ‘Tomorrow will they know who is the boastful liar!", "french": " « Demain ils sauront qui est le grand menteur plein d’orgueil !", "german": " „Morgen werden sie erfahren, wer der prahlerische Lügner ist!", "spanish": " “¡Mañana sabrán quién es el embustero insolente!”.", "urdu": " (ہم نے کہا) وہ کل (یعنی آنے والے زمانہ میں) جان لیں گے کہ کون جھوٹا اور متکبر ہے۔"}, {"arabic": " اِنَّا مُرۡسِلُوا النَّاقَۃِ فِتۡنَۃً لَّہُمۡ فَارۡتَقِبۡہُمۡ وَ اصۡطَبِرۡ ﴿۫۲۸﴾", "english": " ‘We will send the she-camel as a trial for them. So watch them, O Salih , and have patience.", "french": " Nous enverrons la chamelle comme une épreuve pour eux. Observe-les donc, ô Ṣāliḥ , et prends patience.", "german": " Wir werden die Kamelstute als eine Prüfung für sie schicken. Drum beobachte sie (o Sâleh) und sei geduldig.", "spanish": " “Enviaremos la camella como prueba para ellos. Míralos, oh Salih, y ten paciencia.", "urdu": " (ہم نے ان سے کہا کہ) ہم ایک اونٹنی ان کی آزمائش کے لئے بھیجنے والے ہیں (پس اے صالح)! ان کے انجام کا انتظار کر اور صبر سے کام لے۔"}, {"arabic": " وَ نَبِّئۡہُمۡ اَنَّ الۡمَآءَ قِسۡمَۃٌۢ بَیۡنَہُمۡ ۚ کُلُّ شِرۡبٍ مُّحۡتَضَرٌ ﴿۲۹﴾", "english": " ‘And tell them that the water is shared only between them, but as for the she-camel every drinking time may be attended by her .’", "french": " Et dis-leur que l’eau est à partager entre la chamelle et eux ; alors, que chaque groupe aille se désaltérer à l’heure qui lui est fixée. »", "german": "", "spanish": " “Y diles que se repartirá el agua entre ellos y que se respetará cada turno asignado para beber.", "urdu": " اور انہیں کہہ دے کہ پانی ان کے اور تیرے درمیان تقسیم کر دیا گیا ہے۔ ہر گروہ اپنے پینے کے وقت پر حاضر ہوا کرے۔"}, {"arabic": " فَنَادَوۡا صَاحِبَہُمۡ فَتَعَاطٰی فَعَقَرَ ﴿۳۰﴾", "english": " But they called their comrade, and he seized a sword and hamstrung her .", "french": " Mais ils appelèrent leur camarade, et il se dressa sur la pointe des pieds, les bras levés, pour frapper de son épée ; et lui coupa les jarrets.", "german": " Doch sie riefen ihren Gefährten, und er packte (sie) und schnitt (ihr) die Sehnen durch.", "spanish": " Mas llamaron a su camarada, y se dispuso a golpearla y desjarretarla.", "urdu": " اس پر انہوں نے اپنے سردار کو بلایا‘ جس پر وہ آیا اور اونٹنی کی کونچیں کاٹ دیں۔"}, {"arabic": " فَکَیۡفَ کَانَ عَذَابِیۡ وَ نُذُرِ ﴿۳۱﴾", "english": " How terrible then was My punishment and My warning!", "french": " Alors, combien terribles furent Mon châtiment et Mes avertissements !", "german": " Wie war da Meine Strafe und Meine Warnung!", "spanish": " ¡Qué terrible fue, pues, Mi castigo y Mi advertencia!", "urdu": " پھر دیکھو میرا عذاب اور میرا ڈرانا کیسا تھا؟ (یعنی میرا عذاب کیسا سخت تھا اور میرا ڈرانا کیسا سچا تھا)۔"}, {"arabic": " اِنَّاۤ اَرۡسَلۡنَا عَلَیۡہِمۡ صَیۡحَۃً وَّاحِدَۃً فَکَانُوۡا کَہَشِیۡمِ الۡمُحۡتَظِرِ ﴿۳۲﴾", "english": " We sent against them a single blast, and they became like the dry stubble, trampled upon.", "french": " Nous envoyâmes contre eux un seul souffle, et ils devinrent comme le chaume desséché qui est foulé aux pieds.", "german": " Wir entsandten wider sie einen einzigen Schall, und sie wurden wie dürre, zertretene Stoppeln.", "spanish": " Enviamos contra ellos un solo soplo, y quedaron como rastrojo seco, pisoteado.", "urdu": " ہم نے ان پر ایک ہی عذاب نازل کیا۔ اور وہ ایک باڑ بنانے والے کے (درختوں سے) گرائے ہوئے چورے کی طرح ہوگئے۔"}, {"arabic": " وَ لَقَدۡ یَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّکۡرِ فَہَلۡ مِنۡ مُّدَّکِرٍ ﴿۳۳﴾", "english": " And indeed We have made the Qur’an easy to understand and to remember. But is there anyone who would receive admonition?", "french": " Et, en vérité, Nous avons rendu le Coran facile en guise d’admonestation. Mais, y a-t-il quelqu’un qui voudrait être admonesté ?", "german": " Wir haben den Qur-ân leicht gemacht, danach zu handeln. Ist also einer, der ermahnt sein mag?", "spanish": " En verdad hicimos el Corán fácil de entender y de recordar. Mas ¿hay alguien que quiera recibir la advertencia?", "urdu": " اور ہم نے قرآن کو عمل کرنے کے لئے آسان بنایا ہے۔ پھر کیا کوئی نصیحت حاصل کرنے والا ہے؟"}, {"arabic": " کَذَّبَتۡ قَوۡمُ لُوۡطٍۭ بِالنُّذُرِ ﴿۳۴﴾", "english": " Lot’s people also rejected the Warners.", "french": " Le peuple de Lot aussi rejeta ceux qui avertissent.", "german": " Das Volk des Lot verleugnete (ebenfalls) die Warner.", "spanish": " El pueblo de Lot rechazó también a los Amonestadores.", "urdu": " لوط کی قوم نے بھی نبیوں کو جھٹلا دیا تھا۔"}, {"arabic": " اِنَّاۤ اَرۡسَلۡنَا عَلَیۡہِمۡ حَاصِبًا اِلَّاۤ اٰلَ لُوۡطٍ ؕ نَجَّیۡنٰہُمۡ بِسَحَرٍ ﴿ۙ۳۵﴾", "english": " We sent a storm of stones upon them except the family of Lot, whom We delivered by early dawn,", "french": " Nous envoyâmes contre eux une tempête de pierres, sauf sur la famille de Lot, que Nous délivrâmes à la pointe du jour,", "german": " Da sandten Wir einen Steinregen über sie, ausgenommen die Familie des Lot, die Wir erretteten im Morgengrauen,", "spanish": " Enviamos sobre ellos una tormenta de piedras, salvo la familia de Lot, a quien libramos a primeras horas del alba,", "urdu": " ہم نے ان کے تباہ کرنے کے لئے بھی کنکروں سے بھری ہوئی ہوا چلائی (جس نے آل لوط کے سوا سب کو تباہ کر دیا) ہاں صبح کے وقت (جب وہ عذاب آیا تو) ہم نے لوط کے خاندان کو بچا لیا۔"}, {"arabic": " نِّعۡمَۃً مِّنۡ عِنۡدِنَا ؕ کَذٰلِکَ نَجۡزِیۡ مَنۡ شَکَرَ ﴿۳۶﴾", "english": " As a favour from Us. Thus do We reward him who is grateful.", "french": " Comme une faveur de Notre part. C’est ainsi que Nous récompensons celui qui est reconnaissant.", "german": " als eine Gnade von Uns. Also belohnen Wir den, der dankbar ist.", "spanish": " Como favor Nuestro. Así recompensamos a quien es agradecido.", "urdu": " یہ ہماری طرف سے ایک نعمت تھی‘ جو شکر کرتا ہے ہم اسے اسی طرح جزا دیا کرتے ہیں۔"}, {"arabic": " وَ لَقَدۡ اَنۡذَرَہُمۡ بَطۡشَتَنَا فَتَمَارَوۡا بِالنُّذُرِ ﴿۳۷﴾", "english": " And he indeed had warned them of Our punishment, but they doubted the warning.", "french": " Et, en vérité, il les avait avertis de Notre châtiment, mais ils mirent les avertissements en doute.", "german": " Und er hatte sie in der Tat vor Unserer Strafe gewarnt, sie aber stritten doch mit den Warnern.", "spanish": " Y en verdad les advirtió de Nuestro castigo, pero pusieron en duda la advertencia.", "urdu": " اور اس (لوط) نے ان کو ہمارے عذاب کی پہلے سے خبر دے دی تھی۔ لیکن وہ نبیوں سے بحث کرنے لگ گئے۔"}, {"arabic": " وَ لَقَدۡ رَاوَدُوۡہُ عَنۡ ضَیۡفِہٖ فَطَمَسۡنَاۤ اَعۡیُنَہُمۡ فَذُوۡقُوۡا عَذَابِیۡ وَ نُذُرِ ﴿۳۸﴾", "english": " And they deceitfully sought to turn him away from his guests. So We blinded their eyes, and said , ‘Taste ye now My punishment and My warning.’", "french": " Et ils cherchèrent avec duplicité à le détourner de ses visiteurs. Aussi Nous aveuglâmes leurs yeux, et dîmes : « Goûtez maintenant Mon châtiment et Mes avertissements. »", "german": " Und sie versuchten listig, ihn von seinen Gästen abzuhalten. Daher blendeten Wir ihre Augen (und sprachen): \"Kostet nun Meine Strafe und Meine Warnung.\"", "spanish": " E intentaron con engaños apartarlo de sus invitados. Por ello cegamos sus ojos y dijimos: “Probad ahora Mi castigo y Mi advertencia”.", "urdu": " اور انہوں نے اسے اپنے مہمانوں کے خلاف بہکانا چاہا اور ہم نے ان کی آنکھوں پر پردہ ڈال دیا اور کہا‘ میرے عذاب اور میرے ڈرانے کا مزہ چکھو۔"}, {"arabic": " وَ لَقَدۡ صَبَّحَہُمۡ بُکۡرَۃً عَذَابٌ مُّسۡتَقِرٌّ ﴿ۚ۳۹﴾", "english": " And there came upon them early in the morning a lasting punishment.", "french": " Et tôt le matin, il leur survint un châtiment durable.", "german": " Und in der Morgenfrühe ereilte sie eine dauernde Strafe.", "spanish": " Y al amanecer les sobrevino un castigo duradero.", "urdu": " اور صبح صبح ہی ان پر ایک ایسا عذاب آگیا جو آکر ہی رہنے والا تھا۔"}, {"arabic": " فَذُوۡقُوۡا عَذَابِیۡ وَ نُذُرِ ﴿۴۰﴾", "english": " ‘Now taste ye My punishment and My warning.’", "french": " « Goûtez maintenant Mon châtiment et Mes avertissements. »", "german": " So kostet nun Meine Strafe und Meine Warnung.", "spanish": " “Probad ahora Mi castigo y Mi advertencia”.", "urdu": " (اور ہم نے ان سے کہا کہ) میرے عذاب اور میرے ڈرانے کا مزہ چکھو۔"}, {"arabic": " وَ لَقَدۡ یَسَّرۡنَا الۡقُرۡاٰنَ لِلذِّکۡرِ فَہَلۡ مِنۡ مُّدَّکِرٍ ﴿٪۴۱﴾", "english": " And, indeed, We have made the Qur’an easy to understand and to remember. But is there anyone who would receive admonition?", "french": " Et, en vérité, Nous avons rendu le Coran facile en guise d’admonestation. Mais, y a-t-il quelqu’un qui voudrait être admonesté ?", "german": " Wir haben den Qur-ân leicht gemacht, danach zu handeln. Ist also einer, der ermahnt sein mag?", "spanish": " En verdad, hicimos el Corán fácil de entender y recordar. Mas ¿hay alguien que quiera recibir la advertencia?", "urdu": " ہم نے قرآن کو عمل کرنے کے لے آسان بنایا ہے۔ سو کیا کوئی نصیحت حاصل کرنے والا ہے؟"}, {"arabic": " وَ لَقَدۡ جَآءَ اٰلَ فِرۡعَوۡنَ النُّذُرُ ﴿ۚ۴۲﴾", "english": " And surely to the people of Pharaoh also came Warners.", "french": " Et assurément au peuple de Pharaon aussi vinrent des Avertisseurs.", "german": " Zu dem Volke Pharaos kamen (ebenfalls) die Warner.", "spanish": " En verdad, al pueblo del Faraón llegaron también Amonestadores.", "urdu": " اور آل فرعون کے پاس بھی نبی آئے تھے۔"}, {"arabic": " کَذَّبُوۡا بِاٰیٰتِنَا کُلِّہَا فَاَخَذۡنٰہُمۡ اَخۡذَ عَزِیۡزٍ مُّقۡتَدِرٍ ﴿۴۳﴾", "english": " They rejected all Our Signs. So We seized them like the seizing of One Who is Mighty and Omnipotent.", "french": " Ils rejetèrent tous Nos Signes. Alors Nous les saisîmes, comme saisit Celui Qui est Fort et Tout-Puissant.", "german": " Sie aber verwarfen alle Unsere Zeichen. Darum erfassten Wir sie mit dem Griff eines Mächtigen, Allgewaltigen.", "spanish": " Rechazaron todos Nuestros Signos. Así, los castigamos con el castigo de Quien es Poderoso y Omnipotente.", "urdu": " مگر آل فرعون نے ہماری سب آیتوں کو جھٹلایا‘ جس پر ہم نے ان کو ایک غالب طاقتور کی طرح عذاب سے پکڑ لیا۔"}, {"arabic": " اَکُفَّارُکُمۡ خَیۡرٌ مِّنۡ اُولٰٓئِکُمۡ اَمۡ لَکُمۡ بَرَآءَۃٌ فِی الزُّبُرِ ﴿ۚ۴۴﴾", "english": " Are your disbelievers better than those? Or have you an exemption in the Scriptures?", "french": " Vos mécréants valent-ils mieux que ceux-là ? Ou bien y a-t-il une exemption pour vous dans les Ecritures ?", "german": " Sind die Ungläubigen unter euch (den Mekkanern) etwa besser als jene? Oder habt ihr Freispruch in den Schriften?", "spanish": " ¿Son vuestros incrédulos mejores que aquellos? ¿O tenéis inmunidad en las Escrituras?", "urdu": " (اے مکہ والو)! کیا تم میں سے کفر کرنے والے ان پہلے لوگوں سے اچھے ہیں یا پہلی کتابوں میں تمہارے لئے عذاب سے حفاظت لکھی ہوئی ہے؟"}, {"arabic": " اَمۡ یَقُوۡلُوۡنَ نَحۡنُ جَمِیۡعٌ مُّنۡتَصِرٌ ﴿۴۵﴾", "english": " Do they say, ‘We are a victorious host?’", "french": " Disent-ils : « Nous sommes une armée victorieuse ? »", "german": " Sprechen sie wohl: \"Wir sind eine siegreiche Schar?\"", "spanish": " ¿Dicen acaso: “Somos un ejército victorioso?”.", "urdu": " کیا وہ کہتے ہیں کہ ہم ایک جماعت ہیں جو غالب آکر رہیں گے۔"}, {"arabic": " سَیُہۡزَمُ الۡجَمۡعُ وَ یُوَلُّوۡنَ الدُّبُرَ ﴿۴۶﴾", "english": " The hosts shall soon be routed and will turn their backs in flight .", "french": " Les armées seront bientôt mises en déroute et elles fuiront.", "german": " Die Scharen werden alle in die Flucht geschlagen werden, und sie werden den Rücken kehren.", "spanish": " Los ejércitos serán pronto puestos en fuga y volverán sus espaldas en la huida.", "urdu": " ان کی جماعت کو عنقریب شکست دی جائے گی اور وہ پیٹھ پھیر کر بھاگ جائیں گے۔"}, {"arabic": " بَلِ السَّاعَۃُ مَوۡعِدُہُمۡ وَ السَّاعَۃُ اَدۡہٰی وَ اَمَرُّ ﴿۴۷﴾", "english": " Aye, the Hour is their appointed time; and the Hour will be most calamitous and most bitter.", "french": " Oui, sûrement, l’Heure est leur terme désigné ; et l’Heure sera des plus désastreuses et des plus amères.", "german": " Nein, die \"Stunde\" ist die ihnen gesetzte Zeit; und die \"Stunde\" wird fürchterlich sein und bitter.", "spanish": " ¡Ay!, la hora es su tiempo prefijado; y la Hora será sumamente penosa y amarga.", "urdu": " بلکہ ان کی تباہی کی گھڑی کا وعدہ کیا گیا ہے اور وہ وعدہ کی گھڑی بہت زیادہ ہلاک کرنے والی اور سخت ہوگی۔"}, {"arabic": " اِنَّ الۡمُجۡرِمِیۡنَ فِیۡ ضَلٰلٍ وَّ سُعُرٍ ﴿ۘ۴۸﴾", "english": " Surely, the guilty are in manifest error and gone mad.", "french": " Assurément, les pécheurs sont dans une erreur grave et dans la folie.", "german": " Die Sünder werden im Irrtum und in brennender Pein sein.", "spanish": " En verdad, los culpables están en el error y la locura manifiestos.", "urdu": " مجرم لوگ گمراہی اور جلانے والے عذاب میں مبتلا ہوں گے۔"}, {"arabic": " یَوۡمَ یُسۡحَبُوۡنَ فِی النَّارِ عَلٰی وُجُوۡہِہِمۡ ؕ ذُوۡقُوۡا مَسَّ سَقَرَ ﴿۴۹﴾", "english": " On the day when they will be dragged into the Fire on their faces, and it will be said to them , ‘Taste ye the touch of Hell.’", "french": " Le jour où ils seront traînés sur leur visage dans le Feu, et il leur sera dit : « Goûtez donc le contact de l’Enfer. »", "german": " Am Tage, da sie ins Feuer geschleift werden samt ihren Anführern: \"Fühlet die Berührung der Hölle.\"", "spanish": " En el día en que sean arrastrados al Fuego, sobre sus rostros, y se les diga: “Probad ahora el tacto del Infierno”.", "urdu": " جس دن کہ وہ اپنے سرداروں سمیت آگ میں گھسیٹے جائیں گے (اور ان سے کہا جائے گا) کہ دوزخ کا عذاب چکھو۔"}, {"arabic": " اِنَّا کُلَّ شَیۡءٍ خَلَقۡنٰہُ بِقَدَرٍ ﴿۵۰﴾", "english": " Verily, We have created everything in due measure.", "french": " En vérité, Nous avons créé toutes choses avec mesure.", "german": " Wir haben ein jegliches Ding nach Maß geschaffen.", "spanish": " En verdad, hemos creado todo en la justa medida.", "urdu": " ہم نے ہر چیز کو اندازے کے مطابق پیدا کیا ہے۔"}, {"arabic": " وَ مَاۤ اَمۡرُنَاۤ اِلَّا وَاحِدَۃٌ کَلَمۡحٍۭ بِالۡبَصَرِ ﴿۵۱﴾", "english": " And Our command is carried out by only one word , like the twinkling of an eye.", "french": " Et Notre commandement n'est exécuté que d'un seul coup, tel un clin d’oeil.", "german": " Und Unser Befehl wird (vollzogen) mit einem einzigen (Worte) gleich dem Blinzeln des Auges.", "spanish": " Nuestro mandamiento se cumple con sólo una palabra, como el parpadeo del ojo,", "urdu": " اور ہمارا حکم آنکھ کے جھپکنے کی طرح یک دم پورا ہو جاتا ہے۔"}, {"arabic": " وَ لَقَدۡ اَہۡلَکۡنَاۤ اَشۡیَاعَکُمۡ فَہَلۡ مِنۡ مُّدَّکِرٍ ﴿۵۲﴾", "english": " And indeed We have destroyed people before you who were like unto you. But is there anyone who would receive admonition?", "french": " Et en vérité Nous avons anéanti, avant vous , des groupes comme vous. Mais y a-t-il quelqu’un qui voudrait être admonesté ?", "german": " Und Wir haben bereits Leute wie ihr vertilgt. Doch ist auch nur einer, der ermahnt sein mag?", "spanish": " En verdad, destruimos antes de vosotros a pueblos que eran como vosotros. Mas ¿hay alguien que quiera recibir la advertencia?", "urdu": " اور ہم تمہارے جیسے لوگوں کو پہلے بھی ہلاک کر چکے ہیں اور کیا (اس بات کو جان کر) کوئی نصیحت حاصل کرنے والا ہے؟"}, {"arabic": " وَ کُلُّ شَیۡءٍ فَعَلُوۡہُ فِی الزُّبُرِ ﴿۵۳﴾", "english": " And everything they have done is recorded in the Books.", "french": " Et tout ce qu’ils ont fait est inscrit dans les Registres.", "german": " Und alles, was sie getan haben, steht in den Büchern.", "spanish": " Todo lo que hicieron está registrado en los Libros.", "urdu": " اور ہر کام جو انہوں نے کیا ہے۔ وہ کتابوں میں موجود ہے۔"}, {"arabic": " وَ کُلُّ صَغِیۡرٍ وَّ کَبِیۡرٍ مُّسۡتَطَرٌ ﴿۵۴﴾", "english": " And every matter, small and great, is written down.", "french": " Et toute affaire , petite et grande, est inscrite.", "german": " Und alles Kleine und Große ist niedergeschrieben.", "spanish": " Y todos los asuntos anotados, grandes y pequeños.", "urdu": " اور ہر چھوٹی اور بڑی بات لکھی ہوئی ہے۔"}, {"arabic": " اِنَّ الۡمُتَّقِیۡنَ فِیۡ جَنّٰتٍ وَّ نَہَرٍ ﴿ۙ۵۵﴾", "english": " Verily, the righteous will be in the midst of Gardens and streams,", "french": " En vérité, les pieux seront au milieu des Jardins et des rivières,", "german": " Die Rechtschaffenen werden inmitten von Gärten und Strömen sein,", "spanish": " En verdad, los justos estarán en medio de jardines y ríos.", "urdu": " (اور) مومن جنتوں میں اور قسم قسم کی فراخیوں میں ہونگے۔"}, {"arabic": " فِیۡ مَقۡعَدِ صِدۡقٍ عِنۡدَ مَلِیۡکٍ مُّقۡتَدِرٍ ﴿٪۵۶﴾", "english": " In the seat of truth with an Omnipotent King.", "french": " Sur le siège de la vérité en présence d’un Roi Omnipotent.", "german": " auf dem ewigen Platz, beim allmächtigen König.", "spanish": " En el trono de la verdad, con un Rey Omnipotente.", "urdu": " ایک ایسے مقام میں جو دائمی رہنے والا ہوگا (اور وہ) قدرت رکھنے والے بادشاہ کے پاس (ہونگے) (یعنی وہ کبھی ذلت اور تنزل کا منہ نہیں دیکھیں گے) ۔"}], "Surah": 54}