{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں) ۔"}, {"arabic": " اِنَّا فَتَحۡنَا لَکَ فَتۡحًا مُّبِیۡنًا ۙ﴿۲﴾", "english": " Verily, We have granted thee a clear victory,", "french": " En vérité, Nous t’avons accordé une victoire manifeste,", "german": " Wir haben dir einen offenkundigen Sieg gewährt,", "spanish": " En verdad, te hemos concedido una clara victoria.", "urdu": " ہم نے تم کو ایک کھلی کھلی فتح بخشی ہے۔"}, {"arabic": " لِّیَغۡفِرَ لَکَ اللّٰہُ مَا تَقَدَّمَ مِنۡ ذَنۡۢبِکَ وَ مَا تَاَخَّرَ وَ یُتِمَّ نِعۡمَتَہٗ عَلَیۡکَ وَ یَہۡدِیَکَ صِرَاطًا مُّسۡتَقِیۡمًا ۙ﴿۳﴾", "english": " That Allah may cover up for thee thy shortcomings, past and future, and that He may complete His favour upon thee, and may guide thee on a right path;", "french": " Afin qu’Allāh puisse te pardonner tes manquements passés et futurs , et qu’Il puisse compléter Sa grâce sur toi, et continuer à te guider sur un droit chemin ;", "german": " auf dass Allah dich schirme gegen deine Fehler, vergangene und künftige, und dass Er Seine Gnade an dir vollende und dich leite auf den geraden Weg;", "spanish": " Para que Al-lah corra un velo por tus faltas, pasadas y futuras, y complete Su favor sobre ti, guiándote por el camino recto;", "urdu": " جس کا نتیجہ یہ ہوگا کہ اللہ تیرے متعلق کیے گئے وہ گناہ بھی جو پہلے گذر چکے ہیں ڈھانک دے گا اور جو اب تک ہوئے نہیں (لیکن آئندہ ہونے کا امکان ہے) ان کو بھی ڈھانک دے گا اور تجھ پر اپنی نعمت پوری کرے گا اور تجھے سیدھا راستہ دکھائے گا۔"}, {"arabic": " وَّ یَنۡصُرَکَ اللّٰہُ نَصۡرًا عَزِیۡزًا ﴿۴﴾", "english": " And that Allah may help thee with a mighty help.", "french": " Et afin qu’Allāh puisse t’aider d’une aide puissante.", "german": " und dass Allah dir helfe mit mächtiger Hilfe.", "spanish": " Para que Al-lah te ayude poderosamente.", "urdu": " اور اللہ تیری شان دار مدد کرے گا۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَنۡزَلَ السَّکِیۡنَۃَ فِیۡ قُلُوۡبِ الۡمُؤۡمِنِیۡنَ لِیَزۡدَادُوۡۤا اِیۡمَانًا مَّعَ اِیۡمَانِہِمۡ ؕ وَ لِلّٰہِ جُنُوۡدُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ۙ﴿۵﴾", "english": " He it is Who sent down tranquillity into the hearts of the believers that they might add faith to their faith — and to Allah belong the hosts of the heavens and the earth, and Allah is All-knowing, Wise —", "french": " C’est Lui Qui a fait descendre la tranquillité dans le cœur des croyants, afin qu’avec leur foi ils puissent s’affermir davantage dans la foi – et c’est à Allāh qu’appartiennent les armées des cieux et de la terre, et Allāh est Omniscient, Sage –", "german": " Er ist es, Der die Ruhe in die Herzen der Gläubigen niedersandte, damit sie Glauben hinzufügen ihrem Glauben – und Allahs sind die Heerscharen der Himmel und der Erde, und Allah ist allwissend, allweise –,", "spanish": " Él es Quien infundió tranquilidad en los corazones de los creyentes para que añadieran fe a su fe -pues a Al-lah pertenecen las huestes de los cielos y la tierra, y Al-lah es Omnisciente, Sabio–", "urdu": " وہ (خدا) ہی ہے جس نے مومنوں کے دلوں پر سکینت اتاری تا کہ جو ایمان ان کو پہلے نصیب تھا اس کے ساتھ اور ایمان بھی ان کو حاصل ہو جائے‘ اور اللہ کے آسمانوں میں بھی لشکر ہیں اور زمین بھی اور اللہ بڑے علم والا اور بڑی حکمت والا ہے۔"}, {"arabic": " لِّیُدۡخِلَ الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا وَ یُکَفِّرَ عَنۡہُمۡ سَیِّاٰتِہِمۡ ؕ وَ کَانَ ذٰلِکَ عِنۡدَ اللّٰہِ فَوۡزًا عَظِیۡمًا ۙ﴿۶﴾", "english": " That He may make the believing men and the believing women enter the Gardens beneath which streams flow, wherein they will abide, and that He may remove their evils from them — and that, in the sight of Allah, is the supreme triumph —", "french": " Afin qu’Il puisse admettre les croyants et les croyantes dans des Jardins sous lesquels coulent des rivières, où ils demeureront éternellement, et afin qu ’Il puisse leur enlever leurs méfaits – et aux yeux d’Allāh, cela est un très grand succès –", "german": " dass Er die gläubigen Männer und die gläubigen Frauen einführe in Gärten, durch die Ströme fließen, ewig darin zu weilen, und dass Er ihre Missetaten von ihnen nehme – und das ist vor Allah die höchste Glückseligkeit –", "spanish": " Para hacer que los hombres y mujeres creyentes entren en Jardines por los que corren ríos, en los que habitarán y para retirarles sus males –y esto, a la vista de Al-lah, es el triunfo supremo–", "urdu": " (مومنوں کا ایمان بڑھانا) اس لئے ہوگا تا کہ وہ (اللہ) مومن مردوں اور مومن عورتوں کو ایسی جنتوں میں داخل کرے جن کے نیچے نہریں بہتی ہوں گی وہ ان میں ہمیشہ رہتے چلے جائیں گے اور تا کہ وہ (اللہ) ان کے گناہ مٹا دے اور اللہ کے نزدیک یہی بڑی کامیابی ہے۔"}, {"arabic": " وَّ یُعَذِّبَ الۡمُنٰفِقِیۡنَ وَ الۡمُنٰفِقٰتِ وَ الۡمُشۡرِکِیۡنَ وَ الۡمُشۡرِکٰتِ الظَّآنِّیۡنَ بِاللّٰہِ ظَنَّ السَّوۡءِ ؕ عَلَیۡہِمۡ دَآئِرَۃُ السَّوۡءِ ۚ وَ غَضِبَ اللّٰہُ عَلَیۡہِمۡ وَ لَعَنَہُمۡ وَ اَعَدَّ لَہُمۡ جَہَنَّمَ ؕ وَ سَآءَتۡ مَصِیۡرًا ﴿۷﴾", "english": " And that He may punish the hypocritical men and the hypocritical women, and the idolatrous men and the idolatrous women, who entertain evil thoughts concerning Allah. On them shall fall an evil calamity; and the wrath of Allah is upon them. And He has cursed them, and has prepared Hell for them. And that indeed is an evil destination.", "french": " Et afin qu’Il puisse châtier les hypocrites, hommes et femmes, et les idolâtres, hommes et femmes, qui nourrissent de mauvaises pensées envers Allāh. Ils seront frappés par le mauvais sort de la vicissitude ; et Allāh est courroucé contre eux. Et Il les a maudits, et Il a préparé l'Enfer pour eux. Et cela, vraiment, est une mauvaise destination.", "german": " und die Heuchler und Heuchlerinnen und die Götzendiener und Götzendienerinnen strafe, die schlimme Gedanken über Allah hegen. Auf solche wird ein böses Unheil niederfallen; Allah zürnte ihnen, und Er hat sie von Sich gewiesen und hat die Hölle für sie bereitet. Und eine üble Bestimmung ist das.", "spanish": " Y para castigar a los hombres hipócritas y a las mujeres hipócritas y a los hombres idólatras y a las mujeres idólatras, que abrigan malos pensamientos sobre Al-lah. Sobre ellos pasará la rueda del infortunio; y la cólera de Al-lah. Él los ha maldecido y les ha preparado el Infierno. ¡Qué mal destino es en verdad!", "urdu": " اور تا کہ منافق مردوں اور منافق عورتوں اور مشرک مردوں اور مشرک عورتوں کو جو اللہ پر بدگمانی کرنے والے ہیں عذاب دے۔ مصیبت کا چکر انہی پر آئے گا اور اللہ نے ان پر غضب نازل کیا ہے اور اپنی درگاہ سے ان کو دور کر دیا ہے اور ان کے لئے اس نے جہنم تیار کر رکھی ہے‘ جو بہت برا ٹھکانا ہے۔"}, {"arabic": " وَ لِلّٰہِ جُنُوۡدُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ کَانَ اللّٰہُ عَزِیۡزًا حَکِیۡمًا ﴿۸﴾", "english": " And to Allah belong the hosts of the heavens and the earth; and Allah is Mighty, Wise.", "french": " Et à Allāh appartiennent les armées des cieux et de la terre ; et Allāh est Puissant, Sage.", "german": " Allahs sind die Heerscharen der Himmel und der Erde; und Allah ist allmächtig, allweise.", "spanish": " Pues a Al-lah pertenecen las huestes de los cielos y la tierra; y Al-lah es Poderoso, Sabio.", "urdu": " اور آسمانوں اور زمین کے لشکر اللہ ہی کے ہیں۔ اور اللہ بڑا غالب (اور) حکمت والا ہے۔"}, {"arabic": " اِنَّاۤ اَرۡسَلۡنٰکَ شَاہِدًا وَّ مُبَشِّرًا وَّ نَذِیۡرًا ۙ﴿۹﴾", "english": " We have sent thee as a Witness and a bearer of glad tidings and a Warner,", "french": " Nous t’avons envoyé en tant que Témoin, Porteur de la bonne nouvelle et Avertisseur,", "german": " Wir haben dich als Zeugen gesandt und als Bringer froher Botschaft und als Warner,", "spanish": " Te hemos enviado como Testigo, portador de la buena nueva y Amonestador.", "urdu": " ہم نے تجھے (اپنی صفات کے لئے) گواہ اور (مومنوں کے لئے) بشارت دینے والا اور (کافروں کے لئے) ہوشیار کرنے والا بنا کر بھیجا ہے۔"}, {"arabic": " لِّتُؤۡمِنُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ وَ تُعَزِّرُوۡہُ وَ تُوَقِّرُوۡہُ ؕ وَ تُسَبِّحُوۡہُ بُکۡرَۃً وَّ اَصِیۡلًا ﴿۱۰﴾", "english": " That you should believe in Allah and His Messenger, and may help him, and honour him, and that you may glorify Him morning and evening.", "french": " Afin que vous croyiez en Allāh et en Son Messager, et que vous l’aidiez et l’honoriez, et que vous Le glorifiiez matin et soir.", "german": " auf dass ihr an Allah und Seinen Gesandten glaubet und dass ihr ihm helfet und ihn ehret und Ihn preiset morgens und abends.", "spanish": " Para que creáis en Al-lah y en Su Mensajero y le ayudéis y le honréis, y para que glorifiquéis a Al-lah por la mañana y por la tarde.", "urdu": " تا کہ تم اس کے ذریعہ سے اللہ اور اس کے رسول پر ایمان لاٶ اور اس کی مدد کرو اور اس کی عزت کرو۔ اور صبح و شام اس کی تسبیح کرو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یُبَایِعُوۡنَکَ اِنَّمَا یُبَایِعُوۡنَ اللّٰہَ ؕ یَدُ اللّٰہِ فَوۡقَ اَیۡدِیۡہِمۡ ۚ فَمَنۡ نَّکَثَ فَاِنَّمَا یَنۡکُثُ عَلٰی نَفۡسِہٖ ۚ وَ مَنۡ اَوۡفٰی بِمَا عٰہَدَ عَلَیۡہُ اللّٰہَ فَسَیُؤۡتِیۡہِ اَجۡرًا عَظِیۡمًا ﴿٪۱۱﴾", "english": " Verily, those who swear allegiance to thee indeed swear allegiance to Allah. The hand of Allah is over their hands. So whoever breaks his oath , breaks it to his own loss; and whoever fulfils the covenant that he has made with Allah, He will surely give him a great reward.", "french": " En vérité, ceux qui te prêtent serment d’allégeance, prêtent en fait serment à Allāh. La main d’Allāh est sur leurs mains. Alors quiconque viole son serment , ne le viole qu'à son détriment ; et quiconque reste fidèle au pacte qu’il a fait avec Allāh, Il lui accordera sûrement une très grande récompense.", "german": " Die dir Treue schwören, Allah nur schwören sie Treue; die Hand Allahs ist über ihren Händen. Wer daher den Eid bricht, bricht ihn zum Schaden seiner eigenen Seele; wer aber das hält, wozu er sich gegen Allah verpflichtet hat, dem wird Er gewaltigen Lohn zuerkennen.", "spanish": " En verdad, los que te juran lealtad a ti ciertamente juran lealtad a Al-lah. La mano de Al-lah está sobre sus manos. Por ello, quien incumple su juramento, lo incumple en su propio perjuicio; y a quien cumpla el pacto establecido con Al-lah, Él le concederá ciertamente una gran recompensa.", "urdu": " وہ لوگ جو تیری بیعت کرتے ہیں وہ صرف اللہ کی بیعت کرتے ہیں۔ اللہ کا ہاتھ ان کے ہاتھ پر ہے۔ پس جو کوئی اس عہد کو توڑے گا تو اس کے توڑنے کا وبال اس کی جان پر پڑے گا۔ اور جو کوئی اس عہد کو جو اس نے خدا سے کیا تھا پورا کرے گا اللہ اس کو اس کا بہت بڑا اجر دے گا۔"}, {"arabic": " سَیَقُوۡلُ لَکَ الۡمُخَلَّفُوۡنَ مِنَ الۡاَعۡرَابِ شَغَلَتۡنَاۤ اَمۡوَالُنَا وَ اَہۡلُوۡنَا فَاسۡتَغۡفِرۡ لَنَا ۚ یَقُوۡلُوۡنَ بِاَلۡسِنَتِہِمۡ مَّا لَیۡسَ فِیۡ قُلُوۡبِہِمۡ ؕ قُلۡ فَمَنۡ یَّمۡلِکُ لَکُمۡ مِّنَ اللّٰہِ شَیۡئًا اِنۡ اَرَادَ بِکُمۡ ضَرًّا اَوۡ اَرَادَ بِکُمۡ نَفۡعًا ؕ بَلۡ کَانَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ خَبِیۡرًا ﴿۱۲﴾", "english": " Those of the desert Arabs, who were left behind, will say to thee, ‘Our possessions and our families kept us occupied, so ask forgiveness for us.’ They say with their tongues that which is not in their hearts. Say, ‘Who can avail you aught against Allah, if He intends you some harm, or if He intends you some benefit? Nay, Allah is Well-Aware of what you do.", "french": " Ceux d’entre les Arabes du désert qui s’arrangèrent pour être laissés en arrière, te diront : « Nos biens et nos familles nous ont retenus ; demande donc pardon pour nous. » lls disent avec leur langue ce qui n’est pas dans leur cœur. Dis : « Qui donc peut quelque chose pour vous protéger contre lavolonté Allāh, s’Il vous veut du mal, ou s’Il vous veut du bien ? Non , mais Allāh est Très-Conscient de ce que vous faites.", "german": " Diejenigen unter den Wüstenarabern, die zurückblieben, werden zu dir sprechen: \"Unsere Besitztümer und unsere Familien hielten uns beschäftigt, drum bitte um Verzeihung für uns.\" Sie sprechen mit ihren Zungen, was nicht in ihren Herzen ist. Sprich: \"Wer vermag etwas für euch bei Allah, wenn Er euch Schaden oder Nutzen zudenkt? Nein, Allah ist wohl kundig dessen, was ihr tut.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=48:12&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=48:12&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic13\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic13\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/48:13' style='text-decoration:underline'>48:13</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(13)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control13\"></i></button> <audio id=\"player13\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">بَلۡ ظَنَنۡتُمۡ اَنۡ لَّنۡ یَّنۡقَلِبَ الرَّسُوۡلُ وَ الۡمُؤۡمِنُوۡنَ اِلٰۤی اَہۡلِیۡہِمۡ اَبَدًا وَّ زُیِّنَ ذٰلِکَ فِیۡ قُلُوۡبِکُمۡ وَ ظَنَنۡتُمۡ ظَنَّ السَّوۡءِ ۚۖ وَ کُنۡتُمۡ قَوۡمًۢا بُوۡرًا ﴿۱۳﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘Nay, you thought that the Messenger and the believers would never come back to their families, and that was made <em>to appear</em> pleasing to your hearts, and you thought an evil thought, and you were a ruined people.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> ‘Nay, you thought that the Messenger and the believers would never return to their families,<sup class='ref'>[<a class='ref' data-id='ref_48_13_2771' href='#'>2771</a>]</sup> and that was made <i>to appear </i>pleasing to your hearts, and you thought an evil thought, and you were a ruined people.’ <div class=\"footnote\"> <span class='collapsible plus' data-id='ref_48_13_2771'>2771</span></div> <div><a name='2771'></a><div class='reference' data-id='ref_48_13_2771' style='display:none'> <p><b>2771.</b> Wish being father to the thought, the Hypocrites, whenever invited by the Holy Prophet to join him in an expedition, entertained the fond hope that Muslims being very weak would never return safe to their families. Therefore, on one pretext or another, they asked to be excused. But their wishful thinking always ended in frustration and severe disappointment, and the Muslims returned successful from almost every expedition. (<a href='javascript:void(0)' data-id='ref_48_13_2771' class='ref'>close</a>)</p> </div> </div> </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">بلکہ تم گمان کرتے رہے کہ رسول اور ایمان لانے والے اپنے اہل و عیال کی طرف کبھی لوٹ کر نہیں آئیں گے۔ اور یہ بات تمہارے دلوں کو اچھی دکھائی گئی اور تم بدظنّی کرتے رہے اور ایک ہلاک ہونے والی قوم ہوگئے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">حقیقت یہ ہے کہ تم نے گمان کیا تھا کہ رسول اور مومن کبھی بھی اپنے اہل و عیال کی طرف سلامت لوٹ کر نہیں آئیں گے اور یہ امر تمہاری نظر میں خوبصورت کرکے دکھایا گیا تھا (اور تم دل میں بہت خوش تھے) اور تم (مومنوں کے متعلق اور خدا کے متعلق) برے گمان کرتے تھے (حالانکہ مومن نہیں) بلکہ تم خود ہلاک ہونے والے لوگوں میں شامل ہوگئے تھے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\"><em>Non</em>, mais vous pensiez que le Messager et les croyants ne retourneraient jamais à leurs familles, et cela fut rendu attrayant à votre cœur, et vous avez nourri une mauvaise pensée, et vous étiez un peuple perdu. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“¡No!, creísteis que el Mensajero y los creyentes nunca volverían a sus familias, y eso se hizo atractivo para vuestros corazones; mantuvisteis un pensamiento malvado y fuisteis un pueblo corrompido”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Nein, ihr wähntet, dass der Gesandte und die Gläubigen nimmermehr zu ihren Familien zurückkehren würden, und das wurde euren Herzen wohlgefällig gemacht, und ihr hegtet einen bösen Gedanken und ihr wart ein verderbtes Volk.\"", "spanish": " Los moradores del desierto, que quedaron atrás te dirán: “Nuestros bienes y nuestras familias nos mantuvieron ocupados; pide, pues, perdón por nosotros”. Dicen con sus lenguas lo que no está en sus corazones. Diles: “¿Quién puede serviros de algo contra Al-lah si piensa perjudicaros de algún modo o piensa beneficiaros? No, Al-lah es Perfectamente Consciente de lo que hacéis.", "urdu": " اعراب میں سے جو پیچھے چھوڑ دئیے گئے تھے ضرور کہیں گے کہ ہمارے مال اور ہمارے اہل و عیال نے ہم کو مشغول رکھا (اس لئے ہم اس سفر پر نہیں گئے) پس تو ہمارے لئے استغفار کر۔ وہ اپنی زبانوں سے وہ بات کہتے ہیں جو ان کے دلوں میں نہیں۔ تو کہہ دے اگر اللہ تم کو کوئی نقصان پہنچانا چاہے یا تم کوکوئی نفع دینا چاہے تو کون وجود ہے جو اس کے خلاف تمہارے لئے کچھ بھی کر سکتا ہے؟ ایسا ہرگز نہیں بلکہ اللہ تمہارے اعمال سے خبردار ہے۔"}, {"arabic": " وَ مَنۡ لَّمۡ یُؤۡمِنۡۢ بِاللّٰہِ وَ رَسُوۡلِہٖ فَاِنَّاۤ اَعۡتَدۡنَا لِلۡکٰفِرِیۡنَ سَعِیۡرًا ﴿۱۴﴾", "english": " And as for those who believe not in Allah and His Messenger — We have surely prepared for the disbelievers a blazing fire.", "french": " Et quant à ceux qui ne croient pas en Allāh et en Son Messager – Nous avons, en vérité, préparé pour les mécréants une Fournaise.", "german": " Und jene, die nicht an Allah und Seinen Gesandten glauben – für die Ungläubigen haben Wir ein flammendes Feuer bereitet.", "spanish": " En cuanto a quienes no creen en Al-lah y en Su Mensajero, sepan que ciertamente hemos preparado para los incrédulos un fuego llameante.", "urdu": " اور جو شخص اللہ اور اس کے رسول پر ایمان نہیں لاتا (وہ یاد رکھے کہ) ہم نے کافروں کے لئے بھڑکنے والا عذاب مقدر کر چھوڑا ہے۔"}, {"arabic": " وَ لِلّٰہِ مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ یَغۡفِرُ لِمَنۡ یَّشَآءُ وَ یُعَذِّبُ مَنۡ یَّشَآءُ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۱۵﴾", "english": " And to Allah belongs the kingdom of the heavens and the earth. He forgives whom He pleases, and punishes whom He pleases. And Allah is Most Forgiving, Merciful.", "french": " Et à Allāh appartient le royaume des cieux et de la terre. Il pardonne à qui Il veut et Il châtie qui Il veut. Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Und Allahs ist das Königreich der Himmel und der Erde. Er verzeiht, wem Er will, und straft, wen Er will und Allah ist allverzeihend, barmherzig.", "spanish": " A Al-lah pertenece el reino de los cielos y la tierra. Él perdona a quien Le agrada y castiga a quien quiere. Pues Al-lah es el Sumo Indulgente, Misericordioso.", "urdu": " اور آسمانوں اور زمین کی بادشاہت اللہ ہی کے قبضہ میں ہے جس کو چاہتا ہے معاف کر دیتا ہے اور جس کو چاہتا ہے عذاب دیتا ہے اور اللہ بہت معاف کرنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " سَیَقُوۡلُ الۡمُخَلَّفُوۡنَ اِذَا انۡطَلَقۡتُمۡ اِلٰی مَغَانِمَ لِتَاۡخُذُوۡہَا ذَرُوۡنَا نَتَّبِعۡکُمۡ ۚ یُرِیۡدُوۡنَ اَنۡ یُّبَدِّلُوۡا کَلٰمَ اللّٰہِ ؕ قُلۡ لَّنۡ تَتَّبِعُوۡنَا کَذٰلِکُمۡ قَالَ اللّٰہُ مِنۡ قَبۡلُ ۚ فَسَیَقُوۡلُوۡنَ بَلۡ تَحۡسُدُوۡنَنَا ؕ بَلۡ کَانُوۡا لَا یَفۡقَہُوۡنَ اِلَّا قَلِیۡلًا ﴿۱۶﴾", "english": " Those who had managed to be left behind will say, when you go forth to the spoils that you may get them, ‘Let us follow you.’ They seek to change the decree of Allah. Say, ‘You shall not follow us. Thus has Allah said beforehand.’ Then they will say, ‘Nay, but you envy us.’ Not so, but they understand not except a little.", "french": " Ceux qui s’arrangèrent pour être laissés en arrière diront, quand vous partirez ramasser le butin, « Permettez-nous de vous suivre. » Ils veulent changer le décret d’Allāh. Dis : « Vous ne nous suivrez pas. Ainsi l’a dit Allāh auparavant. » Alors ils diront : « Non, mais vous nous enviez. » Pas du tout, mais ils ne comprennent pas grand’chose.", "german": " Diejenigen, die zurückblieben, werden sagen, wenn ihr auszieht, leichte Beute zu nehmen: \"Erlaubt uns, euch zu folgen.\" Sie möchten Allahs Spruch ändern. Sprich: \"Ihr sollt uns nicht folgen. Also hat Allah zuvor gesprochen.\" Dann werden sie sagen: \"Nein, aber ihr beneidet uns.\" Das nicht, jedoch sie verstehen nur wenig.", "spanish": " Los que se las arreglaron para quedar atrás dirán, cuando os dirijáis para recoger el botín: “Permitidnos que os sigamos”. Intentan cambiar el decreto de Al-lah. Diles: “No nos seguiréis. Así lo dijo Al-lah previamente”. Entonces responderán: “¡No!, es porque nos envidiáis”. No es así, pero no entienden casi nada.", "urdu": " جب تم غنیمت کے اموال کو جمع کرنے کے لئے چلو گے تو پیچھے چھوڑے گئے لوگ کہیں گے کہ ہم کو اجازت دو کہ ہم بھی تمہارے پیچھے چلیں‘ وہ چاہیں گے کہ اللہ کے فیصلہ کو بدل ڈالیں تو کہہ دے تم ہرگز ہمارے پیچھے نہیں آسکتے۔ یہی تمہارے متعلق فیصلہ ہے جو اللہ اس سے پہلے دے چکا ہے۔ اس پر وہ کہیں گے۔ اصل میں تم ہم پر حسد کرتے ہو۔ لیکن حقیقت یہ ہے کہ وہ سمجھ سے بالکل کورے ہیں۔"}, {"arabic": " قُلۡ لِّلۡمُخَلَّفِیۡنَ مِنَ الۡاَعۡرَابِ سَتُدۡعَوۡنَ اِلٰی قَوۡمٍ اُولِیۡ بَاۡسٍ شَدِیۡدٍ تُقَاتِلُوۡنَہُمۡ اَوۡ یُسۡلِمُوۡنَ ۚ فَاِنۡ تُطِیۡعُوۡا یُؤۡتِکُمُ اللّٰہُ اَجۡرًا حَسَنًا ۚ وَ اِنۡ تَتَوَلَّوۡا کَمَا تَوَلَّیۡتُمۡ مِّنۡ قَبۡلُ یُعَذِّبۡکُمۡ عَذَابًا اَلِیۡمًا ﴿۱۷﴾", "english": " Say to the desert Arabs who were left behind, ‘You shall be called to fight against a people of mighty valour; you shall fight them until they surrender. Then, if you obey, Allah will give you a good reward, but if you turn your backs, as you turned your backs before, He will punish you with a painful punishment.’", "french": " Dis aux Arabes du désert qui s’arrangèrent pour être laissés en arrière : « Vous serez appelés pour combattre un peuple de guerriers redoutables ; vous vous battrez contre eux jusqu’à ce qu’ils se soumettent. Alors, si vous obéissez, Allāh vous accordera une belle récompense, mais si vous tournez le dos, comme vous avez tourné le dos auparavant, Il vous châtiera d’un châtiment douloureux. »", "german": " Sprich zu den Wüstenarabern, die zurückblieben: \"Ihr sollt gegen ein Volk von gewaltigen Kriegern aufgerufen werden; ihr sollt sie bekämpfen, bis sie sich ergeben. Dann, wenn ihr gehorcht, wird Allah euch schönen Lohn geben; doch wenn ihr den Rücken kehrt, wie ihr ihn zuvor gekehrt habt, so wird Er euch bestrafen mit qualvoller Strafe.\"", "spanish": " Di a los árabes del desierto que quedaron detrás: “Seréis llamados a luchar contra un pueblo de enorme valor; lucharéis contra ellos hasta que se rindan. Entonces, si obedecéis, Al-lah os dará una buena recompensa, pero si dais la espalda, como disteis antes la espalda, os castigará con un castigo doloroso”.", "urdu": " اعراب میں سے جو لوگ پیچھے چھوڑے گئے ہیں تو ان سے کہدے کہ ضرور تم ایک ایسی قوم سے جنگ کرنے کے لئے بلائے جاٶ گے جو فنون جنگ میں بڑی ماہر ہے تم ان سے اس وقت تک جنگ کرو گے کہ وہ مسلمان ہو جائیں۔ پس اگر تم (اس وقت خدا کی آواز) مانو گے تو اللہ تم کو بڑا اچھا اجر دے گا اور اگر تم (حکم سے) روگردانی کرو گے جس طرح اس سے پہلے (روگردانی) کی تھی تو اللہ تم کو دردناک عذاب دے گا۔"}, {"arabic": " لَیۡسَ عَلَی الۡاَعۡمٰی حَرَجٌ وَّ لَا عَلَی الۡاَعۡرَجِ حَرَجٌ وَّ لَا عَلَی الۡمَرِیۡضِ حَرَجٌ ؕ وَ مَنۡ یُّطِعِ اللّٰہَ وَ رَسُوۡلَہٗ یُدۡخِلۡہُ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ۚ وَ مَنۡ یَّتَوَلَّ یُعَذِّبۡہُ عَذَابًا اَلِیۡمًا ﴿٪۱۸﴾", "english": " There is no blame on the blind, nor is there blame on the lame, nor is there blame on the sick, if they go not forth for fight . And whoso obeys Allah and His Messenger, He will make him enter the Gardens beneath which streams flow; but whoso turns his back, him will He punish with a grievous punishment.", "french": " Il n’y aura aucun reproche à l’aveugle, ni aucun reproche au boiteux, ni aucun reproche au malade, s’ils ne partent pas au combat . Et quiconque obéit à Allāh et à Son Messager, Il l’admettra dans des Jardins sous lesquels coulent des rivières ; mais quiconque tournera le dos, Il le châtiera d’un châtiment douloureux.", "german": " Kein Tadel trifft den Blinden, noch trifft ein Tadel den Lahmen, noch trifft ein Tadel den Kranken (wenn sie nicht ausziehen). Und wer Allah und Seinem Gesandten gehorcht, den wird Er in Gärten führen, durch die Ströme fließen; doch wer den Rücken kehrt, den wird Er strafen mit schmerzlicher Strafe.", "spanish": " No tiene culpa el ciego, ni tiene culpa el cojo, ni tampoco el enfermo, si no se dirigen a la lucha. Mas a quien obedece a Al-lah y a Su Mensajero, Él lo hará entrar en los Jardines por los que corren ríos; pero a quien vuelva la espalda, Él lo castigará con un castigo severo.", "urdu": " نہ تو کسی اندھے پر سختی ہے اور نہ لنگڑے پر سختی ہے اور نہ مریض پر سختی ہے (کہ وہ باوجود معذوری کے لڑائی میں شامل ہوں) اور جو اللہ اور اس کے رسول کی اطاعت کرے وہ اسے ایسی جنتوں میں داخل کرے گا جس کے نیچے نہریں بہتی ہیں اور جو (کوئی حکم سے) روگردانی کرے گا اللہ اسے دردناک عذاب دے گا۔"}, {"arabic": " لَقَدۡ رَضِیَ اللّٰہُ عَنِ الۡمُؤۡمِنِیۡنَ اِذۡ یُبَایِعُوۡنَکَ تَحۡتَ الشَّجَرَۃِ فَعَلِمَ مَا فِیۡ قُلُوۡبِہِمۡ فَاَنۡزَلَ السَّکِیۡنَۃَ عَلَیۡہِمۡ وَ اَثَابَہُمۡ فَتۡحًا قَرِیۡبًا ﴿ۙ۱۹﴾", "english": " Surely, Allah was well pleased with the believers when they were swearing allegiance to thee under the Tree, and He knew what was in their hearts, and He sent down tranquillity on them, and He rewarded them with a victory near at hand;", "french": " Assurément, Allāh fut très content des croyants, lorsqu’ils te prêtaient serment d’allégeance sous l’Arbre, et Il savait ce qui était dans leur cœur, et Il a fait descendre la tranquillité sur eux, et Il les a récompensés par une victoire proche ;", "german": " Allah war wohl zufrieden mit den Gläubigen, da sie dir Treue gelobten unter dem Baum, und Er wusste, was in ihren Herzen war, dann senkte Er die Ruhe auf sie und belohnte sie mit einem Sieg, der nahe zur Hand war,", "spanish": " En verdad, Al-lah se congratuló con los creyentes cuando te juraron fidelidad bajo el Árbol; Él sabía lo que había en sus corazones, y Él les infundió tranquilidad, recompensándolos con una victoria inmediata.", "urdu": " اللہ مومنوں سے اس وقت بالکل خوش ہو گیا جب کہ وہ درخت کے نیچے تیری بیعت کر رہے تھے اور اس نے اس (ایمان) کو جو ان کے دلوں میں تھا خوب جان لیا سو اس کے نتیجہ میں اس نے ان کے دلوں پر سکینت نازل کی اور ان کو ایک قریب میں آنے والی فتح بخشی۔"}, {"arabic": " وَّ مَغَانِمَ کَثِیۡرَۃً یَّاۡخُذُوۡنَہَا ؕ وَ کَانَ اللّٰہُ عَزِیۡزًا حَکِیۡمًا ﴿۲۰﴾", "english": " And great spoils that they will take. And Allah is Mighty, Wise.", "french": " Et par beaucoup de butin qu’ils prendront. Et Allāh est Puissant, Sage.", "german": " und viel Beute, die sie machen sollen. Und Allah ist allmächtig, allweise.", "spanish": " Y grandes trofeos que obtendrán, pues Al-lah es Poderoso, Sabio.", "urdu": " اور بہت سے غنیمت کے مال بھی بخشے جن کو وہ قبضہ میں لا رہے تھے اور اللہ غالب (اور) حکمت والا ہے۔"}, {"arabic": " وَعَدَکُمُ اللّٰہُ مَغَانِمَ کَثِیۡرَۃً تَاۡخُذُوۡنَہَا فَعَجَّلَ لَکُمۡ ہٰذِہٖ وَ کَفَّ اَیۡدِیَ النَّاسِ عَنۡکُمۡ ۚ وَ لِتَکُوۡنَ اٰیَۃً لِّلۡمُؤۡمِنِیۡنَ وَ یَہۡدِیَکُمۡ صِرَاطًا مُّسۡتَقِیۡمًا ﴿ۙ۲۱﴾", "english": " Allah has promised you great spoils that you will take, and He has given you this in advance, and has restrained the hands of men from you, that it may be a Sign for the believers, and that He may guide you on a right path.", "french": " Allāh vous a promis beaucoup de butin que vous prendrez, et Il vous a donné ceci d’avance, et Il a retenu de vous les mains des hommes, afin que ce soit un Signe pour les croyants, et qu’Il vous guide sur un droit chemin.", "german": " Allah hat euch viel Beute verheißen, die ihr machen sollt, und einstweilen hat Er euch dies gegeben und hat die Hände der Menschen von euch abgehalten, dass es ein Zeichen für die Gläubigen sei und dass Er euch leite auf den geraden Weg.", "spanish": " Al-lah os ha prometido grandes trofeos que alcanzaréis; os ha dado esto de antemano y ha apartado las manos de los hombres de vosotros, para que sirva de Signo para los creyentes y os guíe por el camino recto.", "urdu": " اللہ نے تم سے بہت سی غنیمتوں کا وعدہ کیا ہے جو تم اپنے قبضہ میں لاٶ گے اور یہ موجودہ مال غنیمت تم کو ان وعدوں میں سے جلدی سے عطا کر دیا ہے اور لوگوں کے ہاتھوں کو تم سے روک دیا ہے تا کہ یہ (واقعات) مومنوں کے لئے ایک نشان بن جائیں اور وہ (اللہ) تم کو اس کے ذریعہ سے سیدھا راستہ دکھائے۔"}, {"arabic": " وَّ اُخۡرٰی لَمۡ تَقۡدِرُوۡا عَلَیۡہَا قَدۡ اَحَاطَ اللّٰہُ بِہَا ؕ وَ کَانَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرًا ﴿۲۲﴾", "english": " And He has promised you another victory , which you have not yet been able to achieve, but Allah has surely compassed it. And Allah has power over all things.", "french": " Et Il vous a promis une autre victoire , que vous n’avez pas encore pu remporter, mais Allāh l’a déjà cernée. Et Allāh a le pouvoir de faire tout ce qu’Il veut.", "german": " Und einen anderen (Sieg), den ihr noch nicht zu erlangen vermochtet, doch Allah hat ihn in Seiner Macht. Und Allah ist mächtig über alle Dinge.", "spanish": " Él os ha prometido otra victoria, que no podréis conseguir aún, pero que Al-lah ciertamente la ha conseguido, porque Al-lah tiene poder sobre todas las cosas.", "urdu": " اور (اس کے علاوہ) ایک اور بھی (فتح) ہے جو تم کو اب تک حاصل نہیں ہوئی۔ اللہ نے اس کا فیصلہ کر چھوڑا ہے اور اللہ اپنے ارادہ کو پورا کرنے پر پورا قادر ہے۔"}, {"arabic": " وَ لَوۡ قٰتَلَکُمُ الَّذِیۡنَ کَفَرُوۡا لَوَلَّوُا الۡاَدۡبَارَ ثُمَّ لَا یَجِدُوۡنَ وَلِیًّا وَّ لَا نَصِیۡرًا ﴿۲۳﴾", "english": " And if those who disbelieve should fight you, they would certainly turn their backs; then they would find neither protector nor helper.", "french": " Et si ceux qui refusent de croire se battaient contre vous, ils tourneraient assurément le dos en déroute ; alors ils ne trouveraient ni protecteur ni secoureur.", "german": " Und wenn die Ungläubigen euch bekämpft hätten, sie hätten gewiss den Rücken gekehrt: dann hätten sie weder Beschützer noch Helfer finden können.", "spanish": " Mas si los incrédulos os combatieran, ciertamente volverían sus espaldas; entonces no encontrarían protector ni ayudante.", "urdu": " اور اگر کفار (صلح حدیبیہ کے وقت) تم سے لڑتے‘ تو وہ اسی وقت پیٹھ پھیر کر بھاگ جاتے اور نہ کوئی پناہ دینے والا پاتے‘ نہ مددگار (پاتے) ۔"}, {"arabic": " سُنَّۃَ اللّٰہِ الَّتِیۡ قَدۡ خَلَتۡ مِنۡ قَبۡلُ ۚۖ وَ لَنۡ تَجِدَ لِسُنَّۃِ اللّٰہِ تَبۡدِیۡلًا ﴿۲۴﴾", "english": " Such is the law of Allah that has been in operation before; and thou shalt not find any change in the law of Allah.", "french": " Telle est la pratique établie d’Allāh qui était déjà en vigueur ; tu ne trouveras aucun changement dans la pratique d’Allāh.", "german": " Solches ist Allahs Vorgehen, wie es zuvor gewesen; und nie wirst du in Allahs Vorgehen einen Wandel finden.", "spanish": " Así es la conducta dispuesta de Al-lah que ha estado vigente con anterioridad; y no encontrarás cambio alguno en la conducta instituida por Al-lah.", "urdu": " اللہ کی اس سنت کو یاد رکھو‘ جو ہمیشہ سے چلی آئی ہے اور تو کبھی بھی اللہ کے مقررہ طریقے میں کوئی تبدیلی نہیں پائے گا۔"}, {"arabic": " وَ ہُوَ الَّذِیۡ کَفَّ اَیۡدِیَہُمۡ عَنۡکُمۡ وَ اَیۡدِیَکُمۡ عَنۡہُمۡ بِبَطۡنِ مَکَّۃَ مِنۡۢ بَعۡدِ اَنۡ اَظۡفَرَکُمۡ عَلَیۡہِمۡ ؕ وَ کَانَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ بَصِیۡرًا ﴿۲۵﴾", "english": " And He it is Who withheld their hands from you and your hands from them in the valley of Mecca, after He had given you victory over them. And Allah sees all that you do.", "french": " Et c’est Lui Qui a retenu leurs mains de vous, et Qui a retenu vos mains d’eux, dans la vallée de la Mecque, après vous avoir accordé la victoire sur eux. Et Allāh voit bien tout ce que vous faites.", "german": " Und Er ist es, Der ihre Hände von euch abhielt und eure Hände von ihnen in dem Tale von Mekka, nachdem Er euch Sieg über sie gegeben. Und Allah sieht alles, was ihr tut.", "spanish": " Él es Quien apartó sus manos de vosotros y vuestras manos de ellos en el valle de la Meca, después de concederos la victoria sobre ellos. Pues Al-lah ve todo lo que hacéis.", "urdu": " اور وہ خدا ہی ہے جس نے ان کے ہاتھوں کو تم سے اور تمہارے ہاتھوں کو ان سے مکہ کی وادی میں روک دیا‘ بعد اس کے کہ تم (حالات کے مطابق) ان پر فتح پا چکے تھے اور اللہ تمہارے اعمال کو دیکھ رہا تھا (اور جانتا تھا کہ تم لڑنے سے نہیں ڈرتے)۔"}, {"arabic": " ہُمُ الَّذِیۡنَ کَفَرُوۡا وَ صَدُّوۡکُمۡ عَنِ الۡمَسۡجِدِ الۡحَرَامِ وَ الۡہَدۡیَ مَعۡکُوۡفًا اَنۡ یَّبۡلُغَ مَحِلَّہٗ ؕ وَ لَوۡ لَا رِجَالٌ مُّؤۡمِنُوۡنَ وَ نِسَآءٌ مُّؤۡمِنٰتٌ لَّمۡ تَعۡلَمُوۡہُمۡ اَنۡ تَطَـُٔوۡہُمۡ فَتُصِیۡبَکُمۡ مِّنۡہُمۡ مَّعَرَّۃٌۢ بِغَیۡرِ عِلۡمٍ ۚ لِیُدۡخِلَ اللّٰہُ فِیۡ رَحۡمَتِہٖ مَنۡ یَّشَآءُ ۚ لَوۡ تَزَیَّلُوۡا لَعَذَّبۡنَا الَّذِیۡنَ کَفَرُوۡا مِنۡہُمۡ عَذَابًا اَلِیۡمًا ﴿۲۶﴾", "english": " It is they who disbelieved and hindered you from the Sacred Mosque and the offering which was prevented from reaching its place of sacrifice. And had it not been for believing men and believing women whom you knew not and whom you might have trampled down so that harm might have come to you on their account unknowingly, He would have permitted you to fight , but He did not do so that He might admit into His mercy whom He will. If they had been separated from the disbelievers , We would have surely punished those of them who disbelieved with a grievous punishment.", "french": " Ce sont eux qui ont refusé de croire, et qui vous ont empêchés d’avoir accès à la Sainte Mosquée, et ont empêché les offrandes entravées de parvenir à leur lieu d’immolation. Et s’il n’y avait pas eu des croyants et des croyantes que vous ne connaissiez pas, et que vous auriez pu fouler aux pieds, de sorte qu’à cause d’eux, un mal aurait pu vous survenir sans le savoir , Allāh vous aurait permis de combattre mais Il ne l'a pas fait afin qu’Il pût admettre dans Sa miséricorde qui Il veut. S’ils avaient été séparés des mécréants , Nous aurions assurément châtié, d’un châtiment douloureux, ceux d’entre eux qui refusaient de croire.", "german": " Sie sind es, die ungläubig waren und euch fernhielten von der Heiligen Moschee und das Opfer verhinderten, seine Opferstätte zu erreichen. Und wäre es nicht um die gläubigen Männer und die gläubigen Frauen gewesen, die ihr nicht kennt und die ihr vielleicht unwissentlich niedergetreten hättet, so dass euch ihrethalben ein Unrecht hätte zugerechnet werden können (Er hätte euch erlaubt zu kämpfen, so aber tat Er es nicht), auf dass Allah in Seine Gnade führe, wen Er will. Wären sie getrennt gewesen, Wir hätten sicherlich jene unter ihnen (den Mekkanern), die ungläubig waren, mit schmerzlicher Strafe gestraft.", "spanish": " Son los incrédulos quienes os impidieron la entrada en la Mezquita Sagrada así como la ofrenda que no pudo alcanzar el lugar del sacrificio. Y de no haber sido por los hombres y mujeres creyentes a los que no conocíais y que hubierais podido exterminar, hasta el punto e que os hubierais perjudicado, sin saberlo, a causa de ellos, Él os hubiera permitido luchar, pero no lo hizo para poder admitir a Su Misericordia a quien quisiera. Si hubiesen estado separados de los incrédulos , en verdad habríamos castigado a los que no creían con un severo castigo.", "urdu": " وہ (تمہارے دشمن) ہی تھے جنہوں نے کفر کیا اور تم کو مسجدحرام (کی زیارت) سے روکا۔ اوراسی طرح قربانیوں کو جو (مکہ کیلئے) وقف ہو چکی تھیں (اس بات سے روک دیا کہ) وہ اپنی منزل مقصود تک پہنچ سکیں۔ اور اگر (مکہ میں) کچھ مومن مرد ایسے نہ ہوتے اور کچھ مومن عورتیں ایسی نہ ہوتیں جن کو تم نہیں جانتے تھے اور یہ خطرہ نہ ہوتا کہ تم ان کو نادانستہ پاٶں کے نیچے روند جاٶ گے اور اس کے نتیجہ میں تم پر عیب لگایا جائے گا (تو ہم تم کو لڑنے دیتے مگر خدا نے روکے رکھا) تا کہ اللہ جس کو پسند کرتا ہے اس کواپنی رحمت میں داخل کرے اگر (پوشیدہ مومن) کہیں ادھرادھر ہوگئے ہوتے تو ان (مکہ کے رہنے والوں) میں سے جو کافر تھے ہم ان کو دردناک عذاب پہنچا دیتے۔"}, {"arabic": " اِذۡ جَعَلَ الَّذِیۡنَ کَفَرُوۡا فِیۡ قُلُوۡبِہِمُ الۡحَمِیَّۃَ حَمِیَّۃَ الۡجَاہِلِیَّۃِ فَاَنۡزَلَ اللّٰہُ سَکِیۡنَتَہٗ عَلٰی رَسُوۡلِہٖ وَ عَلَی الۡمُؤۡمِنِیۡنَ وَ اَلۡزَمَہُمۡ کَلِمَۃَ التَّقۡوٰی وَ کَانُوۡۤا اَحَقَّ بِہَا وَ اَہۡلَہَا ؕ وَ کَانَ اللّٰہُ بِکُلِّ شَیۡءٍ عَلِیۡمًا ﴿٪۲۷﴾", "english": " When those who disbelieved harboured in their hearts prideful indignation, the indignation of the Days of Ignorance, Allah sent down His tranquillity on His Messenger and on the believers, and made them cleave to the principle of righteousness, and they were better entitled to it and more worthy of it. And Allah knows everything full well.", "french": " Quand ceux qui avaient refusé de croire ont entretenu dans leur cœur vaniteux leur indignation – indignation du Temps de l’Ignorance – Allāh a fait descendre Sa tranquillité sur Son Messager et sur les croyants, et les a fait s’attacher au principe de la droiture et ils y avaient meilleur droit, et ils en étaient dignes. Et Allāh connaît très bien toute chose.", "german": " Als die Ungläubigen in ihren Herzen Parteilichkeit hegten, die Parteilichkeit der Zeit der Unwissenheit, senkte Allah auf Seinen Gesandten und auf die Gläubigen Seine Ruhe und ließ sie festhalten an dem Grundsatz der Gerechtigkeit, und wohl hatten sie Anspruch darauf und waren seiner würdig. Und Allah weiß alle Dinge.", "spanish": " Cuando los incrédulos forjaron en sus corazones una orgullosa indignación, la indignación de los días de Ignorancia, Al-lah infundió Su tranquilidad a Su Mensajero y a los creyentes y les hizo seguir la palabra de la justicia, porque tenían más derecho y eran más merecedores de ella. Pues Al-lah lo conoce todo perfectamente.", "urdu": " اس وقت کو یاد کرو جبکہ کافروں نے اپنے دلوں میں ایسی جنبہ داری کی روح پھونکی جو جاہلیت کی جنبہ داری کی روح تھی‘ اس پر اللہ نے اپنی طرف سے نازل ہونے والی سکینت اپنے رسول کے دل پر اور مومنوں کے دل پر اتار دی اور تقویٰ کے طریق پر ان کے قدم کو مضبوط کر دیا۔ اور وہی اس کے زیادہ مستحق تھے اور اس کے اہل تھے اور اللہ ہر ایک چیز کو جانتا ہے۔"}, {"arabic": " لَقَدۡ صَدَقَ اللّٰہُ رَسُوۡلَہُ الرُّءۡیَا بِالۡحَقِّ ۚ لَتَدۡخُلُنَّ الۡمَسۡجِدَ الۡحَرَامَ اِنۡ شَآءَ اللّٰہُ اٰمِنِیۡنَ ۙ مُحَلِّقِیۡنَ رُءُوۡسَکُمۡ وَ مُقَصِّرِیۡنَ ۙ لَا تَخَافُوۡنَ ؕ فَعَلِمَ مَا لَمۡ تَعۡلَمُوۡا فَجَعَلَ مِنۡ دُوۡنِ ذٰلِکَ فَتۡحًا قَرِیۡبًا ﴿۲۸﴾", "english": " Surely has Allah in truth fulfilled for His Messenger the Vision. You will certainly enter the Sacred Mosque, if Allah will, in security, some having their heads shaven, and others having their hair cut short; and you will have no fear. But He knew what you knew not. He has in fact ordained for you, besides that, a victory near at hand.", "french": " Assurément, Allāh a réalisé clairement la Vision pour Son Messager. Vous entrerez certainement dans la Sainte Mosquée, si Allāh le veut, en toute sécurité, certains ayant la tête rasée, et d’autres ayant les cheveux coupés ras ; vous n’aurez aucune crainte. Mais Il savait ce que vous ne saviez pas. En fait, Il a décrété pour vous, en plus de cela, une victoire toute proche.", "german": " Wahrlich, Allah hat Seinem Gesandten das Traumgesicht erfüllt: Ihr würdet gewisslich, so Allah will, in die Heilige Moschee eintreten in Sicherheit, mit geschorenem Haupt oder mit kurzgeschnittenem Haar; ihr würdet keine Furcht haben. Doch Er wusste, was ihr nicht wusstet; und Er hat (euch), außer diesem, einen Sieg bestimmt, der nahe zur Hand ist.", "spanish": " Ciertamente que en verdad Al-lah ha cumplido para Su Mensajero la Visión. Entraréis de cierto en la Mezquita Sagrada, si Al-lah lo quiere, con seguridad; algunos con sus cabezas rapadas y otros con el pelo corto; y no tendréis temor. Mas Él sabe lo que desconocéis. En efecto, ha ordenado para vosotros, además de ésta, una victoria casi inmediata.", "urdu": " اللہ نے اپنے رسول کو اس رٶیا کا مضمون پوری طرح سچا کرکے دکھا دیا جس میں یہ بیان تھا کہ تم مسجد حرام میں اگر خدا نے چاہا تو امن کے ساتھ ضرور داخل ہوگے (اور) اپنے سر پوری طرح منڈوائے ہوئے یا چھوٹے بال کروائے ہوئے ہوگے کسی سے نہ ڈرتے ہو گے سو اللہ نے وہ کچھ جان لیا جو تم نہیں جانتے تھے اور اس نے اس کے ورے ایک فتح رکھ دی ہے۔"}, {"arabic": " ہُوَ الَّذِیۡۤ اَرۡسَلَ رَسُوۡلَہٗ بِالۡہُدٰی وَ دِیۡنِ الۡحَقِّ لِیُظۡہِرَہٗ عَلَی الدِّیۡنِ کُلِّہٖ ؕ وَ کَفٰی بِاللّٰہِ شَہِیۡدًا ﴿ؕ۲۹﴾", "english": " He it is Who has sent His Messenger, with guidance and the Religion of truth, that He may make it prevail over all other religions. And sufficient is Allah as a Witness.", "french": " C’est Lui Qui a envoyé Son Messager avec la direction et la Religion de la Vérité, afin qu’Il la fasse prévaloir sur toutes les autres religions. Et Allāh suffit comme Témoin.", "german": " Er ist es, Der Seinen Gesandten geschickt hat mit der Führung und der Religion der Wahrheit, dass Er sie siegreich mache über jede andere Religion. Und Allah genügt als Bezeuger.", "spanish": " Él es Quien ha enviado a Su Mensajero, con la guía y la Religión de la verdad, para hacerla prevalecer sobre cada una de las demás religiones. Pues Al-lah basta como Testigo.", "urdu": " وہ خدا ہی ہے جس نے اپنے رسول کو ہدایت اور دین حق کے ساتھ بھیجا ہے تا کہ تمام دینوں پر اس کو غالب کردے اور اللہ ہی کافی گواہ ہے۔"}, {"arabic": " مُحَمَّدٌ رَّسُوۡلُ اللّٰہِ ؕ وَ الَّذِیۡنَ مَعَہٗۤ اَشِدَّآءُ عَلَی الۡکُفَّارِ رُحَمَآءُ بَیۡنَہُمۡ تَرٰٮہُمۡ رُکَّعًا سُجَّدًا یَّبۡتَغُوۡنَ فَضۡلًا مِّنَ اللّٰہِ وَ رِضۡوَانًا ۫ سِیۡمَاہُمۡ فِیۡ وُجُوۡہِہِمۡ مِّنۡ اَثَرِ السُّجُوۡدِ ؕ ذٰلِکَ مَثَلُہُمۡ فِی التَّوۡرٰٮۃِ ۚۖۛ وَ مَثَلُہُمۡ فِی الۡاِنۡجِیۡلِ ۚ۟ۛ کَزَرۡعٍ اَخۡرَجَ شَطۡـَٔہٗ فَاٰزَرَہٗ فَاسۡتَغۡلَظَ فَاسۡتَوٰی عَلٰی سُوۡقِہٖ یُعۡجِبُ الزُّرَّاعَ لِیَغِیۡظَ بِہِمُ الۡکُفَّارَ ؕ وَعَدَ اللّٰہُ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ مِنۡہُمۡ مَّغۡفِرَۃً وَّ اَجۡرًا عَظِیۡمًا ﴿٪۳۰﴾", "english": " Muhammad is the Messenger of Allah. And those who are with him are hard against the disbelievers, tender among themselves. Thou seest them bowing and prostrating themselves in Prayer , seeking grace from Allah and His pleasure. Their mark is upon their faces, being the traces of prostrations. This is their description in the Torah. And their description in the Gospel is like unto a seed-produce that sends forth its sprout, then makes it strong; it then becomes thick, and stands firm on its stem, delighting the sowers — that He may cause the disbelievers to burn with rage at the sight of them. Allah has promised, unto those of them who believe and do good works, forgiveness and a great reward.", "french": " Mohammad est le Messager d’Allāh. Et ceux qui sont avec lui sont fermes devant les mécréants, et tendres entre eux-mêmes. Tu les vois s’incliner et se prosterner dans la Prière , recherchant quelque munificence de la part d’Allāh et Son plaisir. Ils ont les visages marqués par les traces de leurs prosternations. Tel est leur signalement dans la Torah. Et dans l’Evangile, ils sont comparés à une semence qui germe, puis rend forte la jeune pousse ; ensuite elle grossit, et se tient ferme sur sa propre tige, faisant la joie des semeurs – afin qu’Il fasse bouillir de rage les mécréants à cause d’eux. Allāh a promis à ceux d’entre eux qui croient et font de bonnes œuvres, le pardon et une très grande récompense.", "german": " Muhammad ist der Gesandte Allahs. Und die mit ihm sind, hart sind sie wider die Ungläubigen, doch gütig gegeneinander. Du siehst sie sich beugen, sich niederwerfen im Gebet, Huld erstrebend von Allah und (Sein) Wohlgefallen. Ihre Merkmale sind auf ihren Gesichtern: die Spuren der Niederwerfungen. Das ist ihre Beschreibung in der Thora. Und ihre Beschreibung im Evangelium ist: gleich dem ausgesäten Samenkorn, das seinen Schößling treibt, dann ihn stark werden lässt; dann wird er dick und steht fest auf seinem Halm, den Sämännern zur Freude – dass Er die Ungläubigen in Wut entbrennen lasse bei ihrem (Anblick). Allah hat denen unter ihnen, die glauben und gute Werke tun, Vergebung verheißen und gewaltigen Lohn.", "spanish": " Mohammad es el Mensajero de Al-lah. Quienes están con él son firmes ontra los incrédulos y compasivos entre si. Los verás inclinándose y postrándose en Oración, buscando la gracia de Al-lah y Su agrado. Marcas de sus características se hallan en sus rostros, que son las señales de las postraciones. Ésta es su descripción en la Torah. Y su descripción en el Evangelio es como la de una semilla que produce primero su brote y después se fortalece; más tarde se hace grande y permanece firme sobre su tronco, complaciendo a os sembradores, para que Él haga que los incrédulos ardan de furor ante su vista. Al-lah ha prometido a quienes creen y hacen buenas obras, el perdón y una gran recompensa.", "urdu": " محمد اللہ کے رسول ہیں اور جو لوگ ان کے ساتھ ہیں وہ کفار کے خلاف بڑا جوش رکھتے ہیں‘ لیکن آپس میں ایک دوسرے سے بہت ملاطفت کرنے والے ہیں جب تو انہیں دیکھے گا انہیں شرک سے پاک اور اللہ کا مطیع پائے گا۔ وہ اللہ کے فضل اور رضا کی جستجو میں رہتے ہیں‘ ان کی شناخت ان کے چہروں پر سجدوں کے نشان کے ذریعہ موجود ہے۔ یہ ان کی حالت تورات میں بیان ہوئی ہے اور انجیل میں ان کی حالت یوں بیان ہے کہ وہ ایک کھیتی کی طرح (ہوں گے) جس نے پہلے تو اپنی روئیدگی نکالی۔ پھر اس کو (آسمانی اور زمینی غذا کے ذریعہ سے) مضبوط کیا اور وہ روئیدگی اور مضبوط ہوگئی۔ پھر اپنی جڑ پر مضبوطی سے قائم ہو گئی یہاں تک کہ زمیندار کو پسند آنے لگ گئی۔ اس کا نتیجہ یہ نکلے گا کہ کفار ان کو دیکھ دیکھ کر جلیں گے۔ اللہ نے مومنوں اور ایمان کے مطابق عمل کرنے والوں سے یہ وعدہ کیا ہے کہ ان کو مغفرت اور بڑا اجر ملے گا۔"}], "Surah": 48}