{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " لِاِیۡلٰفِ قُرَیۡشٍ ۙ﴿۲﴾", "english": " Because of the attachment of the Quraish —", "french": " Afin de lier des Koraïchites", "german": " Wegen der Vorliebe der Quraisch,", "spanish": " Para unir juntos a los quraish,", "urdu": " (دوسری اغراض کے علاوہ) قریش کے دلوں کو مانوس کرنے کے لئے۔"}, {"arabic": " اٖلٰفِہِمۡ رِحۡلَۃَ الشِّتَآءِ وَ الصَّیۡفِ ۚ﴿۳﴾", "english": " His making them attached to their journey in winter and summer —", "french": " Et pour promouvoir leur alliance, Nous avons décrété des voyages commerciaux en hiver comme en été.", "german": " ihrer Vorliebe für Reisen im Winter und Sommer,", "spanish": " Y para promover su alianza hemos planeado viajes comerciales en invierno y en verano.", "urdu": " یعنی ان کے دلوں کو گرمائی اور سرمائی سفروں سے مانوس کرنے کے لئے (ہم نے ابرہہ کو تباہ کیا)"}, {"arabic": " فَلۡیَعۡبُدُوۡا رَبَّ ہٰذَا الۡبَیۡتِ ۙ﴿۴﴾", "english": " They should worship the Lord of this House,", "french": " Qu’ils adorent donc le Seigneur de cette Maison,", "german": " sollten sie den Herrn dieses Hauses verehren,", "spanish": " Deben adorar, por tanto, al Señor de esta Casa.", "urdu": " پس انہیں لازم ہے کہ وہ (قریش) اس گھر (یعنی کعبہ) کے مالک کی عبادت کریں‘ جس نے انہیں (ہر قسم کی) بھوک (کی حالت) میں کھانا کھلایا اور (ہر قسم کی) خوف کی حالت میں امن بخشا۔"}, {"arabic": " الَّذِیۡۤ اَطۡعَمَہُمۡ مِّنۡ جُوۡعٍ ۬ۙ وَّ اٰمَنَہُمۡ مِّنۡ خَوۡفٍ ٪﴿۵﴾", "english": " Who has fed them against hunger, and has given them security against fear.", "french": " Qui les a nourris contre la faim, et leur a donné la sécurité contre la crainte.", "german": " der sie gespeist hat gegen Hunger und sie sicher gemacht vor Furcht.", "spanish": " Quien los alimentó contra el hambre y les dio seguridad contra el temor.", "urdu": " پس انہیں لازم ہے کہ وہ (قریش) اس گھر (یعنی کعبہ) کے مالک کی عبادت کریں‘ جس نے انہیں (ہر قسم کی) بھوک (کی حالت) میں کھانا کھلایا اور (ہر قسم کی) خوف کی حالت میں امن بخشا۔"}], "Surah": 106}