{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " سَبِّحِ اسۡمَ رَبِّکَ الۡاَعۡلَی ۙ﴿۲﴾", "english": " Glorify the name of thy Lord, the Most High,", "french": " Glorifie le nom de ton Seigneur, le Plus-Haut,", "german": " Preise den Namen deines Herrn, des Höchsten,", "spanish": " Glorifica el nombre de tu Señor, el Altísimo,", "urdu": " (اے رسول)! اپنے بزرگ (وبرتر) رب کے نام کا بے عیب ہونا بیان کر۔"}, {"arabic": " الَّذِیۡ خَلَقَ فَسَوّٰی ۪ۙ﴿۳﴾", "english": " Who creates and perfects,", "french": " Qui a créé et a parfait,", "german": " der da erschafft und vollendet,", "spanish": " Quien crea y perfecciona,", "urdu": " (وہ) جس نے (انسان کو) پیدا کیا اور (اسے) بے عیب بنایا۔"}, {"arabic": " وَ الَّذِیۡ قَدَّرَ فَہَدٰی ۪ۙ﴿۴﴾", "english": " And Who designs and guides,", "french": " Et Qui a donné aux éléments leur composition et les a guidés,", "german": " und Der bestimmt und leitet,", "spanish": " Quien designa y guía,", "urdu": " اور جس نے (اس کی طاقتوں کا) اندازہ کیا اور (ان کے مطابق) اسے ہدایت دی۔"}, {"arabic": " وَ الَّذِیۡۤ اَخۡرَجَ الۡمَرۡعٰی ۪ۙ﴿۵﴾", "english": " And Who brings forth the pasturage,", "french": " Et Qui a produit le pâturage,", "german": " der die Weide hervorbringt,", "spanish": " Y Quien hace brotar el pasto,", "urdu": " اور جس نے زمین سے چارہ نکالا۔"}, {"arabic": " فَجَعَلَہٗ غُثَآءً اَحۡوٰی ؕ﴿۶﴾", "english": " Then turns it black, rotten rubbish.", "french": " Puis en a fait des ordures noires, pourries.", "german": " und sie dann schwarz verdorren lässt.", "spanish": " Que luego convierte en hojarasca negra y podrida.", "urdu": " پھر اسے سیاہ کوڑا کرکٹ بنادیا۔"}, {"arabic": " سَنُقۡرِئُکَ فَلَا تَنۡسٰۤی ۙ﴿۷﴾", "english": " We shall teach thee the Qur ’ an , and thou shalt forget it not,", "french": " Nous t’enseignerons le Coran , et tu ne l ’oublieras pas,", "german": " Wir werden dich (den Qur-ân) lehren, und du wirst (ihn) nicht vergessen,", "spanish": " Te enseñaremos el Corán y tú no lo olvidarás,", "urdu": " (اے مسلمان) ہم تجھے (اس طرح) پڑھائیں گے کہ اس کے نتیجہ میں تو بھولے گا نہیں۔"}, {"arabic": " اِلَّا مَا شَآءَ اللّٰہُ ؕ اِنَّہٗ یَعۡلَمُ الۡجَہۡرَ وَ مَا یَخۡفٰی ؕ﴿۸﴾", "english": " Except as Allah wills. Surely, He knows what is open and what is hidden.", "french": " Excepté ce qu’Allāh veut. Assurément, Il sait ce qui est découvert et ce qui est caché.", "german": " es sei denn, was Allah will. Fürwahr, Er kennt, was offen ist und was verborgen.", "spanish": " Salvo lo que Al-lah quiera . En verdad, El sabe lo que está al descubierto y lo que está oculto.", "urdu": " سوائے اس کے جو اللہ بھلانا چاہے‘ وہ یقیناً ظاہر کو بھی جانتا ہے اور اسے بھی جو مخفی ہے۔"}, {"arabic": " وَ نُیَسِّرُکَ لِلۡیُسۡرٰی ۚ﴿ۖ۹﴾", "english": " And We shall facilitate for thee every facility.", "french": " Et Nous te faciliterons toutes les facilités.", "german": " Und Wir werden es dir leicht machen.", "spanish": " Y te daremos toda clase de facilidades.", "urdu": " اور ہم (اے مسلمان) تیرے لئے (کامیابیوں اور) آسانیوں کا حصول آسان کر دیں گے۔"}, {"arabic": " فَذَکِّرۡ اِنۡ نَّفَعَتِ الذِّکۡرٰی ؕ﴿۱۰﴾", "english": " So go on reminding; surely, reminding is profitable.", "french": " Aussi, continue à rappeler, car assurément le rappel est profitable.", "german": " Ermahne also; gewiss, Ermahnung frommt.", "spanish": " Sigue, pues, amonestando; en verdad, la amonestación es prove­chosa.", "urdu": " پس تم بھی نصیحت کرو‘ نصیحت کرنا (ہمیشہ دنیا میں) مفید ہوتا رہا ہے۔"}, {"arabic": " سَیَذَّکَّرُ مَنۡ یَّخۡشٰی ﴿ۙ۱۱﴾", "english": " He who fears will soon heed;", "french": " Celui qui craint fera bientôt attention ;", "german": " Der da fürchtet, wird (sie) beachten;", "spanish": " Quien teme, pronto prestará oídos;", "urdu": " جو (خدا سے) ڈرتا ہے وہ یقیناً نصیحت حاصل کرے گا۔"}, {"arabic": " وَ یَتَجَنَّبُہَا الۡاَشۡقَی ﴿ۙ۱۲﴾", "english": " But the reprobate will turn aside from it,", "french": " Mais le plus malchanceux de part sa dépravation s’en détournera,", "german": " doch der Ruchlose wird sie meiden –", "spanish": " Pero los réprobos se apartarán de ella,", "urdu": " اور (اس کے برخلاف) جو نہایت بدبخت ہوگا وہ اس سے گریز ہی کرتا رہے گا۔"}, {"arabic": " الَّذِیۡ یَصۡلَی النَّارَ الۡکُبۡرٰی ﴿ۚ۱۳﴾", "english": " He who is to enter the great Fire.", "french": " Celui qui doit entrer dans le plus grand Feu.", "german": " er, der ins große Feuer eingehen soll.", "spanish": " Aquél que ha de entrar en el gran Fuego.", "urdu": " (وہی) جو بڑی آگ میں داخل ہونے والا ہے۔"}, {"arabic": " ثُمَّ لَا یَمُوۡتُ فِیۡہَا وَ لَا یَحۡیٰی ﴿ؕ۱۴﴾", "english": " Then he will neither die therein nor live.", "french": " Alors il n’y mourra pas ni ne vivra.", "german": " Dann wird er darinnen weder sterben noch leben.", "spanish": " Y luego ni morirá ni vivirá en él.", "urdu": " پھر (اس میں داخل ہونے کے بعد) نہ تو وہ اس میں مرے گا اور نہ زندہ رہے گا۔"}, {"arabic": " قَدۡ اَفۡلَحَ مَنۡ تَزَکّٰی ﴿ۙ۱۵﴾", "english": " Verily, he truly prospers who purifies himself,", "french": " En vérité, prospère vraiment celui qui se purifie,", "german": " Wahrlich, der wird Erfolg haben, der sich reinigt,", "spanish": " En verdad, quien realmente prospera es quien se purifica,", "urdu": " جو پاک بنے گا‘ وہ یقیناً کامیاب ہوگا۔"}, {"arabic": " وَ ذَکَرَ اسۡمَ رَبِّہٖ فَصَلّٰی ﴿ؕ۱۶﴾", "english": " And remembers the name of his Lord and offers Prayers.", "french": " Et qui se souvient du nom de son Seigneur, et qui dit sa Prière.", "german": " und des Namens seines Herrn gedenkt und betet.", "spanish": " Y recuerda el nombre de su Señor y ofrece oraciones.", "urdu": " بشرطیکہ (پاک بننے کے ساتھ ساتھ) اس نے اپنے رب کا نام بھی لیا‘ اور نماز پڑھتا رہا۔"}, {"arabic": " بَلۡ تُؤۡثِرُوۡنَ الۡحَیٰوۃَ الدُّنۡیَا ﴿۫ۖ۱۷﴾", "english": " But you prefer the life of this world,", "french": " Mais vous préférez la vie de ce monde,", "german": " Ihr aber bevorzugt das Leben in dieser Welt,", "spanish": " Mas vosotros preferís la vida de este mundo,", "urdu": " مگر (اے مخالفو)! تم (لوگ) تو ورلی زندگی کو (آخرت پر) ترجیح دیتے ہو۔"}, {"arabic": " وَ الۡاٰخِرَۃُ خَیۡرٌ وَّ اَبۡقٰی ﴿ؕ۱۸﴾", "english": " Whereas the Hereafter is better and more lasting.", "french": " Bien que l’au-delà soit meilleur et plus durable.", "german": " wiewohl das Jenseits besser ist und bleibender.", "spanish": " Aunque el Más Allá es mejor y más duradero.", "urdu": " حالانکہ آخرت کہیں بہتر اور دیرپا ہے۔"}, {"arabic": " اِنَّ ہٰذَا لَفِی الصُّحُفِ الۡاُوۡلٰی ﴿ۙ۱۹﴾", "english": " This indeed is what is taught in the former Scriptures —", "french": " Ceci est en vérité ce qui est enseigné dans les Ecritures antérieures,", "german": " Dies ist fürwahr dasselbe, was in den früheren Schriften steht,", "spanish": " Eso es, en verdad, lo que se enseñó en las Escrituras anteriores,", "urdu": " یقیناً یہی (بات) پہلے صحیفوں میں بھی (درج) ہے۔"}, {"arabic": " صُحُفِ اِبۡرٰہِیۡمَ وَ مُوۡسٰی ﴿٪۲۰﴾", "english": " The Scriptures of Abraham and Moses.", "french": " Les Ecritures d’Abraham et de Moïse.", "german": " den Schriften Abrahams und Mose.", "spanish": " Las Escrituras de Abraham y Moisés.", "urdu": " (یعنی) ابراہیم اور موسیٰ کے صحیفوں میں۔"}], "Surah": 87}