{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al-lah, el Clemente, el misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں)"}, {"arabic": " وَ الۡفَجۡرِ ۙ﴿۲﴾", "english": " By the Dawn,", "french": " Par l’Aube,", "german": " Bei der Morgendämmerung,", "spanish": " Por la Aurora", "urdu": " میں شہادت کے طور پر ایک آنے والی فجر کو پیش کرتا ہوں۔"}, {"arabic": " وَ لَیَالٍ عَشۡرٍ ۙ﴿۳﴾", "english": " And the Ten Nights,", "french": " Et par les Dix Nuits,", "german": " und den zehn Nächten,", "spanish": " Las Diez Noches ,", "urdu": " اور دس راتوں کو بھی۔"}, {"arabic": " وَّ الشَّفۡعِ وَ الۡوَتۡرِ ۙ﴿۴﴾", "english": " And the Even and the Odd,", "french": " Et par le Pair et l’Impair,", "german": " und beim Geraden und Ungeraden,", "spanish": " Lo Par y lo Impar,", "urdu": " اور ایک جفت کو اور ایک وتر کو۔"}, {"arabic": " وَ الَّیۡلِ اِذَا یَسۡرِ ۚ﴿۵﴾", "english": " And the Night when it moves on to its end ,", "french": " Et par la Nuit lorsqu’elle s'écoule,", "german": " und der Nacht, wenn sie vergeht;", "spanish": " Y la Noche, cuando transcurre hacia su fin,", "urdu": " اور (مذکورہ بالا دس راتوں کے بعد آنے والی) رات کو جب وہ چل پڑے۔"}, {"arabic": " ہَلۡ فِیۡ ذٰلِکَ قَسَمٌ لِّذِیۡ حِجۡرٍ ؕ﴿۶﴾", "english": " Is there not in it a strong evidence for a man of understanding?", "french": " Ne s’y trouve-t-il pas une preuve solide pour un homme doué d’intelligence ?", "german": " hierin ist wahrlich ausreichender Beweis für einen Verständigen.", "spanish": " ¿No hay en ello una prueba evi­dente para el hombre que posee cono­cimiento?", "urdu": " کیا اس میں عقل مند کے لئے کوئی قسم (یعنی شہادت) ہے (یا نہیں؟)"}, {"arabic": " اَلَمۡ تَرَ کَیۡفَ فَعَلَ رَبُّکَ بِعَادٍ ۪ۙ﴿۷﴾", "english": " Hast thou not seen how thy Lord dealt with ‘Ad —", "french": " N’as-tu pas vu comment ton Seigneur a traité les ‘Ād –", "german": " Hast du nicht gesehen, wie dein Herr mit den ´Âd verfuhr,", "spanish": " ¿No has visto cómo tu Señor trató a los Ad,", "urdu": " کیا تجھے معلوم ہے کہ تیرے رب نے عاد سے کیا (معاملہ) کیا۔"}, {"arabic": " اِرَمَ ذَاتِ الۡعِمَادِ ۪ۙ﴿۸﴾", "english": " The tribe of Iram, possessors of lofty buildings,", "french": " La tribu d’ Iram, possesseurs de bâtiments élevés,", "german": " dem Volk von Iram, Besitzer von hohen Burgen,", "spanish": " La tribu de Iram, que poseían edificios elevados?,", "urdu": " یعنی (عاد) ارم سے جو بڑی بڑی عمارتوں والے تھے۔"}, {"arabic": " الَّتِیۡ لَمۡ یُخۡلَقۡ مِثۡلُہَا فِی الۡبِلَادِ ۪ۙ﴿۹﴾", "english": " The like of whom have not been created in these parts —", "french": " Dont les pareils n’ont jamais été créés dans ces régions –", "german": " dergleichen nicht erschaffen ward in (anderen) Städten.", "spanish": " Nunca fueron construidos con anterioridad edificios como los suyos en los territorios,", "urdu": " وہ لوگ جن کی مانند کوئی قوم ان ملکوں میں پیدا ہی نہیں کی گئی تھی۔"}, {"arabic": " وَ ثَمُوۡدَ الَّذِیۡنَ جَابُوا الصَّخۡرَ بِالۡوَادِ ۪ۙ﴿۱۰﴾", "english": " And with Thamud who hewed out rocks in the valley,", "french": " Et les Thamūd qui creusèrent les rochers dans la vallée ?", "german": " Und den Thamûd, die die Felsen aushieben im Tal,", "spanish": " Y a los Zamud, quienes ho­radaron rocas en el valle,", "urdu": " اور (کیا) ثمود (کے متعلق بھی تجھے معلومات ہیں) جو وادیوں میں کھود کر (اپنے مکان) بناتے تھے۔"}, {"arabic": " وَ فِرۡعَوۡنَ ذِی الۡاَوۡتَادِ ﴿۪ۙ۱۱﴾", "english": " And with Pharaoh, lord of vast camps?", "french": " Et Pharaon, le seigneur d’immenses camps ?", "german": " und Pharao, dem Herrn von gewaltigen Zelten?", "spanish": " Y al Faraón, señor de exten­sos campos?", "urdu": " اور فرعون (کے متعلق بھی تجھے کچھ پتہ ہے) جو پہاڑوں کا مالک تھا۔"}, {"arabic": " الَّذِیۡنَ طَغَوۡا فِی الۡبِلَادِ ﴿۪ۙ۱۲﴾", "english": " Who transgressed in the cities,", "french": " Qui transgressèrent dans les pays,", "german": " Die frevelten in den Städten,", "spanish": " Que transgredieron en las tierras,", "urdu": " وہ (پہاڑ) جنہوں نے شہروں میں سخت فساد کر رکھا تھا۔"}, {"arabic": " فَاَکۡثَرُوۡا فِیۡہَا الۡفَسَادَ ﴿۪ۙ۱۳﴾", "english": " And wrought much corruption therein.", "french": " Et y commirent beaucoup d’iniquités.", "german": " und viel Verderbnis darin stifteten.", "spanish": " Forjando una gran corrupción en ellas.", "urdu": " اور فساد میں بڑھتے ہی جاتے تھے۔"}, {"arabic": " فَصَبَّ عَلَیۡہِمۡ رَبُّکَ سَوۡطَ عَذَابٍ ﴿ۚۙ۱۴﴾", "english": " Thy Lord then let fall on them the whip of punishment.", "french": " Alors ton Seigneur fit tomber sur eux le fouet du châtiment.", "german": " Drum ließ dein Herr die Peitsche der Strafe auf sie fallen.", "spanish": " Tu Señor hizo caer, pues, sobre ellos, el látigo del castigo.", "urdu": " جس پر تیرے رب نے ان پر عذاب کا کوڑا برسایا۔"}, {"arabic": " اِنَّ رَبَّکَ لَبِالۡمِرۡصَادِ ﴿ؕ۱۵﴾", "english": " Surely thy Lord is on the watch", "french": " Assurément, ton Seigneur veille,", "german": " Wahrlich, dein Herr ist auf der Wacht.", "spanish": " En verdad, tu Señor está vigi­lando.", "urdu": " تیرا رب یقیناً گھات میں (لگا ہوا) ہے۔"}, {"arabic": " فَاَمَّا الۡاِنۡسَانُ اِذَا مَا ابۡتَلٰٮہُ رَبُّہٗ فَاَکۡرَمَہٗ وَ نَعَّمَہٗ ۬ۙ فَیَقُوۡلُ رَبِّیۡۤ اَکۡرَمَنِ ﴿ؕ۱۶﴾", "english": " As for man, when his Lord tries him and honours him and bestows favours on him, he says, ‘My Lord has honoured me.’", "french": " Quant à l’homme, lorsque son Seigneur l’éprouve et l’honore et lui accorde des faveurs, il dit : « Mon Seigneur m’a honoré. »", "german": " Wenn sein Herr den Menschen prüft, indem Er ihn ehrt und Gnaden auf ihn häuft, dann spricht er: \"Mein Herr hat mich geehrt.\"", "spanish": " Y en cuanto al hombre, cuando su Señor le prueba, le honra y le concede favores dice: “Mi Señor me honra.”", "urdu": " پس (ذرا دیکھ تو) انسان کی حالت کو کہ جب اس کا رب اسے آزمائش میںڈالتا ہے‘ اور اس کی عزت کرتا ہے اور اس پر نعمت نازل کرتا ہے تو وہ کہتا ہے کہ (میں ایسا ذیشان ہوں کہ) میرے رب نے (بھی) میری عزت کی۔"}, {"arabic": " وَ اَمَّاۤ اِذَا مَا ابۡتَلٰٮہُ فَقَدَرَ عَلَیۡہِ رِزۡقَہٗ ۬ۙ فَیَقُوۡلُ رَبِّیۡۤ اَہَانَنِ ﴿ۚ۱۷﴾", "english": " But when He tries him and straitens for him his means of subsistence, he says, ‘My Lord has disgraced me.’", "french": " Mais lorsqu’Il l’éprouve et lui restreigne sa provision, il dit : « Mon Seigneur m’a humilié. »", "german": " Wenn Er ihn aber prüft, indem Er ihm seine Versorgung verkürzt, dann spricht er: \"Mein Herr hat mich erniedrigt.\"", "spanish": " Mas cuando El le prueba y le limita sus medios de subsistencia, dice: “Mi Señor me ha envilecido.”", "urdu": " اور جب (خدا) اسے آزمائش میں ڈالتا ہے اور اس کے رزق کو تنگ کر دیتا ہے تو وہ کہتا ہے‘ میرے رب نے (بلاوجہ) میری بے عزتی کی۔"}, {"arabic": " کَلَّا بَلۡ لَّا تُکۡرِمُوۡنَ الۡیَتِیۡمَ ﴿ۙ۱۸﴾", "english": " Nay, but you honour not the orphan,", "french": " Non, mais vous n’honorez pas l’orphelin,", "german": " Nein, doch ihr ehrt nicht die Waise", "spanish": " ¡No!, lo que ocurre es que no honráis al huérfano.", "urdu": " (خدا بلا وجہ سزا نہیں دیتا) بلکہ (قصور تمہارا اپنا ہے کہ) تم یتیم کی عزت نہیں کرتے تھے۔"}, {"arabic": " وَ لَا تَحٰٓضُّوۡنَ عَلٰی طَعَامِ الۡمِسۡکِیۡنِ ﴿ۙ۱۹﴾", "english": " And you urge not one another to feed the poor,", "french": " Et vous ne vous exhortez pas les uns les autres à nourrir les pauvres,", "german": " und treibet einander nicht an, den Armen zu speisen,", "spanish": " Ni os apremiáis mutuamente a dar de comer a los pobres,", "urdu": " اور نہ مسکین کو کھانا کھلانے کی ایک دوسرے کو رغبت دلاتے تھے۔"}, {"arabic": " وَ تَاۡکُلُوۡنَ التُّرَاثَ اَکۡلًا لَّمًّا ﴿ۙ۲۰﴾", "english": " And you devour the heritage of other people wholly,", "french": " Et vous dévorez complètement l’héritage d’autrui ,", "german": " und ihr verzehrt das Erbe (anderer) ganz und gar,", "spanish": " Devoráis toda la herencia de otras personas ,", "urdu": " اور ورثہ کا مال سب کا سب (عیش میں) اڑا جاتے تھے۔"}, {"arabic": " وَّ تُحِبُّوۡنَ الۡمَالَ حُبًّا جَمًّا ﴿ؕ۲۱﴾", "english": " And you love wealth with exceeding love.", "french": " Et vous aimez les richesses d’un amour excessif.", "german": " und ihr liebt den Reichtum mit unmäßiger Liebe.", "spanish": " Y amáis la riqueza con amor excesivo.", "urdu": " اور تم مال سے بے انتہا محبت کرتے تھے۔"}, {"arabic": " کَلَّاۤ اِذَا دُکَّتِ الۡاَرۡضُ دَکًّا دَکًّا ﴿ۙ۲۲﴾", "english": " Nay, when the earth is completely broken into pieces and made level;", "french": " Non, mais lorsque la terre sera complètement broyée ;", "german": " Nein, wenn die Erde zermalmt wird, ein Zermalmen durch und durch.", "spanish": " ¡No!, cuando la tierra sea contundida a fondo, repetidamente;", "urdu": " سنو! جب زمین کو ٹکڑے ٹکڑے کر دیا جائے گا۔"}, {"arabic": " وَّ جَآءَ رَبُّکَ وَ الۡمَلَکُ صَفًّا صَفًّا ﴿ۚ۲۳﴾", "english": " And thy Lord comes and also the angels ranged in rows after rows;", "french": " Et que ton Seigneur viendra ainsi que les anges, rang par rang ;", "german": " Und dein Herr kommt und (auch) die Engel, in Reihen gereiht;", "spanish": " Y venga tu Señor y tam­bién los ángeles dispuestos en filas unas tras otras;", "urdu": " اور تیرا رب اس شان میں آئے گا کہ فرشتے صفیں باندھے کھڑے ہوں گے۔"}, {"arabic": " وَ جِایۡٓءَ یَوۡمَئِذٍۭ بِجَہَنَّمَ ۬ۙ یَوۡمَئِذٍ یَّتَذَکَّرُ الۡاِنۡسَانُ وَ اَنّٰی لَہُ الذِّکۡرٰی ﴿ؕ۲۴﴾", "english": " And Hell is brought near that day; on that day man will remember, but of what avail shall be his remembrance?", "french": " Et que ce jour-là, on amènera l’Enfer, ce jour-là l’homme se souviendra, mais de quel secours sera son souvenir ?", "german": " und die Hölle nahegebracht wird an jenem Tage. An jenem Tage wird der Mensch eingedenk sein, aber was wird ihm dann sein Gedenken frommen?", "spanish": " Y el Infierno sea acercado en ese día; entonces, en ese día, el hombre recor­dará; mas ¿de qué le servirá su recuerdo?", "urdu": " اور اس دن جہنم (قریب) لائی جائے گی‘ اس عذاب کے وقت انسان چاہے گا کہ نصیحت حاصل کرے مگر وہ وقت نصیحت سے پورا پورا فائدہ اٹھانے کا نہیں ہوگا۔"}, {"arabic": " یَقُوۡلُ یٰلَیۡتَنِیۡ قَدَّمۡتُ لِحَیَاتِیۡ ﴿ۚ۲۵﴾", "english": " He will say, ‘O would that I had sent on some good works for my life here !’", "french": " Il dira : « Hélas si seulement j’avais envoyé de l’avant quelques bonnes œuvres pour ma vie d’ici ! »", "german": " Er wird sprechen: \"O hätte ich doch im voraus für (dieses) mein Leben Vorsorge getroffen!\"", "spanish": " Dirá: “¡Ojalá hubiese remitido algunas buenas obras para mi vida aquí !”", "urdu": " وہ کہے گا‘ کاش میں نے اپنی (اس) زندگی کے لئے کچھ آگے بھیجا ہوتا۔"}, {"arabic": " فَیَوۡمَئِذٍ لَّا یُعَذِّبُ عَذَابَہٗۤ اَحَدٌ ﴿ۙ۲۶﴾", "english": " So on that day none can punish like unto His punishment,", "french": " Aussi, ce jour-là, nul ne peut châtier comme Son châtiment,", "german": " Keiner kann strafen, wie Er an jenem Tage strafen wird.", "spanish": " Así pues, en ese día nadie podrá castigar con un castigo como el Suyo.", "urdu": " پس اس دن خدا کے عذاب جیسا اسے کوئی عذاب نہ دے گا۔"}, {"arabic": " وَّ لَا یُوۡثِقُ وَ ثَاقَہٗۤ اَحَدٌ ﴿ؕ۲۷﴾", "english": " And none can bind like unto His binding;", "french": " Et nul ne peut garrotter comme Il le fait.", "german": " Und keiner bindet so fest, wie Er festbinden wird.", "spanish": " Y nadie podrá obligar como Él obliga;", "urdu": " اور نہ اس کی گرفت جیسی کوئی گرفت کرے گا۔"}, {"arabic": " یٰۤاَیَّتُہَا النَّفۡسُ الۡمُطۡمَئِنَّۃُ ﴿٭ۖ۲۸﴾", "english": " And thou, O soul at peace!", "french": " Ô âme en paix !", "german": " (Doch) du, o beruhigte Seele,", "spanish": " Y tú, ¡Oh alma en paz!", "urdu": " اے نفس مطمئنہ!"}, {"arabic": " ارۡجِعِیۡۤ اِلٰی رَبِّکِ رَاضِیَۃً مَّرۡضِیَّۃً ﴿ۚ۲۹﴾", "english": " Return to thy Lord well pleased with Him and He well pleased with thee .", "french": " Retourne auprès de ton Seigneur, satisfaite de Lui et Lui satisfait de toi .", "german": " kehre zurück zu deinem Herrn, befriedigt in (Seiner) Zufriedenheit!", "spanish": " Vuelve a tu Señor satisfecha con Él y Él satisfecho contigo .", "urdu": " اپنے رب کی طرف لوٹ آ (اس حال میں کہ تو اسے) پسند کرنے والا بھی ہے اور اس کا پسندیدہ بھی۔"}, {"arabic": " فَادۡخُلِیۡ فِیۡ عِبٰدِیۡ ﴿ۙ۳۰﴾", "english": " So enter thou among My chosen servants,", "french": " Entre donc parmi Mes serviteurs,", "german": " So tritt denn ein unter Meine Diener,", "spanish": " Entra, pues, entre Mis siervos elegidos,", "urdu": " پھر (تیرا رب تجھے کہتا ہے کہ) آ میرے (خاص) بندوں میں داخل ہو جا۔"}], "Surah": 89}