{"Ayats": [{"arabic": " بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ﴿۱﴾", "english": " In the name of Allah, the Gracious, the Merciful.", "french": " Au nom d’Allāh, le Gracieux, le Miséricordieux.", "german": " Im Namen Allahs, des Gnädigen, des Barmherzigen.", "spanish": " En el nombre de Al‑lah, el Clemente, el Misericordioso.", "urdu": " (میں) اللہ کا نام لے کر جو بے حد کرم کرنے والا (اور) باربار رحم کرنے والا ہے (پڑھتا ہوں) ۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ اتَّقِ اللّٰہَ وَ لَا تُطِعِ الۡکٰفِرِیۡنَ وَ الۡمُنٰفِقِیۡنَ ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا حَکِیۡمًا ۙ﴿۲﴾", "english": " O thou Prophet, seek protection in Allah, and follow not the wishes of the disbelievers and the hypocrites. Verily, Allah is All-Knowing, Wise.", "french": " Ô Prophète, cherche protection auprès d’Allāh et ne suis pas les désirs des mécréants et des hypocrites. En vérité, Allāh est Omniscient, Sage.", "german": " O Prophet, suche Schutz bei Allah und gehorche nicht den Ungläubigen und den Heuchlern. Wahrlich, Allah ist allwissend, allweise.", "spanish": " Oh, tú, Profeta, haz de Al‑lah tu escudo y no sigas los deseos de los incrédulos y los hipócritas. En verdad, Al‑lah es el Omnisciente, el Sabio.", "urdu": " اے نبی! اللہ کا تقویٰ اختیار کر اور کافروں اور منافقوں کی بات نہ مان۔ اللہ یقیناً بہت جاننے والا (اور) بہت حکمت والا ہے۔"}, {"arabic": " وَّ اتَّبِعۡ مَا یُوۡحٰۤی اِلَیۡکَ مِنۡ رَّبِّکَ ؕ اِنَّ اللّٰہَ کَانَ بِمَا تَعۡمَلُوۡنَ خَبِیۡرًا ۙ﴿۳﴾", "english": " And follow that which is revealed to thee from thy Lord. Verily Allah is well aware of what you do.", "french": " Et suis ce qui t’est révélé de la part de ton Seigneur. En vérité, Allāh est très conscient de ce que vous faites.", "german": " Und folge dem, was dir von deinem Herrn offenbart ward. Wahrlich, Allah ist wohl kundig all dessen, was ihr tut;", "spanish": " Sigue lo que te ha sido reve­lado por tu Señor. En verdad, Al‑lah conoce muy bien lo que hacéis.", "urdu": " اور (صرف) اُس وحی کی پیروی کر جو تیرے رب کی طرف سے تجھ پر نازل کی جاتی ہے۔ اللہ تمہارے اعمال سے خوب واقف ہے۔"}, {"arabic": " وَّ تَوَکَّلۡ عَلَی اللّٰہِ ؕ وَ کَفٰی بِاللّٰہِ وَکِیۡلًا ﴿۴﴾", "english": " And put thy trust in Allah, and Allah is sufficient as a Guardian.", "french": " Et place ta confiance en Allāh, et Allāh suffit comme Protecteur.", "german": " und vertraue auf Allah, denn Allah genügt als Hüter.", "spanish": " Pon tu confianza en Al‑lah, pues Al‑lah basta como Guardián.", "urdu": " اور اللہ پر توکل کر اور اللہ کارساز ہونے کے لحاظ سے کافی ہے۔"}, {"arabic": " مَا جَعَلَ اللّٰہُ لِرَجُلٍ مِّنۡ قَلۡبَیۡنِ فِیۡ جَوۡفِہٖ ۚ وَ مَا جَعَلَ اَزۡوَاجَکُمُ الّٰٓیِٴۡ تُظٰہِرُوۡنَ مِنۡہُنَّ اُمَّہٰتِکُمۡ ۚ وَ مَا جَعَلَ اَدۡعِیَآءَکُمۡ اَبۡنَآءَکُمۡ ؕ ذٰلِکُمۡ قَوۡلُکُمۡ بِاَفۡوَاہِکُمۡ ؕ وَ اللّٰہُ یَقُوۡلُ الۡحَقَّ وَ ہُوَ یَہۡدِی السَّبِیۡلَ ﴿۵﴾", "english": " Allah has not made for any man two hearts in his breast; nor has He made those of your wives, from whom you keep away by calling them mothers, your real mothers, nor has He made your adopted sons your real sons. That is merely a word of your mouths; but Allah speaks the truth, and He guides to the right path.", "french": " Allāh n’a fait pour aucun homme deux cœurs dans sa poitrine ; et Il ne change pas non plus vos femmes en vos vraies mères, avec lesquelles vous aviez rompu vos relations conjugales quand vous les appeliez mères et Il n’a pas non plus fait de vos fils adoptifs vos vrais fils. Ce n ’est là qu ’une parole de votre bouche ; tandis qu’Allāh dit la vérité, et Il guide vers le droit chemin.", "german": " Allah hat keinem Manne zwei Herzen in seinem Innern gegeben, noch hat Er jene unter euren Frauen, die ihr Mütter nennt, zu euren Müttern gemacht, noch hat Er eure angenommenen Söhne zu euren Söhnen gemacht. Das ist Gerede aus euren Mündern; Allah aber spricht die Wahrheit, und Er zeigt den Weg.", "spanish": " Al‑lah no ha creado para ningún hombre dos corazones en su pecho; ni convierte a vuestras esposas en vuestras madres por el mero hecho de que os dirijáis a ellas como a vuestras madres y os abstengáis por ello de mantener relaciones conyugales, ni tampoco convierte a vuestros ijos adop­tados en vuestros hijos reales. Estas son meras palabras de vues­tras bocas; mientras que Al‑lah dice la verdad, y os guía al camino recto.", "urdu": " اللہ نے کسی مرد کے سینہ میں دو دل نہیں بنائے اور نہ تمہاری بیویوں کو جن کو تم (بعض دفعہ) ماں کہہ بیٹھتے ہو تمہاری مائیں بنایا ہے اور نہ تمہارے لے پالکوں کو تمہارا بیٹا بنایا ہے۔ یہ سب تمہاری زبانی باتیں ہیں اور اللہ ہی سچی بات کہتا ہے اور وہی سیدھا راستہ دکھاتا ہے۔"}, {"arabic": " اُدۡعُوۡہُمۡ لِاٰبَآئِہِمۡ ہُوَ اَقۡسَطُ عِنۡدَ اللّٰہِ ۚ فَاِنۡ لَّمۡ تَعۡلَمُوۡۤا اٰبَآءَہُمۡ فَاِخۡوَانُکُمۡ فِی الدِّیۡنِ وَ مَوَالِیۡکُمۡ ؕ وَ لَیۡسَ عَلَیۡکُمۡ جُنَاحٌ فِیۡمَاۤ اَخۡطَاۡتُمۡ بِہٖ ۙ وَ لٰکِنۡ مَّا تَعَمَّدَتۡ قُلُوۡبُکُمۡ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۶﴾", "english": " Call them by the names of their fathers. That is more equitable in the sight of Allah. But if you know not their fathers, then they are your brothers in faith and your friends. And there is no blame on you in any mistake you may unintentionally make in this matter , but what matters is that which your hearts intend. And Allah is Most Forgiving, Merciful.", "french": " Appelez-les du nom de leur père. Cela est plus équitable aux yeux d’Allāh. Mais si vous ne connaissez pas leur père, alors ils sont vos frères dans la foi, et vos amis. Et il n’y a aucun péché de votre part si vous avez fait une erreur quelconque à cet égard, excepté ce que vos cœurs ont fait intentionnellement. Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " Nennt sie nach ihren Vätern. Das ist billiger vor Allah. Wenn ihr jedoch ihre Väter nicht kennt, so sind sie eure Brüder im Glauben und eure Freunde. Und was ihr versehentlich darin gefehlt habt, das ist euch keine Sünde, sondern nur das, was eure Herzen vorsätzlich tun. Und Allah ist allverzeihend, barmherzig.", "spanish": " Llamadles por los nombres de sus padres. Esto es más equitativo a la vista de Al‑lah. Pero si no cono­céis a sus padres, ellos son vuestros hermanos en la fe y vuestros amigos. No se os puede chacar nada por cualquier error sin intención que cometáis en este asunto, salvo lo que vuestros corazones deliberadamente desearon. Pues Al‑lah es el Sumo Indulgente, Mise­ricordioso.", "urdu": " (چاہیے کہ) ان (لے پالکوں) کو ان کے باپوں کا بیٹا کہہ کر پکارو۔ یہ اللہ کے نزدیک زیادہ منصفانہ فعل ہے اور اگر تم کو معلوم نہ ہو کہ ان کے باپ کون ہیں تو (بہرحال) وہ تمہارے دینی بھائی ہیں اور دینی دوست ہیں اور جو تم غلطی سے پہلے کر چکے ہو اس کے متعلق تم پر کوئی گناہ نہیں‘ لیکن جس بات پر تمہارے دل پختہ ارادہ کر بیٹھے ہوں (وہ قابل سزا ہے) اور اللہ (ہرتوبہ کرنے والے کے لئے) بہت بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " اَلنَّبِیُّ اَوۡلٰی بِالۡمُؤۡمِنِیۡنَ مِنۡ اَنۡفُسِہِمۡ وَ اَزۡوَاجُہٗۤ اُمَّہٰتُہُمۡ ؕ وَ اُولُوا الۡاَرۡحَامِ بَعۡضُہُمۡ اَوۡلٰی بِبَعۡضٍ فِیۡ کِتٰبِ اللّٰہِ مِنَ الۡمُؤۡمِنِیۡنَ وَ الۡمُہٰجِرِیۡنَ اِلَّاۤ اَنۡ تَفۡعَلُوۡۤا اِلٰۤی اَوۡلِیٰٓئِکُمۡ مَّعۡرُوۡفًا ؕ کَانَ ذٰلِکَ فِی الۡکِتٰبِ مَسۡطُوۡرًا ﴿۷﴾", "english": " The Prophet is nearer to the believers than their own selves, and his wives are as mothers to them. And blood relations are nearer to one another, according to the Book of Allah, than the rest of the believers from among the Helpers as well as the Emigrants, except that you show kindness to your friends. That also is written down in the Book.", "french": " Le Prophète est plus proche des croyants que leurs propres personnes ; et ses femmes sont comme des mères pour eux. Et, d’après le Livre d’Allāh, les parents par le sang sont plus proches les uns des autres que le reste d’entre les croyants ou d’entre les Emigrants, hormis des actes de bonté envers vos amis intimes. Voilà ce qui est inscrit dans le Livre de la Nature .", "german": " Der Prophet steht den Gläubigen näher als sie sich selber, und seine Frauen sind ihre Mütter. Und Blutsverwandte sind einander näher, gemäß dem Buche Allahs, als die (übrigen) Gläubigen und die Ausgewanderten, es sei denn, dass ihr euren Freunden Güte erweist. Das ist in dem Buche niedergeschrieben.", "spanish": " El Profeta está más cercano a los creyentes que ellos mismos, y sus esposas son como madres para ellos. Y algunos vínculos de sangre de entre los creyentes y los emigrantes están más cerca que otros en el Libro de Al‑lah, salvo los favores voluntarios que queráis conceder, con bondad, a vuestros amigos personales. Esto es lo que está inscrito en el Libro de la Naturaleza .", "urdu": " نبی مومنوں سے ان کی اپنی جانوں کی نسبت بھی زیادہ قریب ہے اور اس کی بیویاں ان کی مائیں ہیں اور رحمی رشتہ داروں میں سے اللہ کی کتاب کے مطابق بعض بعض سے زیادہ قریبی ہیں۔ بہ نسبت (غیر رشتہ دار) مومنوں اور مہاجروں کے ہاں تمہارا اپنے دوستوں سے نیک سلوک کرنا (جائز ہے) یہ بات قرآن میں لکھی جا چکی ہے۔"}, {"arabic": " وَ اِذۡ اَخَذۡنَا مِنَ النَّبِیّٖنَ مِیۡثَاقَہُمۡ وَ مِنۡکَ وَ مِنۡ نُّوۡحٍ وَّ اِبۡرٰہِیۡمَ وَ مُوۡسٰی وَ عِیۡسَی ابۡنِ مَرۡیَمَ ۪ وَ اَخَذۡنَا مِنۡہُمۡ مِّیۡثَاقًا غَلِیۡظًا ۙ﴿۸﴾", "english": " And remember when We took from the Prophets their covenant, and from thee, and from Noah, and Abraham, and Moses, and Jesus, son of Mary, and We indeed took from them a solemn covenant;", "french": " Et souviens-toi quand Nous prîmes des Prophètes leur engagement, et de toi, et de Noé, et d’Abraham, et de Moïse, et de Jésus, fils de Marie. Et Nous prîmes d’eux en vérité un engagement solennel ;", "german": " Und (gedenke der Zeit) da Wir mit den Propheten den Bund eingingen, und mit dir, und mit Noah und Abraham und Moses und mit Jesus, dem Sohn der Maria. Wir gingen mit ihnen einen feierlichen Bund ein;", "spanish": " Y acuérdate de cuando esta­blecimos el pacto con los Profetas, así como contigo, y con Noé, Abraham, Moisés y Jesús, el hijo de María, pues en verdad establecimos con ellos una solemne alianza;", "urdu": " اور (یاد کرو) جب کہ ہم نے نبیوں سے ان پر عائد کردہ ایک خاص بات کا وعدہ لیا تھا اور تجھ سے بھی (وعدہ لیا تھا) اور نوح اور ابراہیم اور موسیٰ اور عیسیٰ ابن مریم سے بھی اور ہم نے ان سب سے پختہ عہد لیا تھا۔"}, {"arabic": " لِّیَسۡـَٔلَ الصّٰدِقِیۡنَ عَنۡ صِدۡقِہِمۡ ۚ وَ اَعَدَّ لِلۡکٰفِرِیۡنَ عَذَابًا اَلِیۡمًا ٪﴿۹﴾", "english": " That He may question the truthful about their truthfulness. And for the disbelievers He has prepared a painful punishment.", "french": " Afin qu’Il puisse interroger les véridiques sur leur vérité. Et pour les mécréants Il a préparé un châtiment douloureux.", "german": " auf dass Er die Wahrhaftigen nach ihrer Wahrhaftigkeit befragen möchte. Und für die Ungläubigen hat Er eine schmerzliche Strafe bereitet.", "spanish": " Para que Él interrogue a los veraces sobre su veracidad. Mas para los incrédulos ha preparado un doloroso castigo.", "urdu": " تا کہ اللہ سچوں سے ان کے سچ کے متعلق سوال کرے اور کافروں کے لئے اس نے ایک دردناک عذاب تیار کیا ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اذۡکُرُوۡا نِعۡمَۃَ اللّٰہِ عَلَیۡکُمۡ اِذۡ جَآءَتۡکُمۡ جُنُوۡدٌ فَاَرۡسَلۡنَا عَلَیۡہِمۡ رِیۡحًا وَّ جُنُوۡدًا لَّمۡ تَرَوۡہَا ؕ وَ کَانَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ بَصِیۡرًا ۚ﴿۱۰﴾", "english": " O ye who believe! remember the favour of Allah on you when there came down upon you hosts, and We sent against them a wind and hosts that you saw not. And Allah sees what you do.", "french": " Ô vous qui croyez ! Souvenez-vous de la grâce d’Allāh sur vous lorsque des armées vous sont venues, et que Nous envoyâmes contre elles un vent et des armées que vous n’avez pas vues. Et Allāh voit bien tout ce que vous faites.", "german": " O die ihr glaubt! Gedenket der Gnade Allahs gegen euch, da Heerscharen wider euch heranrückten; und Wir sandten gegen sie einen Wind und Heerscharen, die ihr nicht saht. Und Allah sieht, was ihr tut.", "spanish": " ¡Oh creyentes!, acordaos del favor de Al‑lah para vosotros cuando cayeron ejércitos sobre vosotros, y enviamos contra ellos a un viento y a ejércitos que vosotros no veíais. Mas Al‑lah ve lo que hacéis.", "urdu": " اے مومنو! اللہ کی اس نعمت کو یاد کرو جو اس نے تم پر اس وقت کی جبکہ تم پر کچھ لشکر چڑھ آئے تھے اور ہم نے ان کی طرف ایک ہوا بھیجی تھی اور ایسے لشکر بھیجے تھے جن کو تم نہیں دیکھتے تھے اور اللہ تمہارے اعمال کو خوب دیکھتا ہے۔"}, {"arabic": " اِذۡ جَآءُوۡکُمۡ مِّنۡ فَوۡقِکُمۡ وَ مِنۡ اَسۡفَلَ مِنۡکُمۡ وَ اِذۡ زَاغَتِ الۡاَبۡصَارُ وَ بَلَغَتِ الۡقُلُوۡبُ الۡحَنَاجِرَ وَ تَظُنُّوۡنَ بِاللّٰہِ الظُّنُوۡنَا ﴿۱۱﴾", "english": " When they came upon you from above you, and from below you, and when your eyes became distracted, and your hearts reached to the throats, and you thought diverse thoughts about Allah.", "french": " Lorsqu’ils tombèrent sur vous d’au-dessus de vous et d’en dessous de vous, et que vos regards devinrent éperdus, et que vos cœurs vous montèrent à la gorge, et que vous avez pensé des suppositions indignes au sujet d’Allāh.", "german": " Da sie über euch kamen von oben her und von unten her, und da (eure) Blicke wild waren und die Herzen in die Kehlen stiegen und ihr verschiedene Gedanken hegtet über Allah.", "spanish": " Cuando llegaron sobre voso­tros desde arriba y desde abajo, cuando vuestros ojos se distrajeron y vuestros corazones saltaron a vues­tras gargantas, y mantuvisteis pensamientos rebeldes sobre Al‑lah.", "urdu": " (ہاں! اس وقت کو یاد کرو) جبکہ تمہارے مخالف تمہاری اوپر کی طرف سے بھی (یعنی پہاڑی کی طرف سے بھی) اور نیچے کی طرف سے بھی (یعنی نشیب کی طرف سے بھی) آگئے تھے اور جبکہ آنکھیں گھبرا کر ٹیڑھی ہو گئی تھیں اور دل دھڑکتے ہوئے حلق تک آگئے تھے اور تم اللہ کے متعلق مختلف شکوک میں مبتلا ہو گئے تھے۔"}, {"arabic": " ہُنَالِکَ ابۡتُلِیَ الۡمُؤۡمِنُوۡنَ وَ زُلۡزِلُوۡا زِلۡزَالًا شَدِیۡدًا ﴿۱۲﴾", "english": " There and then were the believers sorely tried, and they were shaken with a violent shaking.", "french": " Là les croyants furent durement éprouvés, et ils furent secoués d’une secousse violente.", "german": " Da wurden die Gläubigen geprüft, und sie wurden erschüttert in heftiger Erschütterung.", "spanish": " Allí y entonces fueron probados amargamente los creyentes, y agitados con una violenta agitación.", "urdu": " اس وقت مومن ایک (بڑے) ابتلا میں ڈال دئیے گئے تھے اور سخت ہلا دئیے گئے تھے۔"}, {"arabic": " وَ اِذۡ یَقُوۡلُ الۡمُنٰفِقُوۡنَ وَ الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ مَّا وَعَدَنَا اللّٰہُ وَ رَسُوۡلُہٗۤ اِلَّا غُرُوۡرًا ﴿۱۳﴾", "english": " And when the hypocrites and those in whose hearts was a disease said, ‘Allah and His Messenger promised us nothing but a delusion.’", "french": " Et lorsque les hypocrites, et ceux dans le cœur de qui siégeait une maladie, dirent : « Allāh et Son Messager ne nous ont rien promis d’autre qu’une tromperie. »", "german": " Und da die Heuchler und die, in deren Herzen Krankheit ist, sprachen: \"Allah und Sein Gesandter haben uns bloßen Trug verheißen.\"", "spanish": " Cuando los hipócritas y los de corazón enfermo dijeron: “Al‑lah y Su Mensajero no nos han prome­tido más que un engaño”.", "urdu": " اور (اس وقت کو بھی یاد کرو) جبکہ منافق اور جن لوگوں کے دلوں میں بیماری تھی‘ کہنے لگ گئے تھے کہ اللہ اور اس کے رسول نے ہم سے صرف ایک جھوٹا وعدہ کیا تھا۔"}, {"arabic": " وَ اِذۡ قَالَتۡ طَّآئِفَۃٌ مِّنۡہُمۡ یٰۤاَہۡلَ یَثۡرِبَ لَا مُقَامَ لَکُمۡ فَارۡجِعُوۡا ۚ وَ یَسۡتَاۡذِنُ فَرِیۡقٌ مِّنۡہُمُ النَّبِیَّ یَقُوۡلُوۡنَ اِنَّ بُیُوۡتَنَا عَوۡرَۃٌ ؕۛ وَ مَا ہِیَ بِعَوۡرَۃٍ ۚۛ اِنۡ یُّرِیۡدُوۡنَ اِلَّا فِرَارًا ﴿۱۴﴾", "english": " And when a party of them said, ‘O people of Yathrib‡, you have possibly no stand against the enemy , therefore turn back.’ And a section of them even asked leave of the Prophet, saying, ‘Our houses are exposed and defenceless .’ And they were in truth not exposed. They only sought to flee away.", "french": " Et lorsqu’un groupe d’entre eux dit : « Ô gens de Yathrib, vous ne pouvez pas résister à l’ennemi ; repartez donc. » Et une section d’entre eux demanda même au Prophète la permission de partir , disant : « Nos maisons sont exposées et sans défense . » Et elles n’étaient pas en fait exposées. Ils ne cherchaient qu’à s’enfuir.", "german": " Und da eine Anzahl von ihnen sprach: \"O ihr Leute von Jathrib, ihr könnt nicht standhalten, drum gehet zurück.\" Und ein Teil von ihnen bat (sogar) den Propheten um Erlaubnis und sprach: \"Unsere Häuser sind entblößt.\" Und sie waren nicht entblößt. Sie wollten eben nur fliehen.", "spanish": " Y cuando un grupo de ellos dijeron: “Oh, pueblo de Yazrib, tal vez no podáis resistir al enemigo; volveos, pues”. Y un grupo de ellos incluso pidió permiso al Profeta iciendo: “Nuestras casas están ex­puestas e indefensas”. Y en verdad no estaban expuestas. Sólo inten­taban huir.", "urdu": " اور جبکہ ان سے ایک گروہ یہ بھی کہنے لگ گیا تھا کہ اے مدینہ کے لوگو! (اب) تمہارے لئے کوئی ٹھکانا نہیں پس (اسلام سے) مرتد ہو جاٶ‘ اور ان میں سے ایک گروہ نبی سے اجازت مانگنے لگ گیا تھا اور کہنے لگ گیا تھا کہ ہمارے گھر دشمن کی زد میں ہیں حالانکہ وہ دشمن کی زد میں نہیں تھے وہ صرف بھاگنے کا ارادہ کر رہے تھے۔"}, {"arabic": " وَ لَوۡ دُخِلَتۡ عَلَیۡہِمۡ مِّنۡ اَقۡطَارِہَا ثُمَّ سُئِلُوا الۡفِتۡنَۃَ لَاٰتَوۡہَا وَ مَا تَلَبَّثُوۡا بِہَاۤ اِلَّا یَسِیۡرًا ﴿۱۵﴾", "english": " And if entry were effected against them into the town from its environs, and then they were asked to join in the disturbances, they would have at once done so, and would not have tarried in their houses save a little.", "french": " Et si l’ennemi devait envahir la ville , depuis ses environs, et qu’il leur était alors demandé de se joindre à la subversion contre les Musulmans , certainement ils le feraient et ne s’attarderaient qu’un peu.", "german": " Und wenn der Zutritt (zu der Stadt Medina) erzwungen würde wider sie von allen Seiten her und würden sie dann aufgefordert, (vom Islam) abzufallen, sie würden es sogleich tun; dann würden sie darin (in der Stadt) nicht lange weilen können.", "spanish": " Iban a ser invadidos desde todos los lados de la ciudad, y si se les hubiera pedido que renegaran, lo habrían hecho inmediatamente, y poco habrían dudado.", "urdu": " اور اگر مدینہ کی مختلف طرفوں سے ان پر (فوجیں) داخل کر دی جائیں اور پھر ان سے (کافروں کی طرف سے) ارتداد کا مطالبہ کیا جائے تو یہ ضرور اس مطالبہ کو قبول کر لیں گے۔ لیکن وہ اس (یعنی مدینہ) میں (اس کے بعد) تھوڑا سا ہی رہنے پائیں گے۔"}, {"arabic": " وَ لَقَدۡ کَانُوۡا عَاہَدُوا اللّٰہَ مِنۡ قَبۡلُ لَا یُوَلُّوۡنَ الۡاَدۡبَارَ ؕ وَ کَانَ عَہۡدُ اللّٰہِ مَسۡـُٔوۡلًا ﴿۱۶﴾", "english": " And truly they had already covenanted with Allah that they would not turn their backs. And a covenant with Allah will have to be answered for.", "french": " Et en vérité ils avaient déjà fait un pacte avec Allāh, qu’ils ne tourneraient pas le dos. Et il sera demandé compte de tout pacte fait avec Allāh.", "german": " Und sie hatten doch in Wahrheit schon mit Allah den Bund geschlossen, dass sie nicht den Rücken (zur Flucht) wenden würden. Und über den Bund mit Allah muss Rechenschaft abgelegt werden.", "spanish": " En verdad ya habían hecho un pacto con Al‑lah de que no volverían la espalda. Y de un pacto con a Al‑lah ciertamente habrá que rendir cuentas.", "urdu": " اور (حقیقت یہ ہے کہ) اس سے پہلے ان (منافقوں) نے اللہ سے عہد کیا تھا کہ وہ کبھی پیٹھ نہ پھیریں گے (اور ثابت قدم رہیں گے) اور اللہ سے باندھے جانے والے عہد کے متعلق ضرور سوال کیا جائے گا۔"}, {"arabic": " قُلۡ لَّنۡ یَّنۡفَعَکُمُ الۡفِرَارُ اِنۡ فَرَرۡتُمۡ مِّنَ الۡمَوۡتِ اَوِ الۡقَتۡلِ وَ اِذًا لَّا تُمَتَّعُوۡنَ اِلَّا قَلِیۡلًا ﴿۱۷﴾", "english": " Say, ‘Flight shall not avail you if you flee from death or slaughter; and even then you will enjoy but a little.’", "french": " Dis : « La fuite ne vous profitera aucunement si vous fuyez la mort ou le massacre, et même alors on ne vous fera jouir des bénéfices que pour peu de temps. »", "german": " Sprich: \"Die Flucht wird euch nimmermehr nützen, wenn ihr dem Tod entflieht oder der Niedermetzelung; und dann werdet ihr nur wenig genießen.\"", "spanish": " Diles: “La huida no servirá si escapáis de la muerte o la matanza; e incluso entonces ganaréis muy poco ”.", "urdu": " تو ان سے کہہ دے کہ اگر تم موت یا قتل سے بھاگو گے تو تمہارا بھاگنا تمہیں ہر گز نفع نہیں دے گا اور اس صورت میں تم کوئی فائدہ نہیں اٹھاٶ گے۔"}, {"arabic": " قُلۡ مَنۡ ذَا الَّذِیۡ یَعۡصِمُکُمۡ مِّنَ اللّٰہِ اِنۡ اَرَادَ بِکُمۡ سُوۡٓءًا اَوۡ اَرَادَ بِکُمۡ رَحۡمَۃً ؕ وَ لَا یَجِدُوۡنَ لَہُمۡ مِّنۡ دُوۡنِ اللّٰہِ وَلِیًّا وَّ لَا نَصِیۡرًا ﴿۱۸﴾", "english": " Say, ‘Who is it that can save you against Allah if it be His wish to do you harm or if it be His wish to show you mercy?’ And they will not find for themselves any friend or helper other than Allah.", "french": " Dis : « Qui pourrait vous sauver contre Allāh s’Il désirait vous châtier ou s’Il désirait vous faire miséricorde ? » Et ils ne trouveront pour eux-mêmes aucun ami, aucun aide en dehors d’Allāh.", "german": "", "spanish": " Diles: “¿Quién puede sal­varos contra Al‑lah si es Su deseo haceros daño o si es Su deseo mos­traros misericordia?”. Mas no encon­trarán amigo ni ayuda alguna ex­cepto en Al‑lah.", "urdu": " تو کہہ دے کہ وہ کون ہے جو تمہیں اللہ کی گرفت سے اگر وہ تمہیں سزا دینا چاہے بچائے گا۔ یا اگر وہ تم پر رحم کرنا چاہے (تو اس سے تمہیں محروم کر سکے گا) وہ اللہ کے سوا اپنے لئے نہ کوئی حقیقی دوست پائیں گے اور نہ مددگار۔ (یعنی جب بھی کام آئے گا خدا ہی آئے گا)"}, {"arabic": " قَدۡ یَعۡلَمُ اللّٰہُ الۡمُعَوِّقِیۡنَ مِنۡکُمۡ وَ الۡقَآئِلِیۡنَ لِاِخۡوَانِہِمۡ ہَلُمَّ اِلَیۡنَا ۚ وَ لَا یَاۡتُوۡنَ الۡبَاۡسَ اِلَّا قَلِیۡلًا ﴿ۙ۱۹﴾", "english": " Verily Allah knows those among you who hinder men and those who say to their brethren, ‘Come to us;’ and they come not to the fight but a little,", "french": " En vérité, Allāh connaît parmi vous ceux qui dressent des obstacles pour empêcher les hommes de lutter dans le chemin d’Allāh et ceux qui disent à leurs frères : « Venez donc à nous ; » et ils ne combattent que bien peu,", "german": " Allah kennt diejenigen unter euch, die (die Menschen) behindern, und diejenigen, die zu ihren Brüdern sprechen: \"Kommt her zu uns\"; und sie lassen sich nur wenig in Krieg ein,", "spanish": " En verdad Al‑lah conoce a aquellos de vosotros que estorban a los hombres y a los que dicen a sus hermanos: “Venid con nosotros”; y no acuden a la lucha sino durante breves momentos,", "urdu": " اللہ ان لوگوں کو پوری طرح جانتا ہے جو تم میں سے دوسروں کو (جہاد سے) پیچھے ہٹاتے تھے۔ اور اپنے بھائیوں سے کہتے تھے کہ ہماری طرف آٶ (اور جہاد میں شامل نہ ہو) اور وہ خود بھی دشمن سے بالکل جنگ نہ کرتے تھے۔"}, {"arabic": " اَشِحَّۃً عَلَیۡکُمۡ ۚۖ فَاِذَا جَآءَ الۡخَوۡفُ رَاَیۡتَہُمۡ یَنۡظُرُوۡنَ اِلَیۡکَ تَدُوۡرُ اَعۡیُنُہُمۡ کَالَّذِیۡ یُغۡشٰی عَلَیۡہِ مِنَ الۡمَوۡتِ ۚ فَاِذَا ذَہَبَ الۡخَوۡفُ سَلَقُوۡکُمۡ بِاَلۡسِنَۃٍ حِدَادٍ اَشِحَّۃً عَلَی الۡخَیۡرِ ؕ اُولٰٓئِکَ لَمۡ یُؤۡمِنُوۡا فَاَحۡبَطَ اللّٰہُ اَعۡمَالَہُمۡ ؕ وَ کَانَ ذٰلِکَ عَلَی اللّٰہِ یَسِیۡرًا ﴿۲۰﴾", "english": " Being niggardly with regard to you. But when danger comes, thou seest them looking towards thee, their eyes rolling like one who is fainting on account of death. But when the fear has passed away, they assail you with sharp tongues being greedy for wealth. These have never believed; so Allah has rendered their works null and void. And that is an easy thing for Allah.", "french": " Etant peu enclins à vous aider. Mais lorsque vient le danger, tu les vois tourner leurs regards vers toi, leurs yeux roulant comme ceux de quelqu’un qui s’évanouit à l’approche de la mort. Mais lorsque la crainte a passé, ils vous harcèlent avec leur langue acérée, étant avides de richesses. Ceux-là n’ont jamais cru ; Allāh a donc rendu vaines leurs œuvres. Et pour Allāh cela est facile.", "german": " geizig euch gegenüber. Naht aber Gefahr, dann siehst du sie nach dir ausschauen, mit rollenden Augen wie einer, der in Ohnmacht fällt vor Todesfurcht. Doch wenn dann die Angst vorbei ist, dann treffen sie euch mit scharfen Zungen in ihrer Gier nach Gut. Diese haben nicht geglaubt; darum hat Allah ihre Werke zunichte gemacht. Und das ist Allah ein leichtes.", "spanish": " Siendo poco inclinados a ha­blar bien de vosotros. Pero cuando viene el peligro los ves que miran hacia ti, con los ojos dando vueltas como quien se encuentra aterrado por la cercanía de la muerte. Mas cuando el temor ha pasado, os asal­tan con sus lenguas agudas, codi­ciosos por obtener riquezas. Éstos no han creído nunca; por tanto Al‑lah ha con­vertido sus obras en nulas y sin mérito; esto es algo fácil para Al‑lah.", "urdu": " وہ تمہارے متعلق بہت بخل رکھنے والے ہیں (یعنی کبھی نہیں چاہتے کہ تمہیں کوئی خیر پہنچے) اور جب ان پر کوئی خوف کا وقت آئے تو تو انہیں دیکھے گا کہ وہ تیری طرف اس طرح دیکھتے ہیں کہ ان کے ڈیلے چکر کھا رہے ہوتے ہیں بالکل اس شخص کی طرح جو موت کی غشی میں مبتلا ہو۔ پھر جب خوف کا وقت جاتا رہتا ہے تو وہ تم پر تلوار کی طرح کاٹنے والی زبان چلاتے ہیں وہ ہر خیر کے متعلق بخیل ہیں (اور چاہتے ہیں کہ تم کو نہ ملے) یہ لوگ (درحقیقت) ایمان لائے ہی نہ تھے۔ سو اللہ نے ان کی سب کوششیں ضائع کر دیں‘ (جو وہ اسلام کے خلاف کرتے تھے) اور اللہ پر یہ بات بالکل آسان تھی۔"}, {"arabic": " یَحۡسَبُوۡنَ الۡاَحۡزَابَ لَمۡ یَذۡہَبُوۡا ۚ وَ اِنۡ یَّاۡتِ الۡاَحۡزَابُ یَوَدُّوۡا لَوۡ اَنَّہُمۡ بَادُوۡنَ فِی الۡاَعۡرَابِ یَسۡاَلُوۡنَ عَنۡ اَنۡۢبَآئِکُمۡ ؕ وَ لَوۡ کَانُوۡا فِیۡکُمۡ مَّا قٰتَلُوۡۤا اِلَّا قَلِیۡلًا ﴿٪۲۱﴾", "english": " They think that the confederates have not gone away; and if the confederates should come again , they would wish to be among the nomad Arabs in the desert, asking for news about you. And if they were among you they would not fight save a little.", "french": " Ils pensent que les tribus cernant la ville ne sont pas parties ; et si ces tribus reviennent à l'attaque , ils voudraient bien être dans le désert parmi les Arabes nomades, demandant de vos nouvelles. Et s’ils étaient parmi vous, ils ne se battraient que très peu.", "german": " Sie hoffen, dass die Verbündeten noch nicht abgezogen seien; und wenn die Verbündeten (wieder) kommen sollten, so würden sie lieber bei den nomadischen Arabern in der Wüste sein und dort um Nachrichten über euch fragen. Und wenn sie bei euch wären, so würden sie nur wenig kämpfen.", "spanish": " Piensan que las tribus invasoras no se han ido; mas si las tribus invadieran de nuevo, preferirían estar entre los árabes nómadas del desierto, pidiendo noticias sobre vosotros. Pero si estuvieran entre vosotros, no lucharían sino poco.", "urdu": " (اور) یہ لوگ تو اب بھی امید رکھتے ہیں کہ (کاش) (کفار کا) لشکر ابھی گیا نہ ہو حالانکہ اگر (کفار کا) لشکر واپس آجائے تو (بجائے ان کے آنے پر خوش ہونے کے) یہ لوگ خواہش کریں گے کہ کاش وہ جنگلی لوگوں میں رہ رہے ہوتے (اور اے مومنو)! تمہارے متعلق (لوگوں سے) دریافت کر رہے ہوتے (کہ ابھی زندہ ہیں یا تباہ ہو چکے ہیں) اور اگر یہ (ضرورت کے موقعہ پر) تمہارے ساتھ رہتے تو تب بھی تمہاری طرف سے بالکل نہ لڑتے۔"}, {"arabic": " لَقَدۡ کَانَ لَکُمۡ فِیۡ رَسُوۡلِ اللّٰہِ اُسۡوَۃٌ حَسَنَۃٌ لِّمَنۡ کَانَ یَرۡجُوا اللّٰہَ وَ الۡیَوۡمَ الۡاٰخِرَ وَ ذَکَرَ اللّٰہَ کَثِیۡرًا ﴿ؕ۲۲﴾", "english": " Verily you have in the Prophet of Allah an excellent model, for him who fears Allah and the Last Day and who remembers Allah much.", "french": " En vérité, dans le Prophète d’Allāh vous avez un excellent modèle pour celui qui garde l’espoir en Allāh et le Dernier Jour, et qui se souvient d’Allāh beaucoup.", "german": " Wahrlich, ihr habt an dem Propheten Allahs ein schönes Vorbild für jeden, der auf Allah und den Letzten Tag hofft und Allahs häufig gedenkt.", "spanish": " En verdad, tenéis en el Pro­feta de Al‑lah un dechado de vir­tudes para quien tema a Al‑lah y al Último Día y se acuerde mucho de Al‑lah.", "urdu": " تمہارے لئے (یعنی ان لوگوں کے لئے) جو اللہ اور اخروی دن سے ملنے کی امید رکھتے ہیں اور اللہ کا بہت ذکر کرتے ہیں۔ اللہ کے رسول میں ایک اعلیٰ نمونہ ہے (جس کی انہیں پیروی کرنی چاہیئے) ۔"}, {"arabic": " وَ لَمَّا رَاَ الۡمُؤۡمِنُوۡنَ الۡاَحۡزَابَ ۙ قَالُوۡا ہٰذَا مَا وَعَدَنَا اللّٰہُ وَ رَسُوۡلُہٗ وَ صَدَقَ اللّٰہُ وَ رَسُوۡلُہٗ ۫ وَ مَا زَادَہُمۡ اِلَّاۤ اِیۡمَانًا وَّ تَسۡلِیۡمًا ﴿ؕ۲۳﴾", "english": " And when the believers saw the confederates, they said, ‘This is what Allah and His Messenger promised us; and Allah and His Messenger spoke the truth.’ And it only added to their faith and submission.", "french": " Et lorsque les croyants virent les confédérés, ils dirent : « Voici ce qu’Allāh et Son Messager nous ont promis ; et Allāh et Son Messager disaient la vérité. » Et cela ne fit qu’accroître leur foi et leur soumission.", "german": " Als die Gläubigen die Verbündeten sahen, da sprachen sie: \"Das ist´s, was Allah und Sein Gesandter uns verheißen haben; und Allah und Sein Gesandter sprachen wahr.\" Und es mehrte sie nur an Glauben und Ergebung.", "spanish": " Mas cuando los creyentes vieron a los confederados, dijeron: “Esto es lo que Al‑lah y Su Mensa­jero nos prometieron, y Al‑lah y Su Mensajero dijeron la verdad”. Y esto no hizo más que aumentar su fe y su sumisión.", "urdu": " چنانچہ (دیکھو) جب حقیقی مومنوں نے حملہ آور لشکروں کو دیکھا تو کہا یہ تو وہی (لشکر) ہیں جن کا اللہ اور اس کے رسول نے ہم سے وعدہ کیا تھا اور اللہ اور اس کے رسول نے بالکل سچ بولا تھا اور ان کو اس واقعہ نے ایمان اور اطاعت میں ہی بڑھایا (کمزور نہیں کیا) ۔"}, {"arabic": " مِنَ الۡمُؤۡمِنِیۡنَ رِجَالٌ صَدَقُوۡا مَا عَاہَدُوا اللّٰہَ عَلَیۡہِ ۚ فَمِنۡہُمۡ مَّنۡ قَضٰی نَحۡبَہٗ وَ مِنۡہُمۡ مَّنۡ یَّنۡتَظِرُ ۫ۖ وَ مَا بَدَّلُوۡا تَبۡدِیۡلًا ﴿ۙ۲۴﴾", "english": " Among the believers are men who have been true to the covenant they made with Allah. There are some of them who have fulfilled their vow, and some who still wait, and they have not changed their condition in the least;", "french": " Parmi les croyants il y a des hommes qui ont été fidèles au pacte qu’ils ont fait avec Allāh. Il y en a parmi eux qui ont accompli leur vœu, et il y en a qui attendent encore , et ils n’ont pas changé leur condition le moindrement ;", "german": " Unter den Gläubigen sind Leute, die dem Bündnis, das sie mit Allah geschlossen, die Treue hielten. Es sind welche unter ihnen, die ihr Gelübde erfüllt haben, und welche, die noch warten, und sie haben sich nicht im geringsten verändert;", "spanish": " Entre los creyentes hay hom­bres que han respetado la alianza que hicieron con Al‑lah. Hay al­gunos de ellos que cumplieron su promesa y otros que siguen espe­rando y no han cambiado nada.", "urdu": " ان مومنوں سے کچھ لوگ ایسے ہیں جنہوں نے اس وعدہ کو جو انہوں نے اللہ سے کیا تھا سچا کر دیا۔ پس بعض تو ایسے ہیں جنہوں نے اپنی نیت کو پورا کر دیا (یعنی لڑتے لڑتے مارے گئے) اور ان میں سے بعض ایسے بھی ہیں جو ابھی انتظار کر رہے ہیں اور اپنے ارادہ میں کوئی تزلزل انہوں نے نہیں آنے دیا۔"}, {"arabic": " لِّیَجۡزِیَ اللّٰہُ الصّٰدِقِیۡنَ بِصِدۡقِہِمۡ وَ یُعَذِّبَ الۡمُنٰفِقِیۡنَ اِنۡ شَآءَ اَوۡ یَتُوۡبَ عَلَیۡہِمۡ ؕ اِنَّ اللّٰہَ کَانَ غَفُوۡرًا رَّحِیۡمًا ﴿ۚ۲۵﴾", "english": " That Allah may reward the truthful for their truth, and punish the hypocrites if He so please, or turn to them in mercy. Verily Allah is Most Forgiving, Merciful.", "french": " Afin qu’Allāh puisse récompenser les véridiques pour leur fidélité, et châtier les hypocrites s’Il le veut, ou Se tourner avec clémence vers eux. En vérité, Allāh est Très-Pardonnant, Miséricordieux.", "german": " dass Allah die Wahrhaftigen belohne für ihre Wahrhaftigkeit und die Heuchler bestrafe, wenn es Ihm gefällt, oder Sich ihnen zuwende in Barmherzigkeit. Wahrlich, Allah ist allverzeihend, barmherzig.", "spanish": " Para que Al‑lah recompense al veraz por su verdad, y castigue a los hipócritas si así lo desea, o les muestre misericordia. En verdad, es el Sumo Indulgente, Misericordioso.", "urdu": " اس کا نتیجہ یہ ہوگا کہ اللہ ایسے صادقوں کو ان کے صدق کا بدلہ دے گا اور اگر چاہے گا تو منافقوں کو عذاب دے گا۔ یا ان پر رحم کرے گا اور اللہ یقیناً بڑا بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " وَ رَدَّ اللّٰہُ الَّذِیۡنَ کَفَرُوۡا بِغَیۡظِہِمۡ لَمۡ یَنَالُوۡا خَیۡرًا ؕ وَ کَفَی اللّٰہُ الۡمُؤۡمِنِیۡنَ الۡقِتَالَ ؕ وَ کَانَ اللّٰہُ قَوِیًّا عَزِیۡزًا ﴿ۚ۲۶﴾", "english": " And Allah turned back the disbelievers in their rage; they gained no good. And Allah sufficed the believers in their fight. And Allah is Powerful, Mighty.", "french": " Et Allāh renvoya les mécréants avec leur rage ; ils n’obtinrent aucun avantage. Et Allāh a suffi aux croyants dans leur combat. Et Allāh est Fort et Puissant.", "german": " Und Allah schlug die Ungläubigen in ihrem Grimm zurück; sie erlangten keinen Vorteil. Und Allah genügte den Gläubigen im Kampf. Allah ist gewaltig, allmächtig.", "spanish": " Al‑lah rechazó en su cólera a los incrédulos: no consiguieron bien alguno. Pues Al‑lah bastó para los creyentes en su batalla. Porque Al‑lah es Potente, Poderoso.", "urdu": " اور (حقیقت یہ ہے کہ) اللہ نے کفار کو ان کے سب غصہ سمیت (مدینہ سے) واپس لوٹا دیا اور کسی قسم کا فائدہ ان کو نہیں پہنچا‘ اور اللہ نے مومنوں کی طرف سے خود لڑائی کی اور اللہ بڑا طاقت ور (اور) غالب ہے ۔"}, {"arabic": " وَ اَنۡزَلَ الَّذِیۡنَ ظَاہَرُوۡہُمۡ مِّنۡ اَہۡلِ الۡکِتٰبِ مِنۡ صَیَاصِیۡہِمۡ وَ قَذَفَ فِیۡ قُلُوۡبِہِمُ الرُّعۡبَ فَرِیۡقًا تَقۡتُلُوۡنَ وَ تَاۡسِرُوۡنَ فَرِیۡقًا ﴿ۚ۲۷﴾", "english": " And He brought those of the People of the Book who aided them down from their fortresses and cast terror into their hearts. Some you slew, and some you took captive.", "french": " Et Il a fait descendre de leurs forteresses ceux des Gens du Livre qui les avaient aidés, et Il a jeté la terreur dans leurs cœurs. Vous en avez tué quelques-uns, et en avez capturé d’autres.", "german": " Und Er brachte die aus dem Volk der Schrift, die ihnen halfen, herunter von ihren Burgen und warf Schrecken in ihre Herzen. Einen Teil erschlugt ihr, und einen Teil nahmt ihr gefangen.", "spanish": " Él ha desalojado de sus fortalezas a aquellos del Pueblo del libro que les ayudaron y ha encendido el temor en sus corazones. Matasteis algunos y a otros los hicisteis pri­sioneros.", "urdu": " اور اس (اللہ) نے اُن اہل کتاب کو جنہوں نے ان (حملہ آور مشرکوں) کی مدد کی تھی‘ اپنے قلعوں سے اتار دیا اور ان کے دلوں میں رُعب داخل کر دیا۔ یہاں تک کہ تم ان میں سے ایک حصہ کو قتل کرنے پر اور ایک حصہ کو قید کرنے پر قادر ہوگئے۔"}, {"arabic": " وَ اَوۡرَثَکُمۡ اَرۡضَہُمۡ وَ دِیَارَہُمۡ وَ اَمۡوَالَہُمۡ وَ اَرۡضًا لَّمۡ تَطَـُٔوۡہَا ؕ وَ کَانَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرًا ﴿٪۲۸﴾", "english": " And He made you inherit their land and their houses and their wealth, and a land on which you had never set foot. And Allah has power over all things.", "french": " Et Il vous a fait hériter de leur terre et de leurs maisons et de leurs biens, et d’une terre que vous n’aviez point foulée. Et Allāh a le pouvoir de faire tout ce qu'Il veut.", "german": " Und Er ließ euch ihr Land erben und ihre Häuser und ihren Besitz und ein Land, in das ihr nie den Fuß gesetzt. Und Allah vermag alle Dinge zu tun.", "spanish": " Y Él os hizo heredar su tierra, sus casas y sus riquezas, y un país en el que nunca pusisteis vuestros pies. Pues Al‑lah tiene poder sobre todas las cosas.", "urdu": " اور ان کی زمینوں اور ان کے گھروں اور ان کے مالوں کا تم کو وارث کر دیا نیز اس زمین کا بھی جس پر ابھی تمہارے قدم نہیں پڑے اور اللہ ہر ایک چیز پر قادر ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ قُلۡ لِّاَزۡوَاجِکَ اِنۡ کُنۡـتُنَّ تُرِدۡنَ الۡحَیٰوۃَ الدُّنۡیَا وَ زِیۡنَتَہَا فَتَعَالَیۡنَ اُمَتِّعۡکُنَّ وَ اُسَرِّحۡکُنَّ سَرَاحًا جَمِیۡلًا ﴿۲۹﴾", "english": " O Prophet! say to thy wives, ‘If you desire the life of this world and its adornment, come then, I will provide for you and send you away in a handsome manner.", "french": " Ô Prophète ! Dis à tes épouses : « Si vous désirez la vie de ce monde et sa parure, venez alors, je vous accorderai des avantages pécuniaires et je vous renverrai d’une manière bienséante.", "german": " O Prophet! sprich zu deinen Frauen: \"Wenn ihr das Leben in dieser Welt begehrt und seinen Schmuck, so kommt, ich will euch eine Gabe reichen und euch dann entlassen auf geziemende Weise.</span> </div> </div> <div class=\"row links\" style=\"margin-top:10px;\"> <div class=\"col-lg-12 center\"> <font size=\"-1\" style=\"font-family:Arial, Helvetica, sans-serif; color: #777\"> Read: <a target=\"_blank\" href=\"/quran/tafseer/?verse=33:29&region=E1&CR=E3,E2\" title=\"English Translation with Detailed Commentary with Meanings of Some Key Words\">Detailed English Commentary</a> | <a href=\"/quran/tafseer/?verse=33:29&region=TS&CR=UR,P1,H1,T1\" title=\"Urdu Tafseer-e-Saghir alongwith other Tafaseer\" target=\"_blank\">Urdu Tafaseer <font style=\"font-family: 'Jameel Noori Nastaleeq', -apple-system, BlinkMacSystemFont, 'Urdu Naskh Asiatype', 'Nafees Web Naskh';\">اردو تفاسیر</font></a> </font> </div></div> <hr size='1'> <div class=\"row\" id=\"Arabic30\" class='indopak' style=\"padding: 5px\"> <div class=\"col-lg-1\"> <a name=\"Arabic30\"></a> <font color=\"#939598\" style=\"font-size:1.1em\"> [<a href='/quran/33:30' style='text-decoration:underline'>33:30</a>]</font> </div> <div class=\"col-lg-1\"> <button onclick=\"aud_play_pause(30)\"><i class=\"fa fa-play\" style=\"color: #777\" aria-hidden=\"true\" id=\"control30\"></i></button> <audio id=\"player30\" class=\"audioplayer\" /> </div><div class=\"col-lg-10\" align=\"right\" dir=\"rtl\"></div> </div> <div class=\"row\"> <div class=\"col-lg-12\" align=\"right\" dir=\"rtl\"> <p class=\"arabicverse\">وَ اِنۡ کُنۡـتُنَّ تُرِدۡنَ اللّٰہَ وَ رَسُوۡلَہٗ وَ الدَّارَ الۡاٰخِرَۃَ فَاِنَّ اللّٰہَ اَعَدَّ لِلۡمُحۡسِنٰتِ مِنۡکُنَّ اَجۡرًا عَظِیۡمًا ﴿۳۰﴾ </p> </div> </div> <div class=\"row english\" align=\"left\" dir=\"ltr\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English</span><br> <span class=\"translationtext\">‘But if you desire Allah and His Messenger and the Home of the Hereafter, then truly Allah has prepared for those of you who do good a great reward.’</span> </div> </div> <div class=\"row english2\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">English Short Commentary</span><br> <span class=\"translationtext\"> But if you desire Allah and His Messenger and the Home of the Hereafter, then, truly, Allah has prepared for those of you, who do good, a great reward.’ </span> </div> </div> <div class=\"row urdu\" align=\"right\" dir=\"rtl\" style=\"margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو</span><br> <span class=\"urdutarjma\">اور اگر تم اللہ کو چاہتی ہو اور اس کے رسول کو اور آخرت کے گھر کو تو یقیناً اللہ نے تم میں سے حُسنِ عمل کرنے والیوں کے لئے بہت بڑا اجر تیار کیا ہے۔</span> </div> </div> <div class=\"row urdu2\" align=\"right\" dir=\"rtl\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">اُردو تفسیر صغیر</span><br> <span class=\"urdutarjma\">اور اگر تم اللہ اور اس کے رسول اور اُخروی زندگی کے گھر کو چاہتی ہو تو اللہ نے تم میں سے پوری طرح اسلام پر قائم رہنے والیوں کے لئے بہت بڑا انعام تجویز کر رکھا ہے۔ </span> </div> </div> <div class=\"row french\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Français</span><br> <span class=\"translationtext\">Mais si vous désirez Allāh et Son Messager et la Demeure de l’au-delà, alors en vérité pour celles d’entre vous qui font de bonnes œuvres, Allāh a préparé une très grande récompense. »</span> </div> </div> <div class=\"row spanish\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Español</span><br> <span class=\"translationtext\">“Pero si deseáis a Al‑lah y a Su Mensajero y la Morada del Más Allá, entonces <em>sabed que</em> Al‑lah en verdad ha preparado una gran recompensa para aquellas de vosotras que prac­tiquen el bien”.</span> </div> </div> <div class=\"row german\" align=\"left\" dir=\"ltr\" style=\"display:none; margin-top:10px\"> <div class=\"col-lg-12\"> <span class=\"translationheading\">Deutsch</span><br> <span class=\"translationtext\">Doch wenn ihr Allah begehrt und Seinen Gesandten und die Wohnstatt im Jenseits, dann, fürwahr, hat Allah für die unter euch, die Gutes tun, einen herrlichen Lohn bereitet.\"", "spanish": " ¡Oh, Profeta! di a tus esposas: “Si deseáis la vida de este mundo y sus adornos, venid pues; os proveeré y os liberaré de manera decorosa.", "urdu": " اے نبی! اپنی بیویوں سے کہہ کہ اگر تم دنیا اور اس کی زینت چاہتی ہو تو آٶ میں تمہیں کچھ دنیوی سامان دے دیتا ہوں اور تم کو نیک طریق سے رخصت کر دیتا ہوں۔"}, {"arabic": " یٰنِسَآءَ النَّبِیِّ مَنۡ یَّاۡتِ مِنۡکُنَّ بِفَاحِشَۃٍ مُّبَیِّنَۃٍ یُّضٰعَفۡ لَہَا الۡعَذَابُ ضِعۡفَیۡنِ ؕ وَ کَانَ ذٰلِکَ عَلَی اللّٰہِ یَسِیۡرًا ﴿۳۱﴾", "english": " O wives of the Prophet! if any of you be guilty of manifestly dishonourable conduct, the punishment will be doubled for her. And that is easy for Allah.", "french": " Ô épouses du Prophète ! Au cas où quelqu’une d’entre vous serait coupable de conduite manifestement inconvenante, le châtiment sera doublé pour elle. Et cela est facile pour Allāh.", "german": " O Frauen des Propheten! wer von euch offenkundig unziemlicher Aufführung schuldig ist, so würde ihr die Strafe verdoppelt werden. Und das ist Allah ein leichtes.", "spanish": " ¡Oh, esposas del Profeta! Si una de vosotras fuese culpable de conducta manifiestamente deshonrosa, el castigo le será duplicado. Y esto es fácil para Al‑lah.", "urdu": " اے نبی کی بیویو! اگر تم میں سے کوئی اعلیٰ ایمان کے خلاف بات کرے‘ تو اس کا عذاب دُگنا کیا جائے گا۔ اور یہ بات اللہ پر آسان ہے۔"}, {"arabic": " وَ مَنۡ یَّقۡنُتۡ مِنۡکُنَّ لِلّٰہِ وَ رَسُوۡلِہٖ وَ تَعۡمَلۡ صَالِحًا نُّؤۡتِہَاۤ اَجۡرَہَا مَرَّتَیۡنِ ۙ وَ اَعۡتَدۡنَا لَہَا رِزۡقًا کَرِیۡمًا ﴿۳۲﴾", "english": " But whoever of you is obedient to Allah and His Messenger and does good works, We shall give her her reward twice over; and We have prepared for her an honourable provision.", "french": " Mais quant à celle d’entre vous qui obéit à Allāh et à Son Messager, et fait de bonnes œuvres, Nous lui accorderons le double de sa récompense, et Nous avons préparé pour elle une provision honorable.", "german": " Doch wer von euch Allah und Seinem Gesandten gehorsam ist und Gutes tut – ihr werden Wir ihren Lohn zwiefach geben; und Wir haben für sie eine ehrenvolle Versorgung bereitet.", "spanish": " Pero a aquella de vosotras que obedezca a Al‑lah y a Su Mensa­jero y haga buenas obras, le daremos su recompensa duplicada; pues le he­mos preparado una provi­sión honorable.", "urdu": " اور تم میں سے جو کوئی اللہ اور اس کے رسول کی فرمانبرداری کرے گی اور اس (فرمانبرداری کی شان) کے مطابق کام بھی کرے گی تو ہم اسے انعام بھی دگنا دیں گے اور ہم نے ہر ایسی (بیوی) کے لئے معزز رزق تیار کیا ہوا ہے۔"}, {"arabic": " یٰنِسَآءَ النَّبِیِّ لَسۡتُنَّ کَاَحَدٍ مِّنَ النِّسَآءِ اِنِ اتَّقَیۡتُنَّ فَلَا تَخۡضَعۡنَ بِالۡقَوۡلِ فَیَطۡمَعَ الَّذِیۡ فِیۡ قَلۡبِہٖ مَرَضٌ وَّ قُلۡنَ قَوۡلًا مَّعۡرُوۡفًا ﴿ۚ۳۳﴾", "english": " O wives of the Prophet! You are not like any other women if you are righteous. So be not soft in speech, lest he in whose heart is a disease should feel tempted; and speak a decent speech.", "french": " Ô épouses du Prophète ! Vous n’êtes nullement comme des femmes ordinaires, pourvu que vous soyez pieuses. Alors ne parlez pas d’une voix basse et engageante, afin que celui dans le cœur de qui est une maladie, ne se sente pas tenté ; et prononcez des paroles décentes.", "german": " O Frauen des Propheten, ihr seid nicht wie andere Frauen! Wenn ihr rechtschaffen seid, dann seid nicht geziert im Reden, damit nicht der, in dessen Herzen Krankheit ist, Erwartungen hege, sondern redet in geziemenden Worten.", "spanish": " ¡Oh, esposas del Profeta! sois distintas a otras mujeres a condición de que seáis justas. No seáis pues demasiado blandas en vuestras palabras, para que no se sienta tentado quien tenga el corazón enfermo; y hablad con palabras pudorosas.", "urdu": " اے نبی کی بیویو! اگر تم اپنے مقام کو سمجھو تو تم عام عورتوں کی طرح نہیں ہو۔ پس چبا کر (یعنی نازونخرے کے ساتھ) بات نہ کیا کرو۔ تا ایسا نہ ہو کہ جس کے دل میں مرض ہے وہ تمہارے متعلق کوئی بدارادہ کرے اور ہمیشہ لوگوں کو نیک باتیں کہا کرو۔"}, {"arabic": " وَ قَرۡنَ فِیۡ بُیُوۡتِکُنَّ وَ لَا تَبَرَّجۡنَ تَبَرُّجَ الۡجَاہِلِیَّۃِ الۡاُوۡلٰی وَ اَقِمۡنَ الصَّلٰوۃَ وَ اٰتِیۡنَ الزَّکٰوۃَ وَ اَطِعۡنَ اللّٰہَ وَ رَسُوۡلَہٗ ؕ اِنَّمَا یُرِیۡدُ اللّٰہُ لِیُذۡہِبَ عَنۡکُمُ الرِّجۡسَ اَہۡلَ الۡبَیۡتِ وَ یُطَہِّرَکُمۡ تَطۡہِیۡرًا ﴿ۚ۳۴﴾", "english": " And stay in your houses with dignity , and do not show off yourselves like the showing off of the former days of ignorance, and observe Prayer, and pay the Zakat, and obey Allah and His Messenger. Surely Allah desires to remove from you all uncleanness, O Members of the Household, and purify you completely.", "french": " Restez avec dignité dans vos maisons, et ne vous embellissez pas dans le style de l’embellissement des jours de l’ignorance d’autrefois, et observez la Prière et payez la Zakāt, et obéissez à Allāh et à Son Messager. Assurément, Allāh désire enlever de vous toute impureté, ô Membres de la Famille du Prophète , et vous purifier entièrement.", "german": " Und bleibt in euren Häusern und prunkt nicht wie in den Zeiten der Unwissenheit, und verrichtet das Gebet und zahlet die Zakât, und gehorchet Allah und Seinem Gesandten. Allah wünscht nur Unreinheit von euch zu nehmen, ihr Angehörigen des Hauses, und euch rein und lauter zu machen.", "spanish": " Permaneced en vuestras casas con dignidad, no os adornéis al estilo que os embellecíais en los días de la ig­norancia, cumplid la Oración, pagad el Zakat y obedeced a Al‑lah y a Su Mensajero. En verdad, Al‑lah desea alejar de vosotras todo lo impuro, Oh Miembros de la Casa, y purifi­caros completamente.", "urdu": " اور اپنے گھروں میں بیٹھی رہا کرو اور پرانے زمانے کی جاہلیت (کے طریقوں) کی طرح اپنے زینت (غیر لوگوں پر) ظاہر نہ کیا کرو اور نماز کو (باشرائط) ادا کیا کرو۔ اور زکٰوۃ دیا کرو۔ اور اللہ اور اس کے رسول کی اطاعت کیا کرو۔ اے اہل بیت! اللہ تم میں سے ہر قسم کی گندگی دور کرنا اور تم کو کامل طور پر پاک کرنا چاہتا ہے۔"}, {"arabic": " وَ اذۡکُرۡنَ مَا یُتۡلٰی فِیۡ بُیُوۡتِکُنَّ مِنۡ اٰیٰتِ اللّٰہِ وَ الۡحِکۡمَۃِ ؕ اِنَّ اللّٰہَ کَانَ لَطِیۡفًا خَبِیۡرًا ﴿٪۳۵﴾", "english": " And remember what is rehearsed in your houses of the Signs of Allah and of wisdom. Verily Allah is the Knower of subtleties, All-Aware.", "french": " Et souvenez-vous de ce qui est récité dans vos maisons au sujet des Signes d’Allāh et de la sagesse. En vérité, Allāh connaît très bien toutes les subtilités, et est Très-Conscient.", "german": " Und gedenket der Zeichen Allahs und der Worte der Weisheit, die in euren Häusern verlesen werden; denn Allah ist gütig, allwissend.", "spanish": " Y acordaos de lo que se recita en vuestras casas de los Signos de Al‑lah y de la sabiduría. En ver­dad, Al‑lah es Quien conoce las suti­lezas, el Sumo Conocedor.", "urdu": " اور جو کچھ تمہارے گھروں میں اللہ کی آیتوں اور حکمت کی باتوں کی تلاوت کی جاتی ہے اس کو یاد رکھو اللہ بہت مہربانی کرنے والا (اور) خبر رکھنے والا ہے۔"}, {"arabic": " اِنَّ الۡمُسۡلِمِیۡنَ وَ الۡمُسۡلِمٰتِ وَ الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ وَ الۡقٰنِتِیۡنَ وَ الۡقٰنِتٰتِ وَ الصّٰدِقِیۡنَ وَ الصّٰدِقٰتِ وَ الصّٰبِرِیۡنَ وَ الصّٰبِرٰتِ وَ الۡخٰشِعِیۡنَ وَ الۡخٰشِعٰتِ وَ الۡمُتَصَدِّقِیۡنَ وَ الۡمُتَصَدِّقٰتِ وَ الصَّآئِمِیۡنَ وَ الصّٰٓئِمٰتِ وَ الۡحٰفِظِیۡنَ فُرُوۡجَہُمۡ وَ الۡحٰفِظٰتِ وَ الذّٰکِرِیۡنَ اللّٰہَ کَثِیۡرًا وَّ الذّٰکِرٰتِ ۙ اَعَدَّ اللّٰہُ لَہُمۡ مَّغۡفِرَۃً وَّ اَجۡرًا عَظِیۡمًا ﴿۳۶﴾", "english": " Surely, men who submit themselves to God and women who submit themselves to Him , and believing men and believing women, and obedient men and obedient women and truthful men and truthful women, and men steadfast in their faith and steadfast women, and men who are humble and women who are humble, and men who give alms and women who give alms, and men who fast and women who fast, and men who guard their chastity and women who guard their chastity , and men who remember Allah much and women who remember Him — Allah has prepared for all of them forgiveness and a great reward.", "french": " Assurément, les hommes qui se soumettent à Allāh et les femmes qui se soumettent à Lui , et les hommes croyants et les femmes croyantes et les hommes obéissants et les femmes obéissantes, et les hommes véridiques et les femmes véridiques, et les hommes endurants dans leur foi et les femmes endurantes, et les hommes qui sont humbles et les femmes qui sont humbles, et les hommes qui font l’aumône et les femmes qui font l’aumône, et les hommes qui jeûnent et les femmes qui jeûnent, et les hommes qui préservent leur chasteté et les femmes qui préservent la leur , et les hommes qui se souviennent beaucoup d’Allāh et le femmes qui se souviennent beaucoup de Lui – Allāh a préparé pour eux tous le pardon et une très grande récompense.", "german": " Wahrlich, die muslimischen Männer und die muslimischen Frauen, die gläubigen Männer und die gläubigen Frauen, die gehorsamen Männer und die gehorsamen Frauen, die wahrhaftigen Männer und die wahrhaftigen Frauen, die standhaften Männer und die standhaften Frauen, die demütigen Männer und die demütigen Frauen, die Männer, die Almosen geben, und die Frauen, die Almosen geben, die Männer, die fasten, und die Frauen, die fasten, die Männer, die ihre Keuschheit wahren, und die Frauen, die ihre Keuschheit wahren, die Männer, die Allahs häufig gedenken, und die Frauen, die gedenken – Allah hat ihnen Vergebung und herrlichen Lohn bereitet.", "spanish": " En verdad, los hombres que se someten a Dios y las mujeres que se someten a Él, los hombres y mujeres que creen, los hombres y mujeres obedientes, los hombres y ujeres veraces, los hombres y mu­jeres perseverantes en su fe, los hom­bres y mujeres humildes, los hombres y ujeres que dan limosnas, que ayunan, que guardan su castidad, los hombres que recuerdan mucho a Al‑lah y las mujeres que Lo recuer­dan mucho: para todos ellos Al‑lah ha preparado Su perdón y una mag­nífica recompensa.", "urdu": " یقیناً کامل مسلمان مرد اور کامل مسلمان عورتیں اور کامل مومن مرد اور کامل مومن عورتیں اور کامل فرمانبردار مرد اور کامل فرمانبردار عورتیں اور کامل راست گو مرد اور کامل راست گو عورتیں اور کامل صبر کرنے والے مرد اور کامل صبر کرنے والی عورتیں اور کامل عجز دکھانے والے مرد اور کامل عجز دکھانے والی عورتیں اور کامل صدقہ کرنے والے مرد اور کامل صدقہ کرنے والی عورتیں اور کامل روزہ گذار مرد اور کامل روزہ گذار عورتیں اور پوری طرح اپنی شرم گاہوں کی حفاظت کرنے والے مرد اور پوری طرح اپنی شرم گاہوں کی حفاظت کرنے والی عورتیں اور اللہ کا بہت ذکر کرنے والے مرد اور اللہ کا بہت ذکر کرنے والی عورتیں ان سب کے لئے اللہ نے بخشش کا سامان اور بڑا انعام تیار کر رکھا ہے۔"}, {"arabic": " وَ مَا کَانَ لِمُؤۡمِنٍ وَّ لَا مُؤۡمِنَۃٍ اِذَا قَضَی اللّٰہُ وَ رَسُوۡلُہٗۤ اَمۡرًا اَنۡ یَّکُوۡنَ لَہُمُ الۡخِیَرَۃُ مِنۡ اَمۡرِہِمۡ ؕ وَ مَنۡ یَّعۡصِ اللّٰہَ وَ رَسُوۡلَہٗ فَقَدۡ ضَلَّ ضَلٰلًا مُّبِیۡنًا ﴿ؕ۳۷﴾", "english": " And it behoves not a believing man or a believing woman, when Allah and His Messenger have decided a matter, that there should be a choice for them in the matter concerning them. And whoso disobeys Allah and His Messenger, surely strays away in manifest error.", "french": " Et il ne convient pas à un homme croyant ni à une femme croyante, lorsqu’Allāh et Son Messager ont décidé d’une affaire, qu’il y ait pour eux un choix dans l'affaire les concernant. Et quiconque désobéit à Allāh et à Son Messager, s’égare assurément dans une erreur manifeste.", "german": " Und es ziemt sich nicht für einen gläubigen Mann oder eine gläubige Frau, wenn Allah und Sein Gesandter eine Sache entschieden haben, dass sie in ihrer Angelegenheit eine Wahl haben sollten. Und wer Allah und Seinem Gesandten nicht gehorcht, der geht wahrlich irre in offenkundigem Irrtum.", "spanish": " No corresponde a un hombre creyente o a una mujer creyente, cuando Al‑lah y Su Mensajero han decidido un asunto, poder elegir en lo que les afecte. Pues quien desobedece a Al‑lah y a Su Mensajero, en verdad se aparta en error evidente.", "urdu": " اور کسی مومن مرد یا مومن عورت کے لئے جائز نہیں کہ جب اللہ اور اس کا رسول کسی معاملہ میں کوئی فیصلہ کر دیں تو وہ (پھر بھی) اپنے معاملے کا اپنی مرضی سے فیصلہ کریں اور جو کوئی اللہ اور اس کے رسول کی نافرمانی کرتا ہے وہ کھلی کھلی گمراہی میں پڑجاتا ہے۔"}, {"arabic": " وَ اِذۡ تَقُوۡلُ لِلَّذِیۡۤ اَنۡعَمَ اللّٰہُ عَلَیۡہِ وَ اَنۡعَمۡتَ عَلَیۡہِ اَمۡسِکۡ عَلَیۡکَ زَوۡجَکَ وَ اتَّقِ اللّٰہَ وَ تُخۡفِیۡ فِیۡ نَفۡسِکَ مَا اللّٰہُ مُبۡدِیۡہِ وَ تَخۡشَی النَّاسَ ۚ وَ اللّٰہُ اَحَقُّ اَنۡ تَخۡشٰہُ ؕ فَلَمَّا قَضٰی زَیۡدٌ مِّنۡہَا وَطَرًا زَوَّجۡنٰکَہَا لِکَیۡ لَا یَکُوۡنَ عَلَی الۡمُؤۡمِنِیۡنَ حَرَجٌ فِیۡۤ اَزۡوَاجِ اَدۡعِیَآئِہِمۡ اِذَا قَضَوۡا مِنۡہُنَّ وَطَرًا ؕ وَ کَانَ اَمۡرُ اللّٰہِ مَفۡعُوۡلًا ﴿۳۸﴾", "english": " And remember when thou didst say to him on whom Allah had bestowed favours and on whom thou also hadst bestowed favours: ‘Keep thy wife to thyself, and fear Allah.’ And thou didst conceal in thy heart what Allah was going to bring to light, and thou wast afraid of the people, whereas Allah has better right that thou shouldst fear Him. Then, when Zaid had accomplished his want of her so as to have no further need of her , We joined her in marriage to thee, so that there may be no hindrance for the believers with regard to the wives of their adopted sons, when they have accomplished their want of them. And Allah’s decree must be fulfilled.", "french": " Et souviens-toi quand tu as dit à celui à qui Allāh avait accordé des bienfaits, et à qui toi aussi tu avais accordé des bienfaits : « Garde ta femme et ne divorce pas d’avec elle , et crains Allāh. » Et tu as dissimulé dans ton esprit ce qu’Allāh allait mettre à jour, et tu as craint les hommes, alors qu’Allāh y avait plus de droit que tu Le craignes. Ensuite lorsque Zaid eut interrompu toute relation avec elle, Nous l’avons unie en mariage avec toi, afin que pour les croyants il n’y ait aucun empêchement en ce qui concerne les femmes de leurs fils adoptifs, lorsque ceux-ci ont cessé toute relation avec elles. Et le décret d’Allāh doit être exécuté.", "german": " Und (gedenke der Zeit) da du zu dem sprachst, dem Allah Gnade erwiesen hatte und dem (auch) du Gnade erwiesen hattest: \"Behalte deine Frau für dich und fürchte Allah.\" Und du verbargest in deiner Seele, was Allah ans Licht bringen wollte, und du fürchtetest die Menschen, während Allah mehr verdient, dass du Ihn fürchtest. Dann aber, als Zaid tat, was er mit ihr zu tun wünschte, verbanden Wir sie ehelich mit dir, damit für die Gläubigen keine Beunruhigung bestünde in Bezug auf die Frauen ihrer angenommenen Söhne, wenn sie ihren Wunsch ausgeführt haben. Allahs Ratschluss muss vollzogen werden.", "spanish": " Y acuérdate de cuando dijiste a quien Al‑lah había concedido Sus favores y a quien tú también con­cediste tus favores: “Conserva tu esposa para ti y teme a Al‑lah”. Mas escondiste en tu corazón lo que A1‑lah iba a sacar a la luz, y tuviste miedo de los hombres, mientras que Al‑lah tenía mejor derecho a que Lo temieras. espués, cuando Zaid hubo cumplido lo que quería de ella, hasta el punto de no nece­sitarla más, la unimos en matrimonio contigo, para que no hubiese impedi­mento para los creyentes en cuanto a las esposas de sus hijos adoptados, una vez cumplido su deseo. Y el decreto de Al‑lah debe cumplir­se.", "urdu": " اور (اے نبی! یاد کر) جب تو اس شخص کو جس پر اللہ نے اور تو نے انعام کیا تھا‘ کہتا تھا کہ اپنی بیوی کو روک رکھ (اور طلاق نہ دے) اور اللہ کا تقویٰ اختیار کر اور تو اپنے دل میں وہ بات چھپاتا تھا جس کو اللہ ظاہر کرنے والا تھا۔ اور تو لوگوں سے ڈرتا تھا‘ حالانکہ اللہ زیادہ حق دار ہے کہ تو اس سے ڈرے۔ پس جب زید نے اس (عورت) کے بارے میں اپنی خواہش پوری کر لی (یعنی طلاق دے دی) ہم نے اس (عورت) کا تجھ سے بیاہ کر دیا تاکہ مومنوں کے دلوں میں اپنے لے پالکوں کی بیویوں سے نکاح کرنے کے متعلق ان کو طلاق مل جانے کی صورت میں کوئی خلش نہ رہے اور خدا کا فیصلہ بہرحال پورا ہو کر رہنا تھا۔"}, {"arabic": " مَا کَانَ عَلَی النَّبِیِّ مِنۡ حَرَجٍ فِیۡمَا فَرَضَ اللّٰہُ لَہٗ ؕ سُنَّۃَ اللّٰہِ فِی الَّذِیۡنَ خَلَوۡا مِنۡ قَبۡلُ ؕ وَ کَانَ اَمۡرُ اللّٰہِ قَدَرًا مَّقۡدُوۡرَا ۣ ﴿۫ۙ۳۹﴾", "english": " There can be no hindrance for the Prophet with regard to that which Allah has made incumbent upon him. Such indeed was the way of Allah with those who have passed away before — and the command of Allah is a decree ordained —", "french": " Il ne peut y avoir aucun empêchement pour le Prophète en ce qui concerne ce qu’Allāh lui a rendu obligatoire. Telle était, en effet, la pratique d’Allāh avec ceux qui sont déjà passés – et le commandement d’Allāh est un décret institué –", "german": " Es trifft den Propheten kein Vorwurf für das, was Allah ihm auferlegt hat. Das war Allahs Vorgehen gegen jene, die vordem hingingen – und Allahs Befehl ist ein unabänderlicher Beschluss –,", "spanish": " No puede achacarse culpa al­guna al Profeta respecto a lo que Al‑lah le ha hecho responsable. Ésa fue, en efecto, la costumbre de Al‑lah con los que vivieron antes ‑y el mandamiento de Al‑lah es un decreto promulgado‑", "urdu": " نبی پر اس معاملے میں جو اس پر اللہ نے فرض کیا ہے کوئی الزام نہیں۔ یہی طریق اللہ نے پہلے لوگوں میں جاری کیا تھا اور خدا کا حکم تو ایک فیصلہ شدہ چیز ہے (کوئی اسے ٹلا نہیں سکتا)۔"}, {"arabic": " الَّذِیۡنَ یُبَلِّغُوۡنَ رِسٰلٰتِ اللّٰہِ وَ یَخۡشَوۡنَہٗ وَ لَا یَخۡشَوۡنَ اَحَدًا اِلَّا اللّٰہَ ؕ وَ کَفٰی بِاللّٰہِ حَسِیۡبًا ﴿۴۰﴾", "english": " Those who delivered the Messages of Allah and feared Him, and feared none but Allah. And sufficient is Allah as a Reckoner.", "french": " C’est la pratique d’Allāh en faveur de ceux qui ont transmis les Messages d’Allāh et qui L’ont craint, et qui n’ont craint aucun autre qu’Allāh. Et Allāh suffit pour régler les comptes.", "german": " jene, die Allahs Botschaften ausrichteten und Ihn fürchteten, und niemanden fürchteten außer Allah. Und Allah genügt als ein Rechner.", "spanish": " Quienes entregaron el Men­saje de Al‑lah y Lo temieron, y no temieron a nadie sino a Al‑lah. Pues Al‑lah basta para el cómputo.", "urdu": " (یہی سنت پہلے گذرے ہوئے پیغمبروں میں جاری تھی) جو اللہ کے پیغام لوگوں کو پہنچا دیتے تھے اور اس سے ڈرتے تھے اور اللہ کے سوا کسی سے نہیں ڈرتے تھے اور حساب لینے میں اللہ کافی ہے۔"}, {"arabic": " مَا کَانَ مُحَمَّدٌ اَبَاۤ اَحَدٍ مِّنۡ رِّجَالِکُمۡ وَ لٰکِنۡ رَّسُوۡلَ اللّٰہِ وَ خَاتَمَ النَّبِیّٖنَ ؕ وَ کَانَ اللّٰہُ بِکُلِّ شَیۡءٍ عَلِیۡمًا ﴿٪۴۱﴾", "english": " Muhammad is not the father of any of your men, but he is the Messenger of Allah and the Seal of the Prophets; and Allah has full knowledge of all things.", "french": " Mohammad n’est le père d’aucun de vos hommes, mais il est le Messager d’Allāh, et le Sceau des Prophètes ; et Allāh a pleine connaissance de toutes choses.", "german": " Muhammad ist nicht der Vater eines eurer Männer, sondern der Gesandte Allahs und das Siegel der Propheten; und Allah hat volle Kenntnis aller Dinge.", "spanish": " Mohammad no es el padre de ninguno de vuestros hombres, sino que es el Mensajero de Al‑lah y el Sello de los Profetas; y Al‑lah conoce perfectamente todas las cosas.", "urdu": " نہ محمد تم میں سے کسی مرد کے باپ تھے نہ ہیں (نہ ہونگے) لیکن اللہ کے رسول ہیں بلکہ (اس سے بھی بڑھ کر) نبیوں کی مہر ہیں اور اللہ ہر ایک چیز سے خوب آگاہ ہے۔"}, {"arabic": " یٰۤاَیُّہَاالَّذِیۡنَ اٰمَنُوا اذۡکُرُوا اللّٰہَ ذِکۡرًا کَثِیۡرًا﴿ۙ۴۲﴾", "english": " O ye who believe! remember Allah with much remembrance;", "french": " Ô vous qui croyez ! Souvenez-vous d’Allāh beaucoup ;", "german": " O die ihr glaubt! gedenket Allahs in häufigem Gedenken;", "spanish": " ¡Oh, vosotros, los que creéis! Acordaos con frecuencia de Al‑lah;", "urdu": " اے مومنو! اللہ کا ذکر بہت کیا کرو۔"}, {"arabic": " وَّ سَبِّحُوۡہُ بُکۡرَۃً وَّ اَصِیۡلًا ﴿۴۳﴾", "english": " And glorify Him morning and evening.", "french": " Et glorifiez-Le, matin et soir.", "german": " und lobpreiset Ihn morgens und abends.", "spanish": " Y glorificadle por la mañana y por la tarde.", "urdu": " اور صبح شام اس کی تسبیح کیا کرو۔"}, {"arabic": " ہُوَ الَّذِیۡ یُصَلِّیۡ عَلَیۡکُمۡ وَ مَلٰٓئِکَتُہٗ لِیُخۡرِجَکُمۡ مِّنَ الظُّلُمٰتِ اِلَی النُّوۡرِ ؕ وَ کَانَ بِالۡمُؤۡمِنِیۡنَ رَحِیۡمًا ﴿۴۴﴾", "english": " He it is Who sends blessings on you, as do His angels, that He may bring you forth from all kinds of darkness into light. And He is Merciful to the believers.", "french": " C’est Lui Qui envoie Ses bénédictions sur vous, et Ses anges prient pour vous , afin qu’Il puisse vous faire sortir de toutes sortes de ténèbres pour vous amener vers la lumière. Et Il est Miséricordieux envers les croyants.", "german": " Er ist es, Der euch segnet, und Seine Engel beten für euch, dass Er euch aus den Finsternissen zum Licht führe. Und Er ist barmherzig gegen die Gläubigen.", "spanish": " Es Él Quien envía bendiciones sobre vosotros, como hacen us án­geles, para que os lleve desde todas las clases de tinieblas a la luz. Pues Él es Misericordioso con los creyentes.", "urdu": " وہی ہے جو تم پر اپنی رحمتیں بھیجتا ہے اور اس کے فرشتے بھی تمہارے لئے دعائیں کرتے ہیں تا کہ (اس کا نتیجہ یہ نکلے کہ) وہ تم کو اندھیروں سے نور کی طرف لے جائے اور وہ مومنوں پر باربار رحم کرنے والا ہے۔"}, {"arabic": " تَحِیَّتُہُمۡ یَوۡمَ یَلۡقَوۡنَہٗ سَلٰمٌ ۖۚ وَ اَعَدَّ لَہُمۡ اَجۡرًا کَرِیۡمًا ﴿۴۵﴾", "english": " Their greeting on the day when they meet Him will be, ‘Peace.’ And He has prepared for them an honourable reward.", "french": " Le jour où ils Le rencontreront, leur salutation sera : « Paix. » Et Il leur a préparé une récompense honorable.", "german": " Ihr Gruß an dem Tage, da sie Ihm begegnen, wird sein \"Frieden!\" Und Er hat für sie einen ehrenvollen Lohn bereitet.", "spanish": " Su saludo en el día en que Lo encuentren, será “paz”. Pues Él les ha preparado una recompensa honrosa.", "urdu": " ان کو جب وہ اس سے ملیں گے دعا کا تحفہ سلامتی کی شکل میں ملے گا اور وہ ان کے لئے ایک بڑا عزت والا بدلہ تیار کرے گا۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ اِنَّاۤ اَرۡسَلۡنٰکَ شَاہِدًا وَّ مُبَشِّرًا وَّ نَذِیۡرًا ﴿ۙ۴۶﴾", "english": " O Prophet, truly We have sent thee as a Witness, and Bearer of glad tidings, and a Warner,", "french": " Ô Prophète, en vérité Nous t’avons envoyé en tant que Témoin, et en tant que Porteur de la bonne nouvelle et Avertisseur,", "german": " O Prophet, Wir haben dich als einen Zeugen entsandt, und als Bringer froher Botschaft, und als Warner,", "spanish": " ¡Oh, Profeta!, en verdad te hemos enviado como Testigo, Por­tador de la buena nueva y Amo­nestador.", "urdu": " اے نبی! ہم نے تجھ کو اس حال میں بھیجا ہے کہ تو (دنیا کا) نگران بھی ہے (مومنوں کو) خوشخبری دینے والا بھی ہے اور (کافروں کو) ڈرانے والا بھی ہے۔"}, {"arabic": " وَّ دَاعِیًا اِلَی اللّٰہِ بِاِذۡنِہٖ وَ سِرَاجًا مُّنِیۡرًا ﴿۴۷﴾", "english": " And as a Summoner unto Allah by His command, and as a Lamp that gives bright light.", "french": " Et en tant qu'un Convocateur vers Allāh par Son commandement, et comme une Lampe rayonnante.", "german": " und als einen Aufrufer zu Allah nach Seinem Gebot, und als eine leuchtende Sonne.", "spanish": " Como Convocador a Al‑lah por Su orden y como una Lámpara radiante.", "urdu": " اور نیز اللہ کے حکم سے اس کی طرف بلانے والا اور ایک چمکتا ہوا سورج بنا کر (بھیجا ہے) ۔"}, {"arabic": " وَ بَشِّرِ الۡمُؤۡمِنِیۡنَ بِاَنَّ لَہُمۡ مِّنَ اللّٰہِ فَضۡلًا کَبِیۡرًا ﴿۴۸﴾", "english": " And announce to the believers the glad tidings that they will have great bounty from Allah.", "french": " Et annonce aux croyants la bonne nouvelle qu’ils auront de la part d’Allāh une grande munificence.", "german": " Verkünde den Gläubigen die frohe Botschaft, dass ihnen von Allah große Huld zuteil werden soll.", "spanish": " Anunciad a los creyentes la buena nueva de que recibirán una importante gracia de Al‑lah.", "urdu": " اور مومنوں کو بشارت دے دے کہ ان کو اللہ کی طرف سے بہت بڑا فضل ملے گا۔"}, {"arabic": " وَ لَا تُطِعِ الۡکٰفِرِیۡنَ وَ الۡمُنٰفِقِیۡنَ وَ دَعۡ اَذٰٮہُمۡ وَ تَوَکَّلۡ عَلَی اللّٰہِ ؕ وَ کَفٰی بِاللّٰہِ وَکِیۡلًا ﴿۴۹﴾", "english": " And follow not the disbelievers and the hypocrites, and leave alone their annoyance, and put thy trust in Allah; for Allah is sufficient as a Guardian.", "french": " Et ne suis pas les mécréants et les hypocrites, et ne fais pas attention aux embêtements qu’ils te causent, et place ta confiance en Allāh ; car Allāh suffit comme Protecteur.", "german": " Und gehorche nicht den Ungläubigen und den Heuchlern, und beachte ihre Belästigung nicht, und vertraue auf Allah; denn Allah genügt als Beschützer.", "spanish": " Y no sigas a los incrédulos ni a los hipócritas, ignora sus molestias y pon tu confianza en Al‑lah; pues Al‑lah es suficiente como Guardián.", "urdu": " اور کافروں اور منافقوں کی بات ہرگز نہ مان‘ اور ان کی ایذا دہی کو نظر انداز کر دے اور اللہ پر توکل کر اور اللہ کارسازی میں کافی ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا نَکَحۡتُمُ الۡمُؤۡمِنٰتِ ثُمَّ طَلَّقۡتُمُوۡہُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡہُنَّ فَمَا لَکُمۡ عَلَیۡہِنَّ مِنۡ عِدَّۃٍ تَعۡتَدُّوۡنَہَا ۚ فَمَتِّعُوۡہُنَّ وَ سَرِّحُوۡہُنَّ سَرَاحًا جَمِیۡلًا ﴿۵۰﴾", "english": " O ye who believe! when you marry believing women and then divorce them before you have touched them, then you have no right against them with regard to the period of waiting that you reckon. So make some provision for them and send them away in a handsome manner.", "french": " Ô vous qui croyez ! Lorsque vous épousez des femmes croyantes, et qu’ensuite vous divorcez d’avec elles avant de les avoir touchées, alors vous n’avez sur elles aucun droit concernant la période d’attente prescrite que vous calculez. Fournissez-leur donc une quantité adéquate de biens matériels et laissez-les partir d’une manière élégante.", "german": " O die ihr glaubt! wenn ihr gläubige Frauen heiratet und euch dann von ihnen scheidet, ehe ihr sie berührt habt, so besteht für euch ihnen gegenüber keine Wartefrist, die ihr rechnet. Drum beschenkt sie und entlasst sie auf geziemende Weise.", "spanish": " ¡Oh vosotros, los que creéis! cuando contraigáis matrimonio con mujeres creyentes y después os divor­ciéis de ellas antes de que las hayáis tocado, no tendréis derecho alguno contra ellas respecto al período de espera prescrito que calculáis . Dadles pues alguna provisión y despedidlas de manera hono­rable.", "urdu": " اے مومنو! جب تم مومن عورتوں سے شادی کرو‘ پھر ان کو ان کے چھونے سے پہلے طلاق دے دو تو تم کو کوئی حق نہیں کہ ان سے عدت کا مطالبہ کرو‘ پس (چاہیئے کہ) ان کو کچھ دنیوی نفع پہنچا دو اور ان کو عمدگی کے ساتھ رخصت کر دو۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ اِنَّاۤ اَحۡلَلۡنَا لَکَ اَزۡوَاجَکَ الّٰتِیۡۤ اٰتَیۡتَ اُجُوۡرَہُنَّ وَ مَا مَلَکَتۡ یَمِیۡنُکَ مِمَّاۤ اَفَآءَ اللّٰہُ عَلَیۡکَ وَ بَنٰتِ عَمِّکَ وَ بَنٰتِ عَمّٰتِکَ وَ بَنٰتِ خَالِکَ وَ بَنٰتِ خٰلٰتِکَ الّٰتِیۡ ہَاجَرۡنَ مَعَکَ ۫ وَ امۡرَاَۃً مُّؤۡمِنَۃً اِنۡ وَّہَبَتۡ نَفۡسَہَا لِلنَّبِیِّ اِنۡ اَرَادَ النَّبِیُّ اَنۡ یَّسۡتَنۡکِحَہَا ٭ خَالِصَۃً لَّکَ مِنۡ دُوۡنِ الۡمُؤۡمِنِیۡنَ ؕ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَیۡہِمۡ فِیۡۤ اَزۡوَاجِہِمۡ وَ مَا مَلَکَتۡ اَیۡمَانُہُمۡ لِکَیۡلَا یَکُوۡنَ عَلَیۡکَ حَرَجٌ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۵۱﴾", "english": " O Prophet, We have made lawful to thee thy wives whom thou hast paid their dowries, and those whom thy right hand possesses from among those whom Allah has given thee as gains of war, and the daughters of thy paternal uncle, and the daughters of thy paternal aunts, and the daughters of thy maternal uncle, and the daughters of thy maternal aunts who have emigrated with thee, and any other believing woman if she offers herself for marriage to the Prophet provided the Prophet desires to marry her; this is only for thee, as against other believers — We have already made known what We have enjoined on them concerning their wives and those whom their right hands possess — in order that there may be no difficulty for thee in the discharge of thy work . And Allah is Most Forgiving, Merciful.", "french": " Ô Prophète, Nous avons rendu licites pour toi tes épouses à qui tu as payé leur dot, et celles que ta main droite possède d’entre celles qu’Allāh t’a accordées comme butin de guerre, et les filles de ton oncle paternel, et les filles de tes tantes paternelles, et les filles de ton oncle maternel, et les filles de tes tantes maternelles qui ont émigré avec toi, et n’importe quelle autre femme croyante si elle s’offre en mariage au Prophète, pourvu que le Prophète désire l’épouser ; ces dispositions sont pour toi seul et non pour les autres croyants. Nous avons déjà fait connaître ce que Nous leur avons enjoint concernant leurs épouses, et celles que leurs mains droites possèdent – afin qu’il n’y ait pour toi aucune difficulté pour ce qu’ils puissent penser . Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " O Prophet, Wir erlaubten dir deine Gattinnen, denen du ihre Mitgift zu geben dich verpflichtet hast, und jene, die deine Rechte besitzt aus (der Zahl) derer, die Allah dir als Kriegsbeute gegeben, und die Töchter deines Vatersbruders, und die Töchter deiner Vaterschwestern, und die Töchter deines Mutterbruders, und die Töchter deiner Mutterschwestern, die mit dir ausgewandert sind, und jedwede gläubige Frau, wenn sie sich dem Propheten anvertraut, vorausgesetzt, dass der Prophet sie zu heiraten wünscht: (dies) nur für dich und nicht für die Gläubigen. Wir haben bereits bekanntgegeben, was Wir ihnen verordnet haben über ihre Frauen und jene, die ihre Rechte besitzt, so dass sich keine Schwierigkeit für dich ergäbe (in der Ausführung deines Werks). Und Allah ist allverzeihend, barmherzig.", "spanish": " ¡Oh, Profeta!, Te hemos hecho lícitas tus esposas, cuyas dotes has pagado, las que posee tu mano dere­cha de entre aquellas que Al‑lah te ha dado como ganancia de guerra, las hijas de tu tío paterno, las hijas de tus tías paternas, las hijas de tu tío materno y las hijas de tus tías ma­ternas que han emigrado contigo, y cualquier otra mujer creyente si se ofrece en matrimonio al Profeta, a condición de que el Profeta desee casarse con ella: esto es sólo para ti, y no para otros creyentes- ya hemos dado a conocer lo que les hemos orde­nado a ellos en cuanto a sus esposas y a as que poseen sus manos derechas- para que no haya dificultad para ti en el cumplimiento de tu tarea. Pues Al‑lah es el Sumo Indul­gente, Misericordioso .", "urdu": " اے نبی! تیری موجودہ بیویوں میں سے وہ جن کو تو نے ان کا حق مہر ادا کر دیا ہے ہم نے تیرے لئے حلال کر دی ہیں۔ اسی طرح آئندہ کے لئے وہ عورتیں جن کے مالک تیرے داہنے ہاتھ ہوئے ہیں جن کو اللہ تیرے قبضہ میں جنگ کے بعد لایا ہے اور اسی طرح تیرے چچے کی بیٹیاں اور تیری پھوپھی کی بیٹیاں اور تیرے ماموں کی بیٹیاں اور تیری خالاٶں کی بیٹیاں جنہوں نے تیرے ساتھ ہجرت کی ہے اور ایسی مومن عورت بھی جس نے اپنی جان کو نبی کے لئے ہبہ کر دیا۔ بشرطیکہ نبی اس سے نکاح کا ارادہ کرے۔ یہ حکم خاص تیرے لئے ہے۔ باقی مومنوں کے لئے نہیں ہم اس کو جو ہم نے ان (مسلمانوں) پر ان کی بیویوں کے متعلق اور ان کی لونڈیوں کے متعلق فرض کیا ہے خوب جانتے ہیں۔ تا کہ تجھ پر کوئی ناواجب قید نہ ہو۔ اور اللہ بہت بخشنے والا (اور) باربار کرم کرنے والا ہے۔"}, {"arabic": " تُرۡجِیۡ مَنۡ تَشَآءُ مِنۡہُنَّ وَ تُــٔۡوِیۡۤ اِلَیۡکَ مَنۡ تَشَآءُ ؕ وَ مَنِ ابۡتَغَیۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَیۡکَ ؕ ذٰلِکَ اَدۡنٰۤی اَنۡ تَقَرَّ اَعۡیُنُہُنَّ وَ لَا یَحۡزَنَّ وَ یَرۡضَیۡنَ بِمَاۤ اٰتَیۡتَہُنَّ کُلُّہُنَّ ؕ وَ اللّٰہُ یَعۡلَمُ مَا فِیۡ قُلُوۡبِکُمۡ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَلِیۡمًا ﴿۵۲﴾", "english": " Thou mayest defer the marriage of any of them that thou pleasest, and receive unto thyself whom thou pleasest; and if thou desirest to take back any of those whom thou hast put aside, there is no blame on thee. That is more likely that their eyes may be cooled, and that they may not grieve, and that they may all be pleased with that which thou hast given them. And Allah knows what is in your hearts; and Allah is All-Knowing, Forbearing.", "french": " Tu peux reporter ton mariage avec n’importe laquelle d’entre elles que tu voudras, et retenir auprès de toi celle que tu voudras ; et si tu désires reprendre n’importe laquelle de celles dont tu te seras séparé, il n’y a aucun blâme sur toi. Ainsi, il est plus probable que leurs yeux seront apaisés et qu’elles ne se désoleront pas et qu’elles seront toutes satisfaites avec ce que tu leur as donné. Et Allāh sait ce qui est dans votre cœur ; et Allāh est Omniscient, Indulgent.", "german": " Du darfst die unter ihnen hinhalten, die du wünschest, und du darfst die zu dir nehmen, die du wünschest; und wenn du eine, die du entlassen, wieder nehmen willst, dann trifft dich kein Vorwurf. Das ist dazu angetan, dass ihre Augen gekühlt werden und dass sie sich nicht grämen und dass sie alle zufrieden sein mögen mit dem, was du ihnen zu geben hast. Allah weiß, was in euren Herzen ist, denn Allah ist allwissend, langmütig.", "spanish": " Puedes diferir casarte con cualquiera de entre ellas si lo deseas, y recibir a quien te agrade; y si deseas tomar de nuevo a alguna de las que hayas dejado a un lado, no tendrás culpa al­guna. Eso será lo más adecuado para que sus ojos se consuelen, para que no sufran aflicción y todas se contenten con lo que tú les hayas dado. Pues Al‑lah sabe lo que hay en vuestros corazones; y Al‑lah es Omnisciente, Tolerante.", "urdu": " تو ان (بیویوں) میں سے جس کو چاہے الگ کر دے اور جس کو چاہے اپنے پاس رکھ لے اور ان عورتوں میں سے جن کو تو نے الگ کر دیا ہے کسی کو اپنے پاس لے آئے تو تجھ پر کوئی گناہ نہیں۔ یہ امر اس بات کے بہت زیادہ قریب ہے کہ ان کی آنکھیں ٹھنڈی ہوں اور وہ غم نہ کریں اور جو کچھ تو نے ان کو دیا ہے اس پر سب کی سب راضی ہو جائیں اور اللہ تمہارے دلوں کی ہر بات کو جانتا ہے اور وہ بہت جاننے والا (اور) بہت سمجھ بوجھ سے کام لینے والا ہے۔"}, {"arabic": " لَا یَحِلُّ لَکَ النِّسَآءُ مِنۡۢ بَعۡدُ وَ لَاۤ اَنۡ تَبَدَّلَ بِہِنَّ مِنۡ اَزۡوَاجٍ وَّ لَوۡ اَعۡجَبَکَ حُسۡنُہُنَّ اِلَّا مَا مَلَکَتۡ یَمِیۡنُکَ ؕ وَ کَانَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ رَّقِیۡبًا ﴿٪۵۳﴾", "english": " It is not allowed to thee to marry women after that, not to change them for other wives even though their goodness please thee, except any that thy right hand possesses. And Allah is Watchful over all things.", "french": " Il ne t’est pas permis d’épouser des femmes en dehors de ces catégories , ni de prendre à leur place d’ autres épouses même si leurs bonnes qualités te plaisent, hormis celles que ta main droite possède. Et Allāh est Vigilant sur toutes choses.", "german": " Es ist dir nicht erlaubt, hinfort (andere) Frauen (zu heiraten) noch sie mit (anderen) Frauen zu vertauschen, auch wenn ihre Güte dir gefällt, die nur ausgenommen, die deine Rechte besitzt. Und Allah wacht über alle Dinge.", "spanish": " No se te permite contraer ma­trimonio con mujeres después de eso, ni cambiarlas por otras esposas, aunque su bondad te agrade, excepto cualquiera que posea tu mano de­recha. Pues Al‑lah es Vigilante sobre todas las cosas.", "urdu": " تیرے لئے (مزید) عورتیں اس کے بعد حلال نہیں اور نہ یہ حلال ہے کہ ان موجودہ بیویوں کو بدل کر اور بیویاں کر لے خواہ ان کا حسن تجھے کتنا ہی پسند ہو۔ سوائے ان عورتوں کے جن کے مالک تیرے دائیں ہاتھ ہوئے اور اللہ ہر ایک چیز کا نگران ہے۔"}, {"arabic": " یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَدۡخُلُوۡا بُیُوۡتَ النَّبِیِّ اِلَّاۤ اَنۡ یُّؤۡذَنَ لَکُمۡ اِلٰی طَعَامٍ غَیۡرَ نٰظِرِیۡنَ اِنٰٮہُ ۙ وَ لٰکِنۡ اِذَا دُعِیۡتُمۡ فَادۡخُلُوۡا فَاِذَا طَعِمۡتُمۡ فَانۡتَشِرُوۡا وَ لَا مُسۡتَاۡنِسِیۡنَ لِحَدِیۡثٍ ؕ اِنَّ ذٰلِکُمۡ کَانَ یُؤۡذِی النَّبِیَّ فَیَسۡتَحۡیٖ مِنۡکُمۡ ۫ وَ اللّٰہُ لَا یَسۡتَحۡیٖ مِنَ الۡحَقِّ ؕ وَ اِذَا سَاَلۡتُمُوۡہُنَّ مَتَاعًا فَسۡـَٔلُوۡہُنَّ مِنۡ وَّرَآءِ حِجَابٍ ؕ ذٰلِکُمۡ اَطۡہَرُ لِقُلُوۡبِکُمۡ وَ قُلُوۡبِہِنَّ ؕ وَ مَا کَانَ لَکُمۡ اَنۡ تُؤۡذُوۡا رَسُوۡلَ اللّٰہِ وَ لَاۤ اَنۡ تَنۡکِحُوۡۤا اَزۡوَاجَہٗ مِنۡۢ بَعۡدِہٖۤ اَبَدًا ؕ اِنَّ ذٰلِکُمۡ کَانَ عِنۡدَ اللّٰہِ عَظِیۡمًا ﴿۵۴﴾", "english": " O ye who believe! enter not the houses of the Prophet unless leave is granted to you for a meal without waiting for its appointed time. But enter when you are invited, and when you have finished eating, disperse, without seeking to engage in talk. That causes inconvenience to the Prophet, and he feels shy of asking you to leave. But Allah is not shy of saying what is true. And when you ask them (the wives of the Prophet) for anything, ask them from behind a curtain. That is purer for your hearts and their hearts. And it behoves you not to cause inconvenience to the Messenger of Allah, nor that you should ever marry his wives after him. Indeed that would be an enormity in the sight of Allah.", "french": " Ô vous qui croyez ! N’entrez pas dans les maisons du Prophète, à moins que vous ne soyez invités pour un repas et alors aussi n’arrivant pas avant que le repas soit prêt. Mais entrez quand vous y êtes invités ; et quand vous avez fini de manger dispersez-vous, sans chercher à entamer une conversation. Cela incommode le Prophète, et il est gêné de vous demander de partir , mais Allāh n’est pas gêné de dire ce qui est correct. Et quand vous demandez aux épouses du Prophète quelque chose, demandez -le leur de derrière un rideau. Cela est plus pur pour votre cœur et pour leur cœur. Et il ne vous convient pas d’importuner le Messager d’Allāh, et il vous est commandé de ne jamais vous marier avec ses épouses après lui. En vérité, aux yeux d’Allāh cela serait une énormité.", "german": " O die ihr glaubt! betretet nicht die Häuser des Propheten, es sei denn, dass euch Erlaubnis gegeben ward zu einer Mahlzeit, ohne auf deren Zubereitung zu warten. Sondern wann immer ihr eingeladen seid, tretet ein (zur rechten Zeit); und wenn ihr gespeist habt, so gehet auseinander und säumt nicht zu (weiterer) Unterhaltung. Das verursacht dem Propheten Ungelegenheit und er ist scheu vor euch, jedoch Allah ist nicht scheu vor der Wahrheit. Und wenn ihr sie um irgendetwas zu bitten habt, so bittet sie hinter einem Vorhang. Das ist reiner für eure Herzen und ihre Herzen. Und es geziemt euch nicht, den Gesandten Allahs zu belästigen, noch dass ihr je seine Frauen nach ihm heiraten solltet. Fürwahr, das würde vor Allah eine Ungeheuerlichkeit sein.", "spanish": " ¡Oh vosotros, los que creéis! no entréis en las asas del Profeta salvo que se os invite a una comida, y aun entonces no tan pronto que ten­gáis que esperar a su prepara­ción. Pero entrad cuando seáis invitados, y cuando hayáis terminado de comer, retiraos, sin intentar iniciar una conversación. Esto molestaría al Profeta y Él se avergonzaría de pediros que salgáis. Pero Al-lah no se avergüenza de decir lo que es cierto. Y cuando les pidáis algo (a las esposas del Profeta), pedídselo desde detrás de una cortina. Esto es más puro para vuestros corazones y para los de ellas. Y os corresponde no causar molestia al­guna al Mensajero de Al‑lah, ni con­traer nunca matrimonio con sus es­posas después de él. En verdad esto sería una enormidad a los ojos de Al‑lah.", "urdu": " اے مومنو! نبی کے گھروں میں سوائے اس کے کہ تمہیں کھانے کے لئے بلایا جائے ہرگز داخل نہ ہوا کرو۔ وہ بھی اس شرط سے کہ کھانا پکنے کے انتظار میںنہ بیٹھے رہا کرو۔ اور نہ باتیں کرنے کے شوق میں بیٹھے رہا کرو۔ ہاں! جب تم کو بلایا جائے تو پھر ضرور چلے جایا کرو۔ پھر جب کھانا کھا چکو تو اپنے اپنے گھروں کو چلے جایا کرو۔ یہ امر (یعنی بے فائدہ بیٹھے رہنا یا پہلے آجانا) نبی کو تکلیف دیتا تھا۔ مگر وہ (تمہارے جذبات کا خیال کرکے) تم (کو منع کرنے) سے حیا کرتا تھا۔ مگر اللہ سچی بات بیان کرنے سے (لوگوں کے خیالات کی وجہ سے) باز نہیں رہتا اور (چاہیے کہ) جب تم ان (یعنی نبی کی بیویوں) سے کوئی گھر کی چیز مانگو تو پردہ کے پیچھے سے مانگا کرو۔ یہ بات تمہارے دلوں اور ان کے دلوں کے لئے بہت اچھی ہے اور اللہ کے رسول کو تکلیف دینا تمہارے لئے جائز نہیں اور نہ یہ جائز ہے کہ تم اس کے بعد اس کی بیویوں سے کبھی بھی شادی کرو۔ یہ بات اللہ کے فیصلہ کے مطابق بہت بری ہے۔"}, {"arabic": " اِنۡ تُبۡدُوۡا شَیۡئًا اَوۡ تُخۡفُوۡہُ فَاِنَّ اللّٰہَ کَانَ بِکُلِّ شَیۡءٍ عَلِیۡمًا ﴿۵۵﴾", "english": " Whether you reveal a thing or conceal it, Allah knows all things full well.", "french": " Que vous révéliez une chose ou que vous la dissimuliez, en vérité Allāh connaît toutes choses très bien.", "german": " Ob ihr eine Sache offenbart oder sie verhehlt, wahrlich, Allah kennt alle Dinge.", "spanish": " Tanto si manifestáis algo como si lo ocultáis, Al‑lah conoce per­fectamente todas las cosas.", "urdu": " اگر تم کسی چیز کو ظاہر کرو یا چھپاٶ‘ تو اللہ ہر چیز کو خوب جانتا ہے۔"}, {"arabic": " لَا جُنَاحَ عَلَیۡہِنَّ فِیۡۤ اٰبَآئِہِنَّ وَ لَاۤ اَبۡنَآئِہِنَّ وَ لَاۤ اِخۡوَانِہِنَّ وَ لَاۤ اَبۡنَآءِ اِخۡوَانِہِنَّ وَ لَاۤ اَبۡنَآءِ اَخَوٰتِہِنَّ وَ لَا نِسَآئِہِنَّ وَ لَا مَا مَلَکَتۡ اَیۡمَانُہُنَّ ۚ وَ اتَّقِیۡنَ اللّٰہَ ؕ اِنَّ اللّٰہَ کَانَ عَلٰی کُلِّ شَیۡءٍ شَہِیۡدًا ﴿۵۶﴾", "english": " There is no blame on them in this respect with regard to their fathers or their sons or their brothers or the sons of their brothers or the sons of their sisters or their womenfolk or those whom their right hands possess. And fear Allah, O wives of the Prophet , verily, Allah is Witness over all things.", "french": " Il ne peut rien leur être reproché à cet égard en ce qui concerne leur père, ou leurs fils ou leurs frères, ou les fils de leurs frères, ou les fils de leurs soeurs, ou les femmes de leur milieu ou celles que leurs mains droites possèdent. Et craignez Allāh, ô épouses du Prophète . En vérité Allāh est Témoin de toutes choses.", "german": " Es ist kein Vergehen von ihnen (sich zu zeigen) ihren Vätern oder ihren Söhnen oder ihren Brüdern oder den Söhnen ihrer Brüder oder den Söhnen ihrer Schwestern oder ihren Frauen oder denen, die ihre Rechte besitzt. Und fürchtet Allah; wahrlich, Allah ist Zeuge aller Dinge.", "spanish": " No hay culpa en ellos a este respecto en cuanto a sus padres, sus hijos, sus hermanos o los hijos de sus hermanos, los hijos de sus hermanas o sus mujeres o aquellos que sus manos derechas poseen. Temed a Al‑lah, Oh esposas del Profeta, pues en verdad Al‑lah es Testigo de todas las cosas.", "urdu": " ان (یعنی ازواج نبی کریم صلی اللہ علیہ وسلم) پر اپنے باپوں یا اپنے بیٹوں یا اپنے بھائیوں یا اپنے بھتیجوں یا اپنے بھانجوں یا اپنی ہم کفو عورتوں یا اپنی زیر تصرف لونڈیوں کے سامنے ہونے میں کوئی پابندی نہیں اور اللہ کا تقویٰ اختیار کرو۔ اللہ ہر ایک چیز کو دیکھ رہا ہے۔"}, {"arabic": " اِنَّ اللّٰہَ وَ مَلٰٓئِکَتَہٗ یُصَلُّوۡنَ عَلَی النَّبِیِّ ؕ یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا صَلُّوۡا عَلَیۡہِ وَ سَلِّمُوۡا تَسۡلِیۡمًا ﴿۵۷﴾", "english": " Allah and His angels send blessings on the Prophet. O ye who believe! you also should invoke blessings on him and salute him with the salutation of peace.", "french": " Certainement Allāh envoie Ses bénédictions sur le Prophète et Ses anges prient pour lui . Ô vous qui croyez ! Vous aussi devez implorer des bénédictions sur lui, et le saluer avec la salutation de paix.", "german": " Allah sendet Segnungen auf den Propheten und Seine Engel beten für ihn. O die ihr glaubt, betet (auch) ihr für ihn und wünschet ihm Frieden mit aller Ehrerbietung.", "spanish": " Al‑lah y Sus ángeles envían bendiciones al Profeta. ¡Oh vosotros, los que creéis! invocad también ben­diciones sobre él y saludad le con el saludo de la paz.", "urdu": " اللہ یقیناً اس نبی پر اپنی رحمت نازل کر رہا ہے اور اس کے فرشتے بھی (یقیناً اس کے لئے دعائیں کر رہے ہیں پس) اے مومنو! تم بھی اس نبی پر درود بھیجتے اور ان کے لئے دعائیں کرتے رہا کرو اور (خوب جوش و خروش سے) ان کے لئے سلامتی مانگتے رہا کرو۔"}, {"arabic": " اِنَّ الَّذِیۡنَ یُؤۡذُوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ لَعَنَہُمُ اللّٰہُ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ وَ اَعَدَّ لَہُمۡ عَذَابًا مُّہِیۡنًا ﴿۵۸﴾", "english": " Verily, those who malign Allah and His Messenger — Allah has cursed them in this world and in the Hereafter, and has prepared for them an abasing punishment.", "french": " En vérité ceux qui causent de la gêne à Allāh et à Son Messager, Allāh les a maudits dans ce monde et dans l’au-delà, et leur a préparé un châtiment humiliant.", "german": " Wahrlich, diejenigen, die Allah und Seinen Gesandten belästigen – Allah hat sie von Sich gewiesen in dieser Welt und im Jenseits und hat ihnen eine schmähliche Strafe bereitet.", "spanish": " En verdad, a quienes molestan a Al‑lah y a Su Mensajero, Al‑lah los ha maldecido en este mundo y en el Más Allá, y ha pre­parado para ellos un humillante cas­tigo.", "urdu": " وہ لوگ جو کہ اللہ اور اس کے رسول کو تکلیف دیتے ہیں اللہ ان کو (اس) دنیا میں اور آخرت میں اپنے قرب سے محروم کر دیتا ہے اور اس نے ان کے لئے رسوا کرنے والا عذاب تیار کر چھوڑا ہے۔"}, {"arabic": " وَ الَّذِیۡنَ یُؤۡذُوۡنَ الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ بِغَیۡرِ مَا اکۡتَسَبُوۡا فَقَدِ احۡتَمَلُوۡا بُہۡتَانًا وَّ اِثۡمًا مُّبِیۡنًا ﴿٪۵۹﴾", "english": " And those who malign believing men and believing women for what they have not earned shall bear the guilt of a calumny and a manifest sin.", "french": " Et ceux qui calomnient les croyants et les croyantes, pour ce qu’ils n’ont pas mérité porteront la culpabilité d’ une calomnie et d’ un péché manifeste.", "german": " Und diejenigen, die gläubige Männer und gläubige Frauen belästigen (wollen) unverdienterweise, laden gewisslich (die Schuld) der Verleumdung und offenkundige Sünde auf sich.", "spanish": " Y quienes molestan a los cre­yentes y a las creyentes por lo que no han merecido, serán culpables de ca­lumnia y de pecado manifiesto.", "urdu": " وہ لوگ جو کہ مومن مردوں اور مومن عورتوں کو بغیر اس کے کہ انہوں نے کوئی قصور کیا ہو تکلیف دیتے ہیں ان لوگوں نے خطرناک جھوٹ اور کھلے کھلے گناہ کا بوجھ اپنے اوپر اٹھا لیا ہے۔"}, {"arabic": " یٰۤاَیُّہَا النَّبِیُّ قُلۡ لِّاَزۡوَاجِکَ وَ بَنٰتِکَ وَ نِسَآءِ الۡمُؤۡمِنِیۡنَ یُدۡنِیۡنَ عَلَیۡہِنَّ مِنۡ جَلَابِیۡبِہِنَّ ؕ ذٰلِکَ اَدۡنٰۤی اَنۡ یُّعۡرَفۡنَ فَلَا یُؤۡذَیۡنَ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۶۰﴾", "english": " O Prophet! tell thy wives and thy daughters and the women of the believers that they should draw close to them portions of their loose outer coverings. That is nearer that they may thus be distinguished and not molested. And Allah is Most Forgiving, Merciful.", "french": " Ô Prophète ! Dis à tes épouses et à tes filles et aux femmes des croyants, qu’elles doivent ramener sur elles-mêmes une partie de leurs vêtements extérieurs de la tête, par-dessus le visage. Il est plus probable qu'elles puissent être ainsi distinguées et ne soient pas importunées. Et Allāh est Très-Pardonnant, Miséricordieux.", "german": " O Prophet! sprich zu deinen Frauen und deinen Töchtern und zu den Frauen der Gläubigen, sie sollen ihre Tücher tief über sich ziehen. Das ist besser, damit sie erkannt und nicht belästigt werden. Und Allah ist allverzeihend, barmherzig.", "spanish": " ¡Oh, Profeta!, di a tus esposas, a tus hijas y a las mujeres de los creyentes, que deben bajar sus túnicas externas desde su cabeza sobre su rostro. Esto es más conveniente para que sean así reco­nocidas y no molestadas. Pues Al‑lah, es el Sumo Indulgente, Misericor­dioso.", "urdu": " اے نبی! اپنی بیویوں اور اپنی بیٹیوں اور مومنوں کی بیویوں سے کہہ دے کہ (جب وہ باہر نکلیں) اپنی بڑی چادروں کو سروں پر سے گھسیٹ کر اپنے سینوں تک لے آیا کریں یہ امر اس بات کو ممکن بنا دیتا ہے کہ وہ پہچانی جائیں اور ان کو تکلیف نہ دی جائے اور اللہ بڑا بخشنے والا (اور) باربار رحم کرنے والا ہے۔"}, {"arabic": " لَئِنۡ لَّمۡ یَنۡتَہِ الۡمُنٰفِقُوۡنَ وَ الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ وَّ الۡمُرۡجِفُوۡنَ فِی الۡمَدِیۡنَۃِ لَنُغۡرِیَنَّکَ بِہِمۡ ثُمَّ لَا یُجَاوِرُوۡنَکَ فِیۡہَاۤ اِلَّا قَلِیۡلًا ﴿ۖۛۚ۶۱﴾", "english": " If the hypocrites, and those in whose heart is a disease, and those who cause agitation in the city, desist not, We shall surely give thee authority over them; then they will not dwell therein as thy neighbours, save for a little while.", "french": " Si les hypocrites, et ceux dans le cœur de qui est une maladie, et ceux qui font courir de fausses rumeurs dans la ville, ne renoncent pas à leurs activités , Nous te mettrons à leurs trousses en vue de les punir ; alors ils n’habiteront plus autour de toi sauf pour peu de temps .", "german": " Wenn die Heuchler und die, in deren Herzen Krankheit ist, und die, welche Gerüchte in der Stadt ausstreuen, nicht ablassen, so werden Wir dich sicherlich gegen sie antreiben; dann werden sie nicht als deine Nachbarn darin weilen, es sei denn für kurze Zeit.", "spanish": " Si los hipócritas, y los de corazón enfermo y quienes propagan rumores sin fundamento por la ciudad no desisten, ciertamente haremos que te levantes contra ellos; luego no permanecerán junto a vosotros salvo por poco tiempo.", "urdu": " اگر منافق مرد اور وہ لوگ جن کے دلوں میں مرض ہے اور وہ لوگ جو مدینہ میں جھوٹی افواہیں پھیلاتے پھرتے ہیں باز نہ آئیں گے تو ہم تجھے ان لوگوں کے خلاف (ایک دن) کھڑا کر دیں گے پھر وہ تیرے ساتھ اس شہر میں بہت ہی تھوڑی مدت تک ہمسائیگت میں بسر کریں گے۔"}, {"arabic": " مَّلۡعُوۡنِیۡنَ ۚۛ اَیۡنَمَا ثُقِفُوۡۤا اُخِذُوۡا وَ قُتِّلُوۡا تَقۡتِیۡلًا ﴿۶۲﴾", "english": " Then they will be accursed. Wherever they are found, they will be seized, and cut into pieces.", "french": " Ensuite ils seront maudits. Où qu’ils soient trouvés, ils seront saisis, et tués sans pitié.", "german": " Weit sind sie von der Gnade! Wo immer sie gefunden werden, sollen sie ergriffen und hingerichtet werden.", "spanish": " Entonces serán ellos malditos. En cualquier lugar en que se encuentren serán apresados y cortados en trozos.", "urdu": " وہ جہاں کہیں بھی تمہارے قابو میں آئیں چاہیے کہ پکڑے جائیں اور قتل کر دئیے جائیں کیونکہ وہ خدا کے رحم سے محروم کر دئیے گئے ہیں۔"}, {"arabic": " سُنَّۃَ اللّٰہِ فِی الَّذِیۡنَ خَلَوۡا مِنۡ قَبۡلُ ۚ وَ لَنۡ تَجِدَ لِسُنَّۃِ اللّٰہِ تَبۡدِیۡلًا ﴿۶۳﴾", "english": " Such has been the way of Allah in the case of those who passed away before, and thou wilt never find a change in the way of Allah.", "french": " Telle a été la pratique d’Allāh avec ceux qui sont passés avant, et tu ne trouveras jamais aucun changement dans la pratique d’Allāh.", "german": " (Folget) dem Brauch Allahs im Falle derer, die vordem hingingen; und du wirst in Allahs Brauch nie einen Wandel finden.", "spanish": " Así ha sido el modo de actuar de Al‑lah en el caso de quienes mu­rieron antes, y nunca encontrarás un cambio en el modo de obrar de Al‑lah.", "urdu": " اللہ کی اس سنت کو (اختیار کرو) جو ان لوگوں میں جاری ہوئی تھی جو تم سے پہلے گذر چکے ہیں اور تو کبھی بھی اللہ کی سنت میں تبدیلی نہیں پائے گا۔"}, {"arabic": " یَسۡـَٔلُکَ النَّاسُ عَنِ السَّاعَۃِ ؕ قُلۡ اِنَّمَا عِلۡمُہَا عِنۡدَ اللّٰہِ ؕ وَ مَا یُدۡرِیۡکَ لَعَلَّ السَّاعَۃَ تَکُوۡنُ قَرِیۡبًا ﴿۶۴﴾", "english": " Men ask thee concerning the Hour. Say, ‘The knowledge of it is with Allah alone .’ And what will make thee know that the Hour may be nigh?", "french": " Les gens t’interrogent au sujet de l’Heure. Dis : « La connaissance en est avec Allāh Seul. » Et comment peux-tu savoir – il se peut que l’Heure soit proche ?", "german": " Die Menschen befragen dich über die \"Stunde\". Sprich: \"Das Wissen um sie ist allein bei Allah\", und wie kannst du wissen? Vielleicht ist die \"Stunde\" nahe.", "spanish": " Los hombres te preguntan sobre la Hora. Diles: “Su conocimien­to corresponde sólo a Al‑lah”. ¿Y qué te dará a conocer que la Hora está próxima?", "urdu": " لوگ تجھ سے خاتمہ کر دینے والی گھڑی کے متعلق پوچھتے ہیں تو کہہ دے کہ اس کا علم صرف اللہ کو ہے اور تم کو یہ بات کیا معلوم کہ شاید وہ گھڑی قریب ہی ہو۔"}, {"arabic": " اِنَّ اللّٰہَ لَعَنَ الۡکٰفِرِیۡنَ وَ اَعَدَّ لَہُمۡ سَعِیۡرًا ﴿ۙ۶۵﴾", "english": " Allah has surely cursed the disbelievers, and has prepared for them a burning fire,", "french": " Allāh a assurément maudit les mécréants, et Il leur a préparé une fournaise,", "german": " Allah hat die Ungläubigen von Sich gewiesen und hat für sie ein flammendes Feuer bereitet,", "spanish": " Al‑lah ha maldecido cierta­mente a los incrédulos y ha prepa­rado para ellos un fuego llameante,", "urdu": " اللہ نے یقیناً کافروں کو اپنے قرب سے محروم کر دیا ہے اور ان کے لئے ایک بھڑکنے والا عذاب تیار کیا ہے۔"}, {"arabic": " خٰلِدِیۡنَ فِیۡہَاۤ اَبَدًا ۚ لَا یَجِدُوۡنَ وَلِیًّا وَّ لَا نَصِیۡرًا ﴿ۚ۶۶﴾", "english": " Wherein they will abide for ever. They will find therein no friend nor helper.", "french": " Où ils demeureront pendant longtemps. Ils n’ y trouveront aucun ami, aucun aide.", "german": " worin sie auf lange Zeit bleiben sollen. Sie werden keinen Freund noch Helfer finden.", "spanish": " En el que vivirán para siem­pre. En él no encontrarán amigo ni ayudante.", "urdu": " جس میں وہ ہمیشہ رہتے چلے جائیں گے (اور وہاں) نہ کوئی دوست پائیں گے اور نہ مددگار۔"}, {"arabic": " یَوۡمَ تُقَلَّبُ وُجُوۡہُہُمۡ فِی النَّارِ یَقُوۡلُوۡنَ یٰلَیۡتَنَاۤ اَطَعۡنَا اللّٰہَ وَ اَطَعۡنَا الرَّسُوۡلَا ﴿۶۷﴾", "english": " On the day when their faces are turned over in the Fire, they will say, ‘Oh, would that we had obeyed Allah and obeyed the Messenger!’", "french": " Le jour où leur visage sera tourné et retourné dans le Feu, ils diront : « Hélas pour nous ! Que n’avions-nous obéi à Allāh, et obéi au Messager ! »", "german": " An dem Tage, da ihre Führer im Feuer gewendet werden, da werden sie sprechen: \"O dass wir doch Allah gehorcht hatten und gehorcht dem Gesandten!\"", "spanish": " En el día en que sus rostros sean vueltos hacia el Fuego, dirán: “¡Oh, ojalá hubiésemos obedecido a Al‑lah y al Mensajero!”.", "urdu": " جس دن ان کے بڑے بڑے آدمیوں کو آگ پر الٹایا پلٹایا جائے گا۔ اور وہ کہیں گے اے کاش! ہم اللہ اور اس کے رسول کی اطاعت کر لیتے۔"}, {"arabic": " وَ قَالُوۡا رَبَّنَاۤ اِنَّاۤ اَطَعۡنَا سَادَتَنَا وَ کُبَرَآءَنَا فَاَضَلُّوۡنَا السَّبِیۡلَا ﴿۶۸﴾", "english": " And they will say, ‘Our Lord, we obeyed our chiefs and our great ones and they led us astray from the way.", "french": " Et ils diront : « Notre Seigneur, nous avons obéi à nos chefs et à nos grands hommes, et ils nous ont égarés de la voie.", "german": "", "spanish": " Y dirán: “Señor nuestro, obe­decimos a nuestros jefes y a los grandes de entre nosotros y ellos nos apartaron del camino,", "urdu": " اور (عام لوگ) کہیں گے۔ اے ہمارے رب! ہم نے اپنے سرداروں اور بڑوں کی اطاعت کی پھر انہوں نے ہم کو (اصلی) راستہ سے گمراہ کر دیا۔"}], "Surah": 33}